[{"title": "Big Beat Evangelists", "href": "Big_Beat_Evangelists&&5303", "artist": {"unique_name": "2_Skinnee_J%27s"}, "lyrics": "I do it, I do it\nI do it, I do it\nI do it, I do it (Something strange is happening, Something strange is happening)\nI do it, I do it (I don't know where to begin, But something strange is happening)\n\nI do it this way from the first to the seventh day\nStay on target like an x-wing flexing my brain\nAs I state my claim that my aim is to do this properly\nWatch me dismiss your snobbery promptly\nAs if my soul could be another man's property\nYou gotta be joking, think a minute about what you've been smoking\nBefore you start choking and gasping and asking, \"who knew?\"\nIt's simple. I'm cheeky like dimple\nI jump up I get the thumbs up like a thimble\nIt ain't what you're thinking, though\nI'm known to be prone to kick over thrones and leave governments overthrown\nCharismatic with the verbal acrobatic\nTop gun take your breath away and leave you asthmatic\nIt's automatic that my standards are raised to the attic and my tone is emphatic\nFeel the movement, it's fluid like sand in the hour glass\nHow could I stand to let even a single hour pass\nWithout bounding ahead and thinking far back\nI take to the sky, you're grounded on the tarmac\n\nIf there's a mic to be rocked, I will throw the first stone\nI cross time zones, root like rhizomes with my rhyme tomes\nI'm not alone, my friend's found 5 strong\nWe reciting rhymes so you can sing along. So sing along!\nWe got the tasty treats to fill your mouth so open wide\nWe serve poetic justice. Stay open all night.\nWhile I can't understand why shit gets held high\nThose fads that won't die. They just won't so\nI sleepwalk the street talk like somnambulist\nWe rock like amethyst, we rare like ambergris\nIt's scandalous music planned by avarice\nYou're sorely misinformed like c-span panelist\n\nI never planned on this\nBig beat evangelist\nWack track antagonist,\nPass raps through dialysis\nBut we stand by this\nSo here's a code to those who know to throw up your right fist, like this\nBut when it pours you know it's raining\nThese rats in races got me pistol-whipped like stamens\nI ain't complaining, though, just hopping off this fence\n'Cause when it's all said and done things will finally come togther and make some sense\n\n", "album": {"title": "Volumizer_(2002)&&7507", "genre": "Nerdcore Hip Hop", "year": 2002}}]