[{"title": "Cook It Up", "href": "Cook_It_Up&&8605", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Cook it up, Spooky, Salute, Look\n'Zook'll hook it up to shoop the local Wendy Cooper loopy\nLow brow, low brim, she asked me, \"What's the name?\"\nI flashed the grossest fang in show biz\nYoung Valkyrie's open, \"What's yours?\"\n\"Um, Jenny, um...\"\nBody clocked in a ten-penny sum\nSprung colossal, miss, may I process your Pentium?\nBut Ae is hesitating, \"My princess,\nThe pigeon holing roles that your predecessor's lunacy in the kismet\"\nHer eyes googled back as that of one unfortunate breed\nPlus a new kink in the posture\n\"Just don't get all barnacley\nOr Get P.T. Barnumed in 3D THX sound stereo dismissal\nSorry hun, it's just the last few have been a fistful\nLike, like, them girls you bump into out dumb luck\nGet high innocently kiss once when she's punch drunk\nWatch her misinterpret the moment tongues touch\nCrazy Miss Cling-a-lot claim instant one love\nAnd you gotta beg your friends to take 'em off your hands like thumbcuffs\nOr them barbies you'll vibe for a sexy second (lovely)\nGive it a month; Hyde Heckles Jekyl and she makes Hitler look cuddly\nBut Jenny in the sky with emerald eyes\nYou're so different, so delicious, so the fish\nI'd be willing to walk the limb with!\nSo let's just get a few things out the way: (okay)\nI'm clinically bonkers and hate just about everyone God's great earth offers\nI won't be getting dressed up to impress your family, dear\nAnd if I can't wear jeans and sneakers then I won't be lamping there\nNope, aggro-pimp, sinfully, finicky nova, back it up no-diggity soldier\nMagic-touch fingertip donor\nOwn up to your dirty debutant animalistic instincts\nRitual courting dance and breeding behaviours (like what?)\nLike, \"I dream of Jeannie and fucking her obscenely\"\nBut Jenny could be Jeannie so easily if you'd let me\nHell, the bad tact daddy-o Merlin-- 'e' for effort\nMost of these high-post Fabio world motherfucks make my head hurt\nDead up-- I got death in the skull but you'll get used to it ma\nDinner and cinema, yes, just cough the bread up\nSure, he schleps with naked pockets but I carry dreams\nLike I wanna be an astronaut after you marry me\"\n(Whaaaat???)\n\"You're rushing this I feel smothered it's crowding me awfully, dolly\nI love you, Get the fuck off me! Sorry.\" (Call me)\nAnd I'm circling her like a tiger shark frenzied but friendly\n\"I'm cool, how you feeling Jenny?\" (Jenny) Jenny (Jenny) Jenny\n\"So quiet, ooh I like that, so mysterious, I dig it\nThe way you haven't made eye contact with me once in ten minutes\nI'm just saying girl, I'm dirty-dog raw vintage mixed with mega-low society\nMister gutter-fuck etiquette, try me\nSo there it is... game. I mean it's not like I'm sweating you\n'Cause when it comes down to it, most y'all females are the same\nBut now it's your turn baby, spit it out\n\"Okay,\" she punched me dead in the fuckin' mouth and walked away\n\nWatch out ladies cause you know he don't love ya\nBazooka Tooth is one bad motherfucker\nHe's a low life pimp with a low life game\nHe needs a no life dame with a strobe light frame\n\nCook it up now...\n\nNo ring on the finger\nThere ain't no strings attached\nBut if you love television and\nManic depression\nGet a carton of cigarettes\nAnd we can make it happen\nGet to mackin'\nJust leave your bag up on the curb with the trashcan\nIt ain't like I seen you in maxim\nRelax with the tap dance\nLights, camera, lap dance\n\nCook it up now...\n\n", "album": {"title": "Bazooka_Tooth_(2003)&&7433", "genre": "Underground Hip Hop", "year": 2003}}, {"title": "Garbage", "href": "Garbage&&6879", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "The ritual goes, same window different visual.\n\nWing of wax, or wing of gold leaf\nChoose one.\nFloat or plummet 20 thousand cold leagues\nMy nourishment's provided in the summer\nSo that I wonder\nHow y'all chasin' dreams when most tangibles still outruns ya\nHail dirty doll immaculate performance\nWarm as the march of a billion torches forward to burn what I born at\nCut and paste alertness to current set is provided quick\nShimmy the pirate ship mast, spot the islands on the sovereign in her bow\nFacing, let's salute the embrace pertinent generals who turned innocent hermits to burning spectacles.\nFlirtin' with a serpent workin' overtime\nDrain the battery, siphon the poison and flood his majesty's hatchery.\nI was riding on the yellow bus to where the brush thickens.\nYeah, an it ain't exactly plush pickin's\nI'd rather take the time to burn every last bridge I've ever crossed beneath the sun\nThan live my life knowin' you may one day follow me over one.\nSnake bite\nBreath too heavy to hold.\nCaught up in the wake of the red witch tryin' to swim it.\nRan for the sake of dead click stripped of idyllic image\nSteal a sloppy earth meal feed my pottery wheel to model colossal vision\nThrill, shrunken with a bucket of pennies\nI'ma drag my sneakers through the dirt like alligator bellies\n'Til the cloud burst\nHonor and a loud thirst submersed in a trap\nLittle drummer boy vs. thunderclap\n\nIn a city of garbage, tryin' to reap the harvest\nAdaption is the trap in which the artist meets the forest\nSwing your little axe or be an oak tree if you can\nEither way, adapt to circumstance or play you final hand.\n\nNo enigma, an attempt to bury the hatchet\nRendered me victim of deviltry plus wounded like stigmatics\nSomethin's somethin' hazardous\nI smell an inch of difference in this mornin's pollution pistons and how the loose ends drift in\nMy sour patch institutions slipped in amidst the invaders and,\nPardon my tone but,\nThis garden's grown fuckin' acres since my visit.\nItchin' to count the layers in the blizzard to that chapter where my family inserts the dagger and\nTwists it.\nIt's the carnival, have you any sweets for my weary kin\nIt's the carnival, have you any feed for my cheery grin\nIt's the carnival, welcome, play our games you'll never win\n'Cause it's that carnival where every freak show spectacle's your friend.\nAn' I'm a,\nGhostly galleon, tossed upon cloudy seas\nAntifreeze to glacier cookin' a look of fiery nature\nIt's the,\nCeilin' feelin' too heavy to bless the I-beams for a fraction more collapse (I left sorry) that to\nYour door.\nBitchin' my back to hell's kitchen, back\nBurnin' murder machinery, released regardless of the pardons\nHitchin my life to the leash of one minstrel\nSick of same window different visual\nSame agnostic hostage different ritual\nPlay, cooperative supercolony clash (I heard we have a dust collection - let me see it)\nOoh, I duel this underdog verse forced adaption to the marbles of the now\nSince then my knuckles haven't once dragged on the ground.\n\nIn a city of garbage, tryin' to reap the harvest\nAdaption is the trap in which the artist meets the forest\nSwing your little axe or be an oak tree if you can\nEither way, adapt to circumstance or play you final hand.\n\nThe ritual goes, same window different visual.\nThe ritual is same fuckin' window different visual.\n\n", "album": {"title": "Float_(2000)&&9651", "genre": "Underground Hip Hop", "year": 2000}}, {"title": "Winners Take All", "href": "Winners_Take_All&&9277", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Parachute ratty\nOne bunk chord, now the air is scooped badly\nDripping out the sticks like a twig tweed hammock\nMiter cut the cables for that quick, clean transit\nMiser tuck the big screen panic near the business card\nAnkle out of whack\nPainkiller debacle\nScrappy navigate the yellow corn height for the barn when the spot light swivel hard right over the farm\nPost up\n3 cheers for the gimp sprint, thank you\nLimp to the door, splint what he mangled\nOh yeah, I knew the percentages but the numbers were unaware of the grand finale's emphasis\nAnd over the scent of a thousand dead dogs Agent Zip Zooka swore to pull it off\nGame face\nWalkie-talkie squawking off his hip regarding paratrooper's 20\nTug a noise box trigger, reporting for hunting.\n\nI have landed safely\nI have not received my papers\nI have zero natural enemies\nI don't know my location\nI have no training in reconnaissance, combat or colluding\nI'm calling for my orders, over\n'Strap on a helmet and start shooting!'\n\nKlonopin to kill a horse, numb and blood thirsty 'til the 'uncle' spitter beg a jungle pig to hug mercy\nTwo 40-below shitkickers tickle the corpses\nDuck, the widow maker also manufactures orphans\nManufactures ordanance, if it moves stick a fork in it\nWinners take all, killers rape all coordinates\nUnfortunately courted by the most tenacious guardians whose aimless nature bait a harlequin to taste the martyr skin\nNo semper fi\nNo saluter unit, soldier, the fire is more flesh than sulfur\nAnd when the automatic jitters wiggle the ribs, I feel so alive it don't matter which bitches litter is clipped\nSun down, goggle up\nCanteen, gobble juice\nTear gas, nozzle up\nBrain buff, hostile youth\nChop it up\nLock a noose upon it\nYou will die for the glory of...\nShit I can't put my finger on it but it's big\nBig and legitimate, justify women and kiddy killer shit; iller it builds\nSo he is not a natural predator but could dismantle an AK-47, clean and rebuild before you could mayday brethren\nMuddy gut, snake eyes\nHe approaches cobras with an ugly muck and bloody bowie knife clamped in the canines\nWake 'em with that blind military mechanism set to bludgeon\nWhat is your major malfunction\n\nI have landed safely\nI have not received my papers\nI have zero natural enemies\nI don't know my location\nI have no training in reconnaissance, combat or colluding\nI'm calling for my orders, over\n'Strap on a helmet and start shooting!'\n\nI'm standing at attention\nWith a pocket full of weapons.\nAnd the will to walk a mile\nIn the same fatigues that I slept in.\nI have yet to find a day in life worthy of my saluting.\nI'm calling for my orders, over.\n'Strap on a helmet and start shooting!'\n\nI shimmy up out of the foxhole, disorderly, only after having logged every cadaver accordingly\nHigh scores keep automatons enthralled\nThere is no cause iller than no cause at all\nOkay, if his perspective is merc'd, sneaky detective work is aborted\nAnd it's no longer whisper mode on the red alert\nNo bed of dirt sniper rifle peaking out the bunker\nNow I'm center city looking for something to puncture\nHelp me up the numbers or the hero status suffers,\nTreat the public like a tin can riddled before it plummets,\nBut adrenaline could lead to lazy eye hassles\nSo he missed the little boy and\nTook the the pin out the pineapple\nThat's funny\nBumps into the steel toe\nThat's lovely\nSum it up in 'aw, hell no'\nAnd just as quick as the parachute cable snipped,\nI was rag doll horizontal;\nTwo limbs short of fixed.\nLeak a baby pool around the standard issue weaponry\nWhile fading as a blemish in civility's memory,\nThey will step over the body for the looting...\n(Ready on the firing line.)\n(What the fuck was that?)\n'Strap on a helmet and start shooting!'\n\nI have landed safely\nI have not received my papers\nI have zero natural enemies\nI don't know my location\nI have no training in reconnaissance, combat or colluding\nI'm calling for my orders, over\n'Strap on a helmet and start shooting!'\n\nI'm standing at attention\nWith a pocket full of weapons.\nAnd the will to walk a mile\nIn the same fatigues that I slept in.\nI have yet to find a day in life worthy of my saluting.\nI'm calling for my orders, over.\n'Strap on a helmet and start shooting!'\n\n", "album": {"title": "Fast_Cars,_Danger,_Fire_And_Knives_(2005)&&7560", "genre": "Underground Hip Hop", "year": 2005}}, {"title": "89.9FM Nighttrain Promo", "href": "89.9FM_Nighttrain_Promo&&437", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "(What's up this is Aesop Rock for wkcr, check it)\n\nI traded my title as bent pedestrian for passenger status, to coast muted.\nFinding the night train mildly therapeutic.\nRugged hacker flashing mood full of swings,\nBeneath this puppet master pulling my strings,\nLeaking smoke rings singing...\n(God, despite what's measured is honestly magnificent)\nSyndicate sold to children, building homes for my omnipotent platoons.\nNah I don't think the blueprints drafted tilted in the tombs,\nTampering hampered scampered well beyond the dooms.\nWe bloomed the matter down to those most beautifully discrete,\nApplying yesterdays models, stand obsolete amongst colossals (amongst\nColossals)\nComply not to enforce us, aborted claiming they came off.\nSort of stabbed them with the capital 'A' that sets my name off.\n\nSick of it all, Sick of the stall,\nSick of the thick, brick in the wall sob stories,\nThe falls, the tragic hate calls.\nShaking like magic eight balls, pausing to watch the vapors crawl.\nMy clique heeds lessons I'll be noted from kids sisters paper dolls.\nWe lining up along against these great walls,\nCircling analytical,\nRhetorical inquiries\nYet x is not applicable, kid.\nYour flash motto we as orphans repeated,\nYou talking concrete examples with glass bottoms cause defeated kid,\nI'm heated.\n\nIts flight of the intruder and we all fall down.\nConditions of never blends science with religion\nCut my character cleansed in esoteric opulence,\nBut finding no intrinsic merit in your sense.\nWell isn't that bewildering?\nDrunken distortion and spit the filter in.\nMic sweltering measures like melting my rings together and you never\nSeen I, Aesop Rock, flop for the love of eighty-nine point nine,\nI'm here to ride upon the night train...\n\n(Yeah wkcr 89.9 ... here for the night train ... what's up to my man\nApex, kinetic, DJ ely, baz, my man dub el on productions, the mighty Jer, my\nMan patrick, blockhead, mr roper, omega one, my man hates one, percy p\nAndre ... stay up ... it's like that ... its big aesop rock signing off)\n\n", "album": {"title": "Music_For_Earthworms_(1997)&&6980", "genre": "Underground Hip Hop", "year": 1997}}, {"title": "Coma", "href": "Coma&&610", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "\"We now present to you... music\" *cut up*\n\"Music to make you stutter\"\n\n(Aesop Rock)\nI've been a biplane dog fighter Henson invention\nTrooper burst result of Dragon Ball Z/Speed Racer gene splicing\nMach force, blind the extorted style from the common dirty\nDestiny dream sighting, important as split the prints\nGod shit the planet screaming \"What on Earth is that?\"\nI sit back five dimensions\nOnly to muscle the overcooked specimen\nFending tragic fatality successful dodging violets\nAll hail Mary and hello dollies\nI flow ridiculous, indigenous to now\nWho holds the fifth golden ticket?\nSaw the wicked war phantom mansion beyond the pickets\nThe house next door to when the stickball clears the fence\nY'all hesitate to fetch it\nI was walking through a pinball tilt built landscape\nTerradactle circling turtle\nI bite the bullet in a wingspan shadow\nSuck and rust the oxygen gulps\nAnd spit the metal directly back up the barrel\nWe icegrill the silhouettes (right)\nThe common decency factors a lowball estimate of zero\nMy testament is striking b-boy stances\nDancing past the foggy mirror\nWith wipes clean the billy goat beard, camoflague the spirit\nI'm at six degrees of sexy sarcasm\nYeah never swam up inside summerjam classic\nUnder the bed backwards bastard\nScaverning the carnival grounds for an outlet\nWho the fuck is aes rock?\nI'm not a name to keep at arms length\nAdjacent to little lattice quilt makeshift\nSick security mechanism, check your mission\nI am not a vision, check your mission\nJust a simple sourpatch delinquent\nNo it will not help you shove your Lincoln\n\nI alone settle\nI alone peddle in the mud\nI alone, I condone rebel zone planting\nI alone stand in a social coma\nAll up to your dome, follow I alone\n\nI alone settle\nI alone peddle in the mud\nI alone, I condone rebel zone planting\nI alone stand in a social coma\nAll up to your dome, follow I alone\n\n\"Now you see me, now you don't\" (Method Man)\n\n*Scratches*\n\n(Aesop Rock)\nWell he was maverick enough but still scraped up\nTaki 183 innovation for the kids\nBrick foot ironlung honor\nEscape through the night like a disgruntled teen Krylon bomber\nWithout a care inside from posting the roster\nMal-adjusted blank faced civilian dispersed feelings\nReeling in several separate defunct fame-booster modules\nThis nervous twitch mark the most delectable ingredient\nSee Aesop starving troops in cell blocks with strap-on feeding bins\n(More like) Like I'd auction off a fuck for that blind cause you ride in\nI'd rather find the floors and watch you hide them\nFeel the haggered look penetrate brain castle\nBlasting clear out the back of this batches sour wind collection\n(Flash flooder!)\nYou're a fuckin' wind-up toy\nA goddamn four string criminal trading card\nThe reason they decorate the fonts of closing credits\nTo boost on-looker amusement after fading hard\nCatch more Z's than Rip Van Winkle's 12 Step Narcolepsy Seminar\nThe action, we all compete the masked illusion\nThe commonfolk, I provoke 'em all\nChallenge thirty balance\nI alone pour talent while they fidget\nIf the revolution ain't gon' be televised\nThen fuck, I'll probably miss it\n\nI alone settle\nI alone peddle in the mud\nI alone, I condone rebel zone planting\nI alone stand in a social coma\nAll up to your dome, follow I alone\n\nI alone settle\nI alone peddle in the mud\nI alone, I condone rebel zone planting\nI alone stand in a social coma\nAll up to your dome, follow I alone\n\n", "album": {"title": "Labor_Days_(2001)&&8422", "genre": "Underground Hip Hop", "year": 2001}}, {"title": "Troubled Waters", "href": "Troubled_Waters&&7793", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "You replicas overlooking the guidelines of acoustics\nMiserable attempts result in miserable conclusions\nParagon pen dragon tactician on freeform\nThen a comfortable silence try to combat cliques\nThat unexpected Sephotus cyclone shifts\nWorked up you're shooken, jetted to the side\nI stagger this vagabond wondering menstrual forms of phobia\nWorst fear the terrace stricken muted\nThe roots of all evil I've rooted pinnacle\nPoised with pride pouncing to break your stride, forsaken\nAgony rides inside the heartache wretched condition\nMy intuition felt you slip up\nYou tripped alone what are you aiming for?\nOr do you sus tries to classify your genus, distorted fetus\nEvolve, type unsolved, you lack the malediction\nMalleable martyrs get molded, then folded under pressure\nThou perceives a slaughter suspension\nBridge over troubled water drown, sound study intensive\nMy square drops two erasing lines like tetris\nRelentless agent hush horrendous circles on my pavement\nTwo sticks to burn basics the lie adjacent to my placement\nOn the game board, lunge forward and wind-up impaled by the same sword\nChoose your weapon, stains splattered upon your flag\nTaturag shielding the exterior inferior\nStall face to face with a forms that force your downfall\nAdmittedly suspicious, a decadence, your network's on hiatus\nPermanent, provoked and choked upon the potency\nThe parrow be the penetrating agent pierce the insides\nWhy the cold sweats at midnight? Why the dim light?\nWhy are we staring at a true from the inside?\nWhy the pen slide with vigor on a put down?\nLike while I put my foot down stomp your city\nA-E-S-O-P scoping through the bur, opening minds behind the smirks\n\nI've seen misery, I've seen disgust dust ridden ruins\nIron clad oracle test three COM unit disperse silently\nOver confidence leads to irony\nPlot twist full hardy Icarus shifted in facets of my form\nForbidden aspects of the swarm a thorn upon your side\nA storm upon the rise, Adam, I or crush come brush upon the red zone\nCrook you're shook you started poorly\nYour powers parted pace uncharted territory\nDisoriented malicious god you'll burn your bridges\nThis craft requires first drafts\nGraphs, gritted blueprints of nemesis perimeter\nHunting by night compute, twenty one mic salute\nOne life polluted, concerned muffle moans\nFrom the nine rings of Donnie's hell burn you in your slumber\nSleepwalk then pulled under now\nWhipping through the willows is the warden of this garden\nSlipping through the silhouetted skylines Aesop sidewinds jaded\nDon't wind up war painted into the jungle the solution's not intrusion\nThe starving institution broke your main frame\nI pose the question, are these waiting games worth it or worthless?\nWhile I comb the crowd for clues your nyebony hands be my purpose\nOur planet is the pivotal point\nIn which this network slowly turns to filter kicks\nWe out-box the berserk bewildered by the wilderness\nMy clench is frantic clutch manners falling through underbrush\nTouch fools that duel with a dominant\nThe evil-minded tried to triple six me but he missed me\nIntervene; emcees appear as red blips on my color radar screen\n\n", "album": {"title": "Music_For_Earthworms_(1997)&&6980", "genre": "Underground Hip Hop", "year": 1997}}, {"title": "Labor", "href": "Labor&&9589", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "This is labor labor labor labor\n(Labor labor labor labor)\n\nWho put the monkey wrench in well oiled perfectionist emblem\nJust to watch these monitors spit white noise\nThrough your office space automate\nI infect knowledge gene pool dissented cloud clusters\nBrushing dust mites off your starborn all revolution sound jugglers\nDelinquent fan for brick habitat bob, weave, stick, move fence\nAnd pause somewhere in the middle for slick invention\nThis years brain crop spread spectacular\nI ain't mad at cha don't stay mad at the caliber\nI twist characters like twist characters\nTalley up the alley cat aggression\nIn this Doug E. Fresh infested mess up bassline lust\nAn automatic B-boy krylon can't combust circuits\nWorking these war picked ciphers\nWith head striker stability and kamikaze chivalry\nI alone noble in a worm food feud\nWalking dead generation ain't nobody asking for your patience\nThe grand opening holding me to face the fact\nThat I knew myself and didn't have to ask nobody else\n(Talk about labor) Fantastic planet urchin putting work in\nSearching for pertinent verse minus the murderous diversions\nApologies won't lore me to the communal sob story\nNor would I sacrifice lifestyle to benefit jury temperament\nThis whole Green Goblin webcutter butts up against\nCrayola daydream landscapes spittin' bedlam, Datum\nCharge the villagers nickles and nicotine\nTo watch them fed to one disgruntled crack at the high noon\n(We sell popcorn, beer and balloons!)\nI got an inkling this gon be the one that children bicker over\nAnd start warriors vs. baseball fury element\nTo glitches motor sensory development\nI am a star really! The big bang bastard's back\nWith a one way ticket to Beat Street\nThis soil is like relevant to human concept\nPlot the man ratios man learning, I work past the service\nI work on what I love, I work the service on my burdens\nAnd I work till this here little flat line closes the curtains\n\n", "album": {"title": "Labor_Days_(2001)&&8422", "genre": "Underground Hip Hop", "year": 2001}}, {"title": "Zodiaccupuncture", "href": "Zodiaccupuncture&&9782", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "March.\nThe more the merrier.\nGet a couple or more to carry you to the burial.\nF-R-E-S-H.\nFresh to death and keep it def to the left.\nWell it was Capricorn, Virgo, Aquarius, Cancer, Leo, Sagittarius, Pisces, Libra, Scorpio, Aries, Gemini, Taurus, Let 'em die for it.\n\nDelicate freak show alert the frame.\nBash all flags where the mag spin park.\nCorroded by the volts that jolt the cold vein.\nBoogie down kits to slip past the guard.\nDef with a mascot of radical mass.\nMegaphone fuzz and a woofer on fritz.\nWe are not trained to divert the crash.\nBut march face first with a prayer for the blitz.\nStand up for the cinema fire, simian ire,\nCold shimmy for the cinnamon sky;\nIntimate eyes loop all known alleys.\nScoop the bounty like daddy hires Bazooka to murder Ralphie.\nI curdle with burnt milk, pariah sigh, honor piranha money.\nCount it with the knuckle that hustle bread out a copper's tummy.\nOne of these rebels could level the marked city\nBut the N.Y. uber alles governor's picky.\nI'll be the jenky Jesus for the species you bleed with.\nUltra. Soldier poach the folklore.\nJump guns through the 9th gate.\nJump guns like a noon 6 burner lit up on the 9th pace.\nEven set among a portion conformed to the blind stage,\nNever lured by the formal watching imported wines age.\nWe bow to the gusto mustered by the mecha-bot.\nPlowed by the public, ushered out the letterbox.\nWowed by the subject punctured by the helicop.\nBoy meets vermin: the widescreen version.\nHeadaches, nausea, vomiting, facial paralysis.\nThese area a few of my favorite venomous side effects.\nMamba, Water Moc, Pit Viper, Diamond Back,\nAnaconda, Boomslang, Cobra, bite 'em back.\nSpinal tap crabs to the clapper.\nAesop Rock is the Cadillac of natural disaster.\nPush that button.\nEverybody gotta push something.\nThat's why the envelope is where it wasn't.\nI work with the builders, whittle my gorilla military\nAnd fizzle 'em through the vigilante filters.\nWho lamps left of the toggle?\nHow'd they fit that ninja in a bottle?\nA hundred million motherfuckers with they hands out\nVerse a walking zipper bomb trying to keep the man down.\n\nGet up.\nGet down.\nSit up.\nSit down.\nIt's either fancy footwork or get bit by the hounds.\nFace up.\nFace down.\nLaced up.\nLaced down.\nIt's either fist to the sky or get bit by the crowd.\nWell it was Capricorn, Virgo, Aquarius, Cancer, Leo, Sagittarius, Pisces, Libra, Scorpio, Aries, Gemini, Taurus,\nLet 'em die for it.\n\nI was chewing my tongue out of my mouth one day\nWhen the blood in my beard hit the dirt by the blazers.\nWould have said 'curb it' like any nervous habit\n'Til maverick told me the coyote pack could smell the wound for acres,\nAnd labor to cater fang to fisherman gut critters,\nOblivious to the glimmer of innocent duck feathers.\nFuck it. Want a carnivore war? Bet.\nI'll be at the Bronx Zoo with a lock pick kit.\nOn the eject for cockpit bench, helicop clip\nNazi cops on kamikaze belly flop shit.\nRoger. Hop-fence-kill-a-crop, monster.\nWe are the tired and poor, we come for your water.\nBoom. Bounce when the church corrupt.\nWhen the mayor knuckle dust city worker bugs.\nWhen the stars finger babies like I flirt with sluts.\nYou'll see the fire engine red fox ears perk up.\nMetal kettle unsettling treble howl, settler trembling,\nMeasuring mellow on the levitate off the mezzanine.\nNever seen a ton of bricks dressing clean/dapper\n'Til it's pin stripe and skull chunk 40 stories after.\nAnd U.S.A. on a Ketamine disaster.\nCane for stress. Crack if the former left you unimpressed.\nNow pardon me if part of me heart of an oddball,\nBut damn. Kumba-fucking-ya, dog.\nTerminally alienated and bent awkward by the bought,\nPrepped package of the slickest spin-doctors.\nRaised where the paranoid hide tools proper,\nLike suspicious cargo in a high school locker.\nAnd it looks like war, quacks like war,\nSo it's Occam's Razor and I'm swayze out the door.\nA hundred million motherfuckers hold me back.\nThe hand cannons won't ask 'bout your zodiac, boy.\n\nGet up.\nGet down.\nSit up.\nSit down.\nIt's either fancy footwork or get bit by the hounds.\nFace up.\nFace down.\nLaced up.\nLaced down.\nIt's either fist to the sky or get bit by the crowd.\nWell it was Capricorn, Virgo, Aquarius, Cancer, Leo, Sagittarius, Pisces, Libra, Scorpio, Aries, Gemini, Taurus,\nLet 'em die for it.\n\n", "album": {"title": "Fast_Cars,_Danger,_Fire_And_Knives_(2005)&&7560", "genre": "Underground Hip Hop", "year": 2005}}, {"title": "Babies With Guns", "href": "Babies_With_Guns&&4430", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Radio, check check, video, check check\nThis is how the city folk and mole people connect\nSomebody warp the message right I'll pass it to the next\nNow the perforated county's making you upset\n\nHarvest all brand x clark kents to worm pool\nCarbon heart\nBuried his nozzle in fossil marker art\nPardon\nCadaver had a legitimate pulse\nAnd littered volts are with the village\nWhere the skittish pigeons molt\nBastard poacher gasped\nWith the pigeon with lazarus billy goat whiskers\nHe rose to see salt in the open blisters but\nBlind anarchy slips through the cracks,\nSee naked martyrs with Bubblicious on fishing rods\nItching to pull it back\nWith that organic invention incubated to hatch\nSome can try to make it fructose on paper now\nAllow the details later and the crews will taper out\nOf wooly mayors ousts?\nThrough piggy jammy happy shooting at the bladed mouth\nBazooka tooths who keep the paper route\nWith janky funds and favors\nCradled by twelve empty Zelda heart containers\nMan, it's freezing in this brick bitch\nWinter forever\nLike Punxsutawney Phil down with his four furry wrists severed\nI walk face first through the sex, guns, and church\nWith wild things that make Maurice Syndek question his early works\nBut no hostages no promises\nOut the claw of corporate cogs and sprockets,\nNow clogs off gromits\nRunning from a rabid ring wraith click, basilisk, serpentine\nIn and out of traffic jam and murder scenes\nScrub blood off the AF1 fifty two pick up first degree\nSome toddler's smuggled tommy guns and crack into the nurseries\nDogg, there's a fucking baby at the door asking for wallets\nAnd those ain't twin beenie babies inside his pockets\n2010 sonograms show the magnums form directly off the fetus\nEvolution for the young killer convenience\n\nRadio, check check, video, check check\nThis is how the city folk and mole people connect\nSomebody warp the message right, I'll pass it to the next\nNow the perforated county's making you upset\nMagazine, check check, paper route, check check\nThis is how the hermit inc. and busy bee connect\nSomebody's losing track of their flesh and blood in arrests\nPolka dotted landscapes what did you expect?\nNow-a-days even the babies got guns\nDiaper snipers having clock-tower fun\nMisplace the bottle might catch a bad one\nHave a mid-life crisis when you're ten years young\n\nHold up\nIf the Jesus piece around your neck is bigger than your pistol\nIt makes homicide okie-dokie and your god will forgive you\nJust show the saints at heaven's gate you should be on the list\nI hear overlooks manslaughter for a tattooed crucifix\nTwisty, fidgety, contradicting\nWild animal shit bleed off the slide of born doctor?\nTo mister turnable mind bought?\nSomewhere to laminate dry bones in cool water and ease medulla\nAfter you thumb sucking diaper chains\nGive birth and shoot the school up\nI duel, too, but only to exploit no-brainers\nTeenager beef past alligator teeth\nAnd extra-curricular flagpole scrappin'\nAmongst tadpoles that have yellow backbones\nTeam mechanism brought airborne shrapnel scraps to hassle captain\nBy the itchy index of an umbilically garped fraggle baby\nFragile, maybe, ya think\nChop shop and a misled maladjusty crusty lock box\nHiding clips that light the sky in seconds\nLike dueling communal hopscotch gives them leverage\nCut 'em with mortars\nWhile I mumble in the immortal slang of Mush Mouth\nFor the anti-lead nirvana\nI used to think I'd get hit by a bus or something dumb and dumber\nNow the bus is slugs plugged by the newest kiddie thug wonder\nSuffered through kingsley\nRep a wide pride dosage\nFor tomorrow the holsters are bound to outnumber the roaches\nNot a coach, but that'll even jolt the immobile\nWhen global terrorism's all the rage your folk get smoked local\nBlock[head], if you need me, I had to bounce to d.c.\nTo bullet-proof mom's flower garden\nBefore the war cheats me\nIf I'm not back in a week tell the crew I said \"peace, and lay low\"\nStrains don't vacate slow\n\nRadio, check check, video, check check\nThis is how the city folk and mole people connect\nSomebody warp the message right, I'll pass it to the next\nNow the perforated county's making you upset\nMagazine, check check, news flash, check check\nThis is how the hermit inc. and busy bee connect\nSomebody's losing track of their flesh and blood in arrests\nPolka dotted landscapes what did you expect?\nNow-a-days even the babies got guns\nDiaper snipers having clock-tower fun\nMisplace the bottle might catch a bad one\nHave a mid-life crisis when you're ten years young\n\nAboard the battleship, gray sky, the day i\nGot the phone call Jam Master Jay died\nSo, no, I'll probably never write another daylight\nBecause the stingers tend to cling more than a portable hay rides\nIt adds up when a pioneer fall\nIn comparison to your ninety-nine bottles of beer wall\nThere's banana peels in your hamster wheels\nHand cannons in your shoebox, please\nMine's got adidas, rest in peace... get at me.\n\n", "album": {"title": "Bazooka_Tooth_(2003)&&7433", "genre": "Underground Hip Hop", "year": 2003}}, {"title": "Maintenance", "href": "Maintenance&&4271", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "(Aesop Rock)\nCount that for me... thanks\n\n[Robotic voice] 4x\nOne, two, one, two, three, four\n\n(Aesop Rock)\nWell any asshole with a book of matches can light a fire fresh\nMake that sucker burn for days, I'll be impressed\nSurf 'n' abash the cultured bigot, procreation baked in fanciful\nThen scurry up the grass to roll his marbles off the anthill\nI know girth and good nature but recognize absentee ballots\nAnd sappy ballads couldn't fill the void\nIt's James and the giant Tugboat Complex and HE'S ANNOYED!\n(No one's asking you to build an Ark, brother!)\nHmm, it's fashion\nI'll find my own bullies to shake a finger wrapped in\nRealigned mine eyes in divine justice\nPlus this uncontrollable laugh with those amber waves of brain finally crash\nBrimstone clone with legs and dim poems\nTen little Zen crafts\nThings cooperate like paper doll participant litigants\nPicket well or ride a burner style clinic\nAcid for the basics\nP-H imbalance to burn the malice martyrs faceless\nThen fabricate daytrips\nI want to be the halo that jumps off the brain\nOf the genius who decided some pictures deserved frames\n(God and I are on a first name basis)\nYeah I call him God, he calls me Jesus\nWhen I lost my religion, he fell to pieces\nBlade, dragon, up hell's creek\nInterrupting a devil pageant\nStarfighter settling to madness\nI keep my ghoul spirit concealed\nUntil the warriors return to the Coney Isle Wonder Wheel\n\nMy momma told me there'd be days like this\nDays like this, days like this, days like this (yes she did)\n\n[Robotic voice] 4x\nOne, two, one, two, three, four\n\n(Aesop Rock)\nOkay, tell me who you chill with and I'll tell you who you are\nI walk a mile with a leash attached to your freak seminar\nIt's a modern sensation on the boulevards of maintenance\nTo sweep your broken hopes under the rug then hug the playpen\nThis revolution pushing through the loose pins\nAnd a strait-jacketed maverick classed in a bunk category\nThey had him parallel with a tattered glory division\n(I could devil drink dreams out of thermos)\nYeah, with a whiskey afterburn\nIt's like, nine o'clock wake (I'm up) spit obscenities\nMy girl ties on my cape, smoke a bone then work my deviltry\nThe clear day's laced with a classic mother nature thunderchaser set\nThat got my paper crane's wings wet\nVoyeurist amendments lacked expansive coverage in the syllabus\nI dance with chuckles while you man the keyhole grilling post\nI've done my chores according to God's schedule\nWith coffee holding the wheel and nicotine working the pedals\nMetal edged canes that tends to repel the bevel\nKettle screeching out the operetta\nI live to autograph the iron curtain with dove's back feather pens\nSpurting magma, cursing television earns the burdens of my Cleopatra\nMinor (Major) dispersed slap on the wrist\nFor the tenants lacking arms to harbor the rarity of thick friendship\nSunk with a \"Yes sir\"\nChained to fatigued ankle\nLeagues beneath the angle\nI'ma call home until the rock meets the angels\n\n\n[Robotic voice] *repeat to fade*\nOne, two, one, two, three, four\n\n", "album": {"title": "Daylight_(2002)&&4690", "genre": "Underground Hip Hop", "year": 2002}}, {"title": "Drawbridge", "href": "Drawbridge&&472", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "(Feat. Dose One)\n\n(Aesop Rock and Dose One)\nThis is not your ordinary ballad\nWith a perfect little bow around the middle\nAnd a black man on a white horse\nOr a white man on a black horse\nIt's got all these tired parts where\nWe don't even sing at random\nPrincess, raise the drawbridge\nWe don't serve your kind\nIt ends where it begins\nAnd the beginning isn't pretty\nCan't forget that not-so-perfect\nBow around the middle ('round the middle, 'round the middle...)\nHar-bour (???) [said like har-bow?]\n\nAnd it goes a little something like this...\n\n(Aesop Rock)\nNew walk in a broken sole (???), pedigree incessant\nGot (Gut?) the cruddy (???) frame\nThe zealots enveloped inside the belly of the blame\nCut-throats the result of pope jokes soaked in poacher constants\nAnd now the jewel emits cold, wander prominent... honour (honour)\nI bought up silkworms by the bucket like starter kits\nSo you first bought a stitch\nJoined damaged mammoth brigading caper\nNurse the tantrum with a fantasy chaser\nI keep the spare wings strapped to my fuses\nIn case the hackers snatch the plumage\n\n(Dose One)\nSo you mean these things are worth money\nNow drifting off\nThis is the who-you-calling-homeless\nMock me fearful\nTwisted ???? ???? and I got front row seats at the d-d-d-d-dead concert\nAnd you're in it, Ichabod (???)\n\nRunning out of most (???) from the Alamo (???) we're moseying\nMy kind of people ???? ???? ???? ???? moseying (???)\nWith my eyes patched ???? ???? ???? universe\nSo I back it and gave my verdict (???) ???? ???? ???? ????\n\n(Aesop Rock)\nOh it'll be soon (real soon)\n???? ???? Immune to doom blends\nI eat ditch (???) in the kitchen till every spoon bends\nA glance along tomorrow, sorry\nLooking not at hopefuls (???), where's the raindance\nMy little flint never dreamed would flood unpotable\nSee I sanitize nothing for the sake of contemporary taste\nContemporary taste made my lip drop in the first place (incoming)\nHmm, yo why not be a czar, analyze fallen heroics\nRecognize root of the worship, search and hold it\nWho put the fun in dysfunctional? I...\nChronicle sun combustible, donkey-punching pinholes\nIn uncomfortables and conjunctionals for good (good)\nDr-rink up, slop a goblet of dirt wine (???),\nI nurse a single application of introvert, serpentine\n\n(Dose One)\nNow a sunset without a scrape of red an-an-and plastic bag\nNow sunk around his head (???) sick-sick-sick-sick... (???)\n???? ???? ????\nThe sickness likeness in the roofer's eyes and his alone\nAnd nothing terrible happened to the bag\n\n???? ???? ???? ???? ????...\nAnd brought on out...\nAnd clouds...\nThe hiss cuts out... (???)\nSuppose it's noise...\nAnd the piano...\nAnd the window frrraame... (???)\nSky and dirt that's fresh... kept\nFrom where I'm going... holy other\nHoly other, holy other, holy other...\n\n(Aesop Rock)\nB-B-B-B-B-But\nI've got charcoals in my heart, I've got charcoals in my heart\nI've got charcoals by the armfuls that burn my armor apart\nI've got charcoals in my heart, but I've got charcoals in my heart\nI've got charcoals by the armfuls that burn my armor apart\n\n(Dose One)\nAnd before, when I said 'Shut the fuck up, it's none of your business'\nThat was to be in vain\nYou shoulda locked that up when you're all finished\nFinished yet? Now uhm...\nI usually finish this number with uh... my skull up (???)\n\n(Aesop Rock)\nEverybody rally around the novel burners, spit, murder the matches\nWhere the junkies trade diseases and the gullible trade passions\nThen the masses wanna lean on me like 'O Captain, my Captain'\nNot considering maybe this oarman hosts orbit attachments...\n\n(Dose One)\nButton, button, who's got the button (???)\nTake my name, please...\nButton, button, who's got the button (???)\nLeaks the little checker-men made out of lightning in my ????\nOh, you like to help with goats (?!?) see what I got in this here locket\n\n(Aesop Rock and Dose One)\nThis is not your ordinary ballad\nWith a perfect little bow around the middle\nAnd a black man on a white horse\nOr a white man on a black horse\nAnd I can't forget the not-so-perfect bow around the middle\nHar-bour (???)\n\n", "album": {"title": "Float_(2000)&&9651", "genre": "Underground Hip Hop", "year": 2000}}, {"title": "We're Famous", "href": "We%27re_Famous&&5912", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "(El-P)\nI brought that genuine shit in '96\nBefore you knew the underground or independent existed\nI watched the whole scene straight jump on the dick\nAfter stepping to KCR lit and flexing my shit\nNo gun talk, no gimmicks, just rounds of raw-dogging\nDirty dusty intelligent wit and word murdering\nA hardcore poetic informed without burglary\nPotent and shook the shit out of rappers who just learned of me\nEverytime I prescribe a new pill, revolution\nQuickly defined the standard for indie rap distribution\nArrogant unafraid shit developed riding a train thinking of brain fucks\n\"Bad Touch Example\" that soon became bucks\nHad everybody sprung wondering where I came from\nScreaming out \"Independent as fuck\" with an insane tongue\nWith an indelible squad of design monsters\nInnovating the styles that made biters look like imposters\nSo we scripted an album and signed to Rawkus\nSelling a hundred thousand without a radio chart hit\nImposterous sonics taking the world hostage\nClassic hip-hop bombage dirty with style progress\nNow I've come from the '80s juvenile Brooklyn\nWhere cats was like: \"Gimme that subway pass, kid. Good lookin'.\"\nNow someone else is taking a ride with what's mine\nSo I had to develop styles with a death device cooked in\nSo when I battled in basements I had eight sentences\nWaiting way before the four you had laced in\nAnd I was taught to wait patient (Why?)\nOnly faggots make shit up just to get famous\nSo when I finally blew up I remained sick\nEarning respect in ghettos and 'burbs for word placement\nBack when the independent scene remained faceless\nWe were the only crew who promised your ass we'd take it\nMold it, shape it, living outside the matrix\nHold it, make it, more than miniature major labels\nHold it sacred, living it for the culture\nTold ya plainly, protected it from the vultures\nThat's why I always get respect from true soldiers\nWhile half of the critics claim it every year: \"Hip hop's over.\"\nFUCK YOU, hip hop just started\nIt's funny how the most nostalgic cats are the ones who were never part of it\nBut true veterans'll give dap to those who started it\nThen humbly move the fuck on and come with that new retarded shit\nNew slang, new thought, new sound\nWho's heart you thought you had?\nYou clown, you don't, you drown\nI won't dumb it down, I'm dumbing now for these rounds\nI'm a live mothefucker plus I'm gunning for clowns\nYou're mine motherfucker, don't be coming for pounds\nSo you can break out of that invisible box, you're not down\nMy favorite ones are the ones who started that young rap about\nComic books, spaceships, and Obi-Quan one\nAnd even though they were soft they had fun\nBut they couldn't break out the frame of the town they came from\nSome of these faggots used to send me their demos\nI'm keeping their puppy styles in the Company Flow kennels\nBut since they had no identity from the start\nThey started to resent the scene when they couldn't become a part\nThey've been failing for years and call themselves Vets, that's bold\nMotherfucker, you're not a Vet you're just old\nI'll slap the shit out of you to continue my nerve racket\nMaking this money fist over fist, fuck what you heard\nJukie cats talk about boom bap and golden ages\nPatting themselves on the back for making that new outdated shit\nI've been putting out vinyl since '93 and never looked back once\nAnd y'all trying to chase me\nYou don't innovate because you can't innovate\nIt's not a choice despite what you might tell your boys\nKeep your identity crisis under the table\nI always knew who I was and I'll always be more famous\n\n\n(Aesop Rock)\nCheck it\nFor the best in the vendor biz\n1-800-Lazerface\nLeave the last CE-Offer crabs and buy them Hatorade\nDig it, daddy dug his own tunnel under the gutters where the numbers bleed\nHunters froze up and exposed Rapunzel weeds\nTugboat, tug up through that brutal dirt first\nThe fuedals fuming oodles, it was right under your poodle skirt\nWelcome to Bazooka Works, halogen halo eyesore\nThe revolution will not be apologized for\nWarbucks exlex megaphone on the fashion piggy pageant\nWhile my dick's raw-dogging a style magnet\nFraggle rock your four figure watch\nI clock ninety-nine cent wristbands\nAnd still know the time when you record flops\nNow this is on a sick with it factor\nExhibit A, E, F, Genesis of the klepto reactor\nWanna burgle the buzz over definitive cash\nAfter a life of labor camps starts paying innovators back\nBaby, you ain't felt the collective? (Coooool)\nStop running bases with little bears under the wing of punchdrunk butter makers\nThat engine sputters while the hound dogs wire cutter mechanical rabbit\nBantam weight puppies ain't rabid enough to snatch him\nPockmark ninety Moses approach with a golden focal point\nCome soak in it, resume sturdy composer soldier bliss\nWrong name by a molar can often expose your phobias\nWatch a cobra grow hands to hold his own tongue when he notices\nAll city legity critter, bark with me\nAll filthy documents, cats piss on their kittie litter moccasins\nWelcome to mi casa, Monsters Inc, dropping bangers out the rocket ships\nYour own private apocalypse\n\n(El-P)\nHonor it\n\n(Aesop Rock)\nFor fuck's sake\n\n(El-P)\nOriginal\n\n(Aesop Rock)\nWild fly\nYou wanna read the nile?\nI twitch easy reader\n\n(El-P)\nFather it\n\n(Aesop Rock)\nI will, dog\n\n(El-P)\nOriginal\n\n(Aesop Rock)\nWide open with banged out cutlery from a slang mouth teacher\nAnd money is an ugly god we all fall for\nI got land mammal, cannibal, natural evolving squawk box\nThat means when I wake up and decide to comprise the new shit\nIt's not some watered down version of what my favorite crews did\nPuff the magic komodo bitch\nRappers stuffed komonos and shark fame at a perfect working unit\nLook, I'm done\nB-boy, feed that to the needy\nShut your liquor hole, fuck you in 3D\nEasy\n\n", "album": {"title": "Bazooka_Tooth_(2003)&&7433", "genre": "Underground Hip Hop", "year": 2003}}, {"title": "Skip Town", "href": "Skip_Town&&8833", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "On the train\nWatchin' the rainbows (thank you windows)\nI mean, it's all the same to some\nBut that cityscape makes me numb\nWalkin' the wire between firewater and water - I'll take the tap\nStill managed to end up thirsty the day the nursery collapsed\nIn my hand I hold the plumage of a buzzard\nSomethin' for circlin' nutrition (seems barbaric)\nI may have just saved your children\nThere's an inborn tendency tellin' me to grip that sickle\nThe pirate tyrant breathes, feed on your precious little pixels\nI interviewed the sun, he said the future's lookin' bright\nI interviewed the rain, he claimed the sun's truly an asshole\nI'was supposed to interview the snow today but of course he flaked\nSo I let my frigid demeanor teeter and take his vacant place\nWe three sprout from the same litter\nYet amazingly crafted by separate scissors\nI stalk the morbid beaten past splashin' in the cretin blizzard (?)\nHalf my time is herded toward little lost causes\nHalf my time is spent pluggin' these leaky faucets\nAn' I'm here to pose inquiries\nI'm here to draw a fork in the road and call it the diary of common sheep aspiring\nLittle Billy star lit up the block got the right premise\nBut can't thread the needle without consultin' apprentice present.\nI don't really know you (I don't)\nAnd I don't really care (I don't)\nCan't judge a man's dignity by the wattage in his stare\nMaybe that deams me that vagabond you'd love to kill\nBut I really ain't got time for the motherfuckin' guilt.\n\n\nI'm gone, and I best believe I'm leavin'\nPack up my belongings then it's off into the evening\nNow I haven't exactly been embraced by the populace\nSet sail upon the seven deadly seas of the anonymous\nI'm gone, and I best believe I'm leavin'\nPack up my belongings then it's off into the evening\nAn' I'm diggin' a tunnel to where the sun'l never shine\nI've got my book I got my dream I've got myself an' I'll be fine\n\n(My time) is the day before the day the earth stood still\n(My time) is the day before the soldiers fired at will\n(My time) is the day before the hunter made his kill\nMy time to find a mile before the valley meets the hill\nI'm an archer\nPartnered with a farmer's board of appetites (?)\nSweetalkin' a rasping down to a mere flashing of badges\nPrototypic landscape staged every step of my well-oiled collective workhorse with prose and attention festive.\nWait.\nWhat about the captivator?\nI am the product of skeleton dancers voice crooked scattered amidst blue fields of firey bliss tricks (?)\nWhere disease applicant activist rattlers, fascinate brave child\nWhere expectant slave smiles at the stick in the painted living\nGod, if I could offer maintenance to fantasies I would\nI'd place the button in the city square for everyone to push\nYou see my mission's responsibilities range across the board\nAnd so I'd rather be a pen than a sword\nI swim a cold lake, make no mistake, I was not ready\nAll edgy and outta shape, made the company look messy (?)\n(Sorry, well sorry) Honestly take it or leave it\nJust let me know so I ain't beggin' forgiveness throughout the evening.\nBasic locomotive with a whistle and caboose\nTryin'a pull my cargo 'cross the map without a boost\nBrasher than more ways in ten years sturdy bird construction (?)\nHelp the smokestacks puff until the morn, dream torn\n\n\nI'm gone, and I best believe I'm leavin'\nPacked up my belongings then it's off into the evening\nI've knocked upon every little door that comes about\nI'll sweep ya porch if you can spare a couple of breadcrumbs and a couch.\nI'm gone, and I best believe I'm leavin'\nPack up my belongings then it's off into the evening\nThis turning in my sleep is getting old and older still\nI think I can, I think I can, I think I can,\nI think I will.\n\n", "album": {"title": "Float_(2000)&&9651", "genre": "Underground Hip Hop", "year": 2000}}, {"title": "Appleseed Intro", "href": "Appleseed_Intro&&4300", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "APPLESEED (one, two)\nYeah. yeah- I recall the\nFirst time I bumped heads with my\nHead led to a dead bargain, a\n\"Thanks for nothin', lowlife\", and a\nStart of \"beg my pardon, \"when a\nDust mite harbored spite it barely\nDents the cicada phase, blades a-\nVerted. decorate the backs of\nFreedom fighters, servants pick those\nSteeples higher, man the loose can-\nNons, \"pennin for gold\" \"nah pennin for\nChance to land in camps branded with\n\"Push\" stamped on their hand\" lets\nPush. lets push up through the\nNow, lets evoke a vow of\nZipped lips clipped to my peaking\nBrow (I'm sleeping now) I seen I'm-\nMaculate hearts blemished\nUnder the mass of genie bottle\nHostages who wish that a\nThird to her broken promises.\nBlack spot of gotham, fragile\nCastle and master passageway.\nEven the innocent captives\nBleed appleseed apple\nSeed, leave me with a breeding\nHassle factor's feet. pin the\nTail on the village idiot\nTurn giddy click stern greet a\nBurn it basics laid with the\nModes of neurotic nitpicking\nPatrons and their pseudo potent\nPatronage ah mood of the moment\nGloated in splendor of its\nGreatness and I'm hella swamped\nTruly moody in my\nDays makeshift awakeness\nAct as if apathy's been your\nBest friend since the bonding I'll one\nUp you with love letters from de-\nSpondency, honestly appleseed.\n\n", "album": {"title": "Appleseed_(1999)&&251", "genre": "Underground Hip Hop", "year": 1999}}, {"title": "How to Be a Carpenter", "href": "How_To_Be_A_Carpenter&&7267", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "So you want to be a carpenter, do you?\nWell it takes more than a hammer, boy, you're gonna need blueprints and a will to build, and...\nStraighten your cap! you look like you've been through a war.\nWipe that grin off your mug, you got a sturdy frame?\nSluggish posture just won't cut it.\nYou're gonna need schooling, and, and, and take notes!\nAnd god if I catch you yawning again you're gonna regret ever asking for my help,\nAnd dammit you gotta hustle, this is a slacker-free zone\nAnd, where's my pencil? go get your hard-hat,\nHere's a nickel, go get us a ruler and a saw and a drill and lots of graph paper...\n\nYo\nI used to have a rope ladder but tattered were the rungs,\nI strung it from the highest willow, trying to hug the sun.\nThe seventh level buckled and I tumbled from the summit,\nNow I'm back to re-climb and this time light my cigarette from it.\nMy stitchin division to vision warfares numb enough to soak suddenly in a bullet bath\nAnd skip stones in the morning as I,\nLie in color phantom tantrum explicable, sit and pull the petals off wild flower patches,\nMagic happens!\nBehold, pity the lowlife parish.\nDoom City barracks left remorse coursed on a horse-drawn carriage by the torch of Polaris\nTo the Badlands, where every bridge collapse right where the crowd stands,\nWhere the witches are fireproof and every preacher's a madman.\nFrigid be the appleseed demeanor towards the bay where the landshark Parliament swims\nWhen they pause to polish they fins.\nThe better brains will preach the village through the city square\nTo the light, heavy and middle-weight integrate,\nSlept with sticks and stones in my pillowcase.\nOoh my bomb's light simulator picks barnacles off the tugboat belly\nLeft my spirit home in a shoebox in case I die.\nGot a rugged smoke-green halo floatin' inches off the swamp,\nHad that phase when the devil tree contacts a sparkle in my eye.\nNow step back from the reservoir and let the settlers drink,\nSalvage all priorities and iron out all kinks.\nMy house ain't made of bricks and straw but never has it crumbled,\n'Cause I stitched the brain's rigidity with symmetry,\nCome visit me,\nIt's fascinating.\n\nNow here's how its done, I'm only gonna show you once,\nSo pay close attention, hear me now or hear me never,\nGlue your little eyes to the diagram,\nSee the plywood, the nails, the glue? You work every inch,\nYour domain and you must treat it well.\nKeep it clean or it'll swallow you whole.\nWhere's the T-square, hand me the pliers,\nNow dammit, oh this will never do!\nYou have to want the castle, Head Up, shoulders back!\nBe the materials, know your limits only to break your limits.\nAre you listening? God dammit boy, pay attention!\nTry it again. Little bit more juice this time.\nTry it again. Yeah a little bit more elbow grease this time.\nTry it again. Concentrate, a little more focus this time.\nYou can kick and scream and yell but damn I'm only tryin' to help.\nTry it again. You're not doing it right, here now, y'all watch.\nTry it again. Stop sulking, I'm the example, for real, Watch.\nTry it again. I'm bout to make it easy for you y'all, just Watch.\nYou can kick and scream and yell but damn I'm only tryin' to help.\n\n?? Stinging the hunt\nThe hunt dispatched a pack of wild dog silhouettes,\nAll sulking by the skyline, focused with a bonus hunger pain,\nMy sincere addiction imbalance stems from a vintage grimace slap to the mug of\nAncestral branch camped on the vessels.\nYes and I abide, the laws of the hidden desert survived,\nAnd every peasant presenteed it on the crescent less deprived.\nWith the exception of pleasant finale binges on the great endangered interests\nOf phantom brigades slaving to save that princess.\nI double the negative, to no avail, no promised benefits,\nJust delegates peddling pairs of negatives,\nWith magnified magnanimous appearance sandy sinners in opinion shut.\nNow what of the madness fragments? Stagnant.\nI oughta make a vision sing my twix cling to your pigeon wings,\nVision militia indent benders, we've flooded Hell's kitchen sink,\nWalkin' eye civility simpleton citizen mixers to kiss the sky in unison &lt;kiss&gt;\nSinister city-blistered corporate rule-igans.\nAll I really want's a nickel to feed my little pigs.\n? Big Dick three cheers to the product.\nConsumer populace feed but never dreamed of the process\nWhen a slanted advantage point sort of makeshift criminals date rape the hostage,\nDream away the blame pain, yeah but it seeps through the cracks,\nAnd drips from the ceiling and smells the rich scent of my tracks.\nAll I ever really wanted was a jungle, and a jungle I got,\nSee it ain't the vision it's the plot that makes me stop.\n\nTry it again. I don't want to.\nTry it one more time.\nI'm not even interested anymore.\n\n", "album": {"title": "Float_(2000)&&9651", "genre": "Underground Hip Hop", "year": 2000}}, {"title": "The Mayor And The Crook", "href": "The_Mayor_And_The_Crook&&4162", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "No more pencils no more books\nI built the city out one brick\nI had a mayor and a crook\nI made the crook stab the mayor then slay himself in the guilt\nI stole the brick back and migrated east, now let's build\n\nEvery tenderfoot cadet better they be slit-throat percentages\nChicken penmanship tied the thirteenth knot (Hangman)\nI arrange panoramics of a plastic catalogue\nAnd where wild dogs sing tailor-made lullabies tried by my offspring\nI'll bring the butterflies and he can bring the centipedes\nAnd she'll bring the cadavers set em' free and let em' feed\nThe devil tree penciled me in but I slept thick through my alarm sock\nSlick Willy hid in the barn while farmer charmed the crops\nAnd I'm a warden\nMy tongue is full of glass\nBecause I promised my friend I'd chew up the bottle\nIf he truly drank the poison\nI'm alienating the mating man to the high ride, base tied\nFace mine's and make God clones\nWe can manufacture medicine\nCut into 5-digit slide clock the essentials in (I'll be a bill collector)\nMy destinies resting with red worms chewin\" off the carcass anyway\nLet me slay artists for tips in the penny tray\nBy the way if that diamond ring don't shine\nThat's 'cause I bought it at the five-and-dime but don't neglect the sentiment\nI'll pedal my tricycle through the f-5 logistics of a twister\nSoaked in the religions of a nit-picker\n\n\nIf I botched the operation I apologize (sorry)\nThe air's rooted in carbon\nI'm but a mortal archer parked in amber waves of starlets\nI'm fresh out of Geppeddo's woodwork asylum\nCedar frame, wire-bound knuckles\nLet a tug of the puppeteer steer my hustle\nWell when a page becomes a squire, re-engage, clap your wings\nWhen a noble's demoted hope it don't sucker-punch the colony\nBut when the catapult releases lease your claims behind the bunker\nAnd fasten stinger pageant results to the public eye (glory hunter)\nIs it genuine enough to feel baby felon\nNegotiate comradery of wills\nHow's this my little loom\nPerv surgeon with dirty dominion monitor boxes\nHovering inches 'bove pertinent urchin toxins\nNow y'all ain't excused from table side\nTill the dinner plates fly\nSlurping' liquid happy citzen enhancer\nI got this slicky sycamore head shaker\nMimic stitch and splinter entry\nThereby filtering citizens hit-man prior to acts descending (tight)\nCats know the ambiance calm beyond comparison\nCaptive, passive spring loaded serenity\nI'm trying to give this city acupuncture\nShovin one-way pins in subway systems\nStand up where I'm layin, now that a runway vic (push)\nMade you go batty, spreading spawn legitimate\nSpice the bishop, sever the ties, splinter the kinship\nSee every now and again I love life but hate to admit it\nCause it spreads the jinx on a sleeping cynic\n\n\nI'm quadruple six plus scruples category mayhem stems\nSo one overlooked the scene including loopholes\nWhen Christ studies the return ramifications\nI'll burn the campus to impress him\nThen rock like medusa glances\nYou ran the final mile before the blanks blow\nHome alone sippin beetle juice\nJust to numb and then shimmy the needles loose\nI built a castle out of fifty-two cards\nPlus jokers with an image\nModern theory jars us while remaining harnessed to the vintage\nI'm mad at how far this is dishonoring Occam's Razor\nBut it seemed so being fatigued knuckle work (labor)\nI've patched the little leakage in the shell around my greed\nIn case Tommy Turbulence located the matrix then impedes\n...\n\n", "album": {"title": "Float_(2000)&&9651", "genre": "Underground Hip Hop", "year": 2000}}, {"title": "The Substance", "href": "The_Substance&&1553", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Four rooms, a ceiling and a floor but there's more:\n(Close to insanity)\nA desk with a subtle light, a window, and a door;\n(Close to insanity)\nOne bottle of the bluest inks your iris ever saw;\n(Close to insanity)\nOne child prodigy with a vision in his core.\n(Close to insanity)\n\n(Yeah, yo)\nI'm frost bitten, slippin' away in titanic burden nurses\nWhere the anti-hero clergy purge their value burning service\nAnd warped was I, huddled beneath the influence of fresh,\nMeshed with impressions that appear to shrink before my very breath. (Breath)\nThese tides of woe and malice and mirth initiate a wave crash,\nSplashing my offspring graves prior to birth, it's looking bleak.\nMalarky farce sergeant crooked and sleek emerald eyes glow;\nI'm shook in a freak side show!\nOK, I strobe effects projective when I blink\nSo I design this chorus line.\nWhen linked we let our eyelids fall and pilots stall.\nWith what I sing, I'll open lash light and dark clash to dim the wattage,\nThen see the wide-eyed dry grays, and supplied fiery Colossus.\nWell, I am a hostage. Guiding, yet, pushed beneath the crazes' climate.\nHiding behind the levy while the stubborn rivers rise and feel this.\nI wish heavenly brevity centered hate pedigrees instead of dead serenity.\nGod damn. Must have remembered me.\nIt clinched me, it wrenched me, tempted me to employ it,\nApprehended me, and rendered me suspended in its voyage.\nHow these tables have turned!\nHand to the bottle with the skull and crossbones scribbled off the label,\nSip the ladle. Drank the burn. Begging for dead!\nConcerns off with a zephyr tread and leg in a web,\nCaught triple-six couriers; beckon, they fled.\nOK, OK, I get it...\nLet 'em shake a little, then release 'em,\nLike, as if ghostly hysterics would leech on band aid completion.\nOdium, patience ran his anti-death commando\nJust a litigant stretchin' to touch tranquil,\nBut couldn't quite catch the angle.\nI'm trained as cornerstone famine trooper\nSo my tray within a heart of hearts still belly up and parched, come on...\n\n(Yeah, yeah, check it)\n\nI'm a sideline observer alerted not yet retreating.\n(Close to insanity)\nThe climate stubbornly hovered slightly above freezing.\n(Close to insanity)\nNow everybody in the populace awaited my reply:\n(Close to insanity)\nI spit a billion tiny brilliant white lights into the sky\n(Close to insanity)\n\nUndeniably amused by the way the fuse burn,\nBy the way the clues churn in front of my eyes...\nTo fertilize germination of concern for me, for we,\nFor he who's sucked into the trench, fully dug.\nI don't wanna pull the plug...\nHug on my canteen like in a dream,\nCentipede leader speedin' through a meaty greed league,\nI can tell by the way the needs bleed from a seed,\nIf the breed should have ever been bred. 'Nuff said...\n\nWhether compared to caterpillar and cocoon,\nTo emerge, or a spark's soon to bloom to a surge,\nAll I need is the nourishment, the courage and the burn\nTo ascend from a number, to brave <i>Blade Runner</i>.\nHunter, cleric, swordsman, king...\nMore like I'm walking with a broken mood ring.\nMood swingin' from the mezzanine level,\nHere to bevel the edge.\nMy team's settled on the ledge to pledge.\nIt's like that.\n\nIn the summer it rains buckets of hunger pains.\nIn the winter it's the same, with an added climate change.\nThe remaining two quadrants balance the polar values equally for midrange,\nYet the songs of thirst remain the same.\nYou could turn the whole cold reservoir to liquor,\nHell, split the ocean on its seams if it boosts your esteem.\nI never lend span of attention lest my brethren signal fresh,\nSo do your magic, miracle worker, or I'll remain unimpressed.\nFor the flux, the fix, the famine,\nFor the fact that little Billy up the block obtained a lovely hand cannon,\nI'd examined auto-pilot (right) when filibuster won... (yeah)\nConcluded the few we're tuned with were now targets of his movement... (oh shit)\nIt's intriguing. Yet, I guess, I knew somewhere, something was leaking.\nNow I honor instinct, delinquent.\nBring settler runaways, frayed boogie bastard clicks\nTo bypass glass stature, walking graff characters...\nMilitant dance split the sun and sip the filament...\nTracer. Vivisection is to lab rat primes;\nThey try to grace these sacred lips with his maze or a dirty wine.\nHe knew. He brewed the substance just to mock the lesser budgets,\nThen sought off all trickery, bought off the public, and screamed victory!\nTunnel through the mite infested grillage and the rig\nAs fast as Aesop and his ten little fatigued fingers could dig,\nTrigger revenge, tip the goblet in the dirt, review my words,\nSpit in the puddle. Peace to fame, struggle the fuck out, and duck out.\n\n(Yeah, check, huh, uh)\n\nNow, all hail defenders of the trash talk.\n(Close to insanity)\nI was hidden, yet I slid in just to rip the mask off.\n(Close to insanity)\nI'm seventy-six inches of all the purest sounds\n(Close to insanity)\nSo y'all could dig me six feet deep my eyes would still be over ground!\n(Close to insanity)\n\n(It's like that)\n\n", "album": {"title": "Music_For_Earthworms_(1997)&&6980", "genre": "Underground Hip Hop", "year": 1997}}, {"title": "Fascination", "href": "Fascination&&2875", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Shooken to Casper. Illustrate beautiful disaster. Flight of the mothership lift to badger the male-factor. Marionette vs. the threat of wire cutter function. Stereotypical grinch bashing your pumpkins. Plug. Try to count up your warrior hatchling batch before gestation segment ended and head a platoon of embryonic remnants to the game board. Release Japanese beetle swarm to counter the spread of bitch crops, demolish the harvest and herd colony out immediate. One massive attack. Hunted, confronted and gutted. Most pungent component cloned in outrageous bunches. From the grimacing faces to the knots in my shoelaces, I'm a show you all the phases of a fuck up. Plucking the petals but every rose had its thorn. Consider that first warning, second will be good times, laughs and epitaphs. As a matter of basic principle next I set my boat a sail. I won't always be there for your tugging on my coat tails. Family stuck. Voyage of the S.S. Martyr. Who you think put that unseen iceberg in the water? Manufacture flotsam and jetsam from out your charter. We got the once pushovers pushing back a little harder now, blink. I think I can. I got grips. Muckraker major spin circles 'round sunken ships. Walk an invisible city of lost clans and he's jealous 'cause my silhouette had more dimensions than his game plans.\n\nFascination. Fascination. And everything I do I'm fascinated with, That's why I pass the hated wasteland with a grin, 'cause in the end I got my passions while you splash in a puddle of trying to pick apart the puzzle. Fascination. Fascination. And everything I do I'm fascinated with. That's why I pass the jaded grips of competitors who initiate disturance with a smirk, 'cause I feel I got direction in my work.\n\nAnd everything I touch magnificent. Picking apart a drunken township. Sitting in the rain rusting the nails my crown's bound with. If I had an anchor I would lay it in the dirt and mark today the day the earth stood still while I complete my search. You honor delusions and falsified life comfort systems as boy in the bubble huddled up to simple simon subtle. Born tomahawk. Shock the peanut gallery loopy. Debate the cutesy, groupie, cupie doll community. And I'm hung in a virtual skin and bones emaciated ringworm circus freak bloodthirsty intern trainee urchin feast with a delectable style compiled of that which stands to buff a child's yellow brick vision of slick living. I observe the stories from my fire escape observatory. First I herd the glory, then desert the herbs that word it poorly, understood? Well, maybe a pat on the back for the lucky losers who truly felt they were born to touch the music. I catalog cats as welcome mats, and for the ones insisting on dimming the stars I wipe my snearkers extra hard. I wish upon a penny toss that every servant will betray his gatekeeper and leap to reap the freedom fighter mad galaxy. Huff the war gas vapors and cram hard for tomorrow. Brother, I own twice my wiehgt in patience. Be it padded cubicle or beautiful tomb, I'll be listening 'til you whistling that more suitable tune.\n\n", "album": {"title": "Float_(2000)&&9651", "genre": "Underground Hip Hop", "year": 2000}}, {"title": "Rickety Rackety", "href": "Rickety_Rackety&&9128", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Smack dab in the middle of the cuddles and kills,\nGuerilla jimmy city limits with a bucket of pills\nHollring 'no I don't immediately ameliorate 'em.\nI meet 'em, greet 'em, read 'em, and rate 'em, see if I hate 'em.'\n\nEl-P\n\nHere come the hard rock bump through the speaker top.\nThe tweeter meter blew code def hones in.\nI pack a lunchbox, walk to the stoning,\nJump into the chemicals sold in my zoning.\nI'm irrational, paranoid, tragic.\nAnd the button on my chest says 'panic'.\nPunch it, hold up, don't touch me.\nI'm a savage from a rabid ass country.\n\nCamu Tao\n\nWho want to get it?\nYou all acquitted.\nYou need to quit it.\nGetting evicted, you little idiot, pitching tickets.\nIt's sorta tricky the way you wanna go get your digits.\nBody you up at the party, somebody get his mistress.\n\nAesop Rock\n\nYou take a pitch black lung and a purple heart,\nThen you kick back once the inertia start.\nAnd when the shipwreck sunk through the perfect dark,\nThe serpent's arch alerts every circled shark.\nSee, bloody salt water sounds the h'ors d'oeuvres alarm,\nAnd when the first arm's found we observe the art.\nLike a belly-acher won't kick face to the curb,\nRather kick when the face already raped by the worms.\n\nEl-P\n\nTasmanian pain coast, ridin'.\nVery little to say to these politician behind it but this:\nYou better loosen the noose or lose livin'.\nThese little kids walking the ave. quick to produce a biscuit.\n\nCamu Tao\n\nNow you should medicate any area that the pain hits.\nAnd when you in the streets you should peep the sets of strangers.\nThe actors that are in fact a cast of chaos.\nThey be looking for any situation they can play on.\nRespectively injecting these thoughts, detain us.\nNegative speaking, they be creeping, they entertainers.\nWhen you out of data they run through a route that'll save ya.\nIn retrospect, infect and pressing your papers.\n\nEl-P\n\nI design kill pain cave penmanship.\nFederal analog hog unedited.\nWith a CUNY degree in young numbness.\nAngels on the rooftop, gun in they trumpets.\n\nAesop Rock\n\nI was buried to the neck in them all-start bloopers.\nPeriscope down, hop Boss Hog cruiser.\nPorcelain or pewter authority wil be over ruled the second jukie uber alles news hit the sewers.\n\nRickety Rackety.\nThis city fit my style exactly.\nWith a backspin, and the fat laces, Gazelle glasses, chase rap daily.\nRickety Rackety, this city fit my style exactly.\nNear the train tracks, in the garbage bags, where the cement cracks, we a part of that.\n\nCamu Tao\n\nWhen you take 2 to the vein, introduce 2 to the brain.\nYou don't get used to the pain. A maniac bruising the cage.\nWhen cats rush you in the public you be like 'do it again'.\nHe's a motherfucking bloodsucker, he can do what he can.\n\nEl-P\n\nOn the side of the block, do the bus stop.\nYou paying a fare?\nThat's a trust fund.\nLittle ugly ass duck, life's a fun fuck.\nToo battered to rush, I walk punch drunk.\nAnd the whole world is yours now.\nBefore the steppers are goosed kick your door down.\nI'm in the getaway whip with Aes Rizzle.\nHe got the same shit stitched in his missles.\n\nAesop Rock\n\nO.k. lefty field... stealth.\nDressed to kill... self.\nMegawatt with a horizontal neck spin swim funny to vertical bobble head yes men.\n\nCamu Tao\n\nWhen the evil falls in it draws to the pours, it gnaws to the core.\nIt's precedented that you represented a percentage that wasn't vintage and the crawlers hate us,\nYou automated, we brought the flavors, niggas you ought to hate us.\n\nEl-P\n\nAnd even from antagonity squad the family tissue.\nTestify the look of my eyes, genuine issue.\nI'm a freak in the flesh that penetrates lust.\nSpray the vaginal juices, like I was up in their undies.\n\nAesop Rock\n\nDon't picket the misfit law, Nancy.\nThe core's no picnic.\nMislead whores advancing.\nNo business.\nInsist lured with candy to cure citizen x with that all-rours dancing.\nCorporals landing ashore, all soar boned nitwit, rickety rackety porn fancy.\nWeave through the hell and high water hot zone,\nDiseases in the minute the idiot got home.\n\nCamu Tao\n\nNow I'm a teacher, 1st grade, and I want to participate.\nI want to grade the papers but I don't want to give them A's.\nO.k. F, D, F-, test time, set timers, call every parent and give 'em a piece of my mind, shit.\n'Cause I don't want to give a good future, I'll shoot ya.\nShoot ya?\nWith an Uzi filled with rulers.\nFuck minors, flush minds.\nEven leaving 'em bruised up.\nStack kids, pack cute lunches in the cooler.\n\nRickety Rackety.\nThis city fit my style exactly.\nNear the fire ladder, where the wires gather, drink water, eat fish, smile after.\nRickety Rackety, this pussy fit my dick exactly.\nWith a threesome, giving treatment, sex on drugs, girl you can't keep up.\n\n", "album": {"title": "Fast_Cars,_Danger,_Fire_And_Knives_(2005)&&7560", "genre": "Underground Hip Hop", "year": 2005}}, {"title": "Easy", "href": "Easy&&1506", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "I take it Easy\n\nUpside down, I pick wigs for beetles\nPry 'em out and pin 'em to the polar of the see-saw\nSofa cobra shimmy out crater\nCradle my weight in double wishbone suspension\nVersus AM clock radio bangers\nDownside up in cripple acres and still the fountainhead\nSpittle sniglets quicker than quidditch seekers snatch golden snitches\nYou could be a part of it\nJust park your bark at 20 paces\nHold this target and we'll call this bitch a partnership\nMan, the city bred the brittle cheapo\nLittle Lego people squeezing little Lego Polaroid in keyhole\nMedia breather needy burrow to hide all\nWhile you friends and neighbors press stethoscopes to the drywall\nCurl a worm tongue tight, bitten behind the vamp chopper foaming\nLamb choppy sock puppet fear and loathing\nNeed phoners a.s.a.p. to build careers out of misquoting\nSo I read Aesop interviews and get schooled on my own motives\nIt's a pocketful of nickels, like Cool Hand Luke decapitating\nParking meters when the pigs blew the whistles like windmills\nI went to jail overnight for putting a sticker on a phone booth\nNow in the time that you did the paperwork\nHow many'd the rapists merk?\nPanicky banister silver surf over the wobbles where the potholes\nBe the ulcer in the stomach of the God show\nYou blinded by the light you might just plummet through the cosmos\nMeet Apollo sandman function before the whore hit the high note\n\nI take it easy, the ice is thinning in the valley of the jeep beats\nAnd when the freaks come out I hug a TV\nSomehow a channel zero bender's less creepy, it's bliss\nRepeat with a twist... Easy\nWhen every martian in the market holler feed me\nThe all city opinion spicket leaky\nYou learn more when your mouth piece retreat, it's bliss\nNow listen to this... oh OK\nAll day every day, oh all right, all night every night\n\nWhose capitain gon' spew stale venom? Not mine...\nI hug a hammock in the bedlam\nAnd when the potentially lucrative race horse gets deaded\nI'll wake up for a second to help the betters count their blessings\nBut I cannot cratchet crutch the Ebenezer limbs much longer\nFlaccid flimsy songbirds, classic dizzy wrong turns\nFor the long term got a dragon all achy\nTorn between the lending of a helping five knuckles\nAnd a charter your own escape\nNow it's like, sufferin' succotash, bucko, ducks in the chuckle patch\n10-4 on that, stinger opinion, wingman double back\nFuck it, Let him roam the home of the mange ridden emaciated\nSlave pain cave children game\nNot all players heal the same, learn it or don't learn shit\nMy radio is on regardless\nI tune out pardons and tune in starlets\nCarbon and pre-David/Goliath live Paleolithic bias\nWho walks on all fours dragging the cadaver of King Midas\nNow it's Thor dwarf war hammers, Elvin bow and arrow aimers\nDocumentation of the rate at which narrow tapers\nHermit crab, honest cat, trying to raise the roof in my own TV room\nAnd still get the security deposit back\nCall Ripley, skippy, motorhead dope fixture on some go to bed no dinner\nHold your head cold winter\nEase up out of the ghastly, desert dozer cliques stranded on cloud 8\nProud of their pogo sticks, I stay left\nAlong came a spider, sprung and alert, I stay def\nHe makes records with his tongue in the dirt\nSuffer the dirty earth crisis with a license to flirt\nBuffer the mighty tighty sequins with a price on the mersh\nCovert Mr. Blizzard shoulder, he always acts all pissy\nPlus your friend said I was an asshole when he met me\nNo bad moods aloud when you're in the public eye\nKill it, you are the weakest link, goodbye\n\n", "album": {"title": "Bazooka_Tooth_(2003)&&7433", "genre": "Underground Hip Hop", "year": 2003}}, {"title": "Same Space (Tugboat Complex Part 2)", "href": "Same_Space_(The_Tugboat_Complex_Part_2)&&6364", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Killaz reflect the destiny of the village\nSo when 20 count regrets float down futility spillage\nSee I'll pass the broken arrow this time for certain\nYea but from here on out its hoof the mare the bare footed urchin\nDig it in person\nNow exhibit true audacity and passively hack grease into ribbons\nYour excused from the roundtable admissions committee\nActivist legends turned hostage in fallen cities\nDirty earthlings circling vision immaculate\nSpin me dizzy in a crosswalk\nMy too far gone mastodon senses inspect relentless\nFor fitted boogie systems and crook addictions\nWell sure my crown is formed of thorns\nYea but my thorns are formed of sound\nAnd I have found sound will keep me warm\nWhen the mornings born with frozen ground\nPut a rope down pull me from where the buzzards cleared\nI mean from the bones you and your little badass mad max musketeers\nWhen the silhoettes of emaciated frames dance on a highwire\nMistook for aspiring third world poster children\nBut is inserted ghost with dealin'\nDead to administer links like chief then what's your forte\nDevil dragger in disguise seeking the match made in your eyes\nFriend it don't take the wise this minute triplicate pace unified\nI don't condone the blasphemy naturally its procreation\nFrom the floods, to the fires, to the droughts, to the cyclones\nTidal waves, the twisters, tornadoes, and hell stones\nWhirlwinds, tropical storms, blizzards and monsoons\nAll of which I witnessed prior to waking up inside my room\nLook at the crook as I panic episode tantrums\nFuck hugging my cool\nThe edginess readies the mock knock quick draw hence the duel\nThe company of similars couldn't excite the motor\nBut hermit crab Ace home alone-uh\nOne barrel of idioms and charcoal stick, courage under desire\nCanopy draped beautiful messiah reluctant\nStuck in the pluck in the haul buzzing the fuzzing televison mixer\nBook of saturated matches and a half-made bed\nPick of the litter, litter of the pick\nPack leader will huff cannibal fumes, mechanical zoom\nThere's ample room\nStowaways inside the cargo bed\nSaid leech prior to firing up his barnacle magnet\nInstincts leashing himself to where the wind splitting ice storms\nAnd termite swarms are commonplace\nI'm a trace this silver lining winding round the profit chase\nI know there is good in you if one peels back the opulence\nBut I also know its ratio the bad don't feed my confidence\nThe nutrients will be intense circle\nThe clues units of success being personal\nThen sucked basic diversion\nRusty anchor budget for nothing\nWedged between aesop rock and a scarred face of frustrated fuck yous Bound by concern\nI can't believe I'm still concerned\nI can't believe side children turn in their sleep over one-liners\nWell I yield to hear your burns\nColor me out of my skull draggin a wagon of creature features\nAnd all I ever wanted was to aggravate the sleepers\nLook self-crafted heroics murder worthless\nCrash test ideologies, catalog alien doctrines type disturbance\nGot 'em out, killing machines turn belly up\nBuckled, the troubles I've seen\nCoax twenty four sevens of wide eyes from day dreamers\nClean or dirty serpents in turn wish preference for the latter\nJustified the germs burn cauterize the gashes after\nOn my left, one finger for each burrough I can touch\nOn my right, one finger for each time that I wake up midsummer night\nWho's cloaked in a pristine mantle of hellfire\nBut A-capital glaciers out the east slide lateral\nBorn for one task indeed\nTo spoil the citizen kane emote self this ugly duckling seed\nLook I ain't too attired of draggin the baggage over the seasaw seeds\nWhen the reapers turns mortals to caspers\nSee the plain and stone conjurable can't mimmick the null\nOf a billion troops holding matchsticks to empty cannons\nStand of a many moons when the sun hit the mountainside splendidly\nBask in the last warmth that be known to man's tangents\nIn the wink of an innocent starchild's eyelid drop he vanished\nManaged to carve initials in the granite wall the damned it all up\nI hung with cats that do the donts\nCats that forage through the moats\nHoping they open with soveriegnty and a cantine deemed with prodigies\nI love the wake, the watch, the walk, the work\nThe well its almost six o'clock\nI've never seen so many tugboats miss the dock (watch)\n\n", "album": {"title": "Appleseed_(1999)&&251", "genre": "Underground Hip Hop", "year": 1999}}, {"title": "Boombox", "href": "Boombox&&1520", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Raw, I'm going to give it to you\nWith no trivia\nRaw like that Aesop rock iron-fisted list militia\nWhile bent funny bone grown community\nSpit a thousand and 1 ripples to cripple the continuity\nTap water builds character\nRight I irrigate it straight to mainline\nYou want to do the same? Fine\nThese pretty profit grommet teams solidify the clot to slippery city salt piston pump drain\nBut hold those incredible console with the Russian roulette baboon spin-off\nWhere everyday a thousand strangers pray for empty chambers\nOne-sixth buckle\nFive Sixths sweat bullets trying to keep it subtle\nBut I'll get you (I'm going to get you)\nWobbly rope bridge\nBroke inches tired of dry land\nBut duck skull stepping-stones suit the mix-down well\nWell, when the rumor spreads that y'all stupid\nI'll be the cat with guilty look on face and shirt that reads: I didn't do it!\nIs it on, is it beyond basic\nDoes it ice grill you or is every song faceless?\nDoes it have a title? If didn't would you name it?\nDoes it babble about nothing like a drunken atheist?\nWe could run that Orwells '84 war\nFor the room 101 z-tour\nTill he try and fidgets with his or her own worst fear specifics\nSwerve around the cobra kisses\nSee if the venom overloads this vision\nI'm going to suck the poison out and spit it\nStole my sneakers but your feet just never fit in\nServers you right for trying to walk a mile outside your limits\nI'm going to tiptoe across this yo-yo string\nUntil you walk the dog out from under my feet and skip town, sit down\n\nIt goes boom boom boom\nBoombox\n\nEarth to a-r vertical burden has increased at an alarming rate\nBliss is down a point\nMurder up, glee down and still falling\nStill crawling out of bed at 2 on Saturdays\nCame this blind soldier-burning confessional\nEase back; let a heart thump echo normalcy for 10\nLet the back burner boiling point descend\nI race the derby in the first heat (strike personal)\nStrike personal space with the most utterly putrid version of grace\nSpit the gimmick, sit and fidget\nWhile we try and jump through hoops\nLike Coney Island freak show midgets\nWant to be a fighter pilot\nDriving that childish early Wright brothers experiment\nPrototypic model fossil\nSit and sweat bullets on a console\nBusting accidental dirt bike donuts\nOutside the most ridiculous poison tongue brain silo\nDead before the chubby debutaunt conquered the high note\nSchooled by the cruel intention inventions pensive sideshow\nSee contrary to popular certainty\nI alone advance without an earthly poem\nAnd dance on a handful of zoning fans\nHolding every chance to own the land I roam\nWith dome in hands\nTruly be its only camper happy with the scrap heap\nSee I convinced myself it's on\nTherefore it is and the melody settles\nBeneath the fact that I'm just spitting for these kids\nI tried to get them all open\nAnd once I quit and said I didn't care\nI swear they all threw their hands up in the air\n\nIt goes boom boom boom\nBoombox\n\n", "album": {"title": "Labor_Days_(2001)&&8422", "genre": "Underground Hip Hop", "year": 2001}}, {"title": "Holy Smokes", "href": "Holy_Smokes&&1801", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "(Man 1: Give him one of these pills if he has any pain.)\n(Woman 1: A parable: What is it?\nWell, it's a little story with a lot of truth in it\nAn earthly story with a heavenly meaning\nJesus told many parables to grown-ups and children alike\nHe told them simply and sincerely, in words everyone could understand\nSo that all might learn the lesson he was trying to teach...)\n(Yeah!)\n\nWell they were selfish with the helmets on the little bus\nTill brake fluid sewage crippled up the get-retarted nickel punks\nSlowly cope but swore his lowly robot foley folk\nWould one day rise in sections to interrogate the Holy Ghost\n(I knew it!)\n\nHoly smokes\nFather. Black suit, white collar\nKiddie porn dungeon, guns, and three fingers for your daughters\nCaught belly-up. Antique Nazi paraphernalia\nYou can not pay you bills with holy water and Hail Mary luck. (Oh my!)\nShucks, fucker. Enjoy the Alcatraz shower fun\nAnd mommy's mad; I'm clich&#233; generation X Agnostic Front\nIt ain't the nifty faith in 1958 before the New-New Testament approved altar-boy fistic rape\nAnd take me to your leader 'long as he don't manipulate toddler-beaver. (Leave him alone!)\nCall me crazy but I'd bet that wasn't God's demeanor\n\nSod-o-meter peaking. (Me too!)\nBut Long Island was Jesus every weekend spoon-fed to appease traditional upbringing\nOf a Middle Pennsylvania shit-hole where elders movement\nStressed the stellar therapeutic Bible cycle. (How?)\nOne church with a bait and tackle store next door and not much more\nSo the two moved to New York, made babies raised on what they'd saw\nChristmas morning smelled fresher than angel pussy\nBut immaculate conception came second to playful goodies\nLike laser-tag was way more spiritual than blood and body wafer bags\nAnd manger staff as long as Santa ate the cookies (Well...)\n\nGrandma was a saint while he'd paint with snakes and bullies\nSaid \"If only you'd memorized your prayers like you did your Kool-Gs\"\nBy the time I was old enough to know what religion was\nI was Catholicism-numb and truly didn't give a ... FUCK\n94': Moved out the crib and it ain't seen a steeple since\nWhile Knievel-Evil seeps in a Christian leader's pitch\nTill priest's lap slapped with parental advisory warnings:\n\"I'll be auditioning gods in my office on Monday morning\"\n\n(Yeah!)\n(Yeah!)\nUh-oh! And yet another pill slipped\nDown the hatch It patch him through the kill-switch\n(Yeah!)\n(Yeah!)\nI need a couple As for Qs\nI'm not an asshole I'm just a little confused\n\n\n(Woman 1: This story reminds us of the one Jesus told about people who were kind and helpful to others\nHe said that one day the king would say to these people\n\"Come, inherit the kingdom prepared for you\nFor when I was hungry you gave me food\nI was sick and you visited me\nI was in prison and you came to me.\"\nBut the people asked\n\"Lord, when did we see you hungry and feed you?\nOr sick or in prison and come to you?\"\nAnd the king answered\n\"In as much as you have done it unto one of the least of these, my brethren\nYou have done it unto me.\")\n(Yeah!)\n\nJust a little bruised in the back of the pews\nActing amused with a mask on them Vatican blues\nFor in the eyes of the organization I was raised in\nAes' is just another sinning brick in Hell's basement\nCubicle adjacent to the killers and rapists\nFor what? Drugs and fucking is part of growing up\nLike cups offa dumb shit's better than the schools\nI'm not an asshole I'm just a little confused\n\nJust a lit fuse in the back of the pews\nWatching a thousand flavors of the same God feud\nI figure ultimate peace is the common theme\nSo it's a no-brainer piece when the blood hit the screen\nGot a basic good and evil sensibility born\nGood neighbor know a halo wouldn't fit over horns\nI'm more science than faith, I'm more karma than bread and booze\nI'm not an asshole I'm just a little confused\nNot an asshole I'm just a little confused\nNot an asshole I'm just a little confused\nNot an asshole I'm just a little confused\n\n(Man 2: You know what, to be completely honest, Aesop, you're a fucking asshole.)\n\n", "album": {"title": "Fast_Cars,_Danger,_Fire_And_Knives_(2005)&&7560", "genre": "Underground Hip Hop", "year": 2005}}, {"title": "Basic Cable", "href": "Basic_Cable&&4623", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Television, all hail grand pixelated god of\nFantasy, murder scape and perspective\nFuck a sore channel changed digit\nI sit with a nasty network intravenous plan\nWith a stable diet of my cable pirate\nYo, the doctor is in, the doctor is on\nBorn the bastard son of static radiance cloned to welcome in every home\nLet a blue screen, bruised dream canopy\nVictim of the cursed nursed Technicolor drunk support team\nOoh, I love all advertisements\nThough accused by robot news casters who capture and pollute\nSpoon fed hazardous fog to joy luck catholic squad\nPlease take me, please calm me, please make me a zombie\nPlease I want to donate my brain to the monstrous Panasonic profit\nNow, twenty first century plagued\nDispersed to wide eyed glamor-addict patients\nTelecast patrons\nBlue be the propaganda banners, well, sure I'll be a Marine\nWith a clean sword and blue uniform, it only takes a dollar and a dream\nAnd I abide great idiot box power supply, fuzz vapor,\nBlack out of New York, hey honey, get the generator\nI'm in a doom, doom generation, pacin', ancient electric secret\nNever sleepin' to miss the AM oasis\nMy name is a wired heart, sloppy obligation\nTurn my stilt into my guilt and have a chatter box blame frame adjacent station\nMake reality scrambled and suck the life out of a hidden vandal\nAnd loving every minute of the gimmick, change the channel\n\nPlug it in, turn it on, prop me up against the couch\nLights out, I ain't ever gonna have to leave my house\nSatellite dish, get up on my wish list, turn me to a tyrant\nLet my clean spirit dissolve through the appliance\n\nPlug it in, turn it on, be my mother when she's gone, great\nWipe the spittle off my chinny-chin during the breaks\nIf I gotta go blind I'mma do it for the love of all television kind\nAnd that's fine, and that's fine...\n\nMake me a star, I wanna touch gold\nHold me suspended in a dream, merely inches from the screen\nDeleted passions sacrificed to one electron monster\nCrucify my lit up future to the monitor\nDamn it feels good, turn on, tune in\nZoom in to hug the bug up in your family function\nBut the children seem to love it\nYes mother, me and wild discovery\nAnd heard the static flock to where I sleep\nBy the glow of that magic box big speaker\nStereo mastered often kill the freak seekers, eyes spiraling\nTangled in the star spangled wiring\nI can turn from toxicated visuals\nAnd all the kings horses abort the loyalty to royalty\nFuck the fortress\nRiddle me with glee, hoist the end all teleprompter above my sleeping head\nI'll be dead by morning anyway\nColor my values with mundane humor in thirty minute tickets\nTo feel the magnetic seal picket censorship\nI want commercials twenty four-seven\nI wanna shop from my bed and set an\nExample for all my overworked, underpaid brethren\nI bond with a six string (?) correspondence\nAnd lurking circuitry circus\nWith allegiance pledged beyond the glass surface\nAdamant students within the fine school of possessed graduate catalysts\nChannel zero addict, immaculate\nIt goes- big screen, little screen, any screen'll do\nJust let me hold the controller and I won't have to murder you\n\nPlug it in, turn it on, let my little eyes glaze\nTwenty screens lined up along the borders of the maze\nI wanna see the five day forecast, fourteen days in advance\nSo I can get my two weeks notice every time the sun dance\n\nPlug it in, turn it on, silent fix better than nothing\nLet a once divine soul feel the functions of the hypnotist\nThe viciousness, ridiculous, peaking a dummy's interest\nTouch the power button meet your maker, ain't that something?\n\nPlug it in, turn it on, say goodbye to Sunday afternoon\nFix the antenna, sit back and let disaster bloom\nIt's a beautiful sight, with a most ugly intention\nBut I taste it everyday and bathe inside the consequences\n\nPlug it in, turn it on, never once have you talked back to me\nYour majesty, I love you, I despise you\nMy everyday is sitcom, soaps, news, bad dramatization\nCome along with me, my friend for the most glorious sensation\n\n", "album": {"title": "Float_(2000)&&9651", "genre": "Underground Hip Hop", "year": 2000}}, {"title": "Bazooka Tooth", "href": "Bazooka_Tooth&&654", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Diamond cutter spine\nArmadillo armor that bends around the blades\nBugs in the beard\nEbony in the lungpiece\nBricks in the Timbs\nBazooka in the tooth that he's flashing at your friends\nThis is the lifestyle, baby\nKnow and sip the recipe\nNot a single innocuous side up in the centerpiece\nOh my god\nJournalists across the globe are officially critiquing my first eight bars\n\nPiety for the fam, embargo piggybackers\nNavigate sim-city backwards\nBazooka Tooth, baby!\nZephyrs less dextrimental expect to tone down terrordome for starter crews\nLike jousting Pompeii with a garden hose\nIf you wake up to the sound of helicopters bumping Wagner\nIt's bodycast to Pilates class\nBuckle in the Bronx back alley batting cage with bottle smacks\n\nDrag them prophecies, be them celestine or Mothman to the bumper boat monster mash\nSee, the pristine kittens fiddle with new yarn\nDecrepit sickly dogs get shot behind the barn\nOne shan't put in long hours like Tim Leary's lava lamps\nTo be second headlined under the boy born with lobster hands\nIsolated, biological phenomenon\nFirst nocturnally orchestrated car alarms\nY'all sketch portraits of your neighbors, tack 'em up without fail\nSee a robored pitchforks and alligator tails [?]\nOffical Max Fischer Blume break cable clipper (Def)\nPicket train buffer, the riverboat, and the switcher (Jux)\nPipe-dreaming that so fresh and so clean plummage\nIs an appleseed of bore that resorts to Bazooka Tooth shit\n\nYou don't want me smiling at your cameras\n\n", "album": {"title": "Bazooka_Tooth_(2003)&&7433", "genre": "Underground Hip Hop", "year": 2003}}, {"title": "Dryspell", "href": "Dryspell&&578", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "On a sunny afternoon in lower east side New York...\nYou about ready? (Yeah)\nGood morning my sweet vision of morbid disorder\nAnd good evening wonderful riddance and such\nMaybe today I'll touch the burgundy halo\nTrimming the tunnels and offend with tenants\nSpangled cross a more tangible premise\nThis splendor shit needs splinters all up in day-tripper visuals\nTake it easy man, fuck it I'll take it any way I can\nMy palms are generous\nWhen I witness fury scurry past my window\nModel city in a bottle plugged hostile\nIts bliss kissing polluting\nAnd a billion suckers pucker in a bind\nMaybe the sunken ship is the treasure\nNo, but they insist it man\nI try to spin me dizzy sponging\nSpongin up the given dungeons functions\nAs opposed to art historians absorbed inside assumptions\nEverybody pop your knuckles when the style divorces vertical\nMarveling at the spite with which it curdled\nOutside my tenement grows a little warmth\nFrom out the mugs of masons wasted\nLaying bricks for days to later find they owned the lot adjacent\nMark the blasphemy elements of elegance and savagery\nMurder the gossip, fuck it run off happily\nThe broken spoke cyclers choking open doctors they as born fetus\nIn a matchbox conveniently padlocked to the hammer base\nNow these impurities embedded in five illiterate's textiles\nShedded in the hell tale to motivate blind suspended leverage\nNow I'm drowning in a pool of... why are you here?\nSabotage with my beast of burden pertinence of if I die this year\nMy name is Dry spell\nMy name is pillar\nMy name's allegiance\nMy name is flagrant\nMy name's a thousand steps from patience\nBut I'm sick and tired of waiting\nMy name's Polaris\nMy name is canvas\nMy name is lowlife\nMy name's intention\nMy name is every imperfection that plays a part in my dissension\nMy name is carnival\nMy name is posture\nMy name is polarized\nMy name is evidence\nMy name is delicate approach from symmetrically to my fellowship\nMy name's possessive\nMy name is cordial\nMy name is igloo\nMy name is captivate\nMy name is contaminate the rich\nAnd clock the profits for the captive's sake\nLet us hope that the horrors of evil no longer loiter on the doorstep of your past\nCircle of sandbags drag the shield a meal the meaty hand grabs\nI'm splitting hopes at your local Acropolis\nOpulence in a cockpit not the pocket for them born with a pepper toss\nSunk to rest while they've exhausted the art of drunken address\nExhibit fracture lines that converge towards where the hackers whine\nWhere trappers slack the traps\nUnlatch the catch then cover up his trackers line\nThat will make his majesty furious\nOh bury his head and how could I have been so dense\nIf only, yeah but I'm lonely\nMy days graze normalcy then morbidly crash\nMy years breathe honesty then sardonically laugh\nAlas, I dig my toes in to the sand and spit foliage out my lips personifying mankind's end all aspirations\nHope floats...\nNo, hope sinks like broken boats and most harassed before provoked\nI'm tossing darts at a map of the arts to pick up where you choked\nAnd when the last leaf falls off the branches of resonance\nI'll be waiting with my butterfly net to collect the evidence\nWell I am a room with poison oak scaling the sides\nArachnids on the ceiling, rugged thumb tacks, bones and rusty pipes\nIf you can squeeze between the bars\nEnjoy my space employ my waste\nAnd change the hand dealt by a stolen grace\nDo you ever wish the circle was a square\nSo when land sharks start circling the borders\nYou could just cut them off at the corners\nThere's a ghost in the basket of values\nPertinent to, which kayak pilot succeeded in serving him proof\nNow I'm surfing it through\nSo if you need me spread your wings to spell my name\nAbove the mess near the other funny requests\nSee mild to tolerant mannerisms of higher to win\nTo assist in a meticulous pick a part of cobweb of skins\nOf innocence\nA child of timid instinct with that ten step ahead premise\nSupply dust bowls before the zephyr was requested\nViolent humble shoes ten shades of blues come off the difference\nI grimace, took me one hours blink to conclude that sickly innocence\nMy name is Dry spell\nMy name is pillar\nMy name's allegiance\nMy name is flagrant\nMy name's a thousand steps from patience\nBut I'm sick and tired of waiting\nMy name's Polaris\nMy name is canvas\nMy name is lowlife\nMy name's intention\nMy name is every imperfection that plays a part in my dissension\nMy name is carnival\nMy name is posture\nMy name is polarized\nMy name is evidence\nMy name is delicate approach from symmetrically to my fellowship\nMy name's Possessive\nMy name is cordial\nMy name is Igloo\nMy name is captivate\nMy name is contaminate the rich\nAnd clock the profits for the captive's sake\nMy name is vagabond\nMy name is angel\nMy name is century\nMy name is hunter\nMy name is sunburst\nMy name is wildfire\nMy name is scrutinize\nMy name is basic\nMy name is consequence\nMy name is cigarettes\nMy name is cynical\nMy name is tolerance\nMy name's hallucinogen\nMy name is waterfall\nMy name is runaway\nMy name is alarm clock\nMy name is...\n\n", "album": {"title": "Appleseed_(1999)&&251", "genre": "Underground Hip Hop", "year": 1999}}, {"title": "Shovel", "href": "Shovel&&9345", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "I don't shrug, I study the ramifications of my shovel\nLovin' the consequence of uprooting the jungle\nI'm huggin' the cycle of Gemini stupid contenders for mutin' the puzzle\nI don't budge the motives encased inside the gauntlet's hunger quotas\n\nMy kitchen sink leaks like you're itching to speak a secret\n'Bout the world spins yet nobody's pledged allegiance and why?\nHis beaming smile knew a private agony that burns\nAnd when the children met divinity I sat to watch them merge\nIt goes pandemonium live\nY'all motherfuckers stand up volunteer tantrums while you're playin' somethin' vivid\nPlay your sympathy card turn the miseryclast\nAnd a basket case is in a classless matrix with elastic stitches\n\n(I zig in a zaggin'-only zone)\nRaggin' a bag of lonely poem remnants\nShort of breath like you're short of fresh\nYou're a portable mess\nCarpetbagger spearheading tear peddling pretentious art critics, orphans\nTrying to dismiss those pioneering their fortunes\nYou're a spectacle\nPushin' for pedagogue lacin' up paper weights walkin' on stilts talking'\nYou touched the hand of God and I'm like\nWhat are these evils that plagued the hearts of men by sweet talking border patrol until they fold and let 'em in\nYou got your life in a basket before you could say instant classic\nLike the king of the mountain requires a boost\nI'll bury the hook in my belly just to volunteer at Live Aid clinics\nFor the thrill of nine great mimics with eighteen bloody lips, spittin'\nBeanstalk, chalking outlines before the figures fly\nWalkin' uphill trying to get down\nProminent ghost town litigant battle pitch darkness when the light switch hits the artistry circuit board breaker\nService in the greater half of nature\nSee money go wild shook when the exploitation incubated lovely\nWarmingly piggy leader colony to comfort\nNumb enough to deny the sin pins and evil needles even punctured\nTill he won't define his turn and can still function\n\nI don't shrug, I study the ramifications of my shovel\nLovin' the consequence of uprooting the jungle\nI'm huggin' the cycle of Gemini stupid contenders for mutin' the puzzle\nI don't budge the motives encased inside the gauntlet's hunger quotas\n\nBurn burn 'em mostly\nStuck unplucking plumage out the poultry\nSoaking in bulk on a sofa with duct tape upholstery\nDirty doc stellar space medic\nStoned by the commoners for glowing\nPseudo-floaters bottom feed till bloated\nHappy trail hitchhikers guide to spanning oblivion\nComplete with a thankless 9-5 chapter\nYou can sign your life after the facts\nWicked soldiers pick it with buddy system logistic motors like Noah's ark ticket holders, pivot\nAll in a days breath\nI guess\nSandman here to foreshadow a day when televisions run over baboon heart transplants\nSketching a glass partially empty till their hand cramps\nWith a iceman's dance if that ain't streamlined and stand with a fan's lamp\nBut maybe I do\nYeah yeah maybe it's all over, maybe I won the game before the machine ate my quarter\nI mean absorbing attention's a must\nYou don't wanna be overlooked\nYeah but you don't wanna be looked over too much\nOne up for the dashed hopes of fifty fishermen who crashed boats\nAnd the angels who never hit a bad note when harmonizing\nI'm an armor plated farmer\nI'm an archer rising with a drawn bow for the karma where the bulls eye clings and argues\nDense, spreads like new names at the writers bench\nEither you drink it or sink it, cause ain't no sitting on the fence\nYou make me chuckle child, it's hells kitchen now, miss\nRecognize your life is merely bait for bigger fish\n\nI don't shrug, I study the ramifications of my shovel\nLovin' the consequence of uprooting the jungle\nI'm huggin' the cycle of Gemini stupid contenders for mutin' the puzzle\nI don't budge the motives encased inside the gauntlet's hunger quotas\n\nEncased inside the gauntlet's hunger quotas\n\n", "album": {"title": "Labor_Days_(2001)&&8422", "genre": "Underground Hip Hop", "year": 2001}}, {"title": "Limelighters", "href": "Limelighters&&2884", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "AESOP- Pain cave uno, smoking a broken blue note. Tar pit escape artist carcass linger in the bull doze. Rose radio Lazarus via linear bark screaming 'I'm back to kill the video star and I'm double parked!'\n\nCHIBA- You can kite this or yet maybe baby you won't. Corvette, green Mercedes, daddy one hundred four. When I'm stunting simply stunnin', funkin' with twenty monkeys. They can be like I'm talkin' 'bout we. Slap that orangutan, drop her on her knees. Please be very cautious the funkin' makes me nauseous. Hate the bogota, The target it ain't off. It's right here and the volume's on three.\n\nSUEDE- See, we keep the black plastic stuck in the elastics, even Chevy's heavy hallows lift you higher legend has it. White crows crossing broken bridges double deucy clickin' but the rounds never runnin' out, pounds of ya blood's just comin' out.\n\n\nWe limelighters. Up until the ugly unplug me. We limelighters. Kill it now, fade to black comfortably. Spark the dynamite 'til the limelight's gone. As far as I can see the limelight stays on. And on and on and on the limelight... so we got something built if we all die tonight.\n\nCHIBA- She pissed champagne and shit caviar. Don't the watch the stars, the stars ain't fallin' any sight of glimmer... lo. Shimmering king, spring, they're trembling.\n\nAESOP- O.K. the web spread from Brooklynites to born-in-barn kittens who's gimpy half step hid behind Noah's arc systems. Inconspicuously clustered with the boas, sharks, and pigeons like Zoo York won't clock them rusted crutches up mopping the ship deck. Texas hold'em pocket ace investment. Totem altimeter tiki torch it. Freak abort. Fold or hold a cold cell in peak enforcement fortress. That's a sheep corpse who under penumbra turned tail like a sea horse.\n\nSUEDE- We got that permanent ink, that's staining the paper. Murderer's drink steam in my soul, I'm breathing green vapors. We're the last of them falcons that's soarin' beyond your altitude. Please show us some gratitude. We're carvin' your grave for you.\n\n\nAESOP- 16 D batteries. See the halflings flee the shire before he tore open the packaging. Plus, minus, in proper Panasonic alignment. Pseudo Pliskins o.d. on kick drums, snake, escape that environment.\n\nSUEDE- Wave that colt 44, bolts of lightning with Travolta grease. Strip your skeleton, it's swelterin' inside Miami Heat. Your fishnet and red vette are sizzling. Shoot through chocolate city, Wonder Woman wind whisting. Freeze, presidential sleaze, with Egyptian cuts, Valentine Ave., Jack Daniels out of them plastic cups. Winter white pinstripe lookin' Hugo. Poison ivy out the windpipe blowin' the crucial.\n\nCHIBA- First they line up, we'll divide them. Suede get roscoe, then design 'em. Aesop rock box drop the hot rod getaway car, and head up the rock highway.\n\n", "album": {"title": "Bazooka_Tooth_(2003)&&7433", "genre": "Underground Hip Hop", "year": 2003}}, {"title": "Spare a Match", "href": "Spare_A_Match&&7499", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Electric charge comin' from the mainframe\nI'm from where the phat beats stretch for mad blocks\n\nMy every little step set in a star,\nRetina Scarred; tread in a sled of bedbugs got my dead head in a jar\nCrazer camp stamp blank on the mug of settlers registered not protest nor approval regarding every morn futile.\nMy experience with a spirit alignment interference assigns division from clearance to ample scrambling.\nLet's note the magnificence in the difference.\nOK see two canaries on the wire aspire to separate luulabies both of which had me drifting.\nEvery clan ghostly orphan scared stiff in the bliss and list picking from the arrangement under burden. Bust.\nWallow in will to split the privelage cluster; Lackluster as if a journey choice grew on the nearest chuckle path- dispatch trouble.\nI've never seen the water so high in my poison life. Social conduct, 20 pace, about face, self destruct. I know the key locations, sharp enough to catch those subtle signs cause, well, this here alley cat's been around the block a couple of times.\nLifting every tin can, sifting every mess; one man's trash, you know the rest, live it.\nPitching a battered platform out of mass hysterics perished in the blizzard. When it's finished I plan to sit and observe the twister pivot.\nSleep and sleep well; sleep with a sacred array of fevers, wake as a pertinent version of a pipe dreamer.\nY'all can find me if you lookin' for a friend- I'll be the only iron-clad oracle in a city of tin.\n\n(It's like that)\n\nI was born where crooked demeanor seemed to spawn merit; I was born where all the king's men couldn't mend a broken spirit; I was born where it don't matter if you stand, sit, or fall, to live and die as a brick brick brick in the wall. And I'm a brick brick brick brick brick in the wall, and I'm a brick brick brick brick brick in the wall. And I'm a brick in the wall, drop in the bucket, yes y'all.\n\n(Electric charge comin' from the mainframe)\n(I'm from where the phat beats stretch for mad blocks)\n\n(Electric charge comin' from the mainframe)\n(I'm from where the phat beats stretch for mad blocks)\n\n(Electric charge comin' from the mainframe)\n(I'm from where the phat beats stretch for mad blocks)\n\nSpare a match for the most distorted orchid in the path.\nAssorted orphans coursed in a morbid orbit forward toward the traps.\nI make a tentative promise to flash frequent the most sacred abrasive based in allegiance to the makeshift mason's secrets.\nWater basin leaking, plug it up.\nThe simple triple ring performance shoveled subtle imperfection.\nI rung a life's worth of saturated costume gear over hell's balcony to nullify the drought and still the martyr farmers shout at me.\nAnd so the epic went.\nAnd every cirrus hung.\nThe bow breakers turned a cradle fatal, every spirit clung.\nCroon for the slick Icarus brain children busy splitting the givingtree building fresh canoes for freaks to cross the spill in. I'm frantic.\nMy plan is dwindling with every pulse bump. Gods and monsters yield the lump sum of the dolt clump.\nBe wary when the stratosphere tints.\nI Scout like Atticus Finch, inching up slow in the games of reconnaissance.\nNow cause to amend the Zen memorandum has surfaced in every holocaust citadel fix it plan.\n12 easy steps to better picket line demeanor.\nGumshoe.\nStick stone conglomerate activate massive.\nBut the sky is falling. F-f-f-fuck you.\nI've hired sweatshop labor to hold candles to the solar panels stitched in the back of my neck for nickels and sour milk by the week.\nCheek to the heartache.\nAt the center of my anthem lies a blend of temper tantrums substantial for me to lamp in.\n\n3X\n(Electric charge comin' from the mainframe)\n(I'm from where the phat beats stretch for mad blocks)\n\nI was born where crooked demeanor seemed to spawn merit\nI was born where all the kings man couldn't mend a broken spirit\nI was born where no matter if you stand sit or fall to live or die as a brick brick brick in the wall\nAnd I'm a brick brick brick brick brick in the wall, and I'm a brick brick brick brick brick in the wall.\n\nAnd I'm a brick in the wall, drop in the bucket, yes y'all.\n\n(Electrocharge commin' from the mainframe)\n(I'm from where the phat beats stretch for mad blocks)\n(Chopped and Screwed)\n\n", "album": {"title": "Float_(2000)&&9651", "genre": "Underground Hip Hop", "year": 2000}}, {"title": "Sick Friend", "href": "Sick_Friend&&5598", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "(Intro - Unknown man)\nThou mayest indeed\nTune onto the forbidden channel\nAnd see it like it is baby\n\n*Record Scratch in*\nYou should be a champion\nNever fall on me\nDeceit, deceit, deceit\n*Record Scratch out*\n\n\"Getting dusty in the cellar\"\n\n\n(Verse 1 - Aesop Rock)\n\nYo\nI was thinking about my sick friend\nStringing a ring around my whit's end\n13 loops later his feet hung inches out the pig pen\nMotley day goblins brought up pillage to pass the stillness\nWith bad javelin tip dipped inside barrel black magic brilliance\nWho rose at the tomb of the Unknown Soldier?\nTo capture the fashion fragment choreographed in traffic dancing for nickels\nHooked like sickle cells with the principles of comradery\nOne hope distortion odyssey sputters itself to my how not example sample\nGive me the bread crust while considering the littering\nI don't pity the head rush or the whimpering, spill\nAnchor to rock bottom, rocks bottom packs a ravenous catalyst\nSprung alacrative, leashed by the carnal tyrant\nI choked when the cage bird sings and stings\nSprings me up delirium to stitch the clipped wings\nI say instinctively break through while clinging the shrieking souls\nMourning the death of full and high to loss of quality control\nQuality control, stand still string up the banner\nFrom the beehive to the anthill; rag dummy\nIncorporate the unison of Vikings ship rowers plus the perfection\nOf the twice to burn with half the stone throwers, speak your assessment\nMy communicative, hindrance bleeds the needs\nOf a billion hungry victims gripped by the hell that's left to splinters\nShiving up the mass of natives and it's league marvels\nOne component's sure to shock a mass burial, breeze\nBroken penny bank fragments float up at stagnant seas\nDirty work plus applicants with chatter box disease\nIron bandit, give them the stars, the head balloons and rubies\nAsked for many moons and I can't stand it any more\n\n\n(Unknown man)\nThis is how I feel that I sling\nAnd the regulars were so amazed\n\n*Record Scratch in*\nI'm the mightiest slinger of them all!\nThere is a time for war and a time for peace\nAnd a time to run and a time to split\n*Record Scratch out*\n\n\"Getting dusty in the cellar\"\n\n\n(Verse 2 - Aesop Rock)\n\nI don't run a funny race, malnourished monarchs and loopy astrals\nWhere 99.9% swivel the broken axels\nI built boats of a pack rat bats of bully club swung\nPost utility inhalants nail it to stability and sail it\nLopsided Star bird bow crooked mass makeshift\nPatching holes with chewing gum and stitching sail to thirty phases\nObserve me sitting with my eyes tied to the clock, 'Cause\nI know that once that wind kicks up you and your motors left rope to the dock\nAnd it's the, art of clarity married to slender extension\nOf blue sky of a happy neighborhood\nString on my ring has left me dancing like wooden dummies in a paper nature\nMarry had a case of door nails, Francis little brittle dolls of paper\nIn assembly, I tremble with a crocodile smile\nHiding a fish out of water complex provided upon entry\nNow if I, were to, hold the speed\nTo levigate the game plan, would you wanna still impede\nI mean I guess, I can just divorce me from the rest\nAnd blame my chemical imbalance for the fact I've made a mess\nBut my loyalty supply hints ???\nAnd I'm thinking that damn town prior's about to fill this here bucket\nIt's that, grand precious that precious that part of you wants to touch\nAnd part of you just wants to sit and be impressed with\nTainted agony induct in barnacle attachments\nMood swinging upon the barnstorm to perpendicular traffic\nSpread, circle 4,000 circuits you burn to cater wings\nAbove alkadiene Townsman spoon-fed the shadow\nI'm tired of being wired into the thief ratio\nIt's gnawing a hole through my scheme so I leave (know what I mean?)\n\n\n(Outro - Unknown man)\nIt is the molotov cocktail hour\nHave I not brought you blessings without number?\n\n*Record Scratch in*\nThey have plenty of nothing and nothing is plenty for them\nYeah\nI've never had it so good\n*Record Scratch out*\n\n\"Getting dusty in the cellar\" x3\n\n", "album": {"title": "Appleseed_(1999)&&251", "genre": "Underground Hip Hop", "year": 1999}}, {"title": "Fast Cars", "href": "Fast_Cars&&8358", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Who's that walking with a hole in his head?\nBig bad Bazooka Tooth, I came to break bread.\nWhat's a troop's recipe for treacherous times?\nI tell 'em... ah fuck it, yo\n\nI pull the elephant tranq out of my neck,\nGaffle a tank, count up the chips, wrastle the fangs off of my fist,\nFlood a little soldier blood over the ogre acres\nOn some holiday in Cambodia with moter home appraisers.\nPagans fade into the kodochrome now, later with a lid to brow staple revist the cobra loading zone. Molar foaming but he hold his own wound\nCauterized by the Zippo he had stole that afternoon.\nAnd my dog tags jingle by the monster island heart he built.\nGrew up with a Jughead crown tilt and tardy slip.\nBe all you can be just never soothed us.\nYou lost me in that part about scrubbing piss with a toothbrush.\nHoller scum's lullaby.\nLive from the ultra-fly sham city bunker where the coldest cults multiply alarmingly.\nHush little baby, timeout.\nThe black market mockingbirds can not sing a lick but lean to peck your eyes out\nOf commission with love, out a tradition of wraiths pick on the visions that buzz,\nBet on the kitten's escape, solder the piston to pump out a veteran amplifier.\nAnd magnify through the same lens that set the ants on fire.\nFlush the muppet hootenanny.\nWho could fancy honor circuit when the circle's every duke is clammy?.\nTrooper, scoop the food in pantry. Ante up, stupid.\nMay delusion feed 'em foofi candy and pry the gold out of his tooth when lamping.\nPocket all you can now.\nBlock will lead the lambs down to the cold cutlery outfit.\nSlaughter beef and cow tip. Pour the chief some fountain soda,\nMotor prone to pen the holy opus and pry this monkey off the scoliosis.\n\nWho's that walking with a hole in his head?\nBazooka Tooth, Gemini, I came to break bread.\nWhat's a troop's recipe for treacherous times?\nI tell 'em fast cars, danger, fire and knives, lets go\nFast cars, danger, fire and knives...\nI got her majesty Athena riding shotty wide-eyed\n\nIt's like never mind the bullocks.\nLike every other week these hipster tabloids jumping on and off my sex pistol's bullets.\nLike every other week he spins the bottle.\nLike every other week these fucking fanzines forget if they spit or swallow.\nToo bad your inner sheep never forgets to follow,\n'Cause my inner greed to feed your hate for loving us is hostile.\nFortunate for me it coincides with what comes natural, so the mongrels that I run with turn the 'fuck you's into fast food.\nLike a little freak sick of the 3 o'clock bully knuckle dust, nursing his last shiner, finds the shoebox in his mother's truck.\nTomorrow's extra curricular punching bag will finger daddy's widow maker out a brown lunch bag (bang!).\nThis is where the hunch back snake oil peddlers stuck under the burgundy sky of spaghetti westerns tend to bubble up.\nWeathermen huddle up.\nToday the son of one too many 'yes sir's kings his checkers, watch the double jump.\nBack with a platter of hot leeches that'll drink up-every bloody drop down to the last diseases, it's A-E-S-O-P-R-O-C-K, the peak twister.\nDefender of the son of Vaughn Bode's Cheech Wizard.\nI used to pray the treatments got easier with my aging like serotonin weekends was merely comedic hazing.\nWrong, but along his travels located the key to world peace: kill every motherfucker but me.\nYou cool with that? Cool. Bang. You? Cool. Hang. You? No? Uh... bang? Cool.\nSorry, dog, rules are rules.\nAnd too long have I followed yours.\nI'm trying to get them years back, and walk through every cipher with dynamite in a beer hat.\n\nWho's that walking with a hole in his head?\nBazooka Tooth Krueger, I came to break bread.\nWhat's a troop's recipe for treacherous times?\nI tell 'em fast cars, danger, fire and knives.\nFast cars, danger, fire and knives...\nI got her majesty Athena riding shotty wide-eyed\n\n", "album": {"title": "Fast_Cars,_Danger,_Fire_And_Knives_(2005)&&7560", "genre": "Underground Hip Hop", "year": 2005}}, {"title": "Nickel Plated Pockets", "href": "Nickel_Plated_Pockets&&1085", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "(INTRO: Vast Aire and Aesop conversing)\nYo, (All right Ok)\nCan I get a quarter or something?\nLittle hungry, you know what I'm saying? (All right Ok)\nHomeless...\nI need a Lucy yo...\n(Yo...)\n\n(Verse one)\nWalk into the store with a pocket full of nickels\nAnd a city full of horns, jackhammers, and rape whistles\nThe alley cats manipulate the blocks with gutter magic\nToday my heart beats only out of habit\nCheck it, it's like...\nMy man Jus used to keep an ox between his teeth\nSaid he could spit it with pinpoint accuracy if there was beef\nWe chuckled out loud\nStill the thought of it intrigued me, (right)\nSo now I keep a jackal under my tongue to spit with related reasoning\nThe earthworm turbulent murder burnout Gerber baby no brain or memoir stardom\nAlarmed, pardon the old buzz deader\nRobert Crumb ugly dumb image\nBarely sprung barely no grimace\nNearly cut cherry blood's picket wrist back in high school (now it's like)\nSpy with a millipede pentagon pirate\nNavigates cities' sump systemsUrbanite turbines\nTwisted Pistons\nTermites that infect sturdy grillage\nThere's roaches in the pillars (Spillover)\nAnd crawl across commuter-clean wingtips and loafers\nIt's the theme park I built\nPocket full of nickels for cigarettes, gum\nAnd milk, bitterness, love, and violence\nI'm writing a petition to have smoking as a sport\nIn the 2002 Summer Olympic Games (wanna sign it?)\nNow look, I jux germs draggin a gavel knee deep in a maggot hatchery\nOperation capture flag by any means\nIf this means anything at all, anyway it's a riddle\nWalk into the store with a pocket full of nickels\n\n(SEGUE 1: Vast Aire and Aesop Conversing)\nAy uh, yo excuse me (Ay Yo) yo\nCan I borrow a dollar or something? (Ah sorry man) nickel?\n(Sorry man, I can't help you out dog) Quarter?\nSomething man? (Yeah I only got enough for like cigarettes and shit man)\nAll right man, I see how it is (I'm straight)\n\n(Verse two)\nWalk into the store with a pocket full of nickels\nAnd a city full of World Trade Center victim candle vigils\nThere's anthrax in our mailboxes and (X) anax in my tummy\nThere's a single Spanish female out west traveling the country\nFreak of ?? league lazer major running bases\nNeighborhood watch weasels pacing ugly acres more than often\nIf I ever make it big, I'm gonna build a skyscraper tall enough to piss on\nCloud 9 egos from my corner office\nYou can't pull the plug on a catapult (nope)\nI toss a nickel to a bum's cup from twenty paces thumbs up\nGot twenty ways to tell you shut the fuck up\nNineteen of 'em are 24 bars long, the other one goes (SHUT THE FUCK UP!)\nAnd an electronic daddy long legs stay grimy up in your zoning wall\nGroveling villagers, trying to hide behind the windmill\nI just got in pig-back through subway tunnels with a third rail nearest\nWhile most still try to penetrate the alligator plants (It goes)\nBack in the class, throwing pencils at professors\nAnd making barbarellas giggle\nThat's when life's pleasures were simple\nNow it takes a dancing bear jumping through flaming hoops\nTo even make 'em buy the god-forsaken single!\nThough shall not desecrate the soothing spiral\nAltered by a classic cut to vinyl\nFind that in the Bible!\nMy insult Militia'll fix you up\nI'll light the pyramid shaped torso\nWith your hollow numbskull balancing on top\nNow if you got a lock and gas mask outside of your own apartment\nYou could pretty safely quote Shamar\nLife's Ill, sometimes Life might kill, sometimes prayers dwindle\nWalk into the store with a pocket full of nickels\n\n(SEGUE 2: Vast Aire and Aesop Conversing)\nYo (ay what's up man?) Yo can I oh...\nNo... Never mind man (I can't help you out man)\nAsshole! (Yo man, I'm trying to help myself out right now)\nFucking asked you for a Lucy and you turned me down (Dog, I'm sorry dog!)\n\n(Verse three)\nWalk into the store, same pocket, same nickels\nIn a city where every crack in the sidewalk's a symbol\nWhere there's crack in the basement, where there's crack in the slave ships\nWhere there's crack whores and corrupt pigs killing cats trying to crack cases\nMy boombox runs on a baboon heart transplant (This is hell!)\nI got a poltergeist on a leash trained by Caroline herself\nTwo Thousand something...\nTechnology aid itself glutton\nEvery move I make's from a robot gepetto pressing a red button\nIt's Vietnam in the fumes\nYes I run with cannibals that bite the hand\nThat feeds 'cause it tastes better than the food\nThe prickly outer shell's genetic, it helps defense mode\nBut it also helps to fuck up a couple of sacred friendships\nWatch a six legged insect crawl out of the billy goat beard\nWatch a sick makeshift bitch threat fall out when the filthy smoke clears\nWatch the insect's stinger sting threat till it has sweat a bullet\nSweat a full clip, sweat a river, dead the bullshit, sail away and wither\nYou're the kind of cat that rolls a pimped out Caddy\nDropped with rims and limousine tints bucking Enya\nInsert laughter here\nI wanna rap a lot and stack cheddar by the fistful\nBut for now, I walk into the store with a pocket full of huh...\n\n(OUTRO: Vast Aire and Aesop conversing)\nExcuse me man (all right ok)\nCan I... Can I borrow a dollar or something to eat?...\n(All right ok) I'm... I'm hungry\nI'm saying yo...(all right ok) (Look at that..)\nI'm homeless man (Look at that bum) (all right ok)\nI fought for this country man (yeah)\nSleep on park benches... starvin'\nAll I need is like a lucy and like a sandwich or somethin' man...\nWiping my ass with the Daily News man... c'mon man...\nSleepin' with squirrels (Oh my god, What are you doing with that squirrel?)\n\n", "album": {"title": "Daylight_(2002)&&4690", "genre": "Underground Hip Hop", "year": 2002}}, {"title": "I'll Be OK", "href": "I%27ll_Be_OK&&4504", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Burn it down\n\nPad the circles 'round your life\nTo capture all the sides you sight\nMagic tricks where skeptics sink\nThe ice is thin, stay off the lake\n\nWaiting for a clock to punch\nWish I could breathe and stop for lunch\nIf I stop to count the leaves\nOn only one of these here trees\n\nNot sure that I know what's pure\nBorn to kill the insecure\nSome respect, some resent\nSome remain from start to end\n\nWear my heart on my short sleeves\nI'm stuck out here, I lost my keys\nFrom the roof I watch the street\nAnd pray for those that's caught beneath\n\nAs long as I know right from wrong\nI'll be ok, I'll sing my songs\nAs long as I know right from wrong\nI'll be ok, I'll sing my songs\n\nI dunno what I have to left\nTo give other than truth and breath\nAngel when she shuts her eyes\nLike we will leave to my demise\n\nBetween my time is short\nAbout to start my last resort\nWake me up when it's time to make babies\nTalkin' planet earthquakes\n\nTied the laces, touch the ground\nLet emotions ruptured now\nAs long as I know right from wrong\nI'll be ok I'll sing my songs\n\nAs long as I know right from wrong\nI'll be ok, I'll sing my songs\nWell, as long as I know right from wrong\nI'll be ok, I'll sing my songs\n\nAs long as I know right from wrong\nI'll be ok, I'll sing my songs\nWell, as long as I know right from wrong\nI'll be ok, I'll sing my songs\n\nI wanna lift every yellowbrick\nI never felt pressure to have to justify my selfishness\nAt least not to your and yours\nMaybe just my friends and fellowships\nAs long as the mood is somehow linked to my enhanced development\nI swear they'll understand\n\nThere's a storm outside my tenement\nBeats upon my windows with Mother Nature's adrenaline\nI guess that's why my homey Blockhead stays glued to the television\nNow I look less intelligent\n'Cause I'm the one that tried to bear the elements and lost\n\nWell it's warm by the filament\nHuddled up close in the company of all my relatives\nStories lash like coffee and honest-to-God sentiment\nCocooned in the unified efforts to all get settled in\nAway from where the rain pours\n\nWell, count your delegates\nWeed out the bums who practice migration under the elegant\nOf course I realize the filtering procedure's delicate\nBut let devils inside to collide with your overzealousness\nAnd fall to rock bottom\n\nSpot 'em with their carelessness\nThe urge could burst to turn even those hazardous to militant\nYou can't even have half of free second\nThe beat comes gelatin\n\nYou gotta aim, fire and aspire to be model veteran\nBuried in merit badges\nI'm stuck in the center and could care less\nAbout the eye of the storm and its monstrous measurements\n\nI got a defense that I call coolin' with my brethren\nSometimes I get wet\nBut it's better than risking life and limb to me\nDon't you agree?\n\nAs long as I know right from wrong\nI'll be ok, I'll sing my songs\nAs long as I know right from wrong\nI'll be ok, I'll sing my songs\n\nAs long as I know right from wrong\nI'll be ok, I'll sing my songs\nAs long as I know right from wrong\nI'll be ok, I'll sing\n\nIf you wanna push, than I'm ready to push\nBut if you pulling while I'm pushing\nThen why did you ask me to push?\n\nIf you wanna push, than I'm ready to push\nBut if you pulling while I'm pushing\nThen why did you ask me to push?\n\nIf you wanna push, than I'm ready to push\nBut if you pulling while I'm pushing\nThen why did you ask me to push?\n\nIf you wanna push, than I'm ready to push\nBut if you pulling while I'm pushing\nThen why did you ask me to push?\n\nIf you wanna push, than I'm ready to push\nBut if you pulling while I'm pushing\nThen why did you ask me to push?\n\n", "album": {"title": "Float_(2000)&&9651", "genre": "Underground Hip Hop", "year": 2000}}, {"title": "Mars Attacks", "href": "Mars_Attacks&&44", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "These lil', lil' fuckin' Martians\nYou gotta love em' though\n\nMars attacks wit' electric gats\nNot for sapien abduction (what's up then?!)\nBilly took a laser to the mug piece; hollowed out the mandible\nChannel headquarters order the cannonballs (Mars attacksssss)\nWe have high demands column to this pigeon ankle\nAnd boomeranging' our harvest; 51st area sickness\nNot a threat, an area witness won't injure the promise\nMonster lead- carry your ligament fanged in the mosh pit\nDodge vapor, labor days are major A sir\nCater the alien decomposer soldier platter like cabbage check eight\nI told her \"go for C4 magic's\"\nSmolder as the Bazooka Tooth holster fabric\n(This fucker's rabid and still breathing!) (Hiding cabbage!)\nOh, the heater claps to leave me\nI'ma ninja this shit wit' sugar in the fuel tank of the saucer\nBuddy up and head down to the metal corporate tunnels\nIce pick the soldered ship wiring; pissed of the mother and um,\nI'd be lying if I said I knew your intentions\nSee my sexy sabotage seeks defensive action to save the race\nYou land in hand on board to mention magma (Blaze the place!)\nRed five revival there's wires in the bible\nObviously, ultra take advance when I point counterpoint\nComparison of ET verse little old freak me (She be on somethin')\nHey riddle sweet peas wit' your nickel PCs; fickle CDs, miserable TV sitcom (typical!)\nPathetic. Ritual. Collective slackership\nBeautiful establishment; you ain't established shit! I consider you foul\nProwl back to the numbers under burnt pride in the dark (sup y'all!)\nThey want us dead or alive without the 'aliiivee' Part\nThe sun rose over a body bag shortage\nLast week I was like 'god bless the saint that invented the cordless'\nThis week I saw the re-wrap of the bull's-eye of my worship\nTemple body slash bull-cabinet Mastermind diversions (Fuck y'all!)\nLet's do this shit, my movement soothes any space invader practice\nStomped under enemy like \"Hey what now, bitch!?\"\nHiding human hear me rise above material and cardinal sin\nThey shot me in the face\n\nMars wins (X5)\n\n(Puffin' smoke) Run around with your face on fire\n(Jet-black smoke on the horizon) Black smoke in the air.\nMaaaaaaaaaaarrrrrrrrrrrrrrsssss wins! (I thought you would like it)\n(We gon' make it) Who you screaming at dog?\nI got this! (Lets go)\n\nZig zag zookah, pinnacle stitch\nUnleash the unlimited edish primitive piss\nI'm singin' cynical maybe the most military ops\nMonkey! Here's elephant, and it drops\nWe on a three-ringed prong ancient elephant tusk\nBitter, at fully (break bread!) you shruggin' it off\nKeep it electric, sure, But NY Electra's not about electric wars\nNever seen a poor man's glimpse set fake (Last page!)\nThree, two, one, domesticate!\nIn the corner of the cave reinventing the wheel and roll out funny\nSittin' on them Barney Rubble twenties, subtle\nSippin' Saber tooth blood puddle-\nI could roll with the lackey's, that's if we hustle\nKnuckle in the mud, hell's bells in the chuckle...\nRed-berried face means smugger round the muzzle\nI'm allergic to the now-born solo panel cutters stole quo to the core (dirt mess!)\nStone cold's hands out core cryogenics, stubborn\nCan't talk shit wit' a tongue full a' rug burn!\nBad cholesterol through blood sugar\nFour-piece heartbeats wit' a subwoofer!\nI'm not asking you to act like you notice (Oh Aesop's SO Mesozoic.)\nNow what if in the cabin built the old pulping?\nOpened the mirror, stole a pulse with the voltage\nKeeping me alive is the vibe with the Vulcan's (hope!)\nI'm the divine catapult (Catapult!)\nI break it down to the bunk for the crooks wit' the goals of a angel\nEat. Sleep. Fuck.\nStructural droids; more bangs for the buck\nBut they want a last stegosaurs - thorns in the glove (buck wit' it!)\nPrehistoric land shark business, cradling the arms of the car man's kidney\nSwarm to the sickly thawed out the glacier\nBeggin' for the freezer burn; back every day sir!\nSir, your science loves to fuck nature\nSir, your right to the dawn of my day sir\nSir, your violent laugh homing beacon's never set;\nWho chase till we all catch vapors\nDon't call it a sound-off, \"Mars Attacks\" be the malarkey downfall\nIt's not a game no more, run from the flash, leave your penny at the door\nA lot of magic gadgets; give em' all back just to nullify the savage\nMic's crumble we be rockin' right; in the year of the Troglodyte\nSaw a grey mouse rabid poured on a board to the dull morose world like a lull in a storm\nAnd I know you was hopin' that the piece for the ox was a dull sword, ah\n(Guess what, it's not!) Guess what else, I transmit from the block!\nT-Rex - X-Ray with triple X Hex (give it up!)\nFor the yesterdays, or the next I can assure you if the RZA got the sword, (dead flesh!)\n\nAin't no time left. (Keep ya head up now)\nMaaaaarrrrrrrrssss wins! (I thought you would like it)\nYour head will be down in the dirt\nWe'll end it real quick\nMaaaaarrrrrrrrssss wins! (See how strong you are then..)\nYour head down with a mouth full of pebbles\nThat's it man, no time left.\nY'all keep talkin'. It'll get you nowhere...\n\n", "album": {"title": "Bazooka_Tooth_(2003)&&7433", "genre": "Underground Hip Hop", "year": 2003}}, {"title": "No Jumper Cables", "href": "No_Jumper_Cables&&397", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Burn train buffers\nMy fancy\nUp jumps the boogie delivering eye jammies\nWalk through the muck with a clutch on a trident\nNever give a fuck how far Pi went\nYou are dealing with a reborn icicle age poltergeist\n\nUprock, sidewalk cycles stuck at the bus stop\nWookie foot must not sleep\nUnder the invaders\nNo batteries\nNo jumper cables\n\nWired underagers play box cutter facelift\nRock utter makeshift spirit\nTo y'all I'm just a funny moniker with a couple of fresh records\nAnd a bangin' hand style to put the jukies On the guest list\n\nWalk for that\nMetal train graf brainiac\nWalk for them\nNot a limelight\nMore to blush alizarin crimson\nWhen the multi million\nTin men suck traditional rituals\nOut the homes of starving children\nAnd I bet they can see the city bleeding from the satellites\nFormed by the corporate war drums recorded poorly\nDirty dub vamp.\nBruised by the hues of wicked pallets\nChewed by the tooth of livid maggots\nDino DNA and cola, straight no chaser\nMars attacks colorfulness\nI piss raptors on motherships\n\nHazy days will stay purple\nCause Cips with a Z bargain\nLike Crazy Eddie commercials\n\nGo Ah Ah Ah Ah\nNetwork with a dirt devil\nBurn train buffers.\nHi!\nCute the way your little parasol spins.\nBye!\nSuck my Neanderthal dick.\nCatapults spit.\nLosing the screws and bolts\nAnd all they heard's crews gulp in bulk and sulk in volts\nZap!\nRadio m-m-m-m-mayhem, fine.\nSuicidal eye full of plastic nine.\nBang!\n\n\nNo batteries etc\n\nCome on\n\nCatapult\nJump motherfuckers\nNo batteries\nCatapult\nJump motherfuckers\nNo cables\n\nThey only came to buff the name stuck the train\nThat's a textbook page\nFor my seed up in flames\n\nCatapult\nJump motherfuckers\nNo batteries\nCatapult\nJump motherfuckers\nNo cables\n\nCurators cater to killers of innovators\nI'm a staple\nNo batteries no jumper cables\n\n\nChoke train buffers like a headlocked Ed Koch\nNurture the craft of concrete visionaries\nCave painters screaming \"Loosen the cuffs!\"\nCave paintings get the natural history feather dust\nPick a lust.\n\nLimo tint stretch delorian chrome sittin' on twenties\nThen I walk to the stouge, burning my laundry\nLo Pro,\nFucked up jeans back at the party spinning Kane meets Flight of the Valkryies in a heartbeat.\nSaber tooth, catalog, city art, liturgy\nRanger Ricks endanger the clique maximum efficiency\nAnd isn't that dope?\nThe line of blind winged Pygars and how they wallow planks into the matmos.\nBinder bibles and a graphite prison violator\nWith Joshua for the war gamer systems.\n\nNow the architects are rioting 'cause we built something different\nI'm like how the fuck sure shot evolution not my business?\n\nMy elephant television was on.\nGrape soda, Grape ape, Great space coaster,\nDnD, GI Joe, Transformer, Herculiod, ThunderCat, Voltron, Speed Racer, Space Ghoster.\nKiss the flickering images with Carroll Ann fingertips,\nC-4 to four chamber skips,\nOh shit...\n\nThey say his eyes were spiraling back when he hit the mat\nWoke first words: \"Oh it's like that?\"\nStarted bendin spoons and rippin arrows outa lady hawks\nWith a C3P unit tryin' to interpret the baby talk\n\nBurn train buffers\nRight turn woulda missed the iceberg, fine.\nBut you don't like our kind. Do you?\nJunkyard Dog. Hot tin roofs cradle kittens with them sub par flaws.\nRappin' is my radio, graffiti is my TV\nB-boys keep them windmills breezy.\n\nCatapult\nJump motherfuckers\nNo batteries\nCatapult\nJump motherfuckers\nNo cables\n\nThey only came to buff the name stuck the train\nThat's a textbook page\nFor my seed up in flames\n\nCatapult\nJump motherfuckers\nNo batteries\nCatapult\nJump motherfuckers\nNo cables\nCurators cater to killers of innovators\nI'm a staple.\n\nNo batteries no jumper cables\n\nCatapult\nJump motherfuckers\nNo batteries\nCatapult\nJump motherfuckers\nNo cables\n\nThey only came to buff the name stuck the train\nThat's a textbook page\nFor my seed up in flames\n\nCatapult\nJump motherfuckers\nNo batteries\nCatapult\nJump motherfuckers\nNo cables\nCurators cater to killers of innovators\nI'm a staple.\n\nNo batteries no jumper cables\n\nDon't get cooked by the pilot light\nI can smell metal in the air tonight\nI can smell metal in the air tonight\nI can smell metal in the air tonight\nDon't get cooked by the pilot light\nI can smell metal in the air tonight\nI can smell metal in the air tonight\nI can smell metal in the air tonight\n\n", "album": {"title": "Bazooka_Tooth_(2003)&&7433", "genre": "Underground Hip Hop", "year": 2003}}, {"title": "Bracket Basher", "href": "Bracket_Basher&&433", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Hey yo must not sleep\nI bash the bracket open and breach\nThe priority's bleached since that '76 umbilical severed\nMajority's cordially aboard the pinnacle benders\nI got west nile virus on my TV in the Bronx\nI got two hollow pockets and a sleepy hollow mosh pit\nTryin' to blow the spot with wet matches and bottle rockets\nWhile cop walkie talkies walk outside my apartment obnoxious\nTonight's special consists of stale fiber from shitty diners\nLook mom! I learned to tie my shoes! Hey can I borrow twenty bucks?\nPeel back the prickly cocoon a Poloroid turbulent land unit birth\nStudent first pedagogue only from brazen action\nWind blown mariner east river shark carry lunge carry funk ends on caliber\nWatch war face painted junkies dance blissfully around a bonfire and\nSacrifice life's sanity Pay a nickel for nose-bleed seats in a peanut gallery\nGallop with a Pegasus, malice with no benefits, balance with some sense of bliss in the foulest degenerates, my New Year's revolution's gon' be to stop burning bridges\nI'm just 'gon bend 'em toward the couple cats that's worth the visits\nUm, it's like that, and that's the way Aes stinks, and um\nPlans are like clipper ships, if they got holes they sink\nAnd if the skipper slips the crew shits bricks, wither, and hits the brink\nThat's why I take the poison spitter sips and smile big when I drink\nYou never knew mayhem walked with Nikes talked like a trucker hawk the filibuster Gerber baby lucid Colonel Mustards\nNo time to hold my breath, I'm only here to rap, eat, sleep, grow old, and smoke stoges through the hole in my neck.\nNew millennium, mad cows and Pentium, process the hostage, lock him in the petting bin\nShowing pictures of his wife and kids, then wash the brain\nProbably the same motherfuckers that buffed the train\n\n(x2)\nOk ok ok ok ok ok\nMust not sleep\nMust bash the bracket\nPay The Rent, Pay The Debt\nMust slash the fabric\nCatch the jackrabbit\nPay The Rent, Pay The Debt\nSleep\n\nRoll into the city with one half of the cannibals.\nNew joint bumpin out the whip speakers\nMade the escape for a night of makin' tapes now it's back to the cockroaches and preachers\nSomewhere a prom queen's givin' birth in a bathroom stall\nHolding a prime directive not to get blood on her mother's ballgown\nI'm son of a stubborn old one track jackal prince\nTrucking with prime directive just to get the goods and never fall down [Raw bomber]\nAte the city spit the bricks ate the boxcar spit the burners\nAte the planet spit the murder\nFunny farm rampage from writing rap for milk money built ugly\nBut a couple side effects to make'em love me\nMy cipher demeanor left Jesus rubbin genie bottles\nTill the following morning Colombo found a crown of thorns in urine puddles\nYou're in trouble\nI'm not trying to save the world I'd rather watch it die slow\nSo I could spit my grand I-told-you-so\nAre we having fun yet?\nYup. Step to the carnies\nTry to win a teddy bear to impress your favorite Barbie\nShe almost sucked you off at the company Christmas party\nBut she won't accept the bear till Aesop signs it with a sharpie\nMy ex-girl bounced without payin' the cable bill\nI check myself in television rehab\nWithdrawal symptoms may include shivering, fevers, drooling and chronic masturbation\nNow I pray to the gods of pornography and Playstation\n\nNow I lay me down to sleep\nI pray the lord my soul to keep\nAnd if I should die before I wake\nGive my ASR to El and bury me with my mistakes\n\n(x2)\nOk ok ok ok ok ok\nMust not sleep\nMust bash the bracket\nPay The Rent, Pay The Debt\nMust slash the fabric\nCatch the jackrabbit\nPay The Rent, Pay The Debt\nSleep\n\n\nBonus Round\nThis is the hot tin roof stepper\nHold it down with centipede foundation\nMr. Greed who burns rugged obstruction in bunches\nLike little Jackie paper puffs the magic dragon and dutches\nWe don't need another hero hommie gallop off on you're my little one trick pony\nHolly Hobbie Polly Pocket pretty future destiny\nIf the slipper fits fire up Cinderella propeller and curtsie for the munchkins right before\nAesop Rock smashed the pumpkin\nIron on gusto rustolium bloodstream what's better?\nWhen the wrist slit it leaks out only the bloodiest bubble letters\nComplete with outlines, fill-ins, dates, shading and shout out columns\nFor vagrant colonies to follow in redeeming bottles\nYou're a little tea pot tryin' to eavesdrop on the mammoth route\nPeekin' out from around the rose bush like... here is my handle... here is my spout\nGodzilla junkie used to be in love, now out for gigapussy\nSorry to offend but sometimes life bends in the middle\nSo now you have a fulcrum where there used to be a pillar\nAnd now I got a pulse that bumps less than a cocaine binger\nAnd now I got no 9 to 5 and still labor days flicker\nAnd now I got a 9mm Q-tip with an itchy trigger finger\nSee, I really don't feel your persona distortion ordered by martyrs who martyr self for martyr's sake\nWow fame... If notoriety grew adjacent a jealous dick-riding sentiments I'd give you a pound like \"Greetings Mr. President.\"\nNow go do your homework\nOrder the sequence\n\n", "album": {"title": "Daylight_(2002)&&4690", "genre": "Underground Hip Hop", "year": 2002}}, {"title": "Save Yourself", "href": "Save_Yourself&&5596", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Pull the pin out, sheep creep in wolf garb\nFronted by the Hail Mary parry lunge mixer\nKill the populace for civility, jeopardy's a stickler\nIts bob and weave amalgam played the falcon to your fixture\nI branch out, arms flailing backwards\nWailin upon a tidy sound circuit\nSlightly foul Gershwin\nWith a bed of nails and drumlust plus disgusted service\nWorkin in shifts opposite the asbestos brain furnace\nI be the now observatory eye ear antenna feeler\nSpittin' like a dragon with a similar demeanor\nStood innocent bystand witness the diehard fans turn Rip Van\nIn the poppy fields of N.Y.'s orchestrated brick gauntlet\nNow I'm thinkin' who am I Jabberwocky Superfly bent left\nPushin war without the ten step cushion and what (what)\nI plan to hold this B-positive sacred in these golden veins\nUntil the day I die from grimace overload\nIt's shock (it's shock)\nTreatment offered by the weekend\nThis still be a getaway, let's display the sequence it goes:\nOne for the heartless thievery turning my guardian angel harpless\nAnd the rest to sweep the mess under the carpet (under the carpet)\nI drag a yellow taxi meter behind every measure\nAnd charge cats for labeling me shepherd\n\"That'll be Six Fifty plus tip darlin',\nI take cash, credit, check, money-order, gold and cigarette cartons\"\nHuh, got caught up in the universe tryin' to zoom in on stardom\nForgot the passion plus the hatred, both were based in Carbon\nNext time you wanna be a hero try saving somethin' other than hip-hop\nAnd maybe hip-hop'll save you from the pit-stop\nKill 'em all, yeah\n(Naw man It wasn't me it was Holden Caulfield brother\nI just read and pulled the trigger)\nOh God, well leave me to tiptoe past the pearly gates\nCapture the halo, jet back to base, step past the chase\nThe bad taste of jet-lag and weight slackers\nThere ain't nothin' broken, where you at?\nThe pistons pump perfect, where you at?\nThe bass tone is Merlin, where you at?\nThis service is a urgent workin surgeons\nPurging formulas lookin' for an improper cause is whack\n\nWhat are you saving, honestly? (honestly, honestly)\nWhat are you saving, honestly? (honestly, no honestly)\nWhat are you saving, honestly? (damn)\nPromise me you gon shut the fuck up and recognize\nWhat you holdin' ain't really broken?\n\nI don't flick needles like my sick friend (friend)\nI don't march like Beetle Bailey through a quick trend (trend)\nI don't frequent church's steeples on my weekend (end)\nAnd I don't comment if you formulate a weak Zen.\nAll I ever really wanted was a getaway\nI'ma take a chance by letting a brook slide for what I got in my hands\nI can not agree to follow a leader while on the borderline\nA war without a reason for the Brady hates gore\nBring out your dead we can put 'em in a pile\nAnd burn 'em with the novels for the kids then to admire\nKill the ones that speak from a different life\nBrewin other killer noise makin' the sentiment...\nOkay, welcome to the Kamikaze bottle rocket cockpit\nLive by the icy cold hand of bad intention youth blender\nOh yeah I'll let God warm the bench for now but\nI'll ascend to spin y'all dizzy\n(And for the record I'm bringin' my TV with me)\nYo, let the commoners speak publicly\nThen disperse eye jammies for cats that swear by third pupil\nBut can't see past the loophole\nMotherfucker, my word is born like Siamese triplets\nWith doctor, lawyer, rocket scientist promise\n(Let 'em grow leisurely)\nHey Mom, I'ma fix whatev I broke along this path\nOnce my spiel's perfected I'ma save you a seat in the front row\nOf Aesop Rock's twelve steps to shut the fuck up seminar\nAnd when all these bickering crowds turn solid you gon be proud\nI tack hacks to the (backboard)\nHonesty's a (latchcord)\nFury's far from (obsolete)\nSerenity's a crack whore\nRaw caricature of mayhem standard branded by the labor\nWith a thousand reasons to end this for every one of you saviors\nSaw the brightest burst ironically wide from the vacant stage\nGave it a pound for burning where bunk ratio's engaged\nKeep me posted as to when you grasp something mature to\nSit and sulk about mister, and I'll consider pickin' up your record\n\n\n\nThe Authors, they ain't got nothin' to save\nThe Overground, man they ain't got nothin' to save\nDef Jux, they ain't got nothin' to save\nThe Addams Family, they ain't got nothin' to save\nWeightless, they ain't got nothin' to save\nStronghold man, they ain't got nothin' to save\nRhymesayers baby, they ain't got nothin' to save\nAesop Rock, I ain't got nothin' to save\n\nIt's like that\n\n", "album": {"title": "Labor_Days_(2001)&&8422", "genre": "Underground Hip Hop", "year": 2001}}, {"title": "Hold the Cup", "href": "Hold_The_Cup&&6106", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Verse One:\n\nAnd the saints go marching in\nSerpentine regime ordered by response sort of fell this population\nCaboose humming no fence me in a van with common patrons\nThe parody plastered every red brick in site\nWhere had to keep his plights from ticking\nI'm slipping my key and whim dim by dirty tap water and that\nRoach on my ceiling circular fins round a bed of pushpins\nLet's connect the thrill of volume to a flat earth\nJay-walkin' a hook the past just passed the mere dragon bandwagon passages\nI'm sorry, we've never met, my name is driftwood\nThanks friend, good looking, I'll never see you again\nFeeding frenzy, catfish stomach, empty oceans\nSpangled in hooks dangled by anglers off the plank of burning books\nAnd if you're, not gonna eat that\nKill joy inherited by spirits lacking harnesses\nMerchant, Goliath dipped in slipshod posture conceived evening\nSo I feed idea turn sun dial to bastards son adopt the reroute dreaming\nOh I'll ride the plain bow in flare gully yellow rain coat\nHeard a harp but sunny ways my lifeline searching for the same note\nOh please, I know butterfly wings ain't fit to auction\nDig my tossing sturdy walking head hung\nSkylark litigants strung out like cats straight up participants\nI am the triant diaries of a low life siphon through that vein\nAnti-diligence movement, here the hunger habitat\nWorking class trash raped where racist hit their high\nI spy a toddler on the corner with her bubbles and her dipstick\nI witness the fusion of her breath and her amusement\nAnd it killed me and it stabbed me and it cut me clear open\nThe notion that this child timid in her sins embraced pleasure\nWithin a token of a moment, retless arrested but not a twirp\nStrip the Bonabo Disclosure, so close yet so much closer\nI'll take the hint but still she's never known cold\nCall me in twenty when those bubbles explode it's like that\n\nVerse Two:\n\nBack to back to back to stacking a brick match\nWith the fact that I've sipped the dripping sap tap\nCasually out the limbs of captivated blends back\nTracking the patterns that trim friends to thinning savages\nTake one down, pass it round among us\nLick a tipper drink, drink, drunk, drunk, and drunkest\nBut you quest tore your floorboards and the carpet turned marbles\nNaw the carpet turned charcoals and made skeletons of warlords\nSnake charmer, hate farmer, divvy you the rations\nWith an eyedropper a poison passions hoist above the masses\nAnd interrupts homeostasis seeming flow scapes\nLike a symmetric snow flake visits and with her symmetry blizzards\nI'm sleepy, one wing more and I promise to pay homage\nTo those who stand truly deserving and the list ain't long\nSink or swim, gravel or ascension\nEven birds of our combines float if you let them\nThey'll be dodging more than cradles when the bough breaks\nNote the affiction slip clip to your little visions into cloud shapes\nOh my left hand is a brick layer my right hand is a plow face\nWe build and destroy in response to every sound the crowd makes\nSlingblades sprayed it with apathy magic balance\nOn the palette of the almighty for painting the first half of me\nHonor find it with monster mashing in text casually\nOn the palette of the almighty to paint the second fraction\nI'm collapsed under the relic rainbow with seven sepriet\nSucculent aqua marines hide the in by sweetest elixir\nStar heckler and leaders start gawking at yet another\nReal conceived green fetus beating parallel sterile fixture\nUrgent, the surge is like venom and over kill, kill, kill, kill\nThe over spilled theory's all faucet\nFor real, how many leaves your clover got? Mine's got eight\nThree for normalcy one for luck four more so you'll spot it from space\n\n", "album": {"title": "Appleseed_(1999)&&251", "genre": "Underground Hip Hop", "year": 1999}}, {"title": "Freeze", "href": "Freeze&&9580", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "It goes welcome the pop off, some pop soft. We bang b-bang b-bang bang out loud. Ready on the left with a face full of death. We slanged out fang mouth bang out now.\n\nThis is a never dug disco, Zoo York tycoon, memorandum bonanza banter clamp crunk out the fish bowl. Gorgeous how struggling gills wriggle out water, ain't it? Same scape as the walls crawling with paranoia's plaintiffs. The robo-komodo promo Zen patience a-alike to this jittery drooling mess. Bitterly unruly on mud hugger alert, he usher dirt to the kick circus. Deflected labor ethic questions peeled at the field workers. Is it raw? Please... does a priest need a ten-foot pole to baptize little Linus minus the lap ride and tease? Evolution is a leader depleter, seeker needy sheep idol feeder beware, once complete you might not want to be there. Dead straw to gold bar spin fiber. Lost and fond in a smitten kitten's incisors. They Aphrodite all over the burgle of a purple heart compartment. Marched a burgundy carpet alarmed and far to parched to bark it. Lil' Abner. A real firecracker. Grows to throw 'bows with vehicular hijackers. To eavesdrop plots cops hired a wire tapper. That's a whipper snapper trapped beneath my grip on the fire ladder. Took drums over to deril' to once over the line tones. Punch toothy ticks 'til they find homes like three ruby clicks. The roof is on fire where snoopy sits right now. You should have shot yourself in the foot when it was in your mouth.\n\nThieves in the strobe deep freeze your pose. For the disease that grows underneath your toes holds up a reason y'alls gold never seems to glow. Now we can all breath slow once the fiend's exposed. It goes heave ho. You never got the grit right. Bark fame but you never put the grit down. Hawk styles but you never got the grit right. Put the grit down. Grit right. Get down.\n\nThis is a never dug disco defamation of dog and pony grappled out chincey, chipping Leo Da Vinci phonies pushing kill of hill bloated. Nobody got you. While biggest brother's watching bigger brother watching big brother watch you. Nothing says circus fun quite like nuclear holocaust over breakfast on the terrace. Hash browns and peril. Old ironsides or good ship lolli-popper, Davy Jones still got a locker, ak, the opera's more than docs and soccer moms. Now before you kick your feet up, I married and divorced mother nature after sweet-talking that old hag out of a pre-nup. This information's neither braggadocio nor secret, just know as of now the world is technically not yours, peanut. It's a day in the life of the carnie dog-faced boy escapist. Living large, watching Springer, smoking beedies wrapped in bacon. At night his get busy disease leakage peaketh. Merk the he say/she say, BK Jesus turn peg legs to Adidas on the down stroke. And they like 'what's up with the name?' I tell'em y'all made Bazooka Tooth I's about to ask the same. But before you curfew the city and shut down every block, I'd like to say I still Aesop the fuck out of the Rock\n\n\nThis is a never dug disco. Spread feelers. Tonka zonk Gepetto bred beezers. Jeepers, gee wilikers, goshes galoshes, Christ, god almighty. They tore his limbs off kilter, still the hostage moshes slightly. Hung off the balcony by the skin off his doctor's psyche. He hopes it holds but knows the locusts kamikaze nightly. He woke, corroded buggy facial, insect chopper biting. He's only bones by the time the ungodly body's sighted. He saw the puddle, full color hideous monster Viking. He used to survey if the vermin dined on others like him. He found the fucks indigenous to him and awfully feisty. He grew old awkward grinch and settled into bonkers nicely. I alert vital spider works to cultivate grit, ship the bulk rate shit. Herbie the love bug drugs pulsate whips. Tie in spite for commoner idiocy and good old-fashioned biblical plague. We move units off your pagan escapade. And it's pits to the peg legged. Megas eclipse cripples so that pimp limp's wheel chair basketball when 15 minutes fizzles. Your flimsy frame marks hip-hop's second most tragic event and will 'til Jam Master Jay's resurrection and second death.\n\n", "album": {"title": "Bazooka_Tooth_(2003)&&7433", "genre": "Underground Hip Hop", "year": 2003}}, {"title": "The Greatest Pac-Man Victory In History", "href": "The_Greatest_Pac-Man_Victory_In_History&&171", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Get up to get down now\nGet up to get down now (like this)\nGet up to get down now (like this)\nGet up to get down now (all right)\nI don't wanna do it anymore\nCouldn't do it if I tried, wouldn't do it if I wanted it\n\nHey\nI don't wanna do it anymore\nCouldn't do it if I tried...\n\nOkay\nThe moments were subtle but unstolen and guess who owns them\nNo friendly, non-threatening corporate lacky mucks in the totem\nLucy was in the sky with diamonds\nFive dollars to hold them\nThe summer beneath these Pac-Man's with acid behind his molars\nLittle white tab hollering, little white flag waggling\nInorganic pat on back, trim the panic flat on backer\nBack to back like Mad Hatter magic\nRabid mastif collaborative\nSplatter bachelor fabric fatter with Cabbage Patch lit\n(Dark days)\nBanded Louie-Louie\n(Park blades)\nChemically bent-up but eager to crash for that one, two, three repeater\nGood morning Vietnam\nWhose couch is this, whose house is this, who are you down with bitch?\nI'm sorry, dog, I dreamt the foulest shit\nThere was this rabid foot talismen drowning out of my armspan\nWhat's fouler was the other farmhands growing gills and shark fangs\nWhat's fouler was my torso stripped to ribbons in the marshlands\nBut I'm up now\nLet's get this window pane and shut the fuck down\nDown by the river where the litter sits\nAnd lionheart critters smoke dope and act like illiterates\nI ran with a brat pack of loose bolts and high social maladjusties\nSacred, numb, and boundless went to same proto called cookie\nWell, I was dummy to some when my tongue was cradled and my skin looks crazy\nPocketbook mirror, courtesy Amy\nSpiders in the mattress, paisley sunglasses, dialing eyes green\nIce grill that could burn through your picture-in-picture widescreen\nPoison late late show starring Aes and his jigsaw face\nTwelve hour solid gold entertainment\nOther shit to sell from other ships that sell they DD paper\n(Space Invader)\nThis one's for the labor days worked for rent and rolling papers\nOnly the illest beats leak asbsurdly out the boombox\nThe daytripper anthem goes: \"Wake. Drop. Walk to Aquarium.\"\nWhistle while you work like a canary lung\nAll work and no play makes Jack a dull boy to carry drugs\nI sorta see it as my last flash summer\nSkateboards and sloppy psychedelics and big numbers\nGood times, good people\nAll airbrushed on a collapsible easel\nPeace man, easy\n\nAnd I knew the permanancy would drift\nAnd I knew the ph balance wasn't right\nAnd I knew the crash and burn, how to caress it\nL.S.D. flashed the message\nAnd I knew the gash wasn't gonna stop bleeding\nAnd I knew the ph balance wasn't right\nAnd I knew how September would then affect it\nL.S.D.\n\nLazy summer days\nLike some decrepit landshark dumbluck squad dog lurks sicker, deluded\nLast sturdy domino leans secluded\nDon't let stupid delusions lesson super-duty labor students\nDragnet lifer solutions\nDaddy loves sloppy dimensions like son-daughter links\nSuch determinated leopards, successfully disshelved\nLittle soldiers developed like serpents despite life sentence ducking\nLemmings\nSome don't like sobriety's dirty lenses\nSome do let sleeping dogs lie still\nDon't look so damn lackluster\nSuck defeat\nLove some damage, load sample delete\nLate Show, Dave Letterman, shitty diner lip-slide dutch\nLow self-discipline leader seek that lung self-destruct\nLife sucks dickhead\nLost summer's display laminate showcasing divinity\nLive system definitive\nLiturgy soaked the pig lowly, spectactular delight\nWhy, what kind of L.S.D. you like?\nYour lizard king has spoken (all hail)\nYou in the back, get them up, those trails are necessarily bumped\n(Summertime)\nSome'll try and recapture the same flag\nBut I played it smart and recognized the summertime passed\n\n", "album": {"title": "Bazooka_Tooth_(2003)&&7433", "genre": "Underground Hip Hop", "year": 2003}}]