[{"title": "Garbage", "href": "Garbage&&6879", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "The ritual goes, same window different visual.\n\nWing of wax, or wing of gold leaf\nChoose one.\nFloat or plummet 20 thousand cold leagues\nMy nourishment's provided in the summer\nSo that I wonder\nHow y'all chasin' dreams when most tangibles still outruns ya\nHail dirty doll immaculate performance\nWarm as the march of a billion torches forward to burn what I born at\nCut and paste alertness to current set is provided quick\nShimmy the pirate ship mast, spot the islands on the sovereign in her bow\nFacing, let's salute the embrace pertinent generals who turned innocent hermits to burning spectacles.\nFlirtin' with a serpent workin' overtime\nDrain the battery, siphon the poison and flood his majesty's hatchery.\nI was riding on the yellow bus to where the brush thickens.\nYeah, an it ain't exactly plush pickin's\nI'd rather take the time to burn every last bridge I've ever crossed beneath the sun\nThan live my life knowin' you may one day follow me over one.\nSnake bite\nBreath too heavy to hold.\nCaught up in the wake of the red witch tryin' to swim it.\nRan for the sake of dead click stripped of idyllic image\nSteal a sloppy earth meal feed my pottery wheel to model colossal vision\nThrill, shrunken with a bucket of pennies\nI'ma drag my sneakers through the dirt like alligator bellies\n'Til the cloud burst\nHonor and a loud thirst submersed in a trap\nLittle drummer boy vs. thunderclap\n\nIn a city of garbage, tryin' to reap the harvest\nAdaption is the trap in which the artist meets the forest\nSwing your little axe or be an oak tree if you can\nEither way, adapt to circumstance or play you final hand.\n\nNo enigma, an attempt to bury the hatchet\nRendered me victim of deviltry plus wounded like stigmatics\nSomethin's somethin' hazardous\nI smell an inch of difference in this mornin's pollution pistons and how the loose ends drift in\nMy sour patch institutions slipped in amidst the invaders and,\nPardon my tone but,\nThis garden's grown fuckin' acres since my visit.\nItchin' to count the layers in the blizzard to that chapter where my family inserts the dagger and\nTwists it.\nIt's the carnival, have you any sweets for my weary kin\nIt's the carnival, have you any feed for my cheery grin\nIt's the carnival, welcome, play our games you'll never win\n'Cause it's that carnival where every freak show spectacle's your friend.\nAn' I'm a,\nGhostly galleon, tossed upon cloudy seas\nAntifreeze to glacier cookin' a look of fiery nature\nIt's the,\nCeilin' feelin' too heavy to bless the I-beams for a fraction more collapse (I left sorry) that to\nYour door.\nBitchin' my back to hell's kitchen, back\nBurnin' murder machinery, released regardless of the pardons\nHitchin my life to the leash of one minstrel\nSick of same window different visual\nSame agnostic hostage different ritual\nPlay, cooperative supercolony clash (I heard we have a dust collection - let me see it)\nOoh, I duel this underdog verse forced adaption to the marbles of the now\nSince then my knuckles haven't once dragged on the ground.\n\nIn a city of garbage, tryin' to reap the harvest\nAdaption is the trap in which the artist meets the forest\nSwing your little axe or be an oak tree if you can\nEither way, adapt to circumstance or play you final hand.\n\nThe ritual goes, same window different visual.\nThe ritual is same fuckin' window different visual.\n\n", "album": {"title": "Float_(2000)&&9651", "genre": "Underground Hip Hop", "year": 2000}}, {"title": "Labor", "href": "Labor&&9589", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "This is labor labor labor labor\n(Labor labor labor labor)\n\nWho put the monkey wrench in well oiled perfectionist emblem\nJust to watch these monitors spit white noise\nThrough your office space automate\nI infect knowledge gene pool dissented cloud clusters\nBrushing dust mites off your starborn all revolution sound jugglers\nDelinquent fan for brick habitat bob, weave, stick, move fence\nAnd pause somewhere in the middle for slick invention\nThis years brain crop spread spectacular\nI ain't mad at cha don't stay mad at the caliber\nI twist characters like twist characters\nTalley up the alley cat aggression\nIn this Doug E. Fresh infested mess up bassline lust\nAn automatic B-boy krylon can't combust circuits\nWorking these war picked ciphers\nWith head striker stability and kamikaze chivalry\nI alone noble in a worm food feud\nWalking dead generation ain't nobody asking for your patience\nThe grand opening holding me to face the fact\nThat I knew myself and didn't have to ask nobody else\n(Talk about labor) Fantastic planet urchin putting work in\nSearching for pertinent verse minus the murderous diversions\nApologies won't lore me to the communal sob story\nNor would I sacrifice lifestyle to benefit jury temperament\nThis whole Green Goblin webcutter butts up against\nCrayola daydream landscapes spittin' bedlam, Datum\nCharge the villagers nickles and nicotine\nTo watch them fed to one disgruntled crack at the high noon\n(We sell popcorn, beer and balloons!)\nI got an inkling this gon be the one that children bicker over\nAnd start warriors vs. baseball fury element\nTo glitches motor sensory development\nI am a star really! The big bang bastard's back\nWith a one way ticket to Beat Street\nThis soil is like relevant to human concept\nPlot the man ratios man learning, I work past the service\nI work on what I love, I work the service on my burdens\nAnd I work till this here little flat line closes the curtains\n\n", "album": {"title": "Labor_Days_(2001)&&8422", "genre": "Underground Hip Hop", "year": 2001}}, {"title": "Zodiaccupuncture", "href": "Zodiaccupuncture&&9782", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "March.\nThe more the merrier.\nGet a couple or more to carry you to the burial.\nF-R-E-S-H.\nFresh to death and keep it def to the left.\nWell it was Capricorn, Virgo, Aquarius, Cancer, Leo, Sagittarius, Pisces, Libra, Scorpio, Aries, Gemini, Taurus, Let 'em die for it.\n\nDelicate freak show alert the frame.\nBash all flags where the mag spin park.\nCorroded by the volts that jolt the cold vein.\nBoogie down kits to slip past the guard.\nDef with a mascot of radical mass.\nMegaphone fuzz and a woofer on fritz.\nWe are not trained to divert the crash.\nBut march face first with a prayer for the blitz.\nStand up for the cinema fire, simian ire,\nCold shimmy for the cinnamon sky;\nIntimate eyes loop all known alleys.\nScoop the bounty like daddy hires Bazooka to murder Ralphie.\nI curdle with burnt milk, pariah sigh, honor piranha money.\nCount it with the knuckle that hustle bread out a copper's tummy.\nOne of these rebels could level the marked city\nBut the N.Y. uber alles governor's picky.\nI'll be the jenky Jesus for the species you bleed with.\nUltra. Soldier poach the folklore.\nJump guns through the 9th gate.\nJump guns like a noon 6 burner lit up on the 9th pace.\nEven set among a portion conformed to the blind stage,\nNever lured by the formal watching imported wines age.\nWe bow to the gusto mustered by the mecha-bot.\nPlowed by the public, ushered out the letterbox.\nWowed by the subject punctured by the helicop.\nBoy meets vermin: the widescreen version.\nHeadaches, nausea, vomiting, facial paralysis.\nThese area a few of my favorite venomous side effects.\nMamba, Water Moc, Pit Viper, Diamond Back,\nAnaconda, Boomslang, Cobra, bite 'em back.\nSpinal tap crabs to the clapper.\nAesop Rock is the Cadillac of natural disaster.\nPush that button.\nEverybody gotta push something.\nThat's why the envelope is where it wasn't.\nI work with the builders, whittle my gorilla military\nAnd fizzle 'em through the vigilante filters.\nWho lamps left of the toggle?\nHow'd they fit that ninja in a bottle?\nA hundred million motherfuckers with they hands out\nVerse a walking zipper bomb trying to keep the man down.\n\nGet up.\nGet down.\nSit up.\nSit down.\nIt's either fancy footwork or get bit by the hounds.\nFace up.\nFace down.\nLaced up.\nLaced down.\nIt's either fist to the sky or get bit by the crowd.\nWell it was Capricorn, Virgo, Aquarius, Cancer, Leo, Sagittarius, Pisces, Libra, Scorpio, Aries, Gemini, Taurus,\nLet 'em die for it.\n\nI was chewing my tongue out of my mouth one day\nWhen the blood in my beard hit the dirt by the blazers.\nWould have said 'curb it' like any nervous habit\n'Til maverick told me the coyote pack could smell the wound for acres,\nAnd labor to cater fang to fisherman gut critters,\nOblivious to the glimmer of innocent duck feathers.\nFuck it. Want a carnivore war? Bet.\nI'll be at the Bronx Zoo with a lock pick kit.\nOn the eject for cockpit bench, helicop clip\nNazi cops on kamikaze belly flop shit.\nRoger. Hop-fence-kill-a-crop, monster.\nWe are the tired and poor, we come for your water.\nBoom. Bounce when the church corrupt.\nWhen the mayor knuckle dust city worker bugs.\nWhen the stars finger babies like I flirt with sluts.\nYou'll see the fire engine red fox ears perk up.\nMetal kettle unsettling treble howl, settler trembling,\nMeasuring mellow on the levitate off the mezzanine.\nNever seen a ton of bricks dressing clean/dapper\n'Til it's pin stripe and skull chunk 40 stories after.\nAnd U.S.A. on a Ketamine disaster.\nCane for stress. Crack if the former left you unimpressed.\nNow pardon me if part of me heart of an oddball,\nBut damn. Kumba-fucking-ya, dog.\nTerminally alienated and bent awkward by the bought,\nPrepped package of the slickest spin-doctors.\nRaised where the paranoid hide tools proper,\nLike suspicious cargo in a high school locker.\nAnd it looks like war, quacks like war,\nSo it's Occam's Razor and I'm swayze out the door.\nA hundred million motherfuckers hold me back.\nThe hand cannons won't ask 'bout your zodiac, boy.\n\nGet up.\nGet down.\nSit up.\nSit down.\nIt's either fancy footwork or get bit by the hounds.\nFace up.\nFace down.\nLaced up.\nLaced down.\nIt's either fist to the sky or get bit by the crowd.\nWell it was Capricorn, Virgo, Aquarius, Cancer, Leo, Sagittarius, Pisces, Libra, Scorpio, Aries, Gemini, Taurus,\nLet 'em die for it.\n\n", "album": {"title": "Fast_Cars,_Danger,_Fire_And_Knives_(2005)&&7560", "genre": "Underground Hip Hop", "year": 2005}}, {"title": "Rickety Rackety", "href": "Rickety_Rackety&&9128", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Smack dab in the middle of the cuddles and kills,\nGuerilla jimmy city limits with a bucket of pills\nHollring 'no I don't immediately ameliorate 'em.\nI meet 'em, greet 'em, read 'em, and rate 'em, see if I hate 'em.'\n\nEl-P\n\nHere come the hard rock bump through the speaker top.\nThe tweeter meter blew code def hones in.\nI pack a lunchbox, walk to the stoning,\nJump into the chemicals sold in my zoning.\nI'm irrational, paranoid, tragic.\nAnd the button on my chest says 'panic'.\nPunch it, hold up, don't touch me.\nI'm a savage from a rabid ass country.\n\nCamu Tao\n\nWho want to get it?\nYou all acquitted.\nYou need to quit it.\nGetting evicted, you little idiot, pitching tickets.\nIt's sorta tricky the way you wanna go get your digits.\nBody you up at the party, somebody get his mistress.\n\nAesop Rock\n\nYou take a pitch black lung and a purple heart,\nThen you kick back once the inertia start.\nAnd when the shipwreck sunk through the perfect dark,\nThe serpent's arch alerts every circled shark.\nSee, bloody salt water sounds the h'ors d'oeuvres alarm,\nAnd when the first arm's found we observe the art.\nLike a belly-acher won't kick face to the curb,\nRather kick when the face already raped by the worms.\n\nEl-P\n\nTasmanian pain coast, ridin'.\nVery little to say to these politician behind it but this:\nYou better loosen the noose or lose livin'.\nThese little kids walking the ave. quick to produce a biscuit.\n\nCamu Tao\n\nNow you should medicate any area that the pain hits.\nAnd when you in the streets you should peep the sets of strangers.\nThe actors that are in fact a cast of chaos.\nThey be looking for any situation they can play on.\nRespectively injecting these thoughts, detain us.\nNegative speaking, they be creeping, they entertainers.\nWhen you out of data they run through a route that'll save ya.\nIn retrospect, infect and pressing your papers.\n\nEl-P\n\nI design kill pain cave penmanship.\nFederal analog hog unedited.\nWith a CUNY degree in young numbness.\nAngels on the rooftop, gun in they trumpets.\n\nAesop Rock\n\nI was buried to the neck in them all-start bloopers.\nPeriscope down, hop Boss Hog cruiser.\nPorcelain or pewter authority wil be over ruled the second jukie uber alles news hit the sewers.\n\nRickety Rackety.\nThis city fit my style exactly.\nWith a backspin, and the fat laces, Gazelle glasses, chase rap daily.\nRickety Rackety, this city fit my style exactly.\nNear the train tracks, in the garbage bags, where the cement cracks, we a part of that.\n\nCamu Tao\n\nWhen you take 2 to the vein, introduce 2 to the brain.\nYou don't get used to the pain. A maniac bruising the cage.\nWhen cats rush you in the public you be like 'do it again'.\nHe's a motherfucking bloodsucker, he can do what he can.\n\nEl-P\n\nOn the side of the block, do the bus stop.\nYou paying a fare?\nThat's a trust fund.\nLittle ugly ass duck, life's a fun fuck.\nToo battered to rush, I walk punch drunk.\nAnd the whole world is yours now.\nBefore the steppers are goosed kick your door down.\nI'm in the getaway whip with Aes Rizzle.\nHe got the same shit stitched in his missles.\n\nAesop Rock\n\nO.k. lefty field... stealth.\nDressed to kill... self.\nMegawatt with a horizontal neck spin swim funny to vertical bobble head yes men.\n\nCamu Tao\n\nWhen the evil falls in it draws to the pours, it gnaws to the core.\nIt's precedented that you represented a percentage that wasn't vintage and the crawlers hate us,\nYou automated, we brought the flavors, niggas you ought to hate us.\n\nEl-P\n\nAnd even from antagonity squad the family tissue.\nTestify the look of my eyes, genuine issue.\nI'm a freak in the flesh that penetrates lust.\nSpray the vaginal juices, like I was up in their undies.\n\nAesop Rock\n\nDon't picket the misfit law, Nancy.\nThe core's no picnic.\nMislead whores advancing.\nNo business.\nInsist lured with candy to cure citizen x with that all-rours dancing.\nCorporals landing ashore, all soar boned nitwit, rickety rackety porn fancy.\nWeave through the hell and high water hot zone,\nDiseases in the minute the idiot got home.\n\nCamu Tao\n\nNow I'm a teacher, 1st grade, and I want to participate.\nI want to grade the papers but I don't want to give them A's.\nO.k. F, D, F-, test time, set timers, call every parent and give 'em a piece of my mind, shit.\n'Cause I don't want to give a good future, I'll shoot ya.\nShoot ya?\nWith an Uzi filled with rulers.\nFuck minors, flush minds.\nEven leaving 'em bruised up.\nStack kids, pack cute lunches in the cooler.\n\nRickety Rackety.\nThis city fit my style exactly.\nNear the fire ladder, where the wires gather, drink water, eat fish, smile after.\nRickety Rackety, this pussy fit my dick exactly.\nWith a threesome, giving treatment, sex on drugs, girl you can't keep up.\n\n", "album": {"title": "Fast_Cars,_Danger,_Fire_And_Knives_(2005)&&7560", "genre": "Underground Hip Hop", "year": 2005}}, {"title": "Holy Smokes", "href": "Holy_Smokes&&1801", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "(Man 1: Give him one of these pills if he has any pain.)\n(Woman 1: A parable: What is it?\nWell, it's a little story with a lot of truth in it\nAn earthly story with a heavenly meaning\nJesus told many parables to grown-ups and children alike\nHe told them simply and sincerely, in words everyone could understand\nSo that all might learn the lesson he was trying to teach...)\n(Yeah!)\n\nWell they were selfish with the helmets on the little bus\nTill brake fluid sewage crippled up the get-retarted nickel punks\nSlowly cope but swore his lowly robot foley folk\nWould one day rise in sections to interrogate the Holy Ghost\n(I knew it!)\n\nHoly smokes\nFather. Black suit, white collar\nKiddie porn dungeon, guns, and three fingers for your daughters\nCaught belly-up. Antique Nazi paraphernalia\nYou can not pay you bills with holy water and Hail Mary luck. (Oh my!)\nShucks, fucker. Enjoy the Alcatraz shower fun\nAnd mommy's mad; I'm clich&#233; generation X Agnostic Front\nIt ain't the nifty faith in 1958 before the New-New Testament approved altar-boy fistic rape\nAnd take me to your leader 'long as he don't manipulate toddler-beaver. (Leave him alone!)\nCall me crazy but I'd bet that wasn't God's demeanor\n\nSod-o-meter peaking. (Me too!)\nBut Long Island was Jesus every weekend spoon-fed to appease traditional upbringing\nOf a Middle Pennsylvania shit-hole where elders movement\nStressed the stellar therapeutic Bible cycle. (How?)\nOne church with a bait and tackle store next door and not much more\nSo the two moved to New York, made babies raised on what they'd saw\nChristmas morning smelled fresher than angel pussy\nBut immaculate conception came second to playful goodies\nLike laser-tag was way more spiritual than blood and body wafer bags\nAnd manger staff as long as Santa ate the cookies (Well...)\n\nGrandma was a saint while he'd paint with snakes and bullies\nSaid \"If only you'd memorized your prayers like you did your Kool-Gs\"\nBy the time I was old enough to know what religion was\nI was Catholicism-numb and truly didn't give a ... FUCK\n94': Moved out the crib and it ain't seen a steeple since\nWhile Knievel-Evil seeps in a Christian leader's pitch\nTill priest's lap slapped with parental advisory warnings:\n\"I'll be auditioning gods in my office on Monday morning\"\n\n(Yeah!)\n(Yeah!)\nUh-oh! And yet another pill slipped\nDown the hatch It patch him through the kill-switch\n(Yeah!)\n(Yeah!)\nI need a couple As for Qs\nI'm not an asshole I'm just a little confused\n\n\n(Woman 1: This story reminds us of the one Jesus told about people who were kind and helpful to others\nHe said that one day the king would say to these people\n\"Come, inherit the kingdom prepared for you\nFor when I was hungry you gave me food\nI was sick and you visited me\nI was in prison and you came to me.\"\nBut the people asked\n\"Lord, when did we see you hungry and feed you?\nOr sick or in prison and come to you?\"\nAnd the king answered\n\"In as much as you have done it unto one of the least of these, my brethren\nYou have done it unto me.\")\n(Yeah!)\n\nJust a little bruised in the back of the pews\nActing amused with a mask on them Vatican blues\nFor in the eyes of the organization I was raised in\nAes' is just another sinning brick in Hell's basement\nCubicle adjacent to the killers and rapists\nFor what? Drugs and fucking is part of growing up\nLike cups offa dumb shit's better than the schools\nI'm not an asshole I'm just a little confused\n\nJust a lit fuse in the back of the pews\nWatching a thousand flavors of the same God feud\nI figure ultimate peace is the common theme\nSo it's a no-brainer piece when the blood hit the screen\nGot a basic good and evil sensibility born\nGood neighbor know a halo wouldn't fit over horns\nI'm more science than faith, I'm more karma than bread and booze\nI'm not an asshole I'm just a little confused\nNot an asshole I'm just a little confused\nNot an asshole I'm just a little confused\nNot an asshole I'm just a little confused\n\n(Man 2: You know what, to be completely honest, Aesop, you're a fucking asshole.)\n\n", "album": {"title": "Fast_Cars,_Danger,_Fire_And_Knives_(2005)&&7560", "genre": "Underground Hip Hop", "year": 2005}}, {"title": "Dryspell", "href": "Dryspell&&578", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "On a sunny afternoon in lower east side New York...\nYou about ready? (Yeah)\nGood morning my sweet vision of morbid disorder\nAnd good evening wonderful riddance and such\nMaybe today I'll touch the burgundy halo\nTrimming the tunnels and offend with tenants\nSpangled cross a more tangible premise\nThis splendor shit needs splinters all up in day-tripper visuals\nTake it easy man, fuck it I'll take it any way I can\nMy palms are generous\nWhen I witness fury scurry past my window\nModel city in a bottle plugged hostile\nIts bliss kissing polluting\nAnd a billion suckers pucker in a bind\nMaybe the sunken ship is the treasure\nNo, but they insist it man\nI try to spin me dizzy sponging\nSpongin up the given dungeons functions\nAs opposed to art historians absorbed inside assumptions\nEverybody pop your knuckles when the style divorces vertical\nMarveling at the spite with which it curdled\nOutside my tenement grows a little warmth\nFrom out the mugs of masons wasted\nLaying bricks for days to later find they owned the lot adjacent\nMark the blasphemy elements of elegance and savagery\nMurder the gossip, fuck it run off happily\nThe broken spoke cyclers choking open doctors they as born fetus\nIn a matchbox conveniently padlocked to the hammer base\nNow these impurities embedded in five illiterate's textiles\nShedded in the hell tale to motivate blind suspended leverage\nNow I'm drowning in a pool of... why are you here?\nSabotage with my beast of burden pertinence of if I die this year\nMy name is Dry spell\nMy name is pillar\nMy name's allegiance\nMy name is flagrant\nMy name's a thousand steps from patience\nBut I'm sick and tired of waiting\nMy name's Polaris\nMy name is canvas\nMy name is lowlife\nMy name's intention\nMy name is every imperfection that plays a part in my dissension\nMy name is carnival\nMy name is posture\nMy name is polarized\nMy name is evidence\nMy name is delicate approach from symmetrically to my fellowship\nMy name's possessive\nMy name is cordial\nMy name is igloo\nMy name is captivate\nMy name is contaminate the rich\nAnd clock the profits for the captive's sake\nLet us hope that the horrors of evil no longer loiter on the doorstep of your past\nCircle of sandbags drag the shield a meal the meaty hand grabs\nI'm splitting hopes at your local Acropolis\nOpulence in a cockpit not the pocket for them born with a pepper toss\nSunk to rest while they've exhausted the art of drunken address\nExhibit fracture lines that converge towards where the hackers whine\nWhere trappers slack the traps\nUnlatch the catch then cover up his trackers line\nThat will make his majesty furious\nOh bury his head and how could I have been so dense\nIf only, yeah but I'm lonely\nMy days graze normalcy then morbidly crash\nMy years breathe honesty then sardonically laugh\nAlas, I dig my toes in to the sand and spit foliage out my lips personifying mankind's end all aspirations\nHope floats...\nNo, hope sinks like broken boats and most harassed before provoked\nI'm tossing darts at a map of the arts to pick up where you choked\nAnd when the last leaf falls off the branches of resonance\nI'll be waiting with my butterfly net to collect the evidence\nWell I am a room with poison oak scaling the sides\nArachnids on the ceiling, rugged thumb tacks, bones and rusty pipes\nIf you can squeeze between the bars\nEnjoy my space employ my waste\nAnd change the hand dealt by a stolen grace\nDo you ever wish the circle was a square\nSo when land sharks start circling the borders\nYou could just cut them off at the corners\nThere's a ghost in the basket of values\nPertinent to, which kayak pilot succeeded in serving him proof\nNow I'm surfing it through\nSo if you need me spread your wings to spell my name\nAbove the mess near the other funny requests\nSee mild to tolerant mannerisms of higher to win\nTo assist in a meticulous pick a part of cobweb of skins\nOf innocence\nA child of timid instinct with that ten step ahead premise\nSupply dust bowls before the zephyr was requested\nViolent humble shoes ten shades of blues come off the difference\nI grimace, took me one hours blink to conclude that sickly innocence\nMy name is Dry spell\nMy name is pillar\nMy name's allegiance\nMy name is flagrant\nMy name's a thousand steps from patience\nBut I'm sick and tired of waiting\nMy name's Polaris\nMy name is canvas\nMy name is lowlife\nMy name's intention\nMy name is every imperfection that plays a part in my dissension\nMy name is carnival\nMy name is posture\nMy name is polarized\nMy name is evidence\nMy name is delicate approach from symmetrically to my fellowship\nMy name's Possessive\nMy name is cordial\nMy name is Igloo\nMy name is captivate\nMy name is contaminate the rich\nAnd clock the profits for the captive's sake\nMy name is vagabond\nMy name is angel\nMy name is century\nMy name is hunter\nMy name is sunburst\nMy name is wildfire\nMy name is scrutinize\nMy name is basic\nMy name is consequence\nMy name is cigarettes\nMy name is cynical\nMy name is tolerance\nMy name's hallucinogen\nMy name is waterfall\nMy name is runaway\nMy name is alarm clock\nMy name is...\n\n", "album": {"title": "Appleseed_(1999)&&251", "genre": "Underground Hip Hop", "year": 1999}}, {"title": "Fast Cars", "href": "Fast_Cars&&8358", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Who's that walking with a hole in his head?\nBig bad Bazooka Tooth, I came to break bread.\nWhat's a troop's recipe for treacherous times?\nI tell 'em... ah fuck it, yo\n\nI pull the elephant tranq out of my neck,\nGaffle a tank, count up the chips, wrastle the fangs off of my fist,\nFlood a little soldier blood over the ogre acres\nOn some holiday in Cambodia with moter home appraisers.\nPagans fade into the kodochrome now, later with a lid to brow staple revist the cobra loading zone. Molar foaming but he hold his own wound\nCauterized by the Zippo he had stole that afternoon.\nAnd my dog tags jingle by the monster island heart he built.\nGrew up with a Jughead crown tilt and tardy slip.\nBe all you can be just never soothed us.\nYou lost me in that part about scrubbing piss with a toothbrush.\nHoller scum's lullaby.\nLive from the ultra-fly sham city bunker where the coldest cults multiply alarmingly.\nHush little baby, timeout.\nThe black market mockingbirds can not sing a lick but lean to peck your eyes out\nOf commission with love, out a tradition of wraiths pick on the visions that buzz,\nBet on the kitten's escape, solder the piston to pump out a veteran amplifier.\nAnd magnify through the same lens that set the ants on fire.\nFlush the muppet hootenanny.\nWho could fancy honor circuit when the circle's every duke is clammy?.\nTrooper, scoop the food in pantry. Ante up, stupid.\nMay delusion feed 'em foofi candy and pry the gold out of his tooth when lamping.\nPocket all you can now.\nBlock will lead the lambs down to the cold cutlery outfit.\nSlaughter beef and cow tip. Pour the chief some fountain soda,\nMotor prone to pen the holy opus and pry this monkey off the scoliosis.\n\nWho's that walking with a hole in his head?\nBazooka Tooth, Gemini, I came to break bread.\nWhat's a troop's recipe for treacherous times?\nI tell 'em fast cars, danger, fire and knives, lets go\nFast cars, danger, fire and knives...\nI got her majesty Athena riding shotty wide-eyed\n\nIt's like never mind the bullocks.\nLike every other week these hipster tabloids jumping on and off my sex pistol's bullets.\nLike every other week he spins the bottle.\nLike every other week these fucking fanzines forget if they spit or swallow.\nToo bad your inner sheep never forgets to follow,\n'Cause my inner greed to feed your hate for loving us is hostile.\nFortunate for me it coincides with what comes natural, so the mongrels that I run with turn the 'fuck you's into fast food.\nLike a little freak sick of the 3 o'clock bully knuckle dust, nursing his last shiner, finds the shoebox in his mother's truck.\nTomorrow's extra curricular punching bag will finger daddy's widow maker out a brown lunch bag (bang!).\nThis is where the hunch back snake oil peddlers stuck under the burgundy sky of spaghetti westerns tend to bubble up.\nWeathermen huddle up.\nToday the son of one too many 'yes sir's kings his checkers, watch the double jump.\nBack with a platter of hot leeches that'll drink up-every bloody drop down to the last diseases, it's A-E-S-O-P-R-O-C-K, the peak twister.\nDefender of the son of Vaughn Bode's Cheech Wizard.\nI used to pray the treatments got easier with my aging like serotonin weekends was merely comedic hazing.\nWrong, but along his travels located the key to world peace: kill every motherfucker but me.\nYou cool with that? Cool. Bang. You? Cool. Hang. You? No? Uh... bang? Cool.\nSorry, dog, rules are rules.\nAnd too long have I followed yours.\nI'm trying to get them years back, and walk through every cipher with dynamite in a beer hat.\n\nWho's that walking with a hole in his head?\nBazooka Tooth Krueger, I came to break bread.\nWhat's a troop's recipe for treacherous times?\nI tell 'em fast cars, danger, fire and knives.\nFast cars, danger, fire and knives...\nI got her majesty Athena riding shotty wide-eyed\n\n", "album": {"title": "Fast_Cars,_Danger,_Fire_And_Knives_(2005)&&7560", "genre": "Underground Hip Hop", "year": 2005}}, {"title": "Bracket Basher", "href": "Bracket_Basher&&433", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Hey yo must not sleep\nI bash the bracket open and breach\nThe priority's bleached since that '76 umbilical severed\nMajority's cordially aboard the pinnacle benders\nI got west nile virus on my TV in the Bronx\nI got two hollow pockets and a sleepy hollow mosh pit\nTryin' to blow the spot with wet matches and bottle rockets\nWhile cop walkie talkies walk outside my apartment obnoxious\nTonight's special consists of stale fiber from shitty diners\nLook mom! I learned to tie my shoes! Hey can I borrow twenty bucks?\nPeel back the prickly cocoon a Poloroid turbulent land unit birth\nStudent first pedagogue only from brazen action\nWind blown mariner east river shark carry lunge carry funk ends on caliber\nWatch war face painted junkies dance blissfully around a bonfire and\nSacrifice life's sanity Pay a nickel for nose-bleed seats in a peanut gallery\nGallop with a Pegasus, malice with no benefits, balance with some sense of bliss in the foulest degenerates, my New Year's revolution's gon' be to stop burning bridges\nI'm just 'gon bend 'em toward the couple cats that's worth the visits\nUm, it's like that, and that's the way Aes stinks, and um\nPlans are like clipper ships, if they got holes they sink\nAnd if the skipper slips the crew shits bricks, wither, and hits the brink\nThat's why I take the poison spitter sips and smile big when I drink\nYou never knew mayhem walked with Nikes talked like a trucker hawk the filibuster Gerber baby lucid Colonel Mustards\nNo time to hold my breath, I'm only here to rap, eat, sleep, grow old, and smoke stoges through the hole in my neck.\nNew millennium, mad cows and Pentium, process the hostage, lock him in the petting bin\nShowing pictures of his wife and kids, then wash the brain\nProbably the same motherfuckers that buffed the train\n\n(x2)\nOk ok ok ok ok ok\nMust not sleep\nMust bash the bracket\nPay The Rent, Pay The Debt\nMust slash the fabric\nCatch the jackrabbit\nPay The Rent, Pay The Debt\nSleep\n\nRoll into the city with one half of the cannibals.\nNew joint bumpin out the whip speakers\nMade the escape for a night of makin' tapes now it's back to the cockroaches and preachers\nSomewhere a prom queen's givin' birth in a bathroom stall\nHolding a prime directive not to get blood on her mother's ballgown\nI'm son of a stubborn old one track jackal prince\nTrucking with prime directive just to get the goods and never fall down [Raw bomber]\nAte the city spit the bricks ate the boxcar spit the burners\nAte the planet spit the murder\nFunny farm rampage from writing rap for milk money built ugly\nBut a couple side effects to make'em love me\nMy cipher demeanor left Jesus rubbin genie bottles\nTill the following morning Colombo found a crown of thorns in urine puddles\nYou're in trouble\nI'm not trying to save the world I'd rather watch it die slow\nSo I could spit my grand I-told-you-so\nAre we having fun yet?\nYup. Step to the carnies\nTry to win a teddy bear to impress your favorite Barbie\nShe almost sucked you off at the company Christmas party\nBut she won't accept the bear till Aesop signs it with a sharpie\nMy ex-girl bounced without payin' the cable bill\nI check myself in television rehab\nWithdrawal symptoms may include shivering, fevers, drooling and chronic masturbation\nNow I pray to the gods of pornography and Playstation\n\nNow I lay me down to sleep\nI pray the lord my soul to keep\nAnd if I should die before I wake\nGive my ASR to El and bury me with my mistakes\n\n(x2)\nOk ok ok ok ok ok\nMust not sleep\nMust bash the bracket\nPay The Rent, Pay The Debt\nMust slash the fabric\nCatch the jackrabbit\nPay The Rent, Pay The Debt\nSleep\n\n\nBonus Round\nThis is the hot tin roof stepper\nHold it down with centipede foundation\nMr. Greed who burns rugged obstruction in bunches\nLike little Jackie paper puffs the magic dragon and dutches\nWe don't need another hero hommie gallop off on you're my little one trick pony\nHolly Hobbie Polly Pocket pretty future destiny\nIf the slipper fits fire up Cinderella propeller and curtsie for the munchkins right before\nAesop Rock smashed the pumpkin\nIron on gusto rustolium bloodstream what's better?\nWhen the wrist slit it leaks out only the bloodiest bubble letters\nComplete with outlines, fill-ins, dates, shading and shout out columns\nFor vagrant colonies to follow in redeeming bottles\nYou're a little tea pot tryin' to eavesdrop on the mammoth route\nPeekin' out from around the rose bush like... here is my handle... here is my spout\nGodzilla junkie used to be in love, now out for gigapussy\nSorry to offend but sometimes life bends in the middle\nSo now you have a fulcrum where there used to be a pillar\nAnd now I got a pulse that bumps less than a cocaine binger\nAnd now I got no 9 to 5 and still labor days flicker\nAnd now I got a 9mm Q-tip with an itchy trigger finger\nSee, I really don't feel your persona distortion ordered by martyrs who martyr self for martyr's sake\nWow fame... If notoriety grew adjacent a jealous dick-riding sentiments I'd give you a pound like \"Greetings Mr. President.\"\nNow go do your homework\nOrder the sequence\n\n", "album": {"title": "Daylight_(2002)&&4690", "genre": "Underground Hip Hop", "year": 2002}}, {"title": "Save Yourself", "href": "Save_Yourself&&5596", "artist": {"unique_name": "Aesop_Rock"}, "lyrics": "Pull the pin out, sheep creep in wolf garb\nFronted by the Hail Mary parry lunge mixer\nKill the populace for civility, jeopardy's a stickler\nIts bob and weave amalgam played the falcon to your fixture\nI branch out, arms flailing backwards\nWailin upon a tidy sound circuit\nSlightly foul Gershwin\nWith a bed of nails and drumlust plus disgusted service\nWorkin in shifts opposite the asbestos brain furnace\nI be the now observatory eye ear antenna feeler\nSpittin' like a dragon with a similar demeanor\nStood innocent bystand witness the diehard fans turn Rip Van\nIn the poppy fields of N.Y.'s orchestrated brick gauntlet\nNow I'm thinkin' who am I Jabberwocky Superfly bent left\nPushin war without the ten step cushion and what (what)\nI plan to hold this B-positive sacred in these golden veins\nUntil the day I die from grimace overload\nIt's shock (it's shock)\nTreatment offered by the weekend\nThis still be a getaway, let's display the sequence it goes:\nOne for the heartless thievery turning my guardian angel harpless\nAnd the rest to sweep the mess under the carpet (under the carpet)\nI drag a yellow taxi meter behind every measure\nAnd charge cats for labeling me shepherd\n\"That'll be Six Fifty plus tip darlin',\nI take cash, credit, check, money-order, gold and cigarette cartons\"\nHuh, got caught up in the universe tryin' to zoom in on stardom\nForgot the passion plus the hatred, both were based in Carbon\nNext time you wanna be a hero try saving somethin' other than hip-hop\nAnd maybe hip-hop'll save you from the pit-stop\nKill 'em all, yeah\n(Naw man It wasn't me it was Holden Caulfield brother\nI just read and pulled the trigger)\nOh God, well leave me to tiptoe past the pearly gates\nCapture the halo, jet back to base, step past the chase\nThe bad taste of jet-lag and weight slackers\nThere ain't nothin' broken, where you at?\nThe pistons pump perfect, where you at?\nThe bass tone is Merlin, where you at?\nThis service is a urgent workin surgeons\nPurging formulas lookin' for an improper cause is whack\n\nWhat are you saving, honestly? (honestly, honestly)\nWhat are you saving, honestly? (honestly, no honestly)\nWhat are you saving, honestly? (damn)\nPromise me you gon shut the fuck up and recognize\nWhat you holdin' ain't really broken?\n\nI don't flick needles like my sick friend (friend)\nI don't march like Beetle Bailey through a quick trend (trend)\nI don't frequent church's steeples on my weekend (end)\nAnd I don't comment if you formulate a weak Zen.\nAll I ever really wanted was a getaway\nI'ma take a chance by letting a brook slide for what I got in my hands\nI can not agree to follow a leader while on the borderline\nA war without a reason for the Brady hates gore\nBring out your dead we can put 'em in a pile\nAnd burn 'em with the novels for the kids then to admire\nKill the ones that speak from a different life\nBrewin other killer noise makin' the sentiment...\nOkay, welcome to the Kamikaze bottle rocket cockpit\nLive by the icy cold hand of bad intention youth blender\nOh yeah I'll let God warm the bench for now but\nI'll ascend to spin y'all dizzy\n(And for the record I'm bringin' my TV with me)\nYo, let the commoners speak publicly\nThen disperse eye jammies for cats that swear by third pupil\nBut can't see past the loophole\nMotherfucker, my word is born like Siamese triplets\nWith doctor, lawyer, rocket scientist promise\n(Let 'em grow leisurely)\nHey Mom, I'ma fix whatev I broke along this path\nOnce my spiel's perfected I'ma save you a seat in the front row\nOf Aesop Rock's twelve steps to shut the fuck up seminar\nAnd when all these bickering crowds turn solid you gon be proud\nI tack hacks to the (backboard)\nHonesty's a (latchcord)\nFury's far from (obsolete)\nSerenity's a crack whore\nRaw caricature of mayhem standard branded by the labor\nWith a thousand reasons to end this for every one of you saviors\nSaw the brightest burst ironically wide from the vacant stage\nGave it a pound for burning where bunk ratio's engaged\nKeep me posted as to when you grasp something mature to\nSit and sulk about mister, and I'll consider pickin' up your record\n\n\n\nThe Authors, they ain't got nothin' to save\nThe Overground, man they ain't got nothin' to save\nDef Jux, they ain't got nothin' to save\nThe Addams Family, they ain't got nothin' to save\nWeightless, they ain't got nothin' to save\nStronghold man, they ain't got nothin' to save\nRhymesayers baby, they ain't got nothin' to save\nAesop Rock, I ain't got nothin' to save\n\nIt's like that\n\n", "album": {"title": "Labor_Days_(2001)&&8422", "genre": "Underground Hip Hop", "year": 2001}}]