[{"title": "Congratulations, I Hate You", "href": "Congratulations,_I_Hate_You&&545", "artist": {"unique_name": "Alesana"}, "lyrics": "No one ever said that life was fair and I'm not saying that it should be\nSo knowing that you are what you want to be and I'm not comes as no surprise\nBut don't expect me to be happy for you\nAnd don't smile at me and tell me things will work out for me too\nI don't want your pity... I hate your pity\n\nTaste your vanity and it's sweet bitterness \nAs you hide behind your veil of my stolen hopes and lost dreams\n... You took them all... \nI watched you steal my thoughts and had to see you smile\n\nAs you build your dreams on my shattered hopes\nI'll look back on a day once loved and fantasize for tragedy\n\nBeg me to make this easier and listen to my hopeless cries\n\nSuffer alone in emptiness\nI lust to see you swallowed by the mess that you left in your wake\nDisgust lies deep within your empty gaze... \n\nBeg me to make this easier and listen as my hopeless cries\nSend stares into your meaningless eyes\n\nMy envy can't describe how I loathe you for having all the stars\nLeaving my eyes to marvel the sky knowing it should be mine\nYet it's you I see wasting the dream that only I deserve\nI'll tear off your face to see your smile.\n\nAs you build your dreams on my shattered hopes\nI'll look back on a day once loved and fantasize for tragedy\n\nBeg me to make this easier and listen as my hopeless cries\nSend stares into your meaningless eyes\n\n", "album": {"title": "On_Frail_Wings_Of_Vanity_And_Wax_(2006)&&7104", "genre": "Emo", "year": 2006}}, {"title": "Daggers Speak Louder Than Words", "href": "Daggers_Speak_Louder_Than_Words&&4578", "artist": {"unique_name": "Alesana"}, "lyrics": "Eyes open to splattered blood\nCold tile mocks me as I arise to find the knife is still in my back\nShifting thoughts now slow with venom\nTake me as I stagger, is this all we were worth?\nI've lost you for good without regret\nYour once gentle words are bleeding from my eyes\nScreams of terror now fill my every breath\nI know you'll rue the day you ever met me\nI'll lay you down to sleep when sorrow will bury the blade hilt deep\n\nYou know I would have died for you\nNow I'm forced to choose between a life of revenge or regret\nAs I thirst for vengeance, my heart struggles to come to grips\nWhy would you leave me to die, turn, and walk away?\n\nAlone, you stood so still as you watched me break\nDid it now kill you too? what has led you to the dagger my friend?\n\nYou know I would have died for you\nNow I'm forced to choose between a life of revenge or regret\nAs I thirst for vengeance, my heart struggles to come to grips\nWhy would you leave me to die, turn, and walk away?\n\nMy revenge is made so clear midst cold tears left with the betrayed\nI'll see that you never forget this\nI will hunt you down like a dog\nLies could never disguise what I saw behind me in you\nRemembering times we have shared, my friend for life is gone\nWe'll let the embers serve as the only memory of last days, so long ago\n\nWhy would you leave me to die, turn, and walk away?\nWhy would you leave me to die after you had buried the dagger hilt deep?\n\nYou're dead to me...\nI would have died for you\nNow I'm forced to choose between a life of revenge or regret\nAs I thirst for vengeance, my heart struggles to come to grips\nWhy would you leave me to die, turn, and walk away?\nYou're dead to me\n\n", "album": {"title": "On_Frail_Wings_Of_Vanity_And_Wax_(2006)&&7104", "genre": "Emo", "year": 2006}}, {"title": "Pathetic, Ordinary", "href": "Pathetic,_Ordinary&&6872", "artist": {"unique_name": "Alesana"}, "lyrics": "She haunts me in dreams\nI see her silhouette\nDance across landscapes\nOf golden light and autumn\nIn my dreams...\n\nHer soft eyes see\nThrough my tortured soul\nVanishing any hope for fantasy\nThe thing I'd give, to prove myself to her, to make her see...\n\nJaded eyes awake\nAs her selfish words rain from such placid lips\nStill I kiss her silken flesh\n\nFrigid air leaves me breathless\nFoolish agony fills my lungs\nAs I try to scream for her\nI confess... I scare myself\nThrough the howling wind,\nOn my knees, I cry\nListen to me...\n\nI'm broken by her silence\nTo a love unseen\nBlood soaked feathers rained down\nMy wingless angel so\nBroken falls gracefully from the sky\nTo waiting arms\nTo waiting arms\n\nFrigid air leaves me breathless\nFoolish agony fills my lungs\nAs I try to scream for her\nI confess... I scare myself\nListen to me...\n\nFrigid air leaves me breathless\nFoolish agony fills my lungs\nAs I try to scream for her\nI confess... I scare myself\nThrough the howling wind,\nOn my knees, I cry\nListen to me...\n\nSuch foolish agony fills my lungs as I try to scream for her\nJaded eyes wake to the sounds of my voice as I scream to her\nIn dreams I've seen her silhouette dance across golden light\nAnd autumn... in my dreams...\n\n", "album": {"title": "On_Frail_Wings_Of_Vanity_And_Wax_(2006)&&7104", "genre": "Emo", "year": 2006}}, {"title": "Ambrosia", "href": "Ambrosia&&5610", "artist": {"unique_name": "Alesana"}, "lyrics": "A touch of poison, seals my fate\nThe dawn echoes the night with my glory\n(The sun himself honors me)\n\nOnce king of roses, now lord of gold\nBlessed with the gift of gilded touch\nThe Gods themselves envy my hand\nFate wields its knife to cut the thread\n\nI curse the day my dream became my descent\nSuddenly I long for you, My only love\n\nIn my perfection I have no want\nA folly as fatal as sin\nYet eyes still glint with greed untold\nHas now become the end of me\n\nI curse the day my dream became my descent\nSuddenly I long for you, My only love\n\n...Have I not...\n\nEarned this the gift of beauty within?\nHow selfish were the Gods to\nKeep their riches from my rightful treasure?\nI truly have become one of them my fatal flaw\n\nOh yeah! Ive got her hook, line, and sinker!\nThanks to me, she's her own new necklace!\nThanks to me, she's her own new necklace!\nThanks to me, she's her own new necklace!\nNow she's good as gold!\n\nI curse the day my dream became my descent\nSuddenly I long for you, My only love\nI curse the day my dream became my descent\nSuddenly I long for you, My only love\n...Cut the thread...\n\n", "album": {"title": "On_Frail_Wings_Of_Vanity_And_Wax_(2006)&&7104", "genre": "Emo", "year": 2006}}, {"title": "Alchemy Sounded Good At The Time", "href": "Alchemy_Sounded_Good_At_The_Time&&7787", "artist": {"unique_name": "Alesana"}, "lyrics": "<i>spoken:</i>\nThis the oldest story in the book... he desires the one thing he cannot have...\n\nMy darling queen, I lay myself at your feet\nAnd I shall stay the hands of fate\n\nWind cries out, heavens boil above voicing discontent to my sins\nI have found the way to trick the ferryman\nI have deceived the ancient Gods\n\nCold flesh lends to me its secrets for a price too high\nI shudder at what I have done\nEach day brings me closer to you, my tragic victory\n\nDarling queen I lay at your feet...\nChills take me as she wakes, throat gasps tainted breath\nI've reclaimed you my stolen bride\nCan your soul forgive my crimes of passion?\nI would not close the casket; I'm so consumed by your pain\nFaint screams echo through the night...\n\nCold flesh lends to me its secrets for a price too high\nI shudder at what I have done\nEach day brings me closer to you, my tragic victory\n\nThe pains of death can no longer haunt you\nAs the dawning sky brings forth one forsaken thought\nDeath can not win for I now dwell in the palace of decay\nAnd I shall stay the hands of fate\n\nNight descends, sinews twitch\nMy pale queen finally stands to taste silent lips now cursed with her love\n\nCold flesh lends to me its secrets for a price too high\nI shudder at what I have done\nEach day brings me closer to you, my tragic victory\n\n", "album": {"title": "On_Frail_Wings_Of_Vanity_And_Wax_(2006)&&7104", "genre": "Emo", "year": 2006}}, {"title": "The Last Three Letters", "href": "The_Last_Three_Letters&&3411", "artist": {"unique_name": "Alesana"}, "lyrics": "Dearest love,\nI hope this message finds you well\nAs these endless thoughts drip from my soul\nEvery single word secretly paints a fairytale\nOf when we will melt into one...\n\nEyes (I am so scared) forfeit sight to the pain (so scared\nCold scalpel's steel whispers tear at my very core\nAs I cling to memories of you\nI am so scared... so scared... I need you with me\n\nWere the last words that I wrote for you enough to tell you\nThat in my death the light that shone through my painful darkness\nWas a blinding vision of your eternal smile?\n\nIt's me again,\nIs it me or am I wrong to be concerned?\nWill the beauty of your pen ever cross my eyes again?\nWas this all a lie? why?\n\nWere the last words that I wrote for you enough to tell you\nThat in my death the light that shone through my painful darkness\nWas a blinding vision of your eternal smile?\n\nMake it stop, make this pounding in my head stop\nFill my lungs with air, give me one more day to make her dreams come true\nShe understands right? that I'm not coming back...\nShe understands right? that I'm not coming back...\nMake it stop, make the pounding stop\nI'm not coming back, I'm not coming back, I'm not coming back...\nI don't know what happened... who would have thought my life would end up like this?\nI never got the chance to see her face, or to touch her hair, and now, it's too late.\nI didn't mean to hurt her, not hurt her like this... I can't feel my legs\nI can't feel my legs and I can't even cry... how could somebody die like this?\n\nIf my words ever reach you I'll assume you don't care\nNever knew that silence could cut so deep or that you could twist the blade\nNow I curse all of your beautiful lies...\nI love you and goodbye...\n\nWere the last words that I wrote for you enough to tell you\nThat in my death the light that shone through my painful darkness\nWas a blinding vision of your eternal smile?\n\nCold scalpel's steel whispers tear at my very core\nAs I cling to my memories of you...\n\n", "album": {"title": "On_Frail_Wings_Of_Vanity_And_Wax_(2006)&&7104", "genre": "Emo", "year": 2006}}]