[{"title": "Benediction", "href": "Benediction&&629", "artist": {"unique_name": "Aletheian"}, "lyrics": "May the peace of God, which passes all understanding, go with you\nThere is great power that makes all things new\nThe blood of the eternal covenant through which God raised the Lord Christ Jesus from death\nTherefore, give honor, thanks, and praise to the glory of the Father and the Son\nGo forth in the certainty of faith, in the knowledge of love, and in the vision of hope\nAnd may God work in you what is pleasing to Him\nThrough Christ Jesus, to whom be the glory for ever and ever\nAmen\n\n", "album": {"title": "Apolutrosis_(2003)&&6522", "genre": "Christian Metal", "year": 2003}}, {"title": "The Paragon", "href": "The_Paragon&&8401", "artist": {"unique_name": "Aletheian"}, "lyrics": "Beyond the confines of time, the origin and foundation of formulation. \nThe formless face encased in all creation. \nThe embodiment of authentic authority. \nAbstract intangibility personified to reconcile the gulf of separation. \nUndefiled by the loins of man. \nBorn free of the dark inheritance inherent in all men. \nCrystalline intention, absolute but yet unclear. \nThe archetype of intended life, a spotless anomaly circumventing all conception and convention. \nThe fulfillment of visions and the herald of hope. \nThe culmination of thousands of years of anticipation. \nThe usher of thousands of years of transubstantiation. \n\nChided, Threatened, Condemned, Betrayed, Detained, Ridiculed, \nDenied, Cursed, Chastised, Defiled, Beaten, Battered, Broken, Crucified, Forsaken. \n\nSelfless Abandon; the seal of Atonement. \nThe watermark of eternal precedent.\n\n", "album": {"title": "Dying_Vine_(2005)&&1073", "genre": "Technical Death Metal", "year": 2005}}, {"title": "As The Fall Breaks", "href": "As_The_Fall_Breaks&&1380", "artist": {"unique_name": "Aletheian"}, "lyrics": "Injustice between brothers left un-mended, with no chance left to reconcile.\nWill you forgive me in my memories?\nFor I can't turn back the hands of time.\nHaunted by questions of what could have been.\nSorrow, shame, regret.\nFriendship defiled.\nThe smoke settles as the echo fades.\nThis quiet stillness is so peace less.\nHopeless decision made in haste, leaving only \"numb\" - the hand scrawled explanation.\nWhy couldn't you have waited five more minutes?\nWhy couldn't I have spared five more of mine?\nWho am I to shed a tear?\nThe Hope I bear I bore inside.\nThe silence shatters as the fall breaks.\nLifetime reflection in a momentary decent.\nTragic accident without warning left so many ends untied.\nWhy couldn't I have said I'm sorry?\nWhy had I forsaken you?\nBrotherhood I have defiled.\nThe Love I bare I have denied.\nBrother against brother, selfish stubborn battle.\nPetty qualms fester deep, severing all ties.\nPrinciples borne to heart have all been pushed aside.\nTragedy reveals this squandered wasted time.\nGreat truths revealed through grave mistakes.\nHard lessons learned through retrospect.\nBite not the hand that has been offered.\nDeny not a hand to help another.\nLet bitter judgment fall the way of hate and embrace thy brethren.\n\n", "album": {"title": "Dying_Vine_(2005)&&1073", "genre": "Technical Death Metal", "year": 2005}}, {"title": "Broken Legacy", "href": "Broken_Legacy&&9855", "artist": {"unique_name": "Aletheian"}, "lyrics": "The standard had been set and preparations had been made for the inheritance. \nThe path ahead had been cleared, the end of the journey revealed before steps had been tread. \nThe means by which the ends compile had been designed and defined for all to follow. \nNarrow, straight, safe, secured, unique, unrivaled. \nThe destination awaits; the source of full life to which we aspire. \nThe wellspring of truth, begetting hope and desire. \nA network into which we all have been planted with the intention to flourish and bear fruit. \n\nThe allure of self-reliance and indulgence of desire led to the separation from the network of design. \nWithered and frail, thirsty for life; but I've severed my roots, leaving my vine dying. \nIsolated, unattached from the truth, consuming myself, unable to bear fruit. \nI've chosen to walk away from the birthright of my name. \nAll that was set before me now seems impossible to attain. \nThe source still remains and awaits for the broken branch to be re-grafted.\n\n", "album": {"title": "Dying_Vine_(2005)&&1073", "genre": "Technical Death Metal", "year": 2005}}, {"title": "The Dividing Line", "href": "The_Dividing_Line&&1073", "artist": {"unique_name": "Aletheian"}, "lyrics": "Shifting winds scatter the ashes of perception; subjective, experiential shades of gray.\nCircumstantial conditions sire contrived reason and rationalized logic;\nThe fundamentals for manufacturing the relative standard.\nRe-conjuring the measure to match the scale,\nDenying the line that has been drawn between the rock and the sand.\nFoundations of fabrication suit the desires of the moment,\nForming a convenient framework of comfort and immunity.\nThis structure crumbles when the sands are swept away.\nThese are only shadows on a wall; easily manipulated, distorted reflections of the definitive core.\nIntegrity rests unchanging on absolute objectivism.\nThe unwavering standard maintains the precedent by which all is accountable.\nTranscendent truth that eclipses all situational comprehension.\nThe line that divides black from white and defines the design that protects and guides.\nIt is time to choose a side of the dividing line.\n\n", "album": {"title": "Dying_Vine_(2005)&&1073", "genre": "Technical Death Metal", "year": 2005}}, {"title": "Out from the Shadows", "href": "Out_From_The_Shadows&&1808", "artist": {"unique_name": "Aletheian"}, "lyrics": "Dark skies and I'm drowning in the flood again.\nEndless affliction sent to torture my soul.\nWhy does this misery follow me?\nWhy can't I escape this pain?\nDrill another hole through my skull.\nRelease another demon.\nTake any length to pass the blame.\nResponsibility - washed my hands clean.\nDemons in the night?\nSelf-righteous perception.\nDefensively, I hide blind in the shadows.\nMisery cuts deep and yet my innocent hands hold the blood soaked knife.\nEvery action leads to reaction, every choice to a consequence.\nFoolish decisions yield a price to pay.\nPass the blame and yet the debt remains.\nWipe the scales from my eyes that I might gain clarity of sight.\nWith a new perspective I take ownership of my actions,\nThe impending flood now seems a healthy rain.\nPain is inevitable but misery is optional.\nSuffering and pain will fade away as hope lives on and love remains.\n\n", "album": {"title": "Dying_Vine_(2005)&&1073", "genre": "Technical Death Metal", "year": 2005}}, {"title": "Shepherd's Fold", "href": "Shepherd%27s_Fold&&9729", "artist": {"unique_name": "Aletheian"}, "lyrics": "Barren isolation amongst the closest of friends, longing for contentment and peace. \nBeaten and confined by an established code of counterintuitive reason and worth. \nSettling to mimic the distorted reflections of shadow's cast. \nAutonomous allegiance to that which passes away, obscuring the infallibility of the unseen. \nBitter unrest tears a hole in the whole of a man. \nGut wrenching fear paralyzing the will and the mind, staying the purveyance of grace. \nCatatonic disposition, well dressed with a veil of passive obedience to acceptance. \nTraversing the well-beaten path with a contrived countenance of success. \n\nFace first in the corner of an empty room. \nConfidence is found in hiding, although vulnerable and in plain view. \nSelf-protective deception is only detrimental. \nShutting eyes to the light brings darkness only to the inside.\n\n", "album": {"title": "Dying_Vine_(2005)&&1073", "genre": "Technical Death Metal", "year": 2005}}, {"title": "Call To Arms", "href": "Call_To_Arms&&1609", "artist": {"unique_name": "Aletheian"}, "lyrics": "Faint reflections herald the break of dawn as shadows are overtaken by the warmth of light. \nThe mist subsides and the songs arise as darkness succumbs to a new day. \nThe binding silence of the absence of light falls to the freedom of the rising sun. \n(Not merely the start of a new cycle, but the renewal of life's potential.) \nAnother chance to rise and embrace the gift of life \nStand in awe of the promise that transcends the frailty of time. \nAnother chance to rise and revel in the glory of the truth indwelling. \nMarvel at the divine manifestations of rebirth. \nAnother chance to rise and pursue the wisdom of the hand that guides. \nExtol the power that \"re-grafts the dying vine.\" - Romans 11:24 \nAnother chance to rise and rest in the assurance of hope. \nStrive to defend and uphold the sanctity of truth. \nTake this time to revive your own strength and take full advantage of potential. \nDo not let this opportunity fade and be forsaken by the desire to rest in the shadows. \nThis is the time to stand and proclaim that there is still Hope. \nThis is a call to arms, stand up and fight against the lifeless norm. \nThis is a charge against the apathy that furthers this complacent world. \nThis is the time for change, all that remains is to move beyond the self-absorbed. \nThis is a call to arms, stand and embrace the glory that this day unfolds.\n\n", "album": {"title": "Dying_Vine_(2005)&&1073", "genre": "Technical Death Metal", "year": 2005}}]