[{"title": "Declared, Bannered", "href": "Declared,_Bannered&&3934", "artist": {"unique_name": "Anathallo"}, "lyrics": "I could not look Him in the face, so I stood revarnishing the floor with my eyes. He stared into them with this love so offended and profound. He tore the center of my shirt and red was bleeding through from underneath the white clothes that I wore. The fire of devotion was only an ember. Alarmed at this sign of decay, my legs gave out because there was no self left to stand on. Thus, my heart was grieved, vexed in my mind, still Your banner over me was love. My walls are ever before You, still Your banner over me is love. But it was Your kind arms cradling me, a criminal. But it was your kind arms cradling me, a criminal. Oh wretched worm of a man that I am, on Thy kind arms I fall.** I'm just a man. I'm just a criminal.\n\n**From the gravestone of William Carey, reading only, \"A wretched, poor, and helpless worm, On Thy kind arms I fall\"\n\n", "album": {"title": "A_Holiday_At_The_Sea_(2003)&&3547", "genre": "", "year": 2003}}, {"title": "Aaron Held His Peace", "href": "Aaron_Held_His_Peace&&3632", "artist": {"unique_name": "Anathallo"}, "lyrics": "Aaron held his peace, so may I (Leviticus 10:3)\nPlease don't think that I'm overcoming great obstacles of disinclination (James 1:2)\nIf you only knew\nIf I only knew like I wanted to\nThough the melody seems tainted, it's the words that carry the hope (Psalm 119:105)\nBecause I walked into the room and laid my head on the hands in which I find inscribed the letters of my name (Isaiah 49:16)\nThere's a certain tension in longing\nOne that paralyzes fear\nOne that finds hope in the promises, and in brokenness is complete\n\n", "album": {"title": "Sparrows_(2002)&&5160", "genre": "", "year": 2002}}, {"title": "Sparrows", "href": "Sparrows&&2309", "artist": {"unique_name": "Anathallo"}, "lyrics": "I awoke from a dream\nI was flying home\nThe wind wailed on my wings, and my strength was waning\nAnd I knew wherefrom rescue would come, but I scarcely called\nThen the sun's rays fell upon me there\nRaining, reigning...(and to the ground) a sobering descent\nFrom the dust I'm sure my voice was heard on desolate heights, weeping (Jeremiah 3:21)\n\"Break up your fallow groundand do not sow among thorns\" (Jeremiah 4:3)\n\"You shall call me, \"My Father,\" and not turn away from me\" (Jeremiah 3:19)\nAs my Father has cared for me to this end (Matthew 10:29-31), how much more will He care for you? O Israel, return (Jeremiah 3&amp;4)\n\n", "album": {"title": "Sparrows_(2002)&&5160", "genre": "", "year": 2002}}, {"title": "A Holiday At The Sea", "href": "A_Holiday_At_The_Sea&&8017", "artist": {"unique_name": "Anathallo"}, "lyrics": "I looked down at my shoes\nBecause I felt the drip of blood fall from my hammer to the leather through my socks. The knots kept tightening their grip. The cords (chords) ring out the history\nAnd time is a mocker as a remedy. The preacher wore a suit\nI knew he would. The tiny print rice paper books\nI hated how they saw me so transparently. This heart\nMy thread\nI tried so hard. The best that I could sew was death\nNo matter how I covered it with deeds. What's there left to do? Because the mud only covers up the stains... who could imagine a holiday at the sea? Down there\nIn the sea\nI should hold my breath 'til this other person's blood is washing off of me. Down there\nIn the sea\nI should hold my breath 'til this other person's blood is washing over me.\n\n", "album": {"title": "A_Holiday_At_The_Sea_(2003)&&3547", "genre": "", "year": 2003}}, {"title": "A Song For Christine", "href": "A_Song_For_Christine&&283", "artist": {"unique_name": "Anathallo"}, "lyrics": "I resisted coming here, to open the harbors that guard my heart (Jeremiah 23:24).\nAbide with me, fast falls the even tide.\nThis darkness deepens,\nLord with me abide.\nAnd what does not flow freely from\nYou?\nAm I convicted of what I say?\nForgive me of this pride that knows\nYour redemption yet shamelessly walks away.\nAnd now my life ebbs away.\nNight pierces my bones, and these gnawing pains never rest.\nAnd how I long for that day (when I will return to ashes and dust) (Job 30:17-19).\nIf my steps turn from the path, or if my heart has been led by my eyes, or if my hands have been defiled, then may others reap what I have sown (Job 31:7-8).\nBetter that I dwell in the house of the\nLord who upholds all those who fall than reap this harvest of a life waged in the flesh.\nAnd what do I gain but the exchange of the truth for a lie?\nAnd a heart conditioned not to feel, callused by the nature of my pride?\nAnd now my life ebbs away.\n\n", "album": {"title": "Sparrows_(2002)&&5160", "genre": "", "year": 2002}}, {"title": "I Thought In My Heart...", "href": "I_Thought_In_My_Heart...&&3964", "artist": {"unique_name": "Anathallo"}, "lyrics": "Is this called discontent? Like the meaning behind the father's proud and angry stroll into the church with the mother s\nTraggling behind with the child, they both smiled. When they reached for the door they were happy again. Grim faces mope about (they ask), \"How shall we live today?\" They walk back-first through the crowds in rooms, looking only for a faster way to advance and pay, throw the deadliest smiles, such things that will never suffice. Their spirits cry, \"All I want to hear is that I'm ok. But the light burns me.\" To these people I owe my greatest apologies, for I have been made aware of their needs but I'm afraid that I might share His disgrace. In these thoughts the truth is stripped away. Peeled and peeled away.But because of His great love, we are not consumed. His compassions never fail. His mercies are new every morning. Great is Your faithfulness Lord unto me (Leviticus 3:22-23).\n\n", "album": {"title": "Sparrows_(2002)&&5160", "genre": "", "year": 2002}}, {"title": "Just Because You Can't See The Sun Doesn't Mean It's Not Shining", "href": "Just_Because_You_Can%27t_See_The_Sun_Doesn%27t_Mean_It%27s_Not_Shining&&5320", "artist": {"unique_name": "Anathallo"}, "lyrics": "Heavy through my body\nPummeled but hopeful\nTurn my heart toward Your statutes and not toward selfish gain, turn my eyes away from worthless things (Psalm 119:36-37)\nThe still and silent contender speaks words like bullets punch the air, soft yet with weight enough to run me though\nMy soul, wait in silence (Psalm 130:5)\nNow my heart is troubled and what shall I say? Father save me from this hour? No it was for this very reason that I came (John 12:27)\nThe shadows of the valley, light eclipsed and unseen, yet existenteven inside myself\nDo not be afraid only believe\nGlory strength never scathed me like that\nI'm at a loss for even contemplation\nOnly awe and the prospect of distant possibilities\nBut for now, since I cannot see let the Spirit's plea inside my mind (heart) radiate\n\"Father glorify Your name\" (John 12:28)\nBut for now, since I cannot hear (see), let the aching flesh be silent, still, and wait\nAnd I reach my hands underneath the faucet, turned clockwise to its end, and I hold my dirty hands under for a drip\n\n", "album": {"title": "Sparrows_(2002)&&5160", "genre": "", "year": 2002}}, {"title": "Don't Kid Yourself, You Need a Physician", "href": "Don%27t_Kid_Yourself,_You_Need_A_Physician&&8497", "artist": {"unique_name": "Anathallo"}, "lyrics": "For days and weeks I made the parting call.\nI cupped my hands, my mouth in \"O\".\nI shouted saying,\n\"Brothers, hold my fading arms in the air, I am weak!\"\nThey just faded there, my voice was gone.\n\nWho will rescue me from this body,\nNot the arms, the fingers still... yes,\nThey feel what they touch as well,\nCut the cords. Let the ancient Adam go.\nI've been dancing with this corpse for nineteen years.\n\nAnd when I said, \"Who will shave my head, and on the might, reveal me in my skin?\"\nAll the secrets of fitness: all the fitness He requires is to feel your need for Him.\nAnd in my room, in my room, in this gospel I have made,\nSalvation is a broken cistern in a handmade frame.\nI cut the sheets into a flag, paint it red, self-pity hangs over the doorway in.\n\nFrom seven times seventy scraping knees, blood lets, deficiencies,\nThese are the layers of bandages, protection from the sting.\nIn this great lacking, I've found a way.\nAnd when I said, \"Who will shave my head, and on that might reveal me in my skin?\"\nAll the secrets of fitness: all the fitness He requires is to feel your need for Him.\n\nWho will rescue me from this body,\nNot the arms, the fingers still... yes,\nThey feel what they touch as well,\nCut the cords. Let the ancient Adam go.\nI've been dancing with this corpse for nineteen years.\n\n", "album": {"title": "A_Holiday_At_The_Sea_(2003)&&3547", "genre": "", "year": 2003}}]