[{"title": "Greedy Bastards", "href": "Greedy_Bastards&&2636", "artist": {"unique_name": "Antischism"}, "lyrics": "Let not another tree fall in the name of greed\nNot one more tribe \"civilized\" for the lust of money\nNot one more species forced extinct to to fill the pockets of the scum\nWho would turn something so majestic into just another slum\nNo, the greedy bastard will not be satisfied\nUntil every tree has bee cut down and every animal has died\nBefore every inch of forest is covered with concrete\nExtreme measures must be taken so let's fuck up their machines!\nGreedy Bastards\nEvery dozer that we get costs them thousands to replace\nEvery truck that gets fucked up is another loss that they must take\nWhen the logging road is blockaded, the fuckers can't get there\nAnd when the trees have all been spiked the message sent is clear\nBut the spirit of the wilds lives lives on yearning for the day when we rid the land of those\nScheme to lay nature to waste\nGreedy Bastards!\n\n", "album": {"title": "Antischism_(1995)&&5877", "genre": "", "year": 1995}}, {"title": "Foreign Policy", "href": "Foreign_Policy&&6215", "artist": {"unique_name": "Antischism"}, "lyrics": "How many rivers of blood must spill?\nHow many more people killed?\nI'm tired of hearing about politics\nI want to know when the killing will end\nSenseless killing for corporate profit that's their foreign policy\nVile old men in a pentagon office\nLooking at the world through blood-stained glasses\nLining their pockets with human flesh\nBut all their money stinks of death\nSenseless killing for corporate profit that's their foreign policy\nThese criminals are unknown\nYou never hear their names\nThey sit in their offices\nPlaying multinational murder games\nIt's worse than you can imagine\nMillions have already died\nBut there are no laws in this game\nAnd no one pays for their crimes\nEndorsing apartheid in South Africa\nPumping money into the hateful system\nAs the CIA are playing chess games in Central America\nInstigating revolution and then counter-revolution\nWell its as if they had any right\nThe madness it must be stopped\n\n", "album": {"title": "Antischism_(1995)&&5877", "genre": "", "year": 1995}}, {"title": "Where We Stand", "href": "Where_We_Stand&&989", "artist": {"unique_name": "Antischism"}, "lyrics": "Once again they stick their \"morals\" where they don't belong\nOnce again we must rise up a fight their sexist cause\nUsing their twisted faith as the basis for their\nWoman-hate they call themselves pro life ha.\nIt's time we set the record straight\nTheir name is sick mockery of the women who would die\nThousands every year to the hanger or the knife\nThey call abortion murder but what is their alternative?\nThe same fucking murder they claim to condemn\nSo let's bring out the truth behind their hypocrisy\nAnd what lies beneath the surface of their so called morality\nIs the religion they keep trying to force down our throats\nWith all its sexist values and all its gender roles\n\nIt makes them sick to see a woman in control of her own life\nIn control of her own body and her reproductive rights\nBut that is freedom something they would not understand\nSo we must raise our voice all those pro-choice and show them were we stand.\n\n", "album": {"title": "Antischism_(1995)&&5877", "genre": "", "year": 1995}}, {"title": "Take Your City Back", "href": "Take_Your_City_Back&&2541", "artist": {"unique_name": "Antischism"}, "lyrics": "Rope off another section of the city for the upper class then make another slum -\nA place to throw your human trash.\nSeparate the blacks and whites, the rich from the poor.\nCreate the crime epidemic then sell people locks for their doors.\nSo no more stabbing each other in the back,\nStand together and take your city back, take to the streets.\nWe have the numbers, unity is all we lack,\nWork together and take the city back\nThat they infiltrated, segregated and took all that we had!\nTurned communities into battle zones and then built skyscrapers like giant tombstones.\nTurned communities into battle zones and then built skyscrapers like giant tombstones\nWell, I think we've had enough of that, so stand together and take it all back.\nTake to the streets and take your city back!\nWe have got to learn to recognize the real enemy\nBecause when the poor fight one another over color what is achieved?\nWhen we divide they conquer and up goes another condo-plex,\nAnd unless we stop them now there won't be nothing left (but poverty and homelessness).\nSo no more stabbing each other in the back, stand together and take your city back,\nTake to the streets. We have the numbers,\nUnity is all we lack, work together and take the city back\nThat they infiltrated, gentrified. But this time we fight back!\n\n", "album": {"title": "Antischism_(1995)&&5877", "genre": "", "year": 1995}}, {"title": "Flesh Of Another", "href": "Flesh_Of_Another&&9491", "artist": {"unique_name": "Antischism"}, "lyrics": "Am I wrong to call you a killer? \nThen what's that meat laying on your plate?\nWas that not once a living creature slaughtered to satisfy your crave?\nOr is murder a word that you interpret as you see fit?\nWas that meat not once alive until you paid someone to kill it?\n\nAre there no alternatives to useless animal slaughter?\nYou choose to ignore them, like you ignore you conscience.\n\nCan't say you care about people, can't say you care about anything,\nWhat do you think you're doing? Pumping money into the meat industry?\nEvery single dollar, is a nail in a coffin.\nYou pay for starvation of entire populations.\n\nYou say \"Other animals do it, therefore it's perfectly natural\"\nTake a tour of a slaughterhouse, tell me how you feel, once you see that it's a living hell.\nThe useless waste of precious life is anything but natural.\nIf you are the consumer, You're a killer.\nYou are the consumer, admit yourself a killer.\nIf you are the consumer, You're a killer.\nIf you are the consumer, You're a killer.\n\n", "album": {"title": "Antischism_(1995)&&5877", "genre": "", "year": 1995}}, {"title": "Salvation or Annihilation", "href": "Salvation_Or_Annihilation&&9273", "artist": {"unique_name": "Antischism"}, "lyrics": "Unless we act right now there will be no tomorrow\nThis is only one example of government inflicted sorrow\nStand up and be counted because every voice is crucial\nWe have to stop the arms race, our governments refuse to\n\nWe have to act right now it's a matter of life or death\nWe must break down their wall if we want to breathe another breath\nOur future is at stake if we let them keep control\nWe can build a human ladder and get out of their fucking hole\n\nSalvation or annihilation, the choice is up to you and me\nGenocide is now a threat, and soon to be a reality\nIt takes but two sticks to create a spark, imagine the spark of millions\nA million hands joined in love to save us from the killing\n\nSalvation or annihilation the choice is up to me and you\nWe face the threat of genocide and our leaders won't pull us through\nDisarmament is a giant step for love and peace and anarchy\nThe choice is up to you now, we know where that path leads\n\n", "album": {"title": "Antischism_(1995)&&5877", "genre": "", "year": 1995}}, {"title": "Path Of Destruction", "href": "Path_Of_Destruction&&338", "artist": {"unique_name": "Antischism"}, "lyrics": "Are you proud to be a part of the force that tears life's fabric apart?\nDo you feel no remorse at your little role?\nDoes a fear rest within at what time has in store for the ones who left\nTheir roots behind and turned on the forces that gave them life?\nA dischord has been created within Mother Earth,\nIn time to be exterminated as the laws of nature bring justice forth.\n\nPath of Destruction\nPath of Destruction\nPath of Destruction\nPath Of Destruction\n\nWith our gift of the intelligent mind, we misuse the power\nUse it as a knife that cuts the schism and bleeds the essence - life.\nBut with it too we will eventually die.\nAnd for what? What is the purpose? Can it really be worth the consequences?\nAnd for what? Tell me what is the purpose of our selfish indulgence?\nTurn away from the path of destruction.\nIf there is a minute left for change we must then turn away from the path of destruction.\nIf there is a minute left for change then we must try!\nPath of destruction.\nThe price is paid - irreversible decay.\nMankind's stain wiped away so that life can remain.\nPayment for our crimes - witness the decline.\nJust a matter of time.\nThe experiment has failed!\nSomewhere down the back road behind the barbed wire,\nHidden by trees it chokes,\nA vile beast of smokestacks and fire.\nMass producing our chemical dependency then killing the junkies ever so slowly.\nBut for the masses our of sight is out of mind,\nBut several miles downstream that's where you will find...\nPath of destruction.\n\n", "album": {"title": "Antischism_(1995)&&5877", "genre": "", "year": 1995}}, {"title": "No Hope", "href": "No_Hope&&939", "artist": {"unique_name": "Antischism"}, "lyrics": "I fear to lose all sympathy for the human race\nSo sick of making excuse for an obvious disgrace\nThis is a race that murders beauty and puts filth atop it's grave\nAnd though I was born the same I sit ultimately ashamed\nAnd I would so gladly love to shed this cursed skin\nGive all this up for the chance to start again as anything but human\nSo deep lies my disgust, so strong my venom.\nYes, there was a time when I fought with hope\nOnly to find that mere hope was a rope\nA quick painless death, their cure for my hate leaving me safe and sedate\nBut soon enough you realize, it just don't work that way\nYou can hope all you like but harmless you shall stay\nMere hope is harmless, Turn it to rage!\nAnd with just this change of tactics, from harmless hope to lethal action,\nYou set the wheels in motion and begin to feel a sense of satisfaction\nWatching the buildings burn, and when you can see fear in their eyes\nAnd though the stooges of the state will call you \"terrorist\",\nYou'll know what you've done is just and right\nThen they will say you must hate people, look at all the damage done\nLabel you a freak or fanatic, and they won't be entirely wrong\nBut no you don't hate people, just what they have become\nMindless greedy Mother fuckers, I can't bring myself to sympathy for such scum\nSo no more of your lip service . There is no more room left on the fence\nYou can't straddle it forever, are you with us or are you with them?\nAnd in the end this is the choice we are left with,\nAnd I for one will go along with those who fight the institutions of destruction\nFor our ultimate liberation, because I know it's right\nJoin us! Join Us! With strength who then could stop us? With strength who then could stop us now?\n\n", "album": {"title": "Antischism_(1995)&&5877", "genre": "", "year": 1995}}, {"title": "Scream", "href": "Scream&&7822", "artist": {"unique_name": "Antischism"}, "lyrics": "Locked up inside of cages took so many years\nAll the voices wispering, held up my fear\nBound up in chains, doin' what their told\nWanting to escape from feeling so all alone\n\nScream!\n\nI have stopped from your scream\nI have stopped to be seen\n?\n?\nStick together we have won\nWe never stop what we've begun\nWe have gone to take your dream\nWe will make it a reality\n\nLocked up inside of cages took so many years\nAll the voices wispering, held up my fear\nBound up in chains, doin' what their told\nWanting to escape from feeling so all alone\n\nScream!\n\nI have stopped from your scream\nI have stopped to be seen\n?\n?\nStick together we have won\nWe never stop what we've begun\nWe have gone to take your dream\nWe will make it a reality\n\nFighting in a world with so much hate\nYou try to stop but it seems to late\nTo late to rise above you rise above your lies and hatered\n\nCan you hear the crying?\nCan you hear the screams?\nCan you hear see the fighting?\nIt's not ass bad as it seems\n\n\nCan you hear the crying?\nCan you hear the screams?\nCan you hear see the fighting?\nIt's not ass bad as it seems\n\nFighting in a world with so much hate\nYou try to stop but it seems to late\nTo late to rise above you rise above your lies and hatered\n\nCan you hear the crying?\nCan you hear the screams?\nCan you hear see the fighting?\nIt's not ass bad as it seems\n\n", "album": {"title": "Antischism_(1995)&&5877", "genre": "", "year": 1995}}, {"title": "Mothers", "href": "Mothers&&5500", "artist": {"unique_name": "Antischism"}, "lyrics": "Mothers, don't believe their lies\nDon't let them get their hands inside your mind\nOpen your eyes see through their lies or\nThey'll take your children and waste their young lives\nIn a tailor made grave, lost and forgotten in a land far away\nAnd you'll feel no remorse because there are letters in your drawer\nReminding you of what he was fighting for\nWhat was it again? Oh, yes, of course!\nFor his country.For God. For Democracy.\nFor his country, for god, for Democracy and the economy\nYou're allowed to cry but don't ever ask why\nJust remember there's no better reason to die\nSo don't read the books, don't watch TV\nThe fairy tale has got a grim reality\nIt's a very sad story, all guts no glory\nWho takes pride in a wasted life [2X]\nSo I tell you don't listen to those who kill your children\n\n", "album": {"title": "Antischism_(1995)&&5877", "genre": "", "year": 1995}}, {"title": "Freedom At Last", "href": "Freedom_At_Last&&4970", "artist": {"unique_name": "Antischism"}, "lyrics": "In the face of desperation, the scattered voices of many are heard by none\nAnd we have long since passed the point when something must be done\nSo feel the hope within this movement, now feel your own strength\nThere is motivation in urgency, the power of change to break traditions chains\nTo put past what brings us pain, to no longer feel the shame\nThe battle has begun, the battle lines been drawn\nAnarchy and peace is what we want, so who's side are you on?\nIn every city of every country the voiceless few are so many, and just like you and me\nThey are waiting to demand a peace, a movement rising, so feel the hope within this movement\nFeel your own strength!\nThere is motivation in urgency, the power of change to break traditions chains\nTo put past what brings us pain, to no longer feel the shame\nThe battle has begun, the battle lines been drawn\nAnarchy and peace is what we want, so who's side are you on?\nThere's a statement made in everything you do so never dismiss the power for change within you\nIt cannot be stopped by guns if we stand true. Their guns are useless. Our weapon is truth.\nWe are the \"system\", the system is just people, form governments to corporations\nIt still comes down to individuals. There is no system without participation,\nIf You change within, then we win. That is my solution, that's the revolution.\nNo bloody confrontations, just humanity's realization\nThat the truth behind the evils of the system\nThat we created them so we may therefore reject them.\n\n", "album": {"title": "Antischism_(1995)&&5877", "genre": "", "year": 1995}}]