[{"title": "Background Music To Her Awakening", "href": "Background_Music_To_Her_Awakening&&7929", "artist": {"unique_name": "August_Burns_Red"}, "lyrics": "Then all silence is removed from the last room with the cord ripped from the phone.\nWhat if she's asleep?\nShe remains asleep.\nWhy won't she wake?\nIn the background I can hear the trumpets singing their song so powerful, so elegant.\nThis is what scares me the most.\nIf I can't have her, who is there to carry her love across oceans?\nShe used to remind me that all is not lost,\nAs long as what you failed doing was something worth more than just your arrogant pride.\nThis is true my girl.\nThis is true.\nI will always keep that in my mind, to open it.\nTo be reborn is to define the intent of finding bliss in tragedy.\nI'm in your debt.\n\n", "album": {"title": "Looks_Fragile_After_All_(2004)&&7011", "genre": "Metalcore", "year": 2004}}, {"title": "Accidental Shot Heard 'Round The World", "href": "Accidental_Shot_Heard_%27Round_The_World&&5389", "artist": {"unique_name": "August_Burns_Red"}, "lyrics": "Currently holding that tongue\nLet's just see what happens\nSky is red tonight\nIt moves streaming with rain that beats the pavement\nHow does it sound against the church roof or its bells?\nIt probably echoes\nSanctuary meets comforting\nThe mother sews as the father searches for his gun\nShots hurt my ears\nI'll bite my lip to take in the deafening\nShots hurt my ears\nI'll shut my eyes to remember the symphonies\nI'm surprised to find him running in the rain\nIt's too dangerous\nRisking the chance that bullets would fly\nWith their purpose straight to the life\nAll too many simple mistakes disguising innocence\nTension builds in every nerve\nI'm tired of falling short in understanding what it all meant,\nOr what it's supposed to mean\nI was relieved to see your face when I woke,\nBefore the last accidental shot\nBrought my father to his knees, face in his hands.\nIt felt good to be saved in some way\n\n", "album": {"title": "Looks_Fragile_After_All_(2004)&&7011", "genre": "Metalcore", "year": 2004}}, {"title": "Glory Thrives", "href": "Glory_Thrives&&4362", "artist": {"unique_name": "August_Burns_Red"}, "lyrics": "Blooming into a fight for glory, we will rise above.\nWe will rise above all else.\nThe glory for us.\nBut in the beginning we've dug this endless hole.\nHere we are, and I know we will have to work together.\nAnd in the beginning we've kept our redemption back.\nHere we are.\nI know we'll take the strife by its throat,\nIn order to free each other from what we've fallen for in the first place.\nLet's go.\nHere we come to dream of progress,\nAnd to rationalize our actions to make sense\nFor those who ignore the price they pay for cheating us.\nRemember that we become those who we die for,\nCarrying their guilt on our shoulders,\nOnly having a life lost in the heat of innocent bravery.\nWe are our loved ones heroes, and they won't even notice.\nThey can't.\nThat's the beauty of it, I guess.\n\n", "album": {"title": "Looks_Fragile_After_All_(2004)&&7011", "genre": "Metalcore", "year": 2004}}, {"title": "Missing This Opportunity", "href": "Missing_This_Opportunity&&7831", "artist": {"unique_name": "August_Burns_Red"}, "lyrics": "Time and time again, will his knowledge lead his aggression?\nYou insist on bringing home a broken child, just like you.\nIs this failure what you're grinning at?\nDon't shut the curtain.\nDon't block the view of precious portraits sending signals of grace.\nIt's the only thing left standing in the light.\nI've got nothing else, but your fire hasn't gone out just yet.\nIs this the best of what you are?\nWell it remains subtle, remains silent.\nI'll bring it.\nI'll show them.\nUnleashed in a second, I'll catch them off guard.\nIt hurts to say that I'm at a loss for words, but you've brought this on yourself.\nSeems to feel better when taking a step outside.\nThe wind will carry my thoughts much easier.\nDon't be so blind.\nJust stop and look around to what you're missing these opportunities.\nThere could be something nice to say to you.\nMaybe the next time we meet,\nYou will be smarter in choosing your place in this world for a promising purpose.\n\n", "album": {"title": "Looks_Fragile_After_All_(2004)&&7011", "genre": "Metalcore", "year": 2004}}]