[{"title": "25 Years", "href": "25_Years&&3435", "artist": {"unique_name": "Avail"}, "lyrics": "My mother said things are fine and turned the other way my troubles she said go way back far before your day but things are all right she said it's all right you could see it on her face her days of praise had gone astray and moved on to another place\n\nMy father threw up his arms in a cold aggressive rage I've been fightin my conscience years now every single day we live alone now but no one is to blame his days away go unexplained things will never be the same\n\nWhat's there to pray about? letting go is not so simple what's there to pray about? I should have picked another hero\n\n", "album": {"title": "Dixie_(1994)&&8707", "genre": "", "year": 1994}}, {"title": "Simple Song", "href": "Simple_Song&&7597", "artist": {"unique_name": "Avail"}, "lyrics": "Going over in my head\nWhat seems like everything\nRemembering commitments\nThat nowadays just blend\nI don't know where I'm going\nAnd I don't think that I care\nI had my taste wound up misplaced\nBounced off those troubles clear\n\nDid I trip myself up again?\nDid I see more than you did?\nDid I trip myself up again?\nDid I see more than you did?\n\nDecisions made without reguard I knew returning as regret\nThey could but thought they would\nCome crashing with success\nThey know nothing about me\nAnd I really doubt they care\nBut that's all right cause by myself\nI do fine anywhere\n\nDid I trip myself up again?\nDid I see more than you did?\nDid I trip myself up again?\nDid I see more than you did?\n\nIt seems like I shouldn't have pushed it\nHid myself and lost focus for a change\nShouldn't have made myself committed\nI got to know that one by now\nI'm better off without\n\n", "album": {"title": "Live_At_The_Bottom_Of_The_Hill_In_San_Francisco_(1998)&&4374", "genre": "", "year": 1998}}, {"title": "C. Days", "href": "C._Days&&4520", "artist": {"unique_name": "Avail"}, "lyrics": "One thousand lines \nI've been the one to change in time \nBelieve this \nI lost feeling \nLost feeling \nDon't question \nThat we've seen cloudy days \nAnd been blind by sunset \nAnd all that's been proved \nIs I still can't trust you, regret \nI lost feeling \nLost feeling \nDon't question\nYes, we've seen cloudy days\nAnd been blind by sunset\n\nThis morning I felt like I would break \nFrom mistakes I never made \nBut I won't suffer \nFor anyone anymore \nTonight was dark as sin \nIt's as if nothing's changed \n\nBe straight up \nWhat would be light?\nWhat would be light?\nBe straight up\nWhat would be light?\nWhat would be light?\n\nYes, I've been in for days \nI'm still blind by sunset \n\nThis morning I felt like I would break \nFrom mistakes I never made \nBut I won't suffer \nFor anyone anymore \nTonight was dark as sin \nIt's as if nothing's changed \n\nBe straight up \nWhat would be light?\nWhat would be light?\nBe straight up\nWhat would be light?\nWhat would be light?\n\nDon't question\nDon't question\nDon't question\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Fast One", "href": "Fast_One&&2693", "artist": {"unique_name": "Avail"}, "lyrics": "Fast one\nA need to isolate like leaves that won't fall communal theft it's moving down it's colored reston brown planned in shadows suburban sprawl, cultureless, shameless, pull me back I don't think I've ever seen a forest with so few trees where roots are paved not praised it's not safe where status is based on possession the culdesac built on hollow ground is lonely now stand in shadows where families aren't friends and marriage is bondless pull me back, I don't think i\"ve ever seen a forest with so few trees where roots are paved not praised it's not safe looking back on all I've touched and seen what's been left ingrained to lack identitty remains will grow and if you reach you fail to embrace that I will challenge you and your impatience a need to repeat and take without need white flight it's now soaring now and it's looking down cast no shadows, pure despair poverty is ruthless\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "West Wye", "href": "West_Wye&&8071", "artist": {"unique_name": "Avail"}, "lyrics": "Sidetracked conveniently five steps from the mainline\nFresh off a grain porch drinking swill\nDown from picking up in maine\nCounting change\n\"Oh how i, I would do anything for that old junktrain to turn manifest\nAnd highball, yeah I'd sing that railroad song by the time the sun is setting\nIn the west\"\nNo time or purpose as embers smolder\nHoled up in pines of green\nPablo writes \"dos\" where mouths don't share what their eyes have seen\n\"See those days are gone and I can't stand one more\nI've fought this war counting miles alone\nI've seen it all, every goddamn state\nOut here son it's as rough as I have known\"\nAll I have known with sky above as home\nAnd ground beneath as bed is to ride fast\nLive slow and without regret\n\"I've got no time for regret\nThose thoughts solve nothing in the end\nI've got blistered hands\nAnd lived full through rejection\nLong endured\n'Cause I came up poor\n\"Hell no i, I wouldn't change a thing, those old junktrains all turn manifest\nAnd highball, yeah I'll sing that railroad song by the time\nThe sun is setting in the west\"\n\n", "album": {"title": "Front_Porch_Stories_(2002)&&2963", "genre": "", "year": 2002}}, {"title": "The Falls", "href": "The_Falls&&6862", "artist": {"unique_name": "Avail"}, "lyrics": "To all the years full of front porch stories\nFailed plans and procrastination\nTo r.a.g.n. sowing what others may implore\nI've been broke and forlorn and caught out with the best at acca yard\nOh it just goes to show, to desert friends like these streets\nI would be crazy\nTo all the years full of backyard parties\nWinters in hibernation\nTo assaulting views with dominion at our door\nHealing but scarred\nThere's bullet holes in a porch in jackson ward\nOh it just goes to show, to desert friends like these streets\nI would be crazy\nIt goes to show, to dessert friends like these streets\nI would be crazy\nI sat back to consider what has been within a decade counted\nShould I fly? should I settle?\nWill I find peace in time, in the face of growing old?\nTo all the years full of untold stories\nFutures free of isolation\nTo all those gone who in thought and heart live on\nOn and on you never gave up and I got this far\nOh it just goes to show, with friends like these to leave\nI would be crazy\nIt goes to show, with friends like these to leave\nI would be crazy\n\n", "album": {"title": "Front_Porch_Stories_(2002)&&2963", "genre": "", "year": 2002}}, {"title": "Leveled", "href": "Leveled&&7249", "artist": {"unique_name": "Avail"}, "lyrics": "There's something I've been meaning to say\nI know that time's up and they're lined up, new breath-new scent, new union-dependence\nI've been meaning to ask you:'Have you learned from the days gone past?'\n'Cause I'm far from confused, waiting to conclude, you have been my last.\nBlack mountain retreat-truly beat- no breath-no sense- no union- independence\nIt's a bitter taste, this far from sane, but the rails still click\nAnd at the river the air is thick, and I still despise greed, you're right about me, I follow my conscience, fight what I see as wrong... friends have come but gone... you still mean the world to me as you move along\nThere's something I've been meaning to say\nI'm gonna miss you, I'm gonna miss you, you aged me well... it may not mean much with cold dry eyes. I tried.\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Ask", "href": "Ask&&6755", "artist": {"unique_name": "Avail"}, "lyrics": "Still trying to understand Why after all this time I never got a reason Abrupt ending with A blank stare and a \"I don't care\" Cry for help got A definite answer A turned back like I expected from Someone else \n\nIf I plan to remain This way for eternity Then I must admit That I've got it made \n\nStill trying to understand If I'd explained my thoughts On commitment Would I still pass Your thoughts infrequently? Although disowned Erased and alone With a word you'd Hear my voice pretending \n\nThat I'm finally content With what I've got The same with time rule Worked out just fine \n\nI forgot to \n\nThank you for always Boosting my self esteem Sometimes lies are easy to believe Don't hang on too tightly I may be short of breath But I'm not easy to deceive\n\n", "album": {"title": "Over_The_James_(1998)&&5207", "genre": "", "year": 1998}}, {"title": "Connection", "href": "Connection&&4648", "artist": {"unique_name": "Avail"}, "lyrics": "No one turned your Rally of peace into A state of violence Inside I hear the screams Of the strongest on their knees I took a look - I stepped back Disappointment pulled me down Locks of skin outside Boredom lures them into this set Let's walk away - no not a chance We pause and linger not alone \n\nRandom Plunging people pushing presence To my face I heard about it 100 times When the act caught my sight I plugged my ear to dull the sound But curiosity let me see Why I looked I still don't know But now vision that runs my head \n\nWhy are we overwhelmed By rules today?\n\n", "album": {"title": "V.M._Live_(1999)&&4735", "genre": "", "year": 1999}}, {"title": "Now", "href": "Now&&6543", "artist": {"unique_name": "Avail"}, "lyrics": "When's better than now\nWhen's better than now\nTo come with nothing and deny you\nWhen's better than now\nWhen's better than now\nTo not believe \nA thing you say\nI've restrained \nBut it can't go down this way\nEyes that lie \nHide\n\nBurning time \nBurning time and blaming memory\nTo return back to a comfort\nIn an attempt to feel complete\nThan tokenize\nWith lying eyes as if to care\nAnd it's a shock that you leave calmly\nAs fast as you appear\n\nWhen's better than now\nWhen's better than now\nTo come with nothing and deny you\nWhen's better than now\nWhen's better than now\nTo take the blame \nUnscathed \nAnd remain estranged \nI can walk straight \nEstranged\nWith blinders bound\nTime\n\nBurning time \nBurning time and blaming memory\nOh I won't let myself be troubled\nOr deny I'm part guilty\nThe road will rise\nBlackened skies in time will clear\nThough it's a shock now to the body\nTo be without you near\n\n", "album": {"title": "Front_Porch_Stories_(2002)&&2963", "genre": "", "year": 2002}}, {"title": "S.R.O.", "href": "S.R.O.&&6281", "artist": {"unique_name": "Avail"}, "lyrics": "What difference does it really make When your head's at the foot of the bed? Close the lid tight remain out of sight Easy escape numb the senses\n\nEveryone around is such an expert On who is who and what they do I could give a fuck about small talk Discussions in fact I'd rather be alone And do without companionship for now Block out and walk out unseen Keep far away thean come clean\n\nI thought I heard someone say That if the bottle falls but doesn't break Feel blessed it all stayed inside Unopen beats spilling\n\nBored to death with hearing second hand Who's grown roots who's on the move Can't seem to avoid small talk discussions Is it safe to be unknown? Who's in, what's out, can't keep up Keep up, look good, be seen Label a trend with no meaning\n\n", "album": {"title": "Over_The_James_(1998)&&5207", "genre": "", "year": 1998}}, {"title": "Song", "href": "Song&&7124", "artist": {"unique_name": "Avail"}, "lyrics": "Do you remember when we met I was so intrigued you were so intrigued we spent our time telling our sides of our excitement of insecurities\n\nMoving far away\n\nAnd from that moment on we were inseparable a vivid image of ecstasy it's been a long time and things I see well they remind me they take me to that age\n\nMoving far away moving far away in time\n\nBut everyday that goes by your further from my mind try to remember\n\nLies\n\nI know I treasure things to much instead of pushing them aside still I tell lies try to turn around and face it\n\n", "album": {"title": "Dixie_(1994)&&8707", "genre": "", "year": 1994}}, {"title": "Tuning", "href": "Tuning&&4866", "artist": {"unique_name": "Avail"}, "lyrics": "Walking by myself I took a look around I think I misunderstood the magic of this town it's time to recognize that I should let it go it doesn't look like it did it doesn't feel like it should I keep waiting for something don't know how long I'll last sometimes I think it could be my turn to detach can't find the strength to decide where I should go I don't think like I did I don't feel like I should\n\nI saw familiar faces far from those I knew so well couldn't think of much to say didn't know how I felt\n\nSo I put them behind me and I let them go they didn't look like they did they didn't feel like they should\n\n", "album": {"title": "Live_At_The_Bottom_Of_The_Hill_In_San_Francisco_(1998)&&4374", "genre": "", "year": 1998}}, {"title": "Fix", "href": "Fix&&3286", "artist": {"unique_name": "Avail"}, "lyrics": "Well it's come undone\nLooks like I'll have to fake it\nSeems like I do that anyway\nAdmit to no control\nI thought with time I'd get better\nI am temporary\nAlthough I said\nI wouldn't waste the time\nI went and did it anyway\nWhether or not I said I saw it coming\nI set myself up again\nEven split of words and actions\nThat's not mine to depend\nStash the evidence\nSo it will be forgotten\nI can't forget it anyway\nTry to defuse\nBut I've been trying that forever\nI am temporary\nI thought with time I'd get better\n\n", "album": {"title": "Live_At_The_Bottom_Of_The_Hill_In_San_Francisco_(1998)&&4374", "genre": "", "year": 1998}}, {"title": "Leather", "href": "Leather&&6443", "artist": {"unique_name": "Avail"}, "lyrics": "I can't say another word I fed these lies they're poison breathing I don't know what's left remaining as I continue looking through cracked windows I'm nothing lie to my face be proud and full of praise I can't find a place to hide I shut my eyes they're sore and bleeding I don't know what's left worth seeing I don't know what's left worth seeing no, I don't want sympathy so don't sit with me face doubled 'cause I'm still waiting to see this falling down yes I'm still waiting to be beat down flat I won't look back I am still falling down\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Order", "href": "Order&&5381", "artist": {"unique_name": "Avail"}, "lyrics": "Not impressed\nWith who knows who\nAnd it never really\nMatters if you win or lose\nPassively reject\nLet the rats race on\nStand sound until they are gone\nHave you rejected what you learned?\nIs your resistance all that they've heard?\nBurn that phase and then burn it again ignore the emphasis\nOn competition\nYou protect you\nThere's no no\nKeeping score\nFight the past\nIt's you that you ignored\nTurn away\nWhat's become of us?\nHas your persistence been ignored?\n\n", "album": {"title": "Live_At_The_Bottom_Of_The_Hill_In_San_Francisco_(1998)&&4374", "genre": "", "year": 1998}}, {"title": "Done Reckoning", "href": "Done_Reckoning&&2020", "artist": {"unique_name": "Avail"}, "lyrics": "Please, please don't disappear\nI'm clearly unprepared and aloof\nAnd trained to walk without\nThough I can trace the steps we've made clearly\nSo what is real?\nWe either break it or stay concealed\nDon't lack incentive\nDon't let me crowd your space\nIf you'll do the same I'll slow to match your pace\nPlease don't disappear\nI know in absence perspectives clear, but don't move\nFeel safe to think out loud\nAnd I'll do the same when passing town through town\nSo what is real?\nWe either break it or stay concealed\nDon't lack incentive\nDon't let me crowd your space\nIf you'll do the same I'll slow to match your lead\nMatch your lead\nPlease, please don't disappear\nI'm clearly unprepared and aloof\nAnd far behind in count\nThough I can trace the steps we've made clearly\n\n", "album": {"title": "Front_Porch_Stories_(2002)&&2963", "genre": "", "year": 2002}}, {"title": "Fall Apart", "href": "Fall_Apart&&5761", "artist": {"unique_name": "Avail"}, "lyrics": "I look back now Faded memory I could never Be free I held back now And paid dearly I could never Be free Started running And just kept running \n\nGot hit from the fall Now I don't want To feel this way again Should have let go Long ago Try to look back now But I don't want to See the way I've been Don't know where to start\n\n", "album": {"title": "Over_The_James_(1998)&&5207", "genre": "", "year": 1998}}, {"title": "Tuesday", "href": "Tuesday&&8233", "artist": {"unique_name": "Avail"}, "lyrics": "Been looking from outside\nI've been watching\nBut I don't know what to say\nChanged the old backdrop\nSame face\nBut not who it used to be\nTrying to get our not out getting\nThinking, you're everything you said\nYou wouldn't be\nTime out, I see right through\nYou're running around again\nI'm around\nAnd still confused in an instant\nCan't quite relate\nAnd I don't know what to say\nAll of the bonds I see\nThat I'm not part of\nIt's not how it used to be\nYou're running around again\nI'm around\nAnd I've been cracking on the inside\nIt gets worse each day\nAnd I don't know what to say\nKeeping my distance\nBut still I see\nIt's not how it used to be\nBushing the time in a daze\nWondering how it got this way\nTime out, I've gotta ask it\nAm I on my own?\nTruth\nNumbed by feelings\nTruth\n\n", "album": {"title": "4_AM_Friday_(1996)&&2976", "genre": "", "year": 1996}}, {"title": "Virus", "href": "Virus&&8168", "artist": {"unique_name": "Avail"}, "lyrics": "You built a garden to watch it rot you could get blood from stone if you want but for you to be infectious maybe not the needle got me and I'll bleed on you either way\n\nIt doesn't matter which way you face somehow I'm always gonna be in your way cut from me spend on defense that's genocide\n\nI'll find myself a hammer now and construct a box the size of myself and when the time is right they will bring me down and lay me there on your ground\n\n\"A disease maintained by... crimingal neglect so enormous that it amounts in genocide\"\n\n", "album": {"title": "Live_At_The_Bottom_Of_The_Hill_In_San_Francisco_(1998)&&4374", "genre": "", "year": 1998}}, {"title": "Monuments", "href": "Monuments&&4954", "artist": {"unique_name": "Avail"}, "lyrics": "No more explanations accept that your lifestyle\nIs like climbing upstairs to reach a basement\nWhile you were searching for mirrors\nTo find a place to stare\nYour ideology lost it's step\nIt's not based on reality\nYou stepped on the wrong train\nAnd you became who\nYou would ordinarily shame\nFace it\nWhen you want to run I'd rather crawl\nGod forbid you change on my account\nLike I said before\nI won't lend my words to prosperity\nI know we all change\nBut your rhetoric is extraordinarily tame\nIf time can change you\nTo feel profound\nAbout counting value\nBetter you\nYes better you than me\nFace it\nNo more explanations accept that your lifestyle\nIs like climbing upstairs to reach a basement\nWhile you ewre searching for mirrors\nTo find a place to stare\nYour ideology lost it's step\nIt's not based on reality\nI know we all change\nBut your rhetoric is extraordinarily tame\nIf time can change you\nTo feel profound\nAbout counting value\nBetter you\nYes better you than me\nFact it\nSlow down\n\n", "album": {"title": "Front_Porch_Stories_(2002)&&2963", "genre": "", "year": 2002}}, {"title": "Treading On Heels", "href": "Treading_On_Heels&&1343", "artist": {"unique_name": "Avail"}, "lyrics": "What you are\n\nI'm not your apprentice don't lead the way I could care less of your identity my first impressions did not impress your insecurities come across as confidence it seems convenient to let others think for you\n\nWhen your tired and your down can you find somewhere to be that you call your own? try and learn about yourself then we can have revolution\n\nMy first impressions did not impress your insecurities come across as confidence could it be a front concealment for acceptance\n\nSo far you've show me little to believe so far have you seen what you expected to see\n\n", "album": {"title": "Dixie_(1994)&&8707", "genre": "", "year": 1994}}, {"title": "Taken", "href": "Taken&&3565", "artist": {"unique_name": "Avail"}, "lyrics": "Been trying all night\nTo make you listen\nSay you know me now\nI don't know myself\nA fight an hour\nThe lust of power\nI won't play the part\nOf deeply scarred\n\n'Cause I don't think I will be back again\nYour words don't bring content\nYou've said them so blindly as I have bled\nAnd despise all that you've said\n\nI've got a new thing\nI've got a new thing\nI've got a new thing\n\nI'm over listening\nI call it quits\n\nAnd I don't think I will be back again\nYour words don't bring content\nYou've said them so blindly as I have bled\nAnd despise what you've said\n\nHave you ever been kicked when you're already down?\nYou see it come\nBut you dare not make a sound\nRemain standing\nAnd put a foot to the face that\nDid the pushing and then pass\nIf silence is gained\nIt's overwhelming\n\nI don't think I will be back again\nYour words don't bring content\nYou've said them so blindly as I have bled\nAnd despise all that you've said\n\nHave you ever been kicked when you're already down?\nYou see it come\nBut you dare not make a sound\nHave you ever been kicked when you're already down?\nYou see it come\nBut you dare not make a sound\nRemain standing\n\nYou have taken a piece of me\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Union", "href": "Union&&560", "artist": {"unique_name": "Avail"}, "lyrics": "Damn it's you again how am I supposedly supposed to interpret thhis wihtout feeling guilty a homes not comdemned until it's fallen or stolen by locks and keys it's 3 am I'm locked out left to freeze on steps just feet from light and heat we walk the same block fave offs both good and bad a time bomb strapped on your back you can't see straight it's 3 am and without damn it's you again I saw you and you saw me conscience I neglected to mention I'm hell bend on dissention I've fought for you\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Armchair", "href": "Armchair&&714", "artist": {"unique_name": "Avail"}, "lyrics": "To defend or to stay out\nIt's not a question of who is right\nDebate left no impact\nAnd still never solved the question\nOf who to fight\nBut what has talking done\nWhen actions go unplanned\nDiscussions changing nothing\nMarching with feet tied\nCentered on self\nFalling behind\nWhen focusing on pride\nPride lies it screams so loud\nBut it never says a thing\nBut one's controlling the crowd\nSit and stare\nListen but please don't care\n\n", "album": {"title": "4_AM_Friday_(1996)&&2976", "genre": "", "year": 1996}}, {"title": "Nickel Bridge", "href": "Nickel_Bridge&&2408", "artist": {"unique_name": "Avail"}, "lyrics": "Believe what you want Without checking it (It's not right) We don't agree at all (Got a lot to learn) I'll run so far I Won't hear a word And won't regret it I'm not concerned \n\nI'm holding onto something That I lost and could never find I'm moving on now So I can see what I am Leaving behind \n\nAnd if rejection is what You fear I'm being heard All wrong isolate To think straight To find meaning Not withdrawn \n\nTwo snakes of poison Which one do you Call friend? Two snakes of poison Got bit by both In the end \n\nWhen judged by past Not present it's all Just talking When judged by past It's forgotten that Everyone changes\n\n", "album": {"title": "Over_The_James_(1998)&&5207", "genre": "", "year": 1998}}, {"title": "East On Main", "href": "East_On_Main&&1637", "artist": {"unique_name": "Avail"}, "lyrics": "So it's back to town again where all my friends fear they've got no friends\nThe walls are painted and stenciled\nIt reads \"no more prisons\" on sidewalks bare\nUp to reach a crest\nWith each footstep\nWithout arrogance\nOh I've encountered you a time or two now\nAnd you could use some rest but you don't know how\nIf they could see what you believe\nThey'd be like you instantly\nSo it's back to the porch again where all my friends drink till darkness ends\nAnd pass the labor pool potentials\nThey read \"homes not jails\" on boarded shells\nUp to reach a crest\nWith each footstep\nWithout arrogance\nOh I've encountered you a time or two now\nAnd you could use some rest but you don't know how\nIf they could see what you believe\nThey'd be like you instantly\nAlthough this town may prove\nTo change slow your ways still\nMatter the same\n\n", "album": {"title": "Front_Porch_Stories_(2002)&&2963", "genre": "", "year": 2002}}, {"title": "Sidewalk", "href": "Sidewalk&&6485", "artist": {"unique_name": "Avail"}, "lyrics": "It was time when I walked away we said good-bye I was confused I traded everything for another life and though I left I swore that I would never go you said you would save a place until I came back home\n\nI've got a new design and I want to try it on for size I was hoping you would let me 'cause when I think that everything is on the brink I now that you are there to catch me\n\nSpilling time looking for salvation in my mind holding on holding out for life I swore I would never go\n\n", "album": {"title": "Dixie_(1994)&&8707", "genre": "", "year": 1994}}, {"title": "Nameless", "href": "Nameless&&5454", "artist": {"unique_name": "Avail"}, "lyrics": "Should have left that attitude\nBack at home\nCenter of attention\nThrough tension\nBegging for respect\nThrough the unsaid\nResorting to disruption\nWhen you hate something\nShould have left that attitude\nBack at home\nStriving to dominate\nTo feel safe\nShowing your strength to\nThe unknown\nYou probably won't quit\nWhen you hurt someone\nWhat the hell are you fighting for\nI hope that it's something that you really believe in\n'Cause someone got a fist in their face\nBecause you're feeling weak\nAnd you're causing all these problems\nThat nobody needs\nDon't forget that you're all alone\nYou've got no good reason\nIt's just and attitude\n\n", "album": {"title": "Live_At_The_Bottom_Of_The_Hill_In_San_Francisco_(1998)&&4374", "genre": "", "year": 1998}}, {"title": "Monroe Park", "href": "Monroe_Park&&8499", "artist": {"unique_name": "Avail"}, "lyrics": "Riot at monroe\nNowhere to roam\nForced into place\nDown home bench life\nHigh class eye sore\nFall migration\nThose to impress\nA community\nIs community-less riot at monroe\nFuture curfew\nTo maim esteem\nOne more arrest\nTo show authority\nDignity lost\nMisplace by now\nScreams to uphold\nThose held down\nRiot at monroe\n\n", "album": {"title": "4_AM_Friday_(1996)&&2976", "genre": "", "year": 1996}}, {"title": "Bell", "href": "Bell&&9501", "artist": {"unique_name": "Avail"}, "lyrics": "The Birmingham sun \nIt burned me through \nI thought of you \nAnd with every step I've made mistakes \nYou've seen me though \nYou've seen me true \n\nAll these towns are lonesome \nAll their streets the same \nEvery rain's a downpour \nI'm nearly washed away \nAs I wait \n\nThis morning's news \nIt seemed untrue \nBut it's safe with you \nAnd with every step I've made mistakes \nYou've seen me through \nYou've seen me true \n\nAll these towns are lonesome \nAll their streets the same \nEvery rain's a downpour \nI'm nearly washed away \nAs I wait\n\nAll these towns are lonesome \nAll their streets the same \nEvery rain's a downpour \nI'm nearly washed away \nAs I wait\n\nAll these towns are lonesome \nAll their streets the same \nEvery rain's a downpour \nWhen I've nearly washed away \nYou've kept me sane\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Vine", "href": "Vine&&5139", "artist": {"unique_name": "Avail"}, "lyrics": "Is it true you don't want to Feel a thing? \n\nThen stay in the underground Remain elusive I'm higher now than when I broke down It's wrong I don't think about you Is it wrong I don't think about you? \n\nTook a walk to the bridge again last night Gave no thoughts to mistakes I've made I felt cleansed for once in my life The sky was perfect clear I walked home again last night And got a feeling that I rarely question Rolled right over the thought of a breakdown And smiled without a care \n\nIf I never see you again I'm counting my blessings I'm higher now than when I broke down It's wrong I don't think about you Is it wrong I don't think about you? \n\nImpurites Accepted\n\n", "album": {"title": "Over_The_James_(1998)&&5207", "genre": "", "year": 1998}}, {"title": "High Lonesome", "href": "High_Lonesome&&8885", "artist": {"unique_name": "Avail"}, "lyrics": "I've tried to think this out \nTen times now \nBut it's gone, the temptation, to reason \nFuck reason \nAnd fuck all the words you've written \nThey make no sense\nNot in retrospect\nPlease tell me\nPlease tell me\nWhy did you walk back in today? \n\nBut before you see me \nIt's been over a year now \nAnd I'm hardly sound \nAnd I'm over pretending \nI'm no longer shaking \nOr walking the ground\n\nI'll try to work this out \nBut I don't know how\nIt goes on, this frustration lacks meaning\nFuck meaning \nAnd fuck all the pain it brings\nThis makes no sense \nI don't buy what you send\nPlease tell me\nWhy'd you walk back in today? \n\nBut before you see me \nIt's been over a year now \nAnd I'm hardly sound \nAnd I'm over pretending \nI'm no longer shaking \nOr walking the ground\n\nI've tried to run \nBut I stay here\nAnd I don't know why I would wait \nThere's still a reason \nAnd it burns down \nIn ashes where I lay \n\nWhy'd you walk back in today? \n\nBut before you see me \nIt's been over a year now \nAnd I'm hardly sound \nAnd I'm over pretending \nI'm no longer shaking \nOr walking the ground\n\nI'm drowning\nDrowning\nDrowning\nWalking the ground\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Subdued & Arrested", "href": "Subdued_%26_Arrested&&9082", "artist": {"unique_name": "Avail"}, "lyrics": "And I wait for an end\nBut what about them\nWith broken wings\nWhat about them\nWe've become so indifferent\nIs there a stance one could take\nTo break the infrastructure\nIs there a single thing that you would die for?\nWhen all's said\nI don't see what you see\nBut you believe\nTruthfully\nThere's a stance you can take\nTo break the infrastructure\nThere's a single thing that you would die for\nIt's blood red\nI don't see what you see\nBut you believe\nIt's come full circle now\nThey finally came to break the home\nTaking everything to dictate you're not your own\nYour conflicts infinitely built\nAnd your reactions may not be sound\nBut they're the only thing\nBetween love for family\nAnd finding closure now\n\n", "album": {"title": "Front_Porch_Stories_(2002)&&2963", "genre": "", "year": 2002}}, {"title": "Invisible", "href": "Invisible&&6839", "artist": {"unique_name": "Avail"}, "lyrics": "I hope I never have to use the world friend again it's the same old slap in the face set in motion, ah fuck this place again I've met the end don't tell me what is left there's nothing but a box of pictures I refuse to open they may cause resent you know I really don't miss a thing there's no struggle to confront now 'cause what's said is said and what's done is done a crude emotion set in forward pace get this message straight now 'cause I'm sick as shit I've got no room for impatience the bet was set you know I really don't miss a thing cause sometimes the rain is warm in winter and the clouds part everything is clear when I play the card I dealt the ice will warm and melt and I don't think i\"ll care there's nothing wrong at all with spending time alone and if I ever have to use the word friend again don't question just slap my face there's no devotion when I played and betrayed and if there are no starts then there'll be no more ends just another stop treated careless, to ass to the list but sometimes the rain is warm in winter...\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Heron", "href": "Heron&&1355", "artist": {"unique_name": "Avail"}, "lyrics": "I am, outside, I am pay no mind to how I see this pay no mind to what I'm feeling now turn it around follow the lesser I won't break down i\"m staying in tonight I don't need the insight I am, outside, I am when you broke in you forgot to strip me of all my value pay no mind to how I see this pay no mind to what I'm feeling now turn it around point with anger I'm to blame somehow maybe I forgot to mention what it's like to be free of total disrespect on sight at last call I'm shut down I forgot to explain the way interaction in kind can leave a different taste at last call I'm shit down pay no mind to how I say this pay now mind if I seem restless now i\"m through with this crowd cower and question ask loud just how I cam to laugh at myself quietly don't look to the ground I won't be found the lesssons learned I won't break down\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Cross Tie", "href": "Cross_Tie&&2978", "artist": {"unique_name": "Avail"}, "lyrics": "Got a full blown standard To question outright Now find something To believe in Shared a million secrets That all broke one night Damned bad job of concealment Sometimes here and sometimes gone When the mainline blows Stay sidetracked It's safe to say that Perfection is created It perfectly scars And digs deep under skin \n\nBeen at all time highs And all time lows Sometimes barely maintaining It's strange that to go and Shutdown sometimes Can be so damned relieving Rain on the face can cleanse So deep it will bring a lost Feeling right back It's safe to say that Perfection is created It perfectly scars And digs deep under skin \n\nAs the wind blows away the words Who's left to blame? \n\nTake a ride on the back Near the switch And make good time Without a hint of leaving Be from many places Be from here see what To see then wander alone Steel rails hum find the cure Then fall right back It's safe to say that Perfection is created It perfectly scars And digs deep under skin \n\nAs the wind blows away the words Who's left to blame?\n\n", "album": {"title": "Over_The_James_(1998)&&5207", "genre": "", "year": 1998}}, {"title": "92", "href": "92&&2958", "artist": {"unique_name": "Avail"}, "lyrics": "Sometimes when I wake up\nI start to think\nThis can't be true\nAnd I'm not together\nSo I block out all the days\nThat don't matter\nAnd I raise my head\nForget about what I did\nAnd try not to think too hard\nSometimes I get so happy\nI hear things in my head\nThat were never said\nI just sit alone for a while\nAnd start talking to myself, I think\nIt's getting a little out of hand\nTry not to think too hard\nI hang on the words\nThinking how I blew it\nWith nothing left to lose\nSometimes when I think about it\nIt just doesn't seem fair\nStill I stay prepared\nAnd I work my way around it\nI look deep into myself and think\nThis is getting a little out of hand\nTry not to think too hard\nI hand on the words\nThinking I blew it\nWith nothing left to lose\nI play my part\nIt's not so hard\nI just stay out of view\n\n", "album": {"title": "4_AM_Friday_(1996)&&2976", "genre": "", "year": 1996}}, {"title": "Fifth Wheel", "href": "Fifth_Wheel&&1086", "artist": {"unique_name": "Avail"}, "lyrics": "Tripped all over my friends At once as they were starting to unwind Had a feeling I was losing 'Cause as they moved along I was falling far behind I've got a frame full of Good intentions that I Left back at home to rot Thought that to stay underground And go streamline I'd be strong Now I know I'm not Everyday's a week now A search for identity The ground below my feet Has got the best of me \n\nAnd I'm tired of always changing I'm tired of being seen The path is leading homeward bound Only God knows where I've been \n\nI got sick of all of my friends at once As they were starting to unwind Had a feeling I was losing 'Cause as they moved along I was falling far behind I've got a box full of small inventions That I left back at home to rot Thought that to stay underground And go streamline I'd be strong Now I know I'm not Many months I've been gone now I've learned from all I've seen Turn around and face southward bound This has got the best of me \n\nI'll keep looking for an answer Until my eyes have gone blind I've run myself in circles And made it through this time With one foot on the platform One foot on the train I'm going back to Richmond To wear that ball and chain\n\n", "album": {"title": "Over_The_James_(1998)&&5207", "genre": "", "year": 1998}}, {"title": "Pinned Up", "href": "Pinned_Up&&7501", "artist": {"unique_name": "Avail"}, "lyrics": "There were times likes before When she was overcome By happiness And as one her life Her age was prime and vulnerable \n\nSatiate \n\nSo you've got the opportunity To take my best away from me She's different now Can't you see Her life structure's been deranged By your greed And for your desires \n\nLet me get my thoughts straight \n\nWhat gave you the Right to take her away from me \n\nSaid you were raised And claimed to be neglected That's no excuse Do you know the pain I feel With your presence Just go away I think you've done your damage Her plans for the future Were dismissed by you \n\nSo I will try I think I'll try again To get my life straight And I pray that everything she's seen Won't blind her And everything she's felt Will show in years to come And as for you...\n\n", "album": {"title": "Live_At_The_Bottom_Of_The_Hill_In_San_Francisco_(1998)&&4374", "genre": "", "year": 1998}}, {"title": "F.C.A.", "href": "F.C.A.&&8129", "artist": {"unique_name": "Avail"}, "lyrics": "There's one in the middle\nCan we run this toll?\nWhat happens tomorrow\nCan never be told\nSpray can and a spyderco\nIt never really hit\nUnitl it was written in stone\nBut we'll try to get by\nAs soon as there's a chance\nTo clear our eyes\nAnd we'll finally say goodbye\nInside with pride you survive\nRemember\nIt wasn't time wasted\nAnd we forget\nFour a.m. Friday\nAwaken to a scream\nHe's not gonna make it\nReal it didn't seem\nNo-don't let go\nNo-make it through\n\n", "album": {"title": "Live_At_The_Bottom_Of_The_Hill_In_San_Francisco_(1998)&&4374", "genre": "", "year": 1998}}, {"title": "Model", "href": "Model&&7583", "artist": {"unique_name": "Avail"}, "lyrics": "I'd to anything to look that way when I stop and think again I want to change my face and change my skin no more invisible to them, you can't compare me I'd to anything\n\nBig is a scar you'd better get thin the tanner you are the more you fit in\n\nBullshit you got a disease you follow the trends like the rest of the sheep\n\n", "album": {"title": "Live_At_The_Bottom_Of_The_Hill_In_San_Francisco_(1998)&&4374", "genre": "", "year": 1998}}, {"title": "Governor", "href": "Governor&&2714", "artist": {"unique_name": "Avail"}, "lyrics": "Quickly formed and raised\nFor keeping more contained\nYou shut it, you lock it\nBut you haven't solved it\nThree strikes, petty crime\nOut of sight, out of mind\nRepossess, relocate\nThere's more than one way\nSo don't talk to me\nAbout all your gonna do\nAnd who you represent\nAnd how you'll see it through\nI'm not buying who you're selling\nYou're selling you\nAnd it just doesn't seem right\nYou've done nothing\nBut caused harm\nAnd you want\nPraise\nAnd I'm not gonna take it easy\n\n", "album": {"title": "4_AM_Friday_(1996)&&2976", "genre": "", "year": 1996}}, {"title": "Versus", "href": "Versus&&7087", "artist": {"unique_name": "Avail"}, "lyrics": "Silence, silence all sides\nRaw with indecision\nWithout the mind to congregate\nIn fault the line extends\nTo further burden divided friends\nSilence all sides\nWhy bother to defy when we still can't unite\nSo put your fist down until sanity can be contained\nWe burn out before we fade away\nLosing time and not changing anything\nBurn out we isolate,\nRather stand alone than divided\nStuck on lines deplete\nChant slogans timed one step off beat\nFull loss of common sense\nWhen passion becomes status end\nSilence, silence all sides\nWhy bother to defy when we still can't unite\nSo put your fist down until sanity can be contained\nWhat's been said has spread like fire to all\nIt takes no strength to pass blame\nWe burn out before we fade away\nLosing time and not changing anything\nBurn out we isolate,\nRather stand alone than divided\n\n", "album": {"title": "Front_Porch_Stories_(2002)&&2963", "genre": "", "year": 2002}}, {"title": "Mid-Town West", "href": "Mid-Town_West&&3990", "artist": {"unique_name": "Avail"}, "lyrics": "These are my eyes, I said \nThis is how they see you \nMisled \nForce-fed \nCan't make sense of what you do \nBut how could you not have meant it?\nWhat's real? \nWhat's untrue? \nMisled \nForce-fed \n\nYou criticize so you get a reaction \nIt's a reflection \nYou judge yourself \nYou talk down \nYou do it for attention \nSelf-motivation \nNot misunderstood \nYou conceal what's not real \nAnd hope they miss what's really wrong \nYou never listen \nI'm feeling strong \n\nThese are my eyes, I said \nThis is how they see you \nMisled \nForce-fed \nCan't make sense of what you do \nBut how could you not have meant it? \nWhat's real? \nWhat's untrue? \nMisled \nForce-fed\n\nReminding me of \nReminding me of\nReminding me of\nReminding me of\nMyself \nI'm not willing to take it\nMyself\nI'm not gonna forget it\n\nThese are my eyes, I said \nThis is how they see you \nMisled \nForce-fed \nCan't make sense of what you do \nBut how could you not have meant it? \nWhat's real? \nWhat's untrue? \nMisled \nForce-fed\n\nReminding me of \nReminding me of\nReminding me of\nReminding me of\nMyself \nI'm not willing to take it\nMyself\nI'm not gonna forget it\n\n", "album": {"title": "Over_The_James_(1998)&&5207", "genre": "", "year": 1998}}, {"title": "Deepwood", "href": "Deepwood&&2046", "artist": {"unique_name": "Avail"}, "lyrics": "So far no one seems bothered But you've seen what I've seen Around here it doesn't take much I'll take the liberty Let's just get to it soon And tell the truth\n\nBut if you're afraid of the promise And afraid of the truth it contains I know I haven't always been around But I can help you lead And take the blame anyway\n\nI know you've seen what I've seen We'll group and build some trust Follow and lead Lets just get organized And see it through\n\n", "album": {"title": "Over_The_James_(1998)&&5207", "genre": "", "year": 1998}}, {"title": "Scuffle Town", "href": "Scuffle_Town&&5038", "artist": {"unique_name": "Avail"}, "lyrics": "There's kepone in the river But the river's still Flowing east Ethyl doze the planet In an attempt to keep The downtown clean\n\nStill it's a beautiful day And the sun is still shining Over the James\n\nOregon Hill is at end time VCU crept up and lit the torch West ave. honkeys don't forget That trains still run north\n\nThird per-capita Next year number one\n\n", "album": {"title": "Over_The_James_(1998)&&5207", "genre": "", "year": 1998}}, {"title": "McCarthy", "href": "McCarthy&&5228", "artist": {"unique_name": "Avail"}, "lyrics": "I tried to breath but I wouldn't\nI think it's gonna catch up one day\nOne chance to reshape wrong\nBacktrack out of the shell\nOne more chance to understand\nTo be a different way\nAnd I hope that it won't take long\nIt's time to rotate\nIn the right direction\nAnd reshape imperfection\nYou smother me\nAll I see around is changing\nMaking it tough to stay I've twisted thoughts to words\nThe ground I knew\nLooks different from inside\nBut the path out is far too wide\nTo decide today\nBut somewhere I'll find my place\n-Try moving-\nI tried to leave but I couldn't\nI think I'll try again someday\nAnd baybe I'll make it work\nI'll plan my route but not think it out\nDrop out of sight and ease on out\nI'm gonna find my way\nAnd someday I'll make it work\n\n", "album": {"title": "4_AM_Friday_(1996)&&2976", "genre": "", "year": 1996}}, {"title": "Stride", "href": "Stride&&9776", "artist": {"unique_name": "Avail"}, "lyrics": "I see different now As I view the rushing all around But that's the breaks I've taken in too much hate \n\nBut still I'll struggle To remember what I've learned Before So I'll let that pass me by And renew what is mine \n\nI know I have the strength To break away 'Cause I knowthe language Everyone's speaking today \n\nWho's to say what stays the same Who's to say that I'm to blame No one ever said That I would stay the same \n\nI fear the twist around And I feel the wrong That I have found Too many times I've been disgraced So I'll look to another place \n\nBut I never want to turn around And see that face again It's not embarrassment but somewhere Down the road it's got to end Research yourself research that place But I don't know where to begin I understand I think I've just seen the end \n\nNo one ever said That I would feel no pain That you would stay the same That I would always change Who's to say what stays the same Not me\n\n", "album": {"title": "Live_At_The_Bottom_Of_The_Hill_In_San_Francisco_(1998)&&4374", "genre": "", "year": 1998}}, {"title": "Pink houses", "href": "Pink_Houses&&3129", "artist": {"unique_name": "Avail"}, "lyrics": "There's a black man with a black cat\nLiving in a black neighbourhood\nHe's got an interstate runnin' through his front yard\nYou know, he think, that he's got it so good\nAnd there's a woman in the kitchen cleanin' up the evening slop\nAnd he looks at her and says: hey darling, I can remember when you could stop a clock\n\nOh but ain't that America for you and me\nAin't that America we're something to see baby\nAin't that America, home of the free\nLittle pink houses for you and me\n\nWell there's a young man in a t-shirt\nListening to a rockin' rollin' station\nHe's got a greasy hair, greasy smile\nHe says: lord, this must be my destination\n'Cause they told me, when I was younger\nBoy, you're gonna be president\nBut just like everything else, those old crazy dreams\nJust kinda came and went\n\nWell there's people and more people\nWhat do they know know know\nGo to work in some high rise\nAnd vacation down at the gulf of Mexico\nOh yeah\nAnd there's winners, and there's losers\nBut they ain't no big deal\n'Cause the simple man baby pays for the thrills,\nThe bills and the pills that kill\n\n", "album": {"title": "Dixie_(1994)&&8707", "genre": "", "year": 1994}}, {"title": "N30", "href": "N30&&2367", "artist": {"unique_name": "Avail"}, "lyrics": "To steal without lifting a finger \nIt's quietly kept \nThe real terrorist \nBy way of the West \n(One by one by one by one)\nOne hundred thousand starved\nTheir eyes glazed, stare westward \n\nSee something want it\nPut a figure on it \n\nAbandoned for triple the profit \nLonger for less \nImperialist by way of the West (one by one by one by one)\nOne thousand jobs lost \nGreed so profound \nCrimes of gold\n\nDeep want for everything \nExactly what does wealth bring\nA class filled with resent \nOne wrench can break the machine \nStripped clean and torn down \nTired of kneeling \nThe tide is rising \n\nNow fed these lies so long \nThe mind craves to believe them \n(One by one by one by one)\nOne blatant myth king \nControls pawn \n\nDeep want for everything \nExactly what does wealth bring\nA class filled with resent \nOne wrench can break the machine \nOutput could slow down \nTired of kneeling \nThe tide is rising \n\nNow remember who works the land \nGloves on hands \nIt seems they have been forgotten \nFrom Jaurez and through the Panhandle \nIt takes one wrench \nTo leave you crippled\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "South Bound 95", "href": "South_Bound_95&&1220", "artist": {"unique_name": "Avail"}, "lyrics": "Boredom in the mobile home in nowhere u.s.a. somehow gotta make it home to richmond v.a. when I'm there I want to go but when I'm gone I don't I'll make it\n\nAnywhere but here but here is where I've got to be anywhere but here I've gotta make it to dixie\n\n", "album": {"title": "Live_At_The_Bottom_Of_The_Hill_In_San_Francisco_(1998)&&4374", "genre": "", "year": 1998}}, {"title": "Sanctuary 13", "href": "Sanctuary_13&&8332", "artist": {"unique_name": "Avail"}, "lyrics": "I need a place To lay my head That's safely Out of sight From where I am Somewhere uncontrolled Where no one's led A simple change of mood That I haven't found yet \n\nI want to be up front and honest But I can't at all Don't want to set myself Up for a fall I'll say it until I'm blue In the face And won't get a response It's so pitifully tame now Good day now drop the name Of an unknown place And I'm leaving Reason give me one reason A short invitation Or none at all\n\n", "album": {"title": "Over_The_James_(1998)&&5207", "genre": "", "year": 1998}}, {"title": "Old Dominion", "href": "Old_Dominion&&5991", "artist": {"unique_name": "Avail"}, "lyrics": "Who am I to make you consider yourself but how can I watch you walk through hell? as I held your head up straight I clenched my fists but not in rage I've fought so many off I'm still surrounded thers so much I meant to say that depth forced to contain it's not right I lied I never changed I'm the same person as I drink my problems straight I've touched your hand to test for strength behind one step ahead I'm nearly drowning if I dropped to my knees and said I'd hold you every day I'd fail myself do you understand? goddamn we've got the same last name right? you're right in front of me did you believe you'd fall that deep from fear? you say you're down well try and make it through another night stay in front of me it's hard to believe but I've walked that path before I'm saying, forget about last night\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "You", "href": "You&&3263", "artist": {"unique_name": "Avail"}, "lyrics": "It's not an accusation, I freeze when I see you and I can still feel\nYou breath\nYou say I spread lies for attention as you play victim\nTheir minds set on who to believe\nI can't sit here pitied and self absorbed\nBut I can't scrub this scent clean\nI've tried before and I'm sure I can't explain in words\nOr thoughts the way I've kicked and fought\nAnd fought myself to be sane to come clean and\nBegin at last again\nSure I could give up and those I praise\nWoudln't give a fuck\nSo much for friends, so much for feelings now\nWhy don't you spit in my face\nFor bringing shame to your name\nYou and I know for sure\nBehind closed doors\nIt was you against me\nI won't sit here blamed and ignored\nAs I rinse the stains clean without support\nAnd I'm sure I can't explain in words or thought\nThe lessons I was taught\nAs I fought while you used force for gain\nAnd I was skin deep in shame\nNow I won't let up\nI'll tread the heals of your every step\nSo much for friends, so much for feelings now\nWhy don't you spit in my face\nFor bringing shame to your name\nYou and I know for sure\nBehind closed doors\nIt was you against me\n\n", "album": {"title": "Front_Porch_Stories_(2002)&&2963", "genre": "", "year": 2002}}, {"title": "Beliefs Pile", "href": "Beliefs_Pile&&85", "artist": {"unique_name": "Avail"}, "lyrics": "To be the one to swallow my pride I'll try but make no promises and before I go off to collect myself please don't give up while there's time\n\nTo be the one to swallow my pride I'll try and make no promises I'll wash myself of that feeling while I'm still wet and before I go off to collect myself please don't give up\n\nWhile there's time my goal is to gain the courage and smile for a while\n\nIf I'm the first to open my arms and try well I've done mine I have no regrets I wasn't forced into this so it's all right\n\nTo be the one to laugh at my pride I'll try and make no promises I'll wash myself of that feeling while I'm still wet I'm trying to make the best of my nonsensse before I go of to collect myself please don't give up\n\n", "album": {"title": "Dixie_(1994)&&8707", "genre": "", "year": 1994}}, {"title": "Rest", "href": "Rest&&6765", "artist": {"unique_name": "Avail"}, "lyrics": "I'll starve no more I've been conjuring fate repent sin come to my mind no more with half the truth I go my way and pray there is no war bloody knuckles scraping pavement leave stains once I say, life is complete I've got to light the way confess sin come to my mind no more this lack of faith that guides the way prove there is no more sun you'll be here and I'll be gone without a trace a paper trail, finally complete I get up daily, I get a day to me and I wonder why I can't believe tried following scents that are watered down the truth is lies believed there's not few left this is the last\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "On The Nod", "href": "On_The_Nod&&2250", "artist": {"unique_name": "Avail"}, "lyrics": "Could be afraid of what they'd say could be afraid of the things they say\n\nThis morning I had the bad taste I couldn't think straight I crawled back inside I've taken this as a warning I'm gonna rid myself of everything outside of my ways could be afraid of what they'd say\n\nSo from now on I know nothing push it back and let it fade simple words have always meant nothing I can taste the waste of energy\n\nI always thought it was safe to be acquainted casually they're dropping non-stop casually I make my way directed to another place to stay until I'm settled but I'm not afraid\n\nCould be afraid of what they'd say\n\nOut of strength watch me go afraid that it's over on I move a simple step on my way to avoid responsibility\n\n", "album": {"title": "V.M._Live_(1999)&&4735", "genre": "", "year": 1999}}, {"title": "Clone", "href": "Clone&&2356", "artist": {"unique_name": "Avail"}, "lyrics": "Day breaks the same for the expressionless open the gates at a stand still routine media dreams, no reality pressure eager to be recognized fighting for promotion\n\nNo time for rest no\n\nNext door no contact impersonal glance afraid to go out learn to isolate companionship through classifieds a desperate attempt to put a name on the face\n\nNo time for companionship no\n\nEgo knows you want ego knows you'll take it\n\nInconvenience a nightmare never ending race four wheels, pavement ego, poor health hands of greed grab whatever they can take eager to materialize fighting for a piece\n\nNo time for rest no\n\nRise\n\nWhen it happens friend no, don't let them break you\n\nRise\n\nNo matter what they say no, don't let them break you\n\n", "album": {"title": "Live_At_The_Bottom_Of_The_Hill_In_San_Francisco_(1998)&&4374", "genre": "", "year": 1998}}, {"title": "August", "href": "August&&5324", "artist": {"unique_name": "Avail"}, "lyrics": "I felt it all The holes are burning Still I hold my throat And I'm watching All the laughing Pass me by If I could just Turn the clock back \n\nAll this time's left me Feeling jaded I nearly lost my mind Let me stay here One more moment Buried \n\nBroken glass from Window panes feel Down on my back yard And I cut my feet Got dirt ground In the wound If there's such thing As a payback \n\nHow high's the price on my head?\n\n", "album": {"title": "Over_The_James_(1998)&&5207", "genre": "", "year": 1998}}, {"title": "Black And Red", "href": "Black_And_Red&&5053", "artist": {"unique_name": "Avail"}, "lyrics": "Color yourself, color yourself black and red\nAnd when you find life slow and simple\nThen you've grown against the grain\nBut look at yourself, you've got your head held in your hands\nThere's proof you don't need to possess on command\nYou color yourself, color yourself bitter gray\nIn words you are outspoken, but too few hear what you say\nYou break yourself and still don't understand\nConditioned to compete whether you lose or if you win\nTouch all you see - surround yourself\nColor yourself, color yourself black and red\nAnd when you find life slow and simple\nThen you've grown against the grain\nBut look at yourself, you've got your head held in your hands\nThere's proof you don't need to possess on command\n\n", "album": {"title": "Front_Porch_Stories_(2002)&&2963", "genre": "", "year": 2002}}, {"title": "New Song", "href": "New_Song&&1019", "artist": {"unique_name": "Avail"}, "lyrics": "I keep saying don't beat yourself down you never had much and never asked for lesss than truth, not promises the truth is I still live in hell treading pools that are shallow when I touch the bottom. the bottle still I reach up although my hands hurt and aim high in a world so confined I'd rather die with my face all torn up wrists in handcuffs with pride than believe lies I keep saying this time you won't be let down, you've learned to touch, to bond, to share, to act and move, to rebel. the fact is I jus tkeep on talking blindly and you can't relate, I know the game you act like you care when you don't\n\n", "album": {"title": "One_Wrench_(2000)&&1441", "genre": "Post-Hardcore", "year": 2000}}, {"title": "March", "href": "March&&5560", "artist": {"unique_name": "Avail"}, "lyrics": "A twist this time You buckle my mind Like a speechless boy\n\nIt won't go away \n\nGot glass rain It cuts my feet I pull apart Yet refrain from the heart I've got water in my veins \n\nIt won't go away \n\nTurns ice On which I slide \n\nIn my soul I have religion I try to preach it And it's stripped away \nIt's beyond contradiction \nJust my fight with my grace \n\nA dove in hand Do I crush it my friend? Why do I feel no guilt \n\nIt won't go away \n\nThis final fear I cannot see This love of hell in which I dwell It makes no sense \n\nIt won't go away \n\nThis way that I feel \n\nBreak it down Knock it down \nPull the wall down \n\nLet go Let go of the hatred in your soul\n\n", "album": {"title": "V.M._Live_(1999)&&4735", "genre": "", "year": 1999}}, {"title": "Blue Times Two", "href": "Blue_Times_Two&&4116", "artist": {"unique_name": "Avail"}, "lyrics": "God I feel like hell\nFor myself and you\nAnd I hate myself\nTo end absolute\nWalking still below ceilings\nGoing round and round\nNine in the evening now\nAnd I ain't never shared\nMore than times allowed\nWithout you leading\nI could just stay and fight\nOh I'd still feel justified\nBut I don't always do what I intend\nMy mind stands to fail\nWith or without much deatail\nAnd for that it's far too late\nStanding still but not believing\nThat talking round and round\nWill a solve everything right now\nAnd I ain't never dared\nLet a word slip out\nDo you breathe when speaking?\n'Cause I've been here all night\nAnd you talked your throat fucking dry\nDid you even mean a word you said?\nMy mind stands to fail\nWith or without much detail\nAnd I can do without distractions\nGod I feel like hell\nFor myself and you\nAnd I hate myself\nTo end so absolute\nMy mind stands to fail\nWith or without much detail\nIt's best left unsaid\nLet's accept mistakes were made\n\n", "album": {"title": "Front_Porch_Stories_(2002)&&2963", "genre": "", "year": 2002}}, {"title": "Lombardy St.", "href": "Lombardy_St.&&4125", "artist": {"unique_name": "Avail"}, "lyrics": "Lately I've been thinking Not about what you said But what you did If you're behind it You decide I'll survive I've been spending time Looking out instead of in Gotta keep reminding myself Begin means end \n\nAnd I'm walking though the alleys In the morning and I'm trying To do some thinking I've gotta Know this time for sure \n\nTell me why I'm feeling pressured Tell me why you feel alright But still I don't \n\nI caught myself believing Every word that was said And that's fine I'll learn To depend on myself in time \n\n'Cause I've made some quick decisions That just barely left me with an opinion Or identity of my own \n\nTell me why I feel below you Tell me why you feel alright But still I don't \n\nWould you feel like a stranger If I turned and walked away? Would you care if I stayed? The many times I've been Through this have I learned From mistakes I've made? I may try and if I fall I'll pick myself up again \n\nI don't want your lines And I don't want your sympathy 'Cause I'm trying to break old habits And I want to do that on my own \n\nTell me why I'm feeling pressured Tell me why you feel alright But still I don't\n\n", "album": {"title": "Over_The_James_(1998)&&5207", "genre": "", "year": 1998}}, {"title": "Blue Ridge", "href": "Blue_Ridge&&9840", "artist": {"unique_name": "Avail"}, "lyrics": "Yes i, yes I'm worried\nThey they're lies\nYes i, yes I'm sorry\nThat I tried\nBut I lay it down too deep\nSometimes for too long\nUp for a moment\nThan that moment's gone\nAnd I pray that you know\nI'd bleed for a home\nI got worried\nBut won't be long\nSo long I took it\nGot me down\nBut I took it\nStayed out\nStayed out too late for trust\nDon't feel sorry\nI'm not worried\nImage\nOffset\nPrize is\nNeglect\n\n", "album": {"title": "Live_At_The_Bottom_Of_The_Hill_In_San_Francisco_(1998)&&4374", "genre": "", "year": 1998}}, {"title": "Gravel to Dirt", "href": "Gravel_To_Dirt&&3725", "artist": {"unique_name": "Avail"}, "lyrics": "Been at this too long\nThat's wise said \nDrunk\n\nPicked at the peddles again\nBled red\nAll sense is gone\n\nShould have left the back door open\nLordy, lordy\nCould have been robbed once again\nI keep screaming \nBut hear only vibrations\n\nBeen at this too long\nTwice said\nOne\n\nShould have left the back door open\nLordy, lordy\nCould have been robbed once again\nI keep screaming \nBut hear only vibrations\n\nI should set sail\nI should sail\nWoah\nWoah\nI should sail\nI should sail\nWoah\nWoah\n\nBeen at this too long\nThat's wise said \nDrunk\n\nPicked at the peddles again\nBled red\nAll sense is gone\n\n", "album": {"title": "Front_Porch_Stories_(2002)&&2963", "genre": "", "year": 2002}}, {"title": "Hang", "href": "Hang&&1553", "artist": {"unique_name": "Avail"}, "lyrics": "I heard you got robbed last week\nDid you know I got shot last night?\nIt's like dependency on a game called hearsay\nYou hear it said but did you hear it right?\nSo I was walking the bricks in my front yard\nThey're uneven and cracking with age\nI made an attempt to arrange them perfectly\nBut when I got done they wouldn't fit into place\nAnd I can't say when\nI plan on giving up\nI'm trying to think\nDon't know when it will end\nI heard a rumor you went on a trip\nDid you know I just got back?\nI had a chance to think while I was away\nI pointed fingers of blame\nUntil they were pointing at me\nSo I rode my temper until I heard the water\nBut I hit a fence that was chained and barred\nI looked and tried to find another way in\nThat's when I finally realized\nThat I'd been trying too hard\n\n", "album": {"title": "4_AM_Friday_(1996)&&2976", "genre": "", "year": 1996}}]