[{"title": "Blinded In Chains", "href": "Blinded_In_Chains&&5628", "artist": {"unique_name": "Avenged_Sevenfold"}, "lyrics": "And we're at it again, I turn around another fucking war, man\nI don't know where to begin, but I'll start with the radical leaders\nTheir steps we're followin'\n\nRunning, don't go back and fight, too many you'll lose\n(And as clowns you follow suit behind the blood between the red and white and blue but it's too deep for you to see and\nEveryone eventually will take the step 'cause it's in sight you take the left I'll take the right I feel the hate you've built\nFor me and I say pay attention baby)\n\nAs they thank the Lord the blind can't see\nLike a plague fed to the brain, deadly disease\n\nBut it wasn't a sin, a sorry life in judging every action\nAnd as they're feeding your mind with this shit you forget\nHow to speak how to ask all the questions\n\nThe business at hand tonight, make the people choose\n(I see another side in you but there's not much more I can do from on the outside looking in your government is listenin' to\nPush you on the story of immortal father mortal son give them your mind and all your wealth the cycle will rebirth itself)\nIf they had it their way I'd burn in Hell and your future's a fuckin' disaster can't you see\nDon't give them all the power when your future's in desperate trouble baby\n\nAs they thank the Lord the blind can't see\nLike a plague fed to the brain, deadly disease\nI'd run away tonight with my mind still intact you gotta make it all right\nEasier said than done with no place to hide and having no place to (run)\nRunning away from condition, I see you but you're running away from\nYou're scared seductive system\n\nMost would claim I live a lie when pointing out it's easy to predict these things\nEvery color has its side, they live together vote and most won't read between these lines\nPlease help us, please save us of course they have control we're all the same\nUp on the cross, crucified their problem drove the nail and let Him rot\nFamily and friends, it won't matter in the end I'm sure they'll understand\nNow look at the world and see how the humans bleed\nAs I sit up here and wonder bout how you sold your mind, body and soul\nLooking at the fields so green I know this sounds obscene\nI see you're living for tomorrow but decisions you have made will leave you empty\n\nAs they thank the Lord the blind can't see\nLike a plague fed to the brain, deadly disease\nI'd run away tonight with my mind still intact you gotta make it all right\nEasier said than done with no place to hide and having no place to run\n\nYou've fallen asleep here in denial\nLook at the way we're dyin'\nHow it ends I'll never know\nJust live your life blind like me\n\n", "album": {"title": "City_Of_Evil_(2005)&&3690", "genre": "Heavy Metal", "year": 2005}}, {"title": "Bat Country", "href": "Bat_Country&&9532", "artist": {"unique_name": "Avenged_Sevenfold"}, "lyrics": "\"He who makes a beast out of himself gets rid of the pain of being man\"\n\nCaught here in a fiery blaze, won't lose my will to stay\nI tried to drive all through the night\nThe heat stroke ridden weather, the barren empty sights\nNo oasis here to see, the sand is singing deathless words to me\n\nCan't you help me as I'm startin' to burn (all alone)\nToo many doses and I'm starting to get an attraction\nMy confidence is leaving me on my own (all alone)\nNo one can save me and you know I don't want the attention\n\nAs I adjust to my new sights the rarely tired lights will take me to new heights\nMy hand is on the trigger I'm ready to ignite\nTomorrow might not make it but everything's all right\nMental fiction, follow me; show me what it's like to be set free\n\nCan't you help me as I'm startin' to burn (all alone)\nToo many doses and I'm starting to get an attraction\nMy confidence is leaving me on my own (all alone)\nNo one can save me and you know I don't want the attention\n\nSo sorry you're not here I've been sane too long my vision's so unclear\nNow take a trip with me but don't be surprised when things aren't what they seem\n\nCaught here in a fiery blaze, won't lose my will to stay\nThese eyes won't see the same, after I flip today\n\nSometimes I don't know why we'd rather live than die\nWe look up towards the sky for answers to our lives\nWe may get some solutions but most just pass us by\nDon't want your absolution 'cause I can't make it right\nI'll make a beast out of myself, gets rid of all the pain of being a man\n\nCan't you help me as I'm startin' to burn (all alone)\nToo many doses and I'm starting to get an attraction\nMy confidence is leaving me on my own (all alone)\nNo one can save me and you know I don't want the attention\n\nSo sorry you're not here I've been sane too long my vision's so unclear\nNow take a trip with me but don't be surprised when things aren't what they seem\nI've known it from the start all these good ideas will tear your brain apart\nScared but you can follow me I'm too weird to live but much too rare to die\n\n", "album": {"title": "City_Of_Evil_(2005)&&3690", "genre": "Heavy Metal", "year": 2005}}, {"title": "Beast and the Harlot", "href": "Beast_And_The_Harlot&&3444", "artist": {"unique_name": "Avenged_Sevenfold"}, "lyrics": "This shining city built of gold\nA far cry from innocence\nThere's more than meets the eye 'round here\nLook to the waters of the deep\nA city of evil\n\nThere sat a seven-headed beast\nTen horns raised from his head\nSymbolic woman sits on his throne\nBut hatred strips her and leaves her naked\nThe Beast and the Harlot\nOhhhhh...\n\nShe's a dwelling place for demons\nShe's a cage for every unclean spirit\nEvery filthy bird and makes us drink\nThe poisoned wine to fornicating with our kings\nFallen now is Babylon the Great!\n\nThe city dressed in jewels and gold\nFine linen, myrrh and pearls\nHer plagues will come all at once\nAs her mourners watch her burn\nDestroyed in an hour\n\nMerchants and captains of the world\nSailors, navigators too\nWill weep and mourn this loss\nWith her sins piled to the sky\nThe Beast and the Harlot\nOhhhhh...\n\nShe's a dwelling place for demons\nShe's a cage for every unclean spirit\nEvery filthy bird and makes us drink\nThe poisoned wine to fornicating with our kings\nFallen now is Babylon the Great!\n\nThe day has come for all us sinners\nIf you're not a servant you'll be struck to the ground\nFlee the burning, greedy city\nLooking back on her to see there's nothin' around\n\nI don't believe in fairytales and no one wants to go to Hell\nYou've made the wrong decision and it's easy to see\nNow if you wanna serve above or be a king below with us\nYou're welcome to the city where your future is set\nForever\n\nShe's a dwelling place for demons\nShe's a cage for every unclean spirit\nEvery filthy bird and makes us drink\nThe poisoned wine to fornicating with our kings\nFallen now is Babylon the Great!\n\nShe's a dwelling place for demons\nShe's a cage for every unclean spirit\nEvery filthy bird and makes us drink\nThe poisoned wine to fornicating with our kings\nFallen now is Babylon the Great!\n\n", "album": {"title": "City_Of_Evil_(2005)&&3690", "genre": "Heavy Metal", "year": 2005}}, {"title": "Burn It Down", "href": "Burn_It_Down&&5424", "artist": {"unique_name": "Avenged_Sevenfold"}, "lyrics": "Jealousy's an ugly word, but you don't seem to care\nConverse behind my back, but now I'm here\nNeed no one to comply with me though everyone that I defeat\nDon\"t need you, fuck camaraderie, this rage will never go away\n\nHatred fuels my blood\nI'll burn ya down (You can't help me)\nOne king to watch the horsemen fail\nI'll fight 'til the end (I won't help you)\nI can't trust anyone (See it in my eyes)\nNow I can understand\nIt's sorrow that feeds your lies\nWhoa, yeah!\n\nYou're on my back when the water gets too deep for you to breathe\nA crutch for you that won't always be there\nHide in the dark another day\nThe fear in you is here to stay\nSo keep the fuck away from me and learn to trust the words I say\n\nHatred fuels my blood\nI'll burn ya down (You can't help me)\nOne king to watch the horsemen fail\nI'll fight 'til the end (I won't help you)\nI can't trust anyone (Witness and see it in my eyes)\n(Chorus vocalizing) \nNow I can understand\nPut faith in you for the last time\nIt's sorrow that feeds your lies\nHa! Yeah, yeah!\n\nRun from me before I tear you down (Be afraid)\nYou chose the wrong side (It feels so right)\nI won't help you, let you rot away (Despise what you say - Chorus vocalizing)\nRun towards the light exposing your soul (We won't be there by your side - Chorus vocalizing)\nSalvation's dying (Somebody's crying)\nWe're all gone in the end (Chorus vocalizing)\nSweet child we'll miss you\nNo, so far away, far away\n\nI can't trust anyone (Witness and see it in my eyes - Chorus vocalizing)\nNow I can understand\nPut faith in you for the last time\nIt's sorrow that feeds your lies\n\nFalling away\nCan't buy back time\nBurn it down anyways\n\n", "album": {"title": "City_Of_Evil_(2005)&&3690", "genre": "Heavy Metal", "year": 2005}}, {"title": "Betrayed", "href": "Betrayed&&1432", "artist": {"unique_name": "Avenged_Sevenfold"}, "lyrics": "Passion in my eyes, I lived it everyday, but how could you go throw it all away?\nIn my dreams it's me and you, it's there I saw it all come true\nAs time went by faith in you grew, so one thing's left for me to do\n\nI feel it burn inside, burning me like the rising sun\nLifted into the sky, took away the only thing I loved\nI know after tonight all your power crumbles in my arms\nSo don't worry, I'll be fine, when my life ends, I'll leave this scar\n\nAnd I felt down I need you there every note and every word seems so hard to take Finally, were destined.\n\nA smoking gun in hand, now don't you realize what you've done\nPut a bullet in his back, your hero since you were so young\nHow could you kill the man who brought salvation through your pain\nHe must mean everything to end it all this shameful way\n\nPassion in my eyes, I lived it everyday, but how could you go throw it all away?\nIn my dreams it's me and you, it's there I saw it all come true\nAs time went by faith in you grew, so one thing's left for me to do (finish you)\n\nI started here so young and helped you get along\nJust did it for the love, and people healed through us\nDon't live your life in vain, don't take it out on me\nYou're cracked, so just remember, I'm not your enemy\nI don't deserve to fall this way, by a man who felt betrayed\n\nI felt so down now you're around to rescue me\nEvery note and every word I'm listening\nSometimes problems seem too deep to take (too hard to take)\nSometimes I cry thinking my future looks so bleak\n\nFinally, together we were destined, I know what's best for us in the end\nSomeone hear me, someone stop me, someone listen, why aren't you listening?\n\nPassion in my eyes, I lived it everyday, but how could you go throw it all away?\nIn my dreams it's me and you, it's there I saw it all come true\nAs time went by faith in you grew, so one thing's left for me to do\n\nIn my dreams it's me and you, it's there I saw it all come true\nAs time went by faith in you grew, so one thing's left to finish you\n\n", "album": {"title": "City_Of_Evil_(2005)&&3690", "genre": "Heavy Metal", "year": 2005}}, {"title": "Sidewinder", "href": "Sidewinder&&9105", "artist": {"unique_name": "Avenged_Sevenfold"}, "lyrics": "I slide through the wasteland that's my world\nMy hunger takes your life, radar to keep me alive, yeah\nMercy's all that you need, mercy's empty in me\n\nCan't you feel the poison rising out of the morning and clear through the night\nYou can feel my strength destroy you straight to the heart from the venomous bite\n\nAnd I dry and I shed my skin tonight but my fangs are hard to hide\nAnd you know that you're going to die, yeah\nMercy's all that you need, mercy's empty to me\n\nCan't you feel the poison rising out of the morning and clear through the night\nYou can feel my strength destroy you straight to the heart from the venomous bite\n\nI can't regret, can't escape decisions made for me, no control\nFire that burns and never dies, wrapped around I'll bury my fangs inside\n\nMaking my way through the night you're still in my sight\nYou're runnin' away 'cause ya know you can't hide\nMy instincts are cold blooded hate; to you I'm the bearer of fate\nWrong place and now the wrong time, now terror is all that you'll find\n\nCan't you feel the poison rising, straight to the heart of the venomous bite\nCan't you feel the poison rising, out of the morning and clear through the night\nYou can feel my strength destroy you straight to the heart from the venomous bite\n\nI can't regret, can't escape decisions made for me, no control\nFire that burns and never dies, wrapped around I'll bury my fangs inside\n\nStay inside tonight - you're out there all alone\nVanish from my sights - venomous control\nYou won't make it right - my appetite has grown\nLost your final fight - no love will be shown\n\nStay inside tonight - you're out there all alone\nVanish from my sights - venomous control\nYou can't make it right - my appetite has grown\nLost your final fight - no love will be shown\n\n", "album": {"title": "City_Of_Evil_(2005)&&3690", "genre": "Heavy Metal", "year": 2005}}, {"title": "M.I.A.", "href": "M.I.A.&&5147", "artist": {"unique_name": "Avenged_Sevenfold"}, "lyrics": "Staring at the carnage, praying that the sun would never rise\nLiving another day in disguise\nThese feelings can't be right, lend me your courage to stand up and fight\n\nOh... tonight\nStand up and fight\n\nMy fighting rages on and on, to challenge me you must be strong.\nI walk your land but don't belong, two million soldiers can't be wrong\n\nIt's no fun but I've been here before\nI'm far from home and fighting your war\n(Not the way I pictured this, I wanted better things)\nSome are scared others killing for fun, I shot a mother right in front of her son\n(Take this from my consciousness and please erase my dreams)\n\nFight for honor, fight for your life\nPray to God that our side is right\nThough we won I still may lose, until I make it home to you\nI see our mothers filled with tears, We grew up so fast where did those years go?\nMemories won't let you cry, unless I don't return tonight\n\nSo many soldiers on the other side, I take their lives so they can't take mine\n(Scared to make it out alive, now murder's all I know)\nNobody tells me all the reasons we're here, I have my weapon so there's nothing to fear\n(Another day, another life, but nothing real to show for)\n\nFight for honor, fight for your life\nPray to god that our side is right\nThough we won I still may lose, until I make it home to you\nI see our mothers filled with tears, We grew up so fast where did those years go?\nMemories won't let you cry, unless I don't return tonight\n\nStaring at the carnage, praying that the sun would never rise\nLiving another day in disguise\nThese feelings can't be right, lend me your courage to stand up and fight\n\nWatching the death toll rise wondering how I'm alive\nStranger's blood on my hands, shot all I can\nThere are no silent nights watching your brothers all die\nTo destroy all their plans with no thought of me (No thought of me)\nNo thought of me\n\nOh...\n\nYou walk the city lonely, memories and thoughts are passing by\nA murderer walks your streets tonight\nForgive me for my crimes\nDon't forget that I was so young, but so scared\nIn the name of God and the Country\n\n", "album": {"title": "City_Of_Evil_(2005)&&3690", "genre": "Heavy Metal", "year": 2005}}, {"title": "Strength Of The World", "href": "Strength_Of_The_World&&4214", "artist": {"unique_name": "Avenged_Sevenfold"}, "lyrics": "My story starts the day they said \"she can't be found\"\nThe news so dark, our hearts stopped, stood silent without a sound\nIt's over, she's finished, mother lies with your father and sister too\nCold-blooded, they suffered, shot down by the outlaws after you\nSorrow swallows my screams\n\nStrength of the world! - is on my shoulders\nStrength of the world! - is on my side\nStrength of the world! - the one true beholder\nIce in my veins! - for those who've died\n\nI've seen my family fade away, you've taken my whole life\nThere's nothing left to say\n\nAvenged the dead killed all who cross me in my path\nSuicidal, I never planned on coming back\nI want it, I need it, revenge is dripping from my teeth\nNeed nothin', to feel power, and bring the killers to their knees\nNothin' to lose vengeance to gain (you know I'll never be the same)\nSo taste my breath I'm close behind you (so desperate on your final day)\nSorrow swallows my screams\n\nStrength of the world! - is on my shoulders\nStrength of the world! - is on my side\nStrength of the world! - the one true beholder\nIce in my veins! - for those who've died\n\nI've seen my family fade away, you've taken my whole life\nThere's nothing left to say\n\nSitting in silence with heaven above me I prayed every night by their graves\nWhile I search for closure I feel it no longer\nI can't turn my cheek away\nI'll stand before you, I'll sin when I have to\nBut now I leave your side, to avenge my family's pride\n\nI've seen my family fade away, you've taken my whole life\nThere's nothing left to say\n\nStrength of the world! - is on my shoulders\nStrength of the world! - is on my side\nStrength of the world! - the one true beholder\nIce in my veins! - for those who've died\n\nSo far forever now alone, a greater punishment on me has been imposed\nA killer falling from the light, I'll miss my family, I'll never be all right\n\n(Whisper)...and that's all she wrote...\n\n", "album": {"title": "City_Of_Evil_(2005)&&3690", "genre": "Heavy Metal", "year": 2005}}, {"title": "The Wicked End", "href": "The_Wicked_End&&3814", "artist": {"unique_name": "Avenged_Sevenfold"}, "lyrics": "Man's becoming more corrupt now, godless, wicked, and cruel\nThe soulless man stood silenced, Mary's words rang so true\nChastisement worse than the flood, spread the word, it's all through\nDon't kill the messenger now\nAs if we haven't swam enough in this life of misery\n\nVoice your prophecy, shed us some light\nFeel sorrow for mankind's chance to survive\nSwallowed lies and swam in our own tears\nA stab in the dark but it wounded our will\n\nWe won't be here tomorrow, hold on to me for one last time\n\nWe've grown into the number, six hundred sixty-six\nWar breaks, a sign of the end, eternally expelled\nLook to the sky for knowledge, the stars align tonight\nEclipse and heaven shall fall\nNow I know I've seen it all in my life of misery\n\nVoice your prophecy, shed us some light\nFeel sorrow for mankind's chance to survive\nSwallowed lies and swam in our own tears\nA stab in the dark but it wounded our will\n\nDust the apple off, savor each bite\nAnd deep inside you know Adam was right\nLust and power, indulgence, no fear\nLeft with his sins, how does this end?\nWe won't be here tomorrow, hold on to me for one last time\n\nAs the prophets shedded light on what's to come the crowds did gather\nYour time is precious, they explained, no time to worry, messiah's coming\nDon't go to sleep tonight, darling, hold me in your arms\nThese will be our final days and I can't let go\n\nWalls are falling, churches burning, women ravaged, children crying\nFlesh is tearing, some still fighting\nIn this world of misery\n\nVoice your prophecy, shed us some light\nFeel sorrow for mankind's chance to survive\nSwallowed lies and swam in our own tears\nA stab in the dark but it wounded our will\n\nDust the apple off, savor each bite\nAnd deep inside you know Adam was right\nLust and power, indulgence, no fear\nLeft with his sins, how does this end?\n\nWe won't be here tomorrow, hold on to me for one last time\n\n", "album": {"title": "City_Of_Evil_(2005)&&3690", "genre": "Heavy Metal", "year": 2005}}, {"title": "Trashed And Scattered", "href": "Trashed_And_Scattered&&5479", "artist": {"unique_name": "Avenged_Sevenfold"}, "lyrics": "Keep on writing you're just raping yourself (nothing can take my mind away from them)\nDon't you ask about me, ask 'bout somebody else (Once I've fallen there's many stories to tell)\nI can't feel it, won't embrace it, it's overwhelming how far ya take it (Stuck in a state of questioning)\nAnd don't you tell me you know we' re destined, you won't convince me, I won't listen (Resentment building, you've put\nOur lives on hold)\n\nTrashed and scattered again, I'm feelin' so low\nYou waste your breath while fuckin' with me, my blood is so cold\nMy destination is always unknown, I'll find my way there\nBut you Goddamn Motherfuckers always wasting my time\n\nI won't be the victim, but the first to cast a stone\nSedated nights to the bar room fights as metropolis takes its toll\nAnd don't you try to stop me, it's a place you'll never know\nDon't try to judge or take shots at me, I'll never let you seize control\n\nPlay your game and walk away your integrity don't mean shit\nCrawl on me you fucking parasite, and I'm gonna take you out\n\nLabel me, that's fine, I'll be somebody else (Nothing in front of me but holes ahead)\nLie about my life, have a story to tell (Lights went down, was on the edge and I fell)\nOh you're so insightful, let me remind you to twist and break me, should make you worried (Long way to go and you're\nRight there)\nTwo-faced liar, don't try and know me, deceit brings fire, makes sure you can't breathe (Pick at pieces of my body below)\n\nI never bothered with all the rumors, too much garbage (all the same)\nI'll stand right here, come on you falsehood deceitful liar (There's no shame)\nDon't ever take my side, I know you're never right, I'll justify the means (Nothing's what it seems)\nI'll stand around and fight, but there's no point tonight, been chained to this machine\n\nTrashed and scattered again, I'm feelin' so low\nYou waste your breath while fuckin' with me, my blood is so cold\nMy destination is always unknown, I'll find my way there\nBut Goddamn Impostor are you out of your mind?\n\nI walk down these roads alone and now you're seen here\nMy feelings that I'm having towards you are perfectly clear (I control this ride)\nMy devils appetite is tonight and now I'm all right\nBut you Goddamn Motherfuckers always wasting my time\n\nPlay your game and walk away your integrity don't mean shit\nCrawl on me you fucking parasite, and I'm gonna take you out\n\nI won't be the victim, but the first to cast a stone\nSedated nights to the bar room fights as metropolis takes its toll\nAnd don't you try to stop me, it's a place you'll never know\nDon't try to judge or take shots at me, I'll never let you seize control\n\nDon't try and get the best of me (No one can help but your own self)\nCity makes my body ache (Lonely, don't try and prey on me)\nI feel your world keep dying, no more use in tryin'\nAnd my body's trashed and low, but to you I'll never show myself or what's inside\nAnd I've seen it all before but I'll settle the score, I'll never join your side\n\n", "album": {"title": "City_Of_Evil_(2005)&&3690", "genre": "Heavy Metal", "year": 2005}}, {"title": "Seize The Day", "href": "Seize_The_Day&&4840", "artist": {"unique_name": "Avenged_Sevenfold"}, "lyrics": "Seize the day or die regretting the time you lost\nIt's empty and cold without you here, too many people to ache over\n\nI see my vision burn, I feel my memories fade with time\nBut I'm too young to worry\nThese streets we travel on will undergo our same lost past\n\nI found you here, now please just stay for a while\nI can move on with you around\nI hand you my mortal life, but will it be forever?\nI'd do anything for a smile, holding you till our time is done\nWe both know the day will come, but I don't want to leave you\n\nI see my vision burn, I feel my memories fade with time\nBut I'm too young to worry\n(A melody, a memory, or just one picture)\n\nSeize the day or die regretting the time you lost\nIt's empty and cold without you here, too many people to ache over\n\nNewborn life replacing all of us, changing this fable we live in\nNo longer needed here so where do we go?\nWill you take a journey tonight, follow me past the walls of death?\nBut girl, what if there is no eternal life?\n\nI see my vision burn, I feel my memories fade with time\nBut I'm too young to worry\n(A melody, a memory, or just one picture)\n\nSeize the day or die regretting the time you lost\nIts empty and cold without you here, too many people to ache over\nTrials in life, questions of us existing here\nDon't wanna die alone without you here\nPlease tell me what we have is real\n\nSo, what if I never hold you, yeah, or kiss your lips again? Whoa\nSo I never want to leave you and the memories of us to see\nI beg don't leave me\n\nSeize the day or die regretting the time you lost\nIts empty and cold without you here, too many people to ache over\nTrials in life, questions of us existing here\nDon't wanna die alone without you here\nPlease tell me what we have is real\n\n(Silence you lost me, no chance for one more day)\n(Silence you lost me, no chance for one more day)\nI stand here alone\nFalling away from you, no chance to get back home\nI stand here alone\nFalling away from you, no chance to get back home\n\n", "album": {"title": "City_Of_Evil_(2005)&&3690", "genre": "Heavy Metal", "year": 2005}}]