[{"title": "Destiny", "href": "Destiny&&6228", "artist": {"unique_name": "B-Legit"}, "lyrics": "B-Legit (Levitti)\nAnd it goes down, like this, like this\n(Into my des-ti-ny, now I see now I see)\nAnd it goes like this, like this\n(Was once confused by these haters, now I see now I see)\n\nI'm in the house about six, twist the lit\nI park my V-Hic feedin my bitch\nThey wonder if I switched since I signed my deal, I'm Legit!\nI'm deep up in this game for real\nThe bars of steel I got the black gate\nTwin 38's just to keep things straight\nI'm late for everythang money is joy\nI run the rap game like a ol' D-boy\nI can rock gator boots and wear K-Swiss\nPut the diamonds on my pinky watchin the wrist\nI'll tell you like this the g'z gon' sag\nWit some real freem in my bag\nAnd it goes like this, like this\n\nDes-ti-ny now I see, was once confused by these haters in this cold\nSo-cie-ty\nNow maybe I'm wrong about the way I fluc\nBut the game stays real to me I can't help but get my skrill\n\nI'm in the wind, 600 Benz up in the traffic\nMy rims, reals girls in it's like magic, its drastic\nTryin' to live the life that I live\nI rap P.I. and stay high as I need\nI'm a factor, brought in a rapper\nI'm from the game\nLegit is the name the mo' skrilla the fame\nIn the train, all in Seatle where it rains\nYou can by my slang I'm from the bay maine\nA rap star piece I'm a beast on the mic\nIt's ten, I'll creep up in by midnight\nYou can check my rap site B-Legit.com\nAnd it tell you that yo' boy he the bomb\nAnd it goes like this, like this\n\nMake way, a brand new day, so peep the boss\nIt's true when I come through so tear it off\nIt cost, so we all kick it and ball\nAnd talk about the platinum and gold on the wall\nI'm a savage, ain't nobody bad like me\nGot people from the bay all the way to DC\nAsk the boy RP and KRED\nAbout a hog out the valley named legitamet B\nI'm a mac, I rap on special request\nCall me superman without the cape and the \"S\"\nI'm from the hillside and plan to hold that down\nSo let me know when you fools hit the westbound\n\n(Levitti)\nI'm feelin' like I got the whole world in my hands\nGive the boots on the feet for the limp-in\nSophisticated high classsssy\nIf you gonna have it, have it Lavissssh\n\n", "album": {"title": "Hempin%27_Ain%27t_Easy_(1999)&&4784", "genre": "West Coast Hip Hop", "year": 1999}}, {"title": "It's in the Game", "href": "It%27s_In_The_Game&&2965", "artist": {"unique_name": "B-Legit"}, "lyrics": "It's in the game!\n\nIt's in the game!\n\n(B-Legit)\nTwo to fo months on federal hold\nI been good, can't believe the game is cold\nSomebody told, that I couldn't handle my floss\nAcross the bay snitches tryin' to shake shit off\nI made a call to my lawyer, one to my bitch\nTwo niggas stuck and we start to sit\nCase hella weak, got to dismiss shit\nI threw the words with the fish like swiiiss\nI only dealt on y'all 'cause I had some warrants\nTell you to a player on some tickets and toys\nI never had a bad case, check my fat on that\nI spend a rap, I bet my lawyer peeped that bat\nI rap, 'cause my mouthpiece the best\nThen I let a nigga out on house arrest\nI break from the game, got a nigga change\nShit will never change it's in the game\n\nIt's in the game!\nIt's in the game, ghetto stars, cars, cocaine\nWhen hustlers slang, some niggas bang, it's everythang\nWeed, hoes, speed, hop, greed, snitches bleed so what you you need\nIt's in the game!\nIt's in the game!\n\nI'm a savage about mine for real tho\nKick a bitch in the mouth with my steel toe\nSay wussup to my niggas off the Filmore\nScooty G, Prop D, and Young ill hoe\nOn a mac block shit to get niggas the fame\nB's got the blunt and Twins got the game\nIt's no kool aid just indo\nWatch a bitch get naked for the kindo\nI bounce outta there, make my way cross town\nDick hard, finsta go knock shit down\nI'm commin through now, 'cause I'm affiliated\nI'm bout' to fuck 'n' get out 'n' leave uritaded\nI was player hated, bitch heard me speak\nPut a note in my pocket said you had me weak\nHit 3rd street 'n' run in the same\nHella 'n' fame, it's in the game\n\nIn my last run, bout' to close up shop\nGot bitches in a rental holding keys to hop, but me I'm nonstop\nI catch the red eye and when my hoe touch down\nI be a mo' ti'\nI'm in a suit top, lookin' business like\nOn my lap top fucken with the web site\nEmail La tell em' hold up\nI got good shit commin' fista blow it up\nKeep my mouth shut, never tell my raps\nAnd niggas pay me double when they know it's a (??)\nAnd fo' a coo amount, we can take em' off\nHave yo niggas meet mine at the shoping mall\nWe ain't takin' falls, got balls of steel\nTakin' hits, see these (??) (??) get killed\nIt's real, fucken appeal, I aim\nIf I'm shoot in the brain, it's in the game\n\n", "album": {"title": "Hempin%27_Ain%27t_Easy_(1999)&&4784", "genre": "West Coast Hip Hop", "year": 1999}}, {"title": "Where the Gangstas At", "href": "Where_The_Gangstas_At&&4828", "artist": {"unique_name": "B-Legit"}, "lyrics": "[B-Legit] (Kurupt)\n(Gangsta time)\nWhere my gangstas at?\n(Gangsta ville)\nWhere all my gangstas at?\n(You know it ain't a gangsta ville withoout a dog pound)\nAnd a hog nigga (caughing)\nYeah, special dedication\nTo all my gangsta niggas and to all my gangsta bitches\n(I'm sick wit it tho, check it out)\n\n(B-Legit)\nI used to mash through the crowd\nMakin' bitches wonder \"DAMN\"\nThat nigga B-Legit's the man\nIt was 65 grand for the land\nFo 5 O, 4x4, hit the strip slow\nWindows on tint so they can't look in\nIt's me the kingpin hit and Mac 10\nOn a trip about to hit up the 6\nShould I give up, them niggas run up\nThey fucked, now what\n\nHuh, whos that?\n\n(Kurupt, Mack 10)\nThat nigga Kurrupt\nG'z up, hoes down, muthafucka blaze up\nD.P.G.C. muthafucka g'd up\nIn all blue and grey all day always\nLet the dogs out muthafucka\nHear the barking\nSee the homies G-walking gangsta talkin'\nBitches low on dick often very often\nLil beeyotch 135 pounds of all diaaack\n\nI keep the house always stoppin' them dubbs to the bay\nFina fuck with B cousin and E fo tay\nFrom my hood to yo' town it's all about the cash\nGot the check and the hoe checkin' off in the stash\nDon't worry bout' nathan, we out there slangin\nMac 'n' Kurrupt stay down for whobangin\nKeep a fat sack of dope 'n' fo sho I'm Dealy\nMaine, the first foo crossin fo sho I'll kill em'\nWhere the gangstas at?\n\nWhere the gangstas at?\nWhere the gangstas at?\nTell me where the homies and the gangstas at!\n\n(Mack 10)\nWe gone keep it gangsta ain't go to pop\nPush the six double O and the Rarri drop\nGet the two tickets spread on top of the hill\nNiggas bellin em' chucks makin' over a mill\nKeep the studio full of groupie hoes and choosas\nIn the gut bruisas 'n' three time losers\nMac 10 still thuggin', that's what's expected\nAnd I vow to keep it ruff as long as I'm connected\n\n(Kurupt)\nMan I don't give a fuck about a bitch\nMan I won't ever ever give em' shit\nI hit the switch about 5 times\nThen I make a switch and bust 5 rymes\nSwerve wit a homie that can serve 5 verbes\nMan that's the life then go home to my wife\nWith my pistol (??) (??)\nRetire a nigga, now I'm a let my girl write my first verse\n\n(B-Legit)\nI hear it's funk on board, they need to let that go\nGot killas gettin' down for a brick of snow\nAnd for the right doe have your head chopped\nTag the drug, bitch you fuckin' with thugs\nNo time for pleasures, I got mills to buy judges\nThey rush us, tryin' to touch us\nThey bust us, no we all burn for scraps\nSo tell me where the homies and my gangstas at\n\n", "album": {"title": "Hempin%27_Ain%27t_Easy_(1999)&&4784", "genre": "West Coast Hip Hop", "year": 1999}}]