[{"title": "Dig Them Up And Try To Reason With Them", "href": "Dig_Them_Up_And_Try_To_Reason_With_Them&&2787", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "Throw in!\nGot mine for the party line.\nIt seems that everything we do is part of a grander scheme.\nWe're still killing parents.\nDid you hear about the beatdown on the streets of old town?\nSome of that was true.\nBut I swear we're learning more.\nWe're gonna fire when ready.\nI got shovels and right hands, I got guts and I got fuel.\nBreak ground, push down, dig deep and throw.\nSplit wood, lift hood inhale and hold.\nI got lamps and I got spikes, I recite just what I'm told.\nBreak ground, push down, dig deep and throw. \nSplit wood, lift hood, inhale and hold.\nBomb set. Who's coming out?\nNobody steps on a beerhall in my town.\n\n", "album": {"title": "Shake_Your_Body_Politic_(2005)&&8804", "genre": "", "year": 2005}}, {"title": "You're Either With Us Or You're With The Satirists", "href": "You%27re_Either_With_Us_Or_You%27re_With_The_Satirists&&7461", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "Stopped dead by the force of the attack,\nMade mute by the rhetoric that fought back.\nLeft treads lightly on bridges we'll be burned on.\nSelf-made are the enemies they've funded.\nWar with Oceania as always.\nOnce again I'll mourn New York like Yeman, Bethleham, or Zagreb.\nI've a unilateral condemnation for a second hesitation\nAddressing the impunity in political immunity.\nIf Pinochet ain't fit, then you must acquit;\nSets a precedent in punishment for acts of war in government.\nDamned to curse it all.\nGoddamn these misled patriots who run headlong into history's oldest joke.\nWe're all drowned in a flood of ignorance of our history,\nAnd I'll snicker softly treading water.\nI object to the moral carpet bombing of the patriotically abject.\nWhen we're dispossessed of this stupid victim's vengeance\nThen the humour in this begins to wreak.\nIt's an eye for an eye till we all go blind,\nBut the king's are those who can best describe\nThe grasses as deader in the lawns\nBeyond and a moral obligation to police the commons.\nAs if the criminalizing of the dissidence rising in the students\nIn the capitals and educated radicals\nWasn't enough to quell the shaping of the stones,\nThen they had to go and forbid Singh a megaphone.\nWho'll be left to call us out?\nDamn.\nCame so far just to fall by a pretext of terror we've built.\nWelcome to the world we've built.\nNow you're surprised?!\nWhat made me hesitate to make this complaint again?\nNew weighted terms and history with a PR spin.\nI'll be damned if I watch a war of pride again,\nLet alone learn it's name off of CNN.\n19 hundred seventy nine.\nWho were the allies that time?\nHow long before we see that security, policy, history are the terror we breed?\n\n", "album": {"title": "Liberty%27s_Ugly_Best_Friend_(2003)&&5716", "genre": "", "year": 2003}}, {"title": "Cobra Constant Committee Bake Sale", "href": "Cobra_Constant_Committee_Bake_Sale&&5776", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "I've been falling harder with this city's decline.\nAnd I know I'm not getting any smarter.\nEvery blackened skyline has some failure in mind that rains on down around quitting time.\nAnd we drink in gulps, through sobs and old gridlock;\nTrekking for wiles the longest damn street in the world.\nAnd although we're young wide eyed and crooked tongued, we're sick of our streets.\nDon't know how to love them.\nConcrete's made us stronger because one thing's for sure;\nThese pop songs don't come easy anymore.\nOur mayor's been shooting for the 'leftist crator.'\nBut that's gone south like town hall jumpers.\nHell, I'll just ask Jane Doe 'bout all the lengths\nOne goes to turn up the volume on the neighbourhood screams and shrieks;\nTo want to paint it red, until the chief is dead and paraded downtown all damn day.\nSo let them bury me anywhere but home because it's been so long,\nI don't care where I'm from.\nI've never been homesick as long as I've walked all alone.\nJust let them bury me anywhere but home because it's been so long,\nI don't care where I'm from.\nThough hallowed, still shallow, this ground couldn't keep my ghost down.\nAssaults we still permit our poet-politic:\nMy violet bruises grand as sunsets that we missed?\nWe're still falling for old talk 'bout newer mores;\nHabourfront circus plans where once we took a stand.\n\n", "album": {"title": "Shake_Your_Body_Politic_(2005)&&8804", "genre": "", "year": 2005}}, {"title": "I've Got Your Revolution Right Here, Wise Ass", "href": "I%27ve_Got_Your_Revolution_Right_Here,_Wise_Ass&&3976", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "Here we are; another school night proclamation of the greater good.\nAnd what's more, I've the gall to curse and moan about the state of my upset.\nCalling all those who'd hate to grow up.\nWhen we're left to our own devices recalling all our youthful ideals\nWithout any means to enact a change.\nWhen all we are is what we've been taught;\nA curt reflection of what we've bought until we present another way.\nNo!\nWe can be more, I swear.\nThis could be more than 100 bodies silent.\nI can't and I won't suggest I'm wasting too much time.\nWe don't have to meet but we want to.\nWe don't have to gather but we long to.\nWe don't sing but we ought to.\nWe don't have to speak but we need to.\nWe don't gotta fight but we're going to.\nWe don't scream but we ache to.\nThere's more to this than just sound.\nThink about what you've heard on your way back home.\nThe screams, the chants and the romance, that can't exist without noble intent.\nI'm so naive.\nI'm so naive still.\nDon't feel bad if I don't win everything we sang along to in our greater moments.\nWe're much stronger than the world would have us be.\nI'm so naive to suggest there's more to this than us.\n\n", "album": {"title": "Liberty%27s_Ugly_Best_Friend_(2003)&&5716", "genre": "", "year": 2003}}, {"title": "What I Destroyed On My Summer Vacation", "href": "What_I_Destroyed_On_My_Summer_Vacation&&8275", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "Know I'm still alive because I'm bleeding. \nNine lives and three sheets to the wind.\nThe story goes our hero boasts little more than a theory in its death throes.\nNo solace found in what I put to ground, but I'm stronger than you know I am.\nThis race is fixed, just so you know. Ready, steady, ante-up, one your mark, GO!\nAnd I know how this cat's gonna go: wrong way, full tilt, with his eyes closed.\nReckon the wreckage and reap what's left, pay no mind, be resigned to some fine print.\nThere's no guarantor of right. Every norm we know is spite. \nTempered by my fair resolve, the safest bet's on the writer and those who never flinched. \nSo c'mon, c'mon, and let's\nRaise the stakes 'cause I'm a contender and I'm swingin'.\nRaise our glasses here's to the quitters. Thanks for giving up.\nAnd I couldn't give a damn who's happy now citing law as right from the top on down.\nDo you only ever tire when you hit the ground?\nI feel it... I feel my rage a thousand different ways.\nWhich one dare you tempt now?\nBig winner, Mr. Knowtail. Breastplate and charter, back to the wall.\nStill paper, and they've killed for less. What's that they say about hedged bets?\nBulls and hammers made good neighbours... if you make 'em. \nSlings and arrows fight for ploughshares, when they need 'em most. \nEmbrace the crimson, broad, recoiling rage; the indignity and strife.\nDon't deny what humanity exists in knee-jerk contentions of right.\nDon't we ever recall discomfort?\nDon't dare ever settle for parchment or other such patrons of bloodless guile.\nFeast your eyes: it's not where I lay my head, but how I sleep at night.\n\n", "album": {"title": "Shake_Your_Body_Politic_(2005)&&8804", "genre": "", "year": 2005}}, {"title": "All The Good Guys Are Dead, And I'm Twisting My Moustache", "href": "All_The_Good_Guys_Are_Dead,_And_I%27m_Twisting_My_Moustache&&9844", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "So it's true: 1989 really is that far away and I wouldn't care,\nHad I not the fortune to be shown the history of memory lost.\nThe sky is falling down and we're being convinced that it's rain,\nWith ideals as parasols we're soaked all the same.\nQuestioning what we've always known.\nHere I reconcile the difference between my concern\nAnd long weekend discussions of our weakest ends,\nAnd parlour room socialism; activist party tricks.\nI'll cut dead the pitch and wane of 10,000 voices screaming,\nAnd I'll draw blood from the claims that Tiananmen isn't everywhere.\nBeauty is a weapon.\nSpark the fuse and we could be: just enough, just in time, just of thought.\nKnowing that all this belongs to us.\nWe will not be sold away on this forum of rights exchange.\nWhere have all the students gone?\nHave we been bought as well?\nDid we die?\nAre we as guilty?\nAnd we'll burn before we learn,\nWe'll fan these burning textbook pages keeping us awake.\n\n", "album": {"title": "Liberty%27s_Ugly_Best_Friend_(2003)&&5716", "genre": "", "year": 2003}}, {"title": "The Grand Preamble (Annie Get Your Gun, Mask, Ductape, And Some Matches)", "href": "The_Grand_Preamble_(Annie_Get_Your_Gun,_Mask,_Ductape,_And_Some_Matches)&&9211", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "I'm calling out all intellectuals and other traitors;\nRousers of the rabble and the instigators.\nGet you war on and curry favour\nTo the united states of nature.\nRest on clich&#233;s and weatherbeaten,\nWe've arrived having already eaten.\nSing allowed, my choir of heathens:\nWe're not coming home tonight!\n\n", "album": {"title": "Shake_Your_Body_Politic_(2005)&&8804", "genre": "", "year": 2005}}, {"title": "Zombie Cheerleader Slumber Party Massacre", "href": "Zombie_Cheerleader_Slumber_Party_Massacre&&819", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "We dumb smart kids got guts; we're buying in without selling out. \nAnd we're great at parties. \nMisplaced-aggression chic, or ill-read rebel's grief, we've got our weapons.\nWe've made a lifetime of wearing our comfort on tattered sleeve. \nI'll buy you everything baby, that's the way I show you my dissent. \nI spent all my cash on you, got nothing left. \nWe mock the tags we were at our subculture fairs; and we fight from checkout tills. \nHot, well dressed and dumb disposable income with a knack for abstraction. \nWe've made a lifetime of wearing our comfort on tattered sleeve. \nI'll buy you everything babe, that's the way I'll show you my dissent. \nI spent all my time with you, and we're singing... \nI don't care about the state of the world today. \nWe'll drown, but damn won't we look good. \nI don't care about the fate of youth anyway. \nIt's for the buying, looks as good as trying. \nI don't care about the state of the world today. \nI don't care. \n'Cause we don't know better. \nWe live with blinders on. \nOur memory nearly gone. \nWe get new fall-line chills. \nDissent and dollar bills! \nWhat do we see, what do we do?\nWe've made a lifetime wearing our comfort on tattered sleeve. \nI'll buy you everything baby, that's the way I show you my dissent. \nI spent my cash on you, got nothing left.\n\n", "album": {"title": "Shake_Your_Body_Politic_(2005)&&8804", "genre": "", "year": 2005}}, {"title": "The Starving Artist Weight-Loss Program Works... To Varying Degree... Somethetimes", "href": "The_Starving_Artist_Weight-Loss_Program_Works..._To_Varying_Degree..._Somethetimes&&1735", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "Where there's no smoke,\nWe've been burned alive, hearing two-cent mind cut us down to size.\nDancing with the spectre of unsolicited conjecture.\nWhile the emperor, he sold his clothes for opening slots on local shows.\nBut these comment of ennui aside,\nThis boy paid to enjoy the ride\nWith kids who fight their battles\nNot with cannons, but with rattles.\nIt was an eye for an eye about a year ago, now it's all \"I told you so.\"\nAlways had the guts somehow, so nothing's gonna stop me now.\nBut when I hear it from old allies, boy, well, I get sidetracked.\nYou can have it, kid, it's yours\nAnd you'll find me face-down, bloated blue on the banks of the Trash-Talk River.\nSo press my shirt and fetch me a tie. Set to work on my obituary-ai.\nWith great foresight, just a laugh, it's the same as my epitaph.\nHere lies a mouthy kid,\nRaised by a picket fence\nTo mean what he says\nWhen he screams.\nAlways had the guts somehow, so nothing's gonna stop me now.\nI've been swingin' for the fences since you thought to build them.\nI always liked 'em low.\nNevermind the hits I take. It's all about the punches I throw.\nYou're picking bones at the wrong damn table, boy.\nSwallow hard, I'm going to serve it to you now.\nHow could one slip from a grace so small as to be dismissed by a single-file style,\nObscure hardcore archivists?\nWell I'm still reeling from that fall.\n\n", "album": {"title": "Shake_Your_Body_Politic_(2005)&&8804", "genre": "", "year": 2005}}, {"title": "Bury My Eyes At 1510 King St. W.", "href": "Bury_My_Eyes_At_1510_King_St._W.&&6636", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "Cast out with the first of winter.\nColdest night since they last raised busfare.\nSeems fitting.\nIn this city it only ever gets this cold\nAfter shelters close and the commons gates are locked.\nThere but for the grace of good odds go you, go I, go we all, but we don't.\nA greater chill than the lake winds at morning:\nKnowing you've been heard but the city's still ignoring.\nThey built this.\nThe city would not entertain appeals to logic.\nSimply locked out, they assembled, built their own walls.\nDignity here lives by alms not asked for.\nBut how long could it possibly last?\nNow that the Pope's here gotta get the streets clear.\nWhat better time for good old Christian charity?\nTempered by the winter weather, cold hearts don't care what month it is.\nIt's all the same, they've themselves to blame.\nAnd we'll never be measured, no matter the weather,\nOn how we lived well while others froze.\nA systematic disease, motivated by greed,\nLeft alone when we all know there's room.\nBreak down City Hall, there's rooms for us all,\nThere's no problem till they hear it upstairs.\nBut what does that mean for the greatest in need?\nMust they fight at every corner?\nEven when they succeed in making all that they need,\n\"Dead\" property discovers its owner.\nI can feel my bones getting cold already.\nSteaming breath betrays our presence.\nMeasured in the way we care for our weakest,\nGod forbid we should ever lose our hold.\nCould we ever lose our hold?\nWe've walked these streets till morning.\nWinds cut through without warning.\nWe're strong as our greatest shame.\nSpeak its name, leads its way, this way home.\n\n", "album": {"title": "Liberty%27s_Ugly_Best_Friend_(2003)&&5716", "genre": "", "year": 2003}}, {"title": "Black Friar's Union Of Thursday Night Anarchists", "href": "Black_Friar%27s_Union_Of_Thursday_Night_Anarchists&&1641", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "I awoke so invincible the state indivisible hasn't had the chance to finish me yet.\nThe force of law notwithstanding moans, groans and the sting of student loans.\nI hit the ground running,\nWith subsidized funding laughing at the irony of the pub\nWhere we'll dine on the hands that feed,\nAnd pay the check by need according to ability.\nPresumed dead by the Kings on whom we've fed,\nSmile quiet when we lift their wallets.\nSomewhere there's a tanker named Condoleeza carving out its meager existence,\nLeaking out crude to the oceans, washing up on the banks just to trickle down.\nTired and half-dead, walking in half-steps, shuffling home in the snow,\nWe'll throw a short breath to the matron saint\nOf the kids who wait and sitting on armed hands.\nHey, what's that you say?\nNo one's listening anyway?\nSo let's just buy another round, get the platform down, and move the shadow cabinet along.\nWhat we do precedes our voice, we're not making any noise.\nSo have your mouth concealed and keep your eyes peeled for a rock that'll do the same.\nThis ain't no hit parade.\nAnd it's not a mess we've made.\nNevermind what we'll do tomorrow night.\nBecause where we come from it's called \"playing dumb\",\nIt'll get you what you need till your boss' back's turned.\nWe'll drink from noon till nightmare.\nThis self immolation, part of our recreation, adheres to our functional paradigm.\nNo better way to spot a comrade; we rely on Vino Veritas.\nBack at the homestead, loaded and well-fed,\nWe'll yearn for a greater sustenance:\nFights till light about laws and rights out of sight\nAnd what we'll do when the fires smolder.\nThis doesn't look like Grub St.\nWhere's my Cafe Voltaire?\nI never read it this way, subversion isn't the same.\nHere's to accounting for inherent failure.\nRaise your glass to black masks.\nPay respects to efforts past.\nWithout danger, we ask, what merits the task of protecting dead, dry, blue eyes?\nOne more round for the broken-hearted.\nCalled a movement and it barely started.\nWe're what dissent is about.\nWe might scream and lash out.\nBut not until we've sung our Pict Song.\n\n", "album": {"title": "Liberty%27s_Ugly_Best_Friend_(2003)&&5716", "genre": "", "year": 2003}}, {"title": "Broken Records", "href": "Broken_Records&&7401", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "Well, it was all roses and wine circa 1999.\nBack when my mentors spoke through headphones and my victories all had soundtracks.\nI'm only getting back there just today\nBy the good graces of those to whom I ache to say \"Thanks for playing the way you play.\"\n\n'Cause all I stand for are these broken records.\nAnd all I stand for are these broken records.\n\nYou know what? Screw the kids.\nScrew the battles I won't win due to the condescending ways by which I try to promote change.\nBecause when all is said, My heroes are all dead,\nSave for those precious few who stayed as strong as the backbones of their protest songs.\n\nJust when that needle hits the groove, walls shake, floors break, this body moves.\nThe smoky nightclubs are where I grew in 4/4 time.\nRevolt, resist, and press repeat, I'm fighting with my tapping feet.\nThis time, this song, they're mine.\nThe local halls where I grew a spine.\n\nI came alive again tonight watching the great blow minds\nSimply by taking the time to convince us we're in a mismatches fight.\nYou know I wouldn't change a thing.\nTo have grown up this way, nothing will ever be the same, nor could I go back to quieter days.\n\nJust when that needle hits the groove, walls shake, floors break, this body moves.\nThe smoky nightclubs are where I grew up in 4/4 time.\nRevolt, resist, and press repeat, I'm fighting with my tapping feet.\nThis time, this song, they're mine.\nThe local halls where I grew a spine.\nAnd heart. And eyes. And a tongue to cut 'em all down to size.\n\nYou must excuse these tired lines, but they've always suited me fine.\nI get what it means to gamble hard, to flirt with losing all but heart.\nGot a dancehall putsch? Hey, you know I'm in it.\nAll for 78 revolutions a minute.\n\nJust when that needle hits the groove, walls shake, floors break, this body moves.\nThe smoky nightclubs are where I grew up in 4/4 time.\nRevolt, resist, and press repeat, I'm fighting with my tapping feet.\nThis time, this song, they're mine.\nThe local halls where I grew a spine.\nAnd heart. And eyes. And a tongue to cut 'em all down to size.\n\nThis time, this song, they're mine, all mine.\nThey're ours.\n\n", "album": {"title": "Shake_Your_Body_Politic_(2005)&&8804", "genre": "", "year": 2005}}, {"title": "Class Aptitude Test Results Are In, And It's Martyr Or Matador For Everybody!", "href": "Class_Aptitude_Test_Results_Are_In,_And_It%27s_Martyr_Or_Matador_For_Everybody!&&7532", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "Keep time to the beat of walls coming down, three cheers for the supernational.\nTell that to the kid who just joined cadets; breast-fed on state-sponsored radio.\nLook at that, us troublemakers got a problem again; I never knew where or when,\nThis boundless world lost appeal to me, it's by the terms of the enemy.\nChance alone has placed us here.\nOur parents' pride condemned us to cross our fingers while we sing these anthems.\nEvery banner, every flag, I'll help you burn them up.\nI cross my heart and hope to tear my tongue out.\nI'm meek and I'm calling dibs on everything.\nNext stop, not victory, but much worse: Parliament hill.\nThis form has a function;\nBut a simple deduction to see the effects of pick up sticks and other games of statecraft.\nAll glowing hearts, dare you consider the truth of pride worth less\nThan what little we've done to own our actions.\nSuch white science abroad, progress with wink and a nod.\nOne road from the port to the mine to the capital.\nIt's easy enough to want more when you have it all.\nI'll lead this parade of thieves,\nStill refusing to grieve the loss of millions for something we've always laughed at.\nNow who's the sucker left holding the flag?\nWhat are we waiting for?\nI'm done with picking teams.\nI've got some kerosene and matches are not hard to procure.\nGrab the loosest thread.\nGrab the loosest thread and run...\n(Sing hard, think loud, I dare you)\nThese dreams are as far-fetched as the nearest nation state.\nRun up the flag, run hard, and plant it right through your heart.\nGrab the loosest thread and run.\n\n", "album": {"title": "Shake_Your_Body_Politic_(2005)&&8804", "genre": "", "year": 2005}}, {"title": "Anybody Remember John Enis, Chair Of The Board Of Tourism For Bad Sex, Ont.?", "href": "Anybody_Remember_John_Enis,_Chair_Of_The_Board_Of_Tourism_For_Bad_Sex,_Ont.%3F&&6172", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "Miles 'tween and what I'll see yet, but I still shudder.\nThe engine's struggling.\nThe snowy drifts of the home we left betray the warmth of the hearts it kept.\nThese prairie mile kids, in droves, put knuckles into things they know.\nThe people and pits in Sydney, that Corless knew we had to see.\nDon't give me those eyes.\nYeah, it's still damn good to be here.\nNow let's start with the making eyes and sharing scars.\nAnd planning more.\nWell you've heard the grumbling by now, I'm sure.\nNow how's about we get down to the hard part?\nWe'll get the sex, the drugs,\nAnd the rock down flat in one trip flat and live out the rest in liner notes.\nNext stop at the free clinic 'cause grumpy Adam's grumbling again:\nI'll never see home again.\nNot that this whine and cheese ain't great and all,\nBut I surely do detect some pretence to it all.\nWe no-balls jabberjaws no not the history we offend\nWhen we put our feet up on the words of those who've burned.\nThese days we say it's better to get your lumps than never have seen your blood at all.\nWe know the cost.\nWe're consumed by loss as hearts explode on the road.\nYou want some Parecon, well we got that in spades.\nIt's every rock show. Let's go employ that ethos elsewhere.\nThese networks wane and die with every sneezing eye.\nMy boys ain't here for nothing.\nShow me how your town does it.\nThe underground is on fire.\nWho's gonna put it out?\nTell my family and friends, whatever's left of them...\nScream it from the rooftops, bellow till your heart stops.\nSorry Boss, I'm afraid that I'm not coming in...\nScream it from the rooftops, bellow till your heart stops.\n\n", "album": {"title": "Shake_Your_Body_Politic_(2005)&&8804", "genre": "", "year": 2005}}, {"title": "May Cruise Missile Diplomacy Keep Us Truthful, Good, And Mild", "href": "May_Cruise_Missile_Diplomacy_Keep_Us_Truthful,_Good,_And_Mild&&940", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "Damned by the wars we wage to a similar fate of the states we imitate.\nForgotten faster than Rome's walls came tumbling down.\nAdministering \"shock and awe\" with Tsunami bombs never did stand a chance,\nWhen I was floored at once by the one-two punch of benevolent terror.\nThis is what I meant by \"dying\" this is why I'm terrified of trying.\nIf we just play dead, they promise they'll stop when we've had enough.\nBut someone's got to teach the world about Texas-sized justice.\nDon't mistake this regret for weakened heart. \nWe're watching how it works and we're taking notes.\nWhat students we've become!\nDon't mistake this regret for weakened heart. Our repertoire of chaos and playing dumb.\nDon't think that we never saw you displace your mistakes at home. \nBuckle in hold tight, listen up, and go pre-empt yourself sir.\nOne more tune for the peace parade with threadbare banners that we made. \nBut if we want to take their ear... (change the speech we use) cut off off, hold it near.\nAnd scream.\nInto darkened streets we pour, so easy to ignore. \nGotta speak in kind to blood, bombs, and bottom lines. \nAnd that's just fine, because we've got the time. \nI'm sharpening my tongue now. \nWe hang, we fall. \nSinging last words under breath, but... we hang we fall. \nAnd the rope they used came right from us. \nWhere's Nero with his violin now? \nI know to run but I can't explain how. \nI've been looking for a way out of this one, truthful, good, and mild. \nWon't say where I went wrong. \nI am the least of any evil that you'll fight. \nWon't say when we've had enough. \nWon't beg when you've silence us. \nOur words will become firebombs. \nAs you wage your wars, I swear that's how we will fight ours.\n\n", "album": {"title": "Liberty%27s_Ugly_Best_Friend_(2003)&&5716", "genre": "", "year": 2003}}, {"title": "And The Award For Best Post-Coital Hug Goes To...", "href": "And_The_Award_For_Best_Post-Coital_Hug_Goes_To...&&2189", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "Once thought I could easily impart some beginner's knowledge to the upstart.\nI've long since left such bombast to fight back, never win, try again iconoclast.\nWe are the nonsense we espouse to waking minds in sleepy towns.\nOf the boroughs and the streets we've gleaned;\nLooking for a cleaner mind to drive obscene.\nThese eyes haven't been this dry since we gave up the first time.\nBad moves make great romance till you've grown fat on consequence\nAnd all resolve is a chain link fence.\nI've left before and I'll do it again.\nDaydreamers, get your hopes up, Wage workers, throw your heads back.\nFailed rebels sing with me.\nI haven't been the same since the last time you saw me.\nWe get tired of the waking dreams we're in; of rubbing elbows and taking them on the chin.\nSmile hard, this is what we asked for:\nTwo for flinching and one more to grow on.\nGoodbye hometown.\nGood night old friends.\nThere's just no telling when I'll be back if I stay the course I have thus far,\nAnd mark each mile with a scar.\nThey'll prop up what's left of me on the bar,\nWhere I'll pose for a picture sent with a postcard.\nGoodbye hometown. Goodnight old friends.\nThere's just no telling when I'll be back if I've tasted blood and known its source,\nAnd hid my wounds from this dead horse.\nPull these strings and I'll run the course.\n'Cause we are the wrenches?\nWe'll never grow up right.\n\n", "album": {"title": "Shake_Your_Body_Politic_(2005)&&8804", "genre": "", "year": 2005}}, {"title": "Walkerton, Workfare, And The Wusses Who Watched", "href": "Walkerton,_Workfare,_And_The_Wusses_Who_Watched&&2413", "artist": {"unique_name": "Bombs_Over_Providence"}, "lyrics": "Hey brother can you spare about a half a quart of rye?\nOntario water's killed before and I fear I'm the next one on its mind.\nI'm damned to review front pages, late apologies that couldn't save us.\nBarely literate, but well-fed, the fire in our eyes is a spark at best.\nThey'll sell the gas like they sell the water, I bet they'll kill us with that too.\nAnd we'll be choking ourselves to sleep alone at night\nBecause we like the girls that think real hard.\nWe'll never get our parents to understand.\nNot till everything is gone.\nNot till their last cherished safety net remains to be cut,\nSlashed, gone, gone, gone.\nAnd cutting Health Care's just the start,\nCutting Welfare's just the start,\nCutting our schools is just the start.\nHow did it ever get this far?\nThis is adherent to a greater trend of which we're but a part.\nSuch is our chance now to stand, reach out,\nPull, and bring down crumbling walls with us.\nNext stop old Queen's Park.\nOur eyes will light the dark.\nWe'll find fuel for that spark.\nBurning down the walls around the floors on which they're traded lives for votes.\nI'll take the trouble to investigate the rubble for a heart that'll set me right.\nI'll step down from this soapbox built in local halls on the weekends.\nI'll acknowledge this as optimism at best and trade my patchcords in for neckties.\nAnd I'll run back to my job.\n\n", "album": {"title": "Liberty%27s_Ugly_Best_Friend_(2003)&&5716", "genre": "", "year": 2003}}]