[{"title": "He Gave His Life", "href": "He_Gave_His_Life&&1088", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Intro-vocal sample)\n\"He Gave His Life today\"\n\"He Gave His Life today\"\n\n(Verse 1-Tek)\nIt was a road block, comin' to a full stop\nCanine, snipers on the rooftop\nYellow tape, orange cones, blue lights\n...Border past midnight\nHospital got my old lady screamin'\nRed eye, wavy hair, black demon\nTell me, is this what I asked for?\nIt ain't like a nigga never saw blood before\nBut, \"He Gave His Life today\"\nCould've sworn I saw the Heavens open\nThe world wonderin' why I gave up smokin'\nThey wonderin' why I gave up smokin'\nI seen too many premonitions\nFrom the cradle to the grave of our existence\nWhen one leave, one return in the flesh\nWhen that man took his left, my son took his first breath, so\n\n(Hook-Jahdan w/vocal samples)\n\"He Gave His Life today\"\nSo many youths drop out, livin' the gangsta life, oh\n\"He Gave His Life today\"\nTryin' to live the gangsta's paradise\n\"He Gave His Life today\"\nWhoa, whoa, you got to think about your life seriously\n\"He Gave His Life today\"\nFreedom or life, locked up in the penitentiary\n\n(Verse 2-Steele)\nYo, I wrote a song for the soldiers in the trenches\nIt's a long way from home, stay strong on your mission\nSince you're gone, not much been different\nPop proud, mom misses, sent a letter with a picture\nI ain't there with ya, but I'm there with ya\nTake care, mister, we still here with ya 'cause we care, nigga\nOver there similar to over here\nBe prepared, nigga, God forbid, these the words I hear, nigga\n\"He Gave His Life today\"\nThat'll make pop crazy, have mama screamin' \"Not my baby\"\nThe good die young, that's what they sayin'\nIn the hood where I'm from, that's an understatement\nCall it The Matrix, where rodents and snakes live\nThe world of hatred, we go on to make it\nWe make sure 'fore we leave this game\nThat Boot Camp Clik name associated with greatness\n\n(Hook-Jahdan w/vocal samples)\n\"He Gave His Life today\"\nYo, so many youths drop out, livin' the gangsta life, oh yeah, uh\n\"He Gave His Life today\"\nTryin' to live the gangsta's paradise, yeah\n\"He Gave His Life today\"\nThink about your life seriously, freedom or life, in the penitentiary\n\"He Gave His Life today\"\nTry to live the gangsta's paradise\n\n(Verse 3-Louieville Sluggah)\nI should be grateful and thankful for what I have\n'Cause some don't even have half of what I have\nThey say \"Henny on some shit\"\nWon't let near niggas slide 'cause that's how my homie died\nThey took his kindness for a weakness\nAnd over the weekend, they left my boy sleepin'\nThat's why I can't play with ya\n'Cause if you cross me over shit, I'ma let them things hit ya\n\"He Gave His Life today\"\nHe was a good dude, good son, good father to his seed\nTold 'em \"Be all you wanna be\"\nWord up, I miss my road dog\nYou know, grindin', shinin', shoppin' and club hoppin'\nWhatever the bank was, my boy stopped it\nA quick 4, 5, 6 and then it's in the pocket\nMy boy was too raw, R.I.P. Rude Dog\n\n(Hook-Jahdan w/vocal samples)\n\"He Gave His Life today\"\nUgh, so many youths drop out, livin' the gangsta life, oh yeah\n\"He Gave His Life today\"\nTryin' to live the gangsta's paradise\n\"He Gave His Life today\"\nThink about your life seriously, freedom or life, in the penitentiary\n\"He Gave His Life today\"\nTry to live the gangsta's paradise\n\n(Verse 4-Buckshot)\nLook at your boy now, he tryin' to come up\nThink he grown 'cause he can curse and roll up\nHold up, I know that ain't a pistol shorty\nYou barely a teen, what you mean you rip through shorty?\nAnd who said it was corny to be cool\nBetter then be a savage, or you rather be that fool?\nThe facts prove that that move is not smooth\nI got niggas pushin' flowers like that, who knew\n\"He Gave His Life today\"\nHmm, and if he would've thought smarter\nHe might've been able to start a\nFamily, damn a D fall for the same thing\nSo I keep you dry in the rain\nNo shame will remain, there's so many things in the game\nThat'll mess with your brain, so maintain\n'Cause, I knew a shorty your age\nThirteen, shot by a thirty-year-old gauge, and...\n\n(Hook-Jahdan w/vocal samples)\n\"He Gave His Life today\"\nHuh, so many youths drop out, livin' the gangsta life, oh, oh\n\"He Gave His Life today\"\nUh, Tryin' to live the gangsta's paradise, yeah\n\"He Gave His Life today\"\nThink about your life seriously, freedom or life, in the penitentiary\n\"He Gave His Life today\"\nLocked away for a century, yeah, hey yeah\n\n(Outro-Jahdan)\nSo many youths drop out, livin' the gangsta life\nTryin' to live the gangsta's paradise\nThink about your life seriously, freedom or life, in the penitentiary\nSend him a lord with the red and the blue\nAnd there be a wicked man holdin' down your crew\nYou don't know what they will or won't do\nNow the gun bangin' at you, yeah\n\"He Gave His Life today\"\nSo many youths drop out, livin' the gangsta life\nTryin' to live the gangsta's paradise\nThink about your life seriously, freedom or life, in the penitentiary\nLocked away for a century, yeah, hey yeah, oh yeah\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}, {"title": "Had it Up 2 Here", "href": "Had_It_Up_2_Here&&3330", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "It's going down baby!\nBucktown, Duckdown baby (whispering)\nMy B.C.C., Cocoa B'z, Top Dog (Sean Price)\nStarang where you at? B.D.I. Eye we got to this\nPeople, Don (Louieville)\nNiggas had it up 2 here (Louieville)\nA nigga had it up to here (Louieville)\nI'm tired of fallen' (Louieville)\nSlugs fallen' all day (Steele)\nFeelin' this, feelin' this (Steele)\n\n(Steele)\nI'm in the ride right\nGetting high right\nWhen some guy comes wit some papers for me to sign right\nAight money started acting fly\nLike I ain't shit he the one that should be in the lime light\nSaying he rhyme tight\nComing all out his face\nSaying that he's better than any rapper that out right\nI'm like look I care if you were dumb like\nYour demo was reviewed in The Source and they gave you 9 mics\nI can care less who look like\nOr who you rhyme like\nLet me show what a real MC sounds like\n\n(Buckshot)\nI pulled up to the red light\nSomebody was parked on my right\nI heard them like K\nAin't you that little nigga from Bucktown or Ducktown or whatever?\nWhat's up with you now nigga\nAs a matter of fact I got some rough shit and going love it\nMake you a million boy if you fuck with\nTrust me dog my flow is grimy\nSoon as spit you dog you'll be the first to sign me\nListen your flow is aight though\nReally wasn't tight though\nYou're kind of loose with aight bite flows\nGot me like Whoa!\nLet me keep it moving or my shottie might blow\nSpittin' but you bullshit me yo\nI can't hear your ill sub-libs\nYou ain't gotta feel Boot Camp to fill some tims\nBut you will respect the 4th Star\nOr I'm spit 4 at your sports car\nWhen you spit bar listen par\nYou better respect or I'm a have the check\nLet the loan half of the check got yet Hummm\nWho was it 'cause only stopped I 'cause I thought knew who it was\nNow move up\n\n(Tek)\nI had it up to here with y'all weak ass rappers\nDJ's CEOs I want y'all to know\nI had it up to here with y'all hundred grand producers\nFake ass thugs, dress codes in clubs\nI had it up to here with y'all P.D.R's\nRacist cops cheeba holders don't me start\nI had it up to here with y'all wannabe stars\nTrying to be who you ain't just be who you are, Man\n\nWho you think your talking be\nGet your head bust to the white meat, questioning me\nWon't play 'cause I won't pay what you think I'm a bitch\nNever tell who shot you what think I'm a snitch\nBut I will the order for them to smack you up\nClap you up, yo money lone we snatch you up\nThink you hide where, I got family over there and they all think like me\nWe had it up to here\n\n(Starang Wondah)\nAyo, I was a broke working nigga\nThis rap got me money\nI had bitches; my good looks kept the honies\nBut in the game niggas with real money\nThey steal from me, when you mention my name\nI changed the real money\nIn the game after a few years\nI'm still hungry, put the band back together\nIts bout get real ugly yo\nI crush plenty guys, I had plenty wives\nI'm on old school tapes I'm only twenty-five\nNiggas would doubt me, bitches talk about me\nThey both wouldn't be shit without me\nStarang One\n\n(Top Dog)\nYes, Yes Y'all\nY'all know niggas ready to brawl y'all\nHit the floor y'all\nThe 4-pound leaving all y'all wasted\nThe gun powder can you taste it\nThe Big Khahuna ready to ride up in your place, bitch\nCan you feel me?\nThese bitch niggas trying to kill\nNo what they do to me, to try to fool me see\nD.O. stay sharp and on top of my game\nSpittin' my flames, so don't throw dirt on my name\nI'm trying to hold lot of thing and make a whole lot of cream\nAll the plots and the schemes got me doing wicked things\n\n(Sean Price)\nShoot your moms, stab your pops, rape your daughter\nGet the moment on the tape recorder\nGive copies out to every nigga up in the hood\nLet them know I'm not the nigga to fuck with up in the hood\nGive me some weed, give some coke, give me some dope\nGive your seed; give me your throat, give me some rope\nChoking your bitch provoking your click\nTo get guns, smoking a spliff\nYou're throwing a fit, now that's fun\nBackpack niggas acting all funny and shit\nTill I them that shit is wack they're no money in this\n\nAnd you female rappers I'm end your careers\nRap my hands around your throat while you get banged from the rear\nI'm the type of nigga that will throw a shell in your arm\nYou the type to snitch, bitch\nWhy you telling my moms listen\nY'all bitch niggas are bout as wack as come\nDon't make me clap you in the back of the ass when I'm done\n\n(Illa Noyz)\nWe pack 10 billion, 987 million, 654 thousand\n321 hundred fans in housing know how we get down and\nWhat this shit about The Boot Camp sounding it's astounding\nBut I'm tried of it, questioning y'all budget\nI wanna snuff but I look him and be like ah fuck it\nBut now I ride wit it when I blow I slide wit it\nAll I know I'm Boot Camp and are niggas\n\nNow a days I had it up to here (Louieville)\n\n", "album": {"title": "The_Chosen_Few_(2002)&&1762", "genre": "East Coast Hip Hop", "year": 2002}}, {"title": "Daddy Wanna", "href": "Daddy_Wanna&&1041", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Female voice)\nNigga, where the fuck you been?\nI know you heard the phone pagin\nI know you heard the shit goin' off, okay?\nWhere the fuck you was at?\nWhere you was at that coulda been so important you couldn't fuckin' call\nThe little kid's pampers shitty as hell, ain't no fuckin' pampers\nThat's where the fuck you went, right, to go get pampers\nWhere the shit's at?\nYou don't smell that shit?\nYou smell it, right, you smell the fuckin' house?\nWhere the fuck was you?\nWhy you think the kids act like that when you come around?\nThey don't fuckin' know you\nWhy, cause you was a deadbeat dad, nigga\nThat's what the fuck you are\nThat's the role you play, piece of shit\n\n(VERSE 1: Starang)\nAiyo, I just want my baby to look and still love me\nKnowin' that her daddy's a crook, word up\nAll the time I'm in crazy drama\nWhen I pick up the phone call my baby's mama, aha\nShe try to tell my baby I'm no good\nBut she don't like to explain how Starang is so hood\nSayin' money ain't shit, she don't know no better\nShe got a regular job, she don't owe no cheddar, aha\nFightin and fussin, she's sayin', \"Fuck Will\"\nBut bitches always tryin' to ice-skate uphill\nBut I'ma stay aggy to keep you happy\nKnowin' it makes you mad when bitches try to get at me\nYou only four, don't like your hair nappy\nWe both won't rock gators less they Navy's\nI'ma bust my ass to make sure you have, girl\nCause right now you're all I have, word up\n\n(VERSE 2: Sean Price)\nAiyo, daddy wanna leave now\nYour moms playin' games and I feel deceived now\nI gotta go when I do a show or leave for tours she hatin'\nSniffin my drawers, ask me if I'm fornicatin\nI'm like, bitch please, gone are the days of me\nTrickin with chickens on the ave that striptease\nYo, and I don't like your moms\nGettin' to the point where I wanna strike your moms\nAnd I know you don't wanna see me fight your moms\nGet hype and commence to lead-pipe your moms\nAnd I ain't goin' to jail\nI'm packin my bags, I'm out the door, I gotta bail\n\n(VERSE 3: Buckshot)\nSit you down on that stool, give you a jewel\nAnd let you know you're never too young for that rule\nRule one: you must have knowledge of self\nTo know the only one you follow is self\nAnything else is useless, the truth is the youth is wild\nGrowin' up and they ruthless now\nBut you my child and I had you when I was half you\nNow I have to show you how to follow no man and when they ask you\nWhat you wanna do when you grow, tell 'em blow\nLet 'em know everything that glitter ain't gold\nNever fold when you come against a obstacle\nAnd know that nobody's stoppin' you but you\n\n(VERSE 4: Tek)\nDamn, it feel good to have my son on my chest\nSee my features in his face and I love him to death\nShow him how to move right, just right for a gang\nCause me and my father never did the daddy-son thing\nWhile I was in the streets pitchin, he in the crib bitchin\nMoms out workin, nobody in the kitchen\nNow I got one of my own and my nephews is grown\nStill I'm out grindin makin' a house a home\nFrom month to month, see, I live on the road\nGive 'em jewels and heat the hole cause the world is cold\nI put the joint in his hand so he used to the piece\nTold him white man's justice is a black man's grief\n\n(VERSE 5: Top Dog)\nYou could say I love my son more than I love my wife\nThink twice, you be sayin' Dog is trife\nThat's aight, it's a father and son type thing\nI got to war for mines and that's word to everything\nKnow what I mean, daddy gon' make the cash cream\nWhether fast or slow my son know about the dough\nYou know, some say the boy look like me\nBut if he look like me he gon' crook like me\nHe got a mind of his own, lighter tone like mama Jones\nHe love phones, the boy be buckwildin when I'm gone\nHe do the type of shit they say he been here before\nI think he's 17 months but he acts 17\nMy first born, so I had to name him Dashawn\nJarel (Name) Yates, he look like he lift weights\nWhen we stack this cake, we gon' roll like skates\n\n(VERSE 6: Steele)\nDaddy wanna stay, but daddy gotta go\nDaddy can't hang cause daddy gotta show\nPoppa was a rolling stone\nDaddy used to hold iron so I roll with chrome\nI was named after pops but they called me Tone\nSome ways like my pops, some ways of my own\nDaddy didn't know I got stoned till I got grown\nHad my own car, home, and my son to moan\nJust like daddy he wanna hang and roll\nNow I pass on game how to gain and grow\nI know hustlers that came, watched 'em go\nI peeped dudes on the come-up, watched 'em blow\nGive jewels to my little mens and watch 'em grow\nGive 'em presents just to watch 'em glow\nWhen I shine you shine, violate mine, you gots to go\nStay focused, there's a lot you sohuld kkonw\nStudy life, listen and learn, sleep long, miss your turn\nGotta get in where you fit in when a spliff gettin' burned\nWhen you see me on a mission it's commission I earn\nRemember as a man think if the world turn\nDaddy want a new six, ya heard, do tricks absurd\nMy little homie's too quick to learn, word\nDaddy need bricks, my son need kicks\nTim boots, jeans suits, all that new shit\nHe watch me do this, he know his daddy a soldier\nI rep G and Jah cause that's me all over\n\n(Kids)\nDaddy, when you gon' buy me a new X-Box?\nI want a Nintendo Gamecube\nAnd I want some new games for my X-Box, too\nI want a PlayStation 2\nDaddy, when you gon' take me and my brothers and sisters to Splish Splash?\nAnd when you gon' take me to the store and buy ice cream and candy?\nAnd when you gon' teach me how to drive your car?\nAnd I want $100 on my birthday\n\n", "album": {"title": "The_Chosen_Few_(2002)&&1762", "genre": "East Coast Hip Hop", "year": 2002}}, {"title": "Let's Get Down 2 Bizness", "href": "Let%27s_Get_Down_2_Bizness&&1379", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Chorus: Buckshot)\nLet's get down to business (say what?)\nI think I'm gonna have to pay a visit\nBeat to the ones that said I wouldn't get back\nWhen I get back -- get back\nLet's get down to business (say what?)\nI think I'm gonna have to pay a visit\nBeat to all y'all, this is for all y'all\nHandle your biz, fall in, you fall off\n\n(Steele)\nI've been kicked, cut, jumped, stuffed\nBy record company exec's, schemin' on my bucks\nThese streets is rough, Timb's on my feet get scuffed\nI hate to see my peeps get cuffed\nAs weed gets puffed, MC's get bluffed\nA&amp;R's get pressed, DJ's get they shit bust\nBucktown, Duck Down Enterprise Record\nWithout distribution, dog, we still push records\n\n(Buckshot)\nI step to my business, man, strongarm my own crew\nRock with a group and a long tool\nPeep the fore path, I been said the shit in the past\nLet's go back in time, flip the hourglass\nIn 1998, I couldn't wait, to get all my niggaz\nAnd do shows, from state to state\nEven in 2000, two triple oh\nI used to be the man, until my band got old\nBut I cannot fold, nor my paper thin\nGet all my paper in, or I'mm lace ya chin\n\n(Sean Price)\nKnow this B.I. thing, I be about it\nThe prophet is only logic\nI'm like assassins from Elijah Muhammed\nGet ya hands out my pocket, stop it\nYou can't have it, in Long Street\nIt can't happen on beat, let another label\nTry to play me for cheap, I'm takin' this cheap\nTrynna chase down paper, till the white display the heat\nThe devil may cry, that's for Cuba, I'm playin' for keeps\nHow my ends not gon' meet, at the end of the week\nI'mma be the streets for ya, I can get the streets on ya\nGive me the things, I can bang, plus I'm trained to get lower\nThat's the last time I seen a CEO and his lawyer\nSee my shit tight, and I don't stack 5 feet taller\n\n(Starang Wondah)\nYo, niggaz gossip quick to pop shit\nActin' like they pop shit, really not shit, yo\nMuthafuckers try to say I changed, man\nI'mma trynna change from Lex to Range\nDon't look strange, trynna say that I ain't the same\nY'all niggaz know about Starang, the same nigga\nFrom the white building up the block\nWho used to be the hype man, for Ruck and Rock\nWho knew the number to them bitches that can suck some cock\nGot in the beef, had thugs that'll bust them shots\nMy vocals make me more than bi-coastal\nYou local, I get this dough like I'm suppose to\nMake riches that's far from social\nHear these words, when we approach you\n\n(Top Dog)\nYou keep our business alone\nYou keep our business, in mind, your own\nNiggaz fuckin' with the feds, they got me fed up\nFuck keepin' it real, just keep ya head up\nDamn if I smoke the weed to keep me dead up\nNiggaz fuckin' with lens, that'll get them set up\nBucktown is the shit, so nigga shut up\nFuck parkin' the whip, just keep it reved up\nNiggaz needin' the fifth, to keep a leg up\nNiggaz bustin' they shit to big they set up\n\n(Sean Price)\nAiyo, let's get down to business\nLet's get pound with this shit, get that dough\nSlap a nigga, dude be like, yo why you do that for?\nSame reason I slap the other two, tic-tac-toe\nFuck around, and jump out the ride with the big black foe\nPop you in the face, and leave you with a big black hole\nEvery time I fuckin' rhyme, you always get that flow\nFuck you, I'm past that, ditch that flow\nHeard you performin' at what, niggaz, skip that show\nNigga ---\n\n(Hook 2X: Buckshot)\nWho we be, we be Boot Camp Clik\nClick, click, in the night\n\n", "album": {"title": "The_Chosen_Few_(2002)&&1762", "genre": "East Coast Hip Hop", "year": 2002}}, {"title": "The Chosen Few (Live For This)", "href": "The_Chosen_Few_(Live_For_This)&&7334", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(VERSE 1: Starang Wondah)\nHey yo, I remember Paula, a female baller\nWe hit down south, I would call her\nShe was lonely, strippin, had a job at the Shoneys\nThe only one who showed me the real from the phoneys\nStayed hangin' out with her best friend Tony\nEyes stayed red with a head full of pony\nAlways jokin sayin' she wish she could clone me\nActin' all friendly, I hooked her up with Henny\n\n(VERSE 2: Louieville)\nThen she told me for me and Foul to come OT\nYou know me, baby girl, show me the money\nDoin' 90 down 95 South\nIf we don't move it out, then the town'll have a drought\nPushin, pedal to the metal\nOnce we get there the worries'll get settled\nChillin', fallin' back for the week with\nMoney that counts and shorty bop's a freak\nToast to the dogs in the war\nThe one's who've been there, through rich and the poor\nThis bitch gotta twist up and hit\nAiin't that some shit, I gotta ask, ain't that a bitch\nBut a nigga gotta keep the shit rollin'\nKeep the shit potent, Hennyville stay smokin'\nAnd a nigga ain't crackin' no jokes\nSmackin up your folks\nCause a nigga know broke\n\n(VERSE 3: Sean Price)\nHey yo, I rhyme all day, I rhyme all night\nI got to sleep, wake up, and rhyme some more\nStarvin like Marvin, niggas screamin, \"I'm so poor\"\nHit records, bangin' videos but I'm so poor\nYo, can I hold somethin'? I'm fucked up, duke\nYou can tell by my jeans and my scuffed up boots\nIn the meantime, smoke a Newport down to the green line\nLeave mine alone in the zone tryin' to feed mine\nKnow y'all hope Sean fall with the words\nFuck you pa, Pope John, call him the Third\nFollow the god, bitches wanna swallow the god\nHit my man off worse than you can polish the god\n\n(Tek)\nI told you to walk with me\nYou wanna lose your money, gamble with me\nBut if you all about your paper, hustle with me\nThen come on\nCome on\nListen\nListen\n\n(VERSE 4: Tek)\nAll I need is one night, one whore, one million dollar score\nTell God to look out for one more\nMatter of fact maybe more than one\nSo I can kick my feet up and sit down my gun\nJust gimme one line, one role, complete with one lick\nAnd one motion, collect it all from 1-6\nThis a painting of the barrio I'm givin' to you\nReadin a lifestyle a Harry-O see in his views\nI'm tatted, only God can judge me, I know that I'm ugly\nWho's my enemies and who don't love me?\nMy young'uns and my family all know that they could\nCall the crib, same number, same hood, it all good\n\n(VERSE 5: Buckshot)\nI say it now like I said it back then\nBucktown's the state of mind that I'm trapped in\nSo I walk with the mind of many\nMy mind is designed to put rhymes in lines combined with semis\nSpray any, plus I got the brain of a soldier\nMy son started but I stay till it's over\nWe click-click-click, it's Hamburger Hill\nAnd saving Private Ryan out this bitch\nI'm tryin' to chill but we dyin' quick\nSo my tactic to survive is a practice\nKillin' gus with my eyes, so how real am I?\nAnd even if I'm finna fly I don't look the part\nCause in my hood we separate the ballers and the crooks apart\n\n(VERSE 6: Steele)\nGhetto livin', parallel to prisons\nCursed soul, from hell I've risen\nWe rebel from the system, Bloomberg cuttin' millions from children\nSo we resort to the streets, I walk with my peeps\nOG's responsible for my speech\nCo-D's make me comfortable enough to preach\nTony Montana was deep, we all follow the script\nRecipe to turn powder to bricks\nDevour the script, the game the same, the players change\nHomie, you gotta maintain if you wanna remain\nLet God give guidance, may the hood provide us\nWith the necessities to get by this\nNiggas fallin' victim to mirages\nWe rep the hardest but the sweat gon' drip regardless\nBehind enemy lines we chargin\nThe traget: gettin' at all you niggas in the market\nGot trees, spark it, got B's, then park it\nBucktown, where all the d's like to hawk us\nWalk what you talk and gotta stay focused\nBeware of this rap industry and the hocus pocus\nMany are called, few are chosen\nI choose to die for a cause and ride with my soldiers\nMany are called, few are chosen\nI choose to die for a cause and ride with my soldiers\n\n(All)\nWe live for this, we die for this\nSince some for die for this, we ride for this\n\n", "album": {"title": "The_Chosen_Few_(2002)&&1762", "genre": "East Coast Hip Hop", "year": 2002}}, {"title": "Last Time", "href": "Last_Time&&6923", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "Turn on the faucet... mm-hmm\nUh-huh (x5)\nYou and you throw your hands up\nIf you in the back come on, throw your hands up\nIf you in the front, you can throw your hands up\nIf you on the side, you can throw your hands up\nWave 'em in the sky, you can throw your hands up\nYo its aiight if you wanna throw your hands up\nYou and you and you could throw your hands up\n'Cause it's the B-double-ooh\nB-double-oh, this is how we do\nOn the regular oh-ooh, you know who\nUh-huh (x3)\n\n(Buckshot)\n\nYo there used to be a rumor about BDI\nI wouldn't come back, I tell you no lie\nBut when I listen to the radio I think\nWhenever I'm back, I'm bound to make a link\nWith the music that used to make me jam and jump\nThump while the bass bump\nTellin' BJ throw on the wax that's playin' the Therapy mix\nYou said it was aiight, we made a remix\nLicks after licks take ticks\nOf the time clock\nB-D-Buck a shot, uh, take it to the top\nSee I'm bound to make your body pop\nOne nation under a groove, so my beat'll never stop\nWhen I heard about the beef between the East and the West coast\nCalled my nigga Kurupt, I knew it was boast\nThey hope a nigga in the music with this bomb\nSo I prepare load my arms\nAnd wait, 'cause it's the last time\n\nChorus (F.L.O.W.)\n\nThis is the last time I will\nEver struggle\nThis is the last time I will\nEver fall\n\n(BJ Swan)\n\nMy moms gotta take in second-hand bum smoke\nJust to keep from breakin, goin' broke\nAnd if you read my diary it'd break your heart\n'Cause I been losin like a mutherfucka from the start\nExcuse me--but that's the only way that I can express\nMy life feelin' like a bunch of bullets racin through my chest\nTime after time I felt the feelin' that you feel when you lose\nSittin' on my stoop cryin blues\nSeekin' refuge from these hard-time skits\nRemembering days when I was literally penniless\nAnd have to watch my people do it alone\nI said it was the last time but this time I swear\nI'll make it happen if I have to to lose all my hair\nFor real\n\n(Steele)\n\nEyes watch as I make moves\nLivin' proof that the struggle still continues\nWho's out to gain for fame?\nLet him not remain vain\nTime will tell who fell\nAnd who maintained\nFinding my purpose in this life\n'Cause I ain't sure that we all promised paradise\nPrecisely I'm just like the seed\nPlanted in the Earth to bring forth new breed\nShall I proceed to manifest destiny\nSurely me and all of my B and C\nWill find our time on the line of history\nFaithfully as G-O-D watchin over we\nCreated we so I satnd in my God Body\nHardly moved by those crews that try to charge me falsely\nIt won't be the first time and it won't be the last time\nI'm sure\n\n(F.L.O.W.)\n\nNo more strugglin\nNo more pain\nOnly good times after this\nI pray\n(Repeats until end)\n\nChorus (repeats until end)\n\nAll you gotta do is believe in me...\n\n", "album": {"title": "For_The_People_(1997)&&4259", "genre": "East Coast Hip Hop", "year": 1997}}, {"title": "Let's Go", "href": "Let%27s_Go&&6665", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Intro-Rock)\nYeah! Let 'em know, son\n\n(Verse 1-Buckshot)\nListen, we stomp through so many rap wars and rap awards\nBoot Camp Clik been on your front line blastin' off\nAnd hardly got props for it, I saw it\nEven though we never got big, we never stopped short\nUgh, 'Pac saw it, that's right, called us\nTo form One Nation on the world to see more of us\nNow we on the grind in the tour bus\nWith a Ill Mind and behind me is the fortress\nYou know, a few bro's with flows\nThat's off the meat rack, seven to be exact\nBD, he in the back, plottin' the plan\nTo show you difference between a pot and a pan\nAnd the reason why I'm not in the can\n'Cause I be with them brothers holdin' it down, till they Last Stand\nAnd, I'll be the Black Marolla Ruran\n'Cause when I get on, you know I'm puttin' on my fam, listen\n\n(Chorus: Rock)\nLet's Go, Let's Go, here we go (Let's Go)\nLet's Go, Let's Go, here we go (Let's Go)\nLet's Go, Let's Go, here we go (Here we go)\nHere we go (Here we go) Let's Go (Let's Go)\nLet's Go, Let's Go, here we go (Let's Go)\nLet's Go, Let's Go, here we go (Let's Go)\nLet's Go, Let's Go, here we go (Here we go)\nHere we go (Here we go) Let's Go (Let's Go)\n\n(Verse 2-Sean Price)\nP! Yo, y'all niggas act tough like Bokine Woodbine\nUntil you get slapped like Penny from Good Times\nSean Price got too many hood rhymes\nBut keep gettin' knocked, I did so many hood crimes\nIt looks like a job for Superman\nUp, up and away, then gun buck with the trey\nConversatin', congregatin', I got twelve disciples\nThey all got rifles and neh' one of 'em like you, Let's Go\n\n(Verse 3-Steele)\nYou nah' wan' rump with this sick soldier, four-fifth holder\nTalk tough, gun blast, nigga, guya de la boca\nLamb toaster, Sam Sosa, business half-owner\nRap quote'll slap you in your hangin' poster\nYou don't wanna throw your 'bows up\nBody blows'll make you fold up\nSlow your role up, don't get your face swolled up\nBring your best arms, Kevlar vest on, step wrong\nGet stretched when the sket's roar, Let's Go\n\n(Verse 4-Starang Wondah)\nHere we go (Here we go) Here we go (Here we go)\nHere we go, here we go, here we, here we, here we go\nBCC and I'm Strang One (One)\nDum-ditty-dum-ditty-ditty-dum-dum\nMy talon is gettin' violent\nY'all don't say shit, y'all just be silent\nLike Jill Scott, don't worry 'bout what Will got\n'Cause bein' nosy could get that ass shot\nTek-N-Steele, the generals, BDI the boss\nDuck Down paid the cost, y'all niggas is lost\nDa Incredible Rap Team rolls with the force\nI'm the greatest entertainer Dru-Ha came across\nToss the keys to E&amp;J, get in the 'Lac\nHe drivin', Will gonna sit in the back\nThat's the 'Ville, that's real, B-O-S-S\nStomp through the East Coast then the West next\nBitches that we meet say we got the best sex\nWe grimy, even though we stay the best list\nDon't blame me for bein' a Foxx like Jamie\nBe angry, but I'm with who you came to see, so\n\n(Starang Wondah)\nHere we go (uh-huh) Here we go (uh-huh)\nHere we go, here we go, here we, here we, here we go\n\nLadies and gentlemen, the illustrious and praiseworthy Ill Mind, for that ass\nLadies and gentlemen, Mister Ill Mind, ladies and gentlemen, Mister Ill Mind\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}, {"title": "So Focused", "href": "So_Focused&&4880", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Hook-Buckshot)\nOpposites attract\nSo you can fall back if you think you all that, miss\nIt's about that time\nOn the street, with the hustle, everyday I'm about that grind\nSo you can play the side, 'cause I'ma get mine\nI don't wait up and I don't waste time\nBut I notice, I roll with\nMy head up when I walk, so I stay Focused\n\n(Verse 1-Starang Wondah)\nHey yo, I usually ain't into chasin' the mommy's\nGet it then I hit it like Jason Giambi\nUntil I met Wendy up in Envy\nShe had a coupe and a Bentley, the inside Fendi\nHey yo, she friendly, far from your average groupie\nThe hoochie ate sushi and kept her coochie in Gucci\nI knew she was checkin' me out\nThen locked in her sight, she never lettin' me out\nWe parkin' lot pimpin', frontin' on a celly\nMesmerized by the tattoo on her belly\nI came with Sean P, she came with Tawana\nYou shoulda seen those ho's ass in these Dolce Gabbana's\nAnd there's somethin' about her, made me shake the ho's off\nAnd I ain't touch her, but I could tell she was so soft\nAnd I seen baller's tryin' to floss to show off\nNow I'm like Biz Mark', about to 'Go Off'\nThey hit the dance floor, dancin' to Chingy\nDressed up kinky, movin' all freaky\nHey yo, I like the way she shake it 'Right Thurr'\nDancin' in the mirror, playin' with her hair\nShe tried to act like she didn't notice me stare, man\nI walked up to her like I ain't care\nMade eye contact, I knew I had a chance\nWhen we danced, the hooker put her hands in my pants\nI'm So Focused...\n\n(Hook-Buckshot)\nOpposites attract\nSo you can fall back if you think you all that, miss\nIt's about that time\nOn the street, with the hustle, everyday I'm about that grind\nSo you can play the side, 'cause I'ma get mine\nI don't wait up and I don't waste time\nBut I notice, I roll with\nMy head up when I walk, so I stay Focused\n\n(Verse 2-Buckshot)\nIt's hard enough tryin' to get by\nWhat's the reason we gotta look fly?\nShorty said that she did 'til the day that I cry\nThen she looked to the side when that nigga walk by\nShe said she want some wisdom\nThen the SL came and she felt wind come\nIncome will show the outcome\nAnd if you get it, then you lose it, well nigga, you're outdone\nHow come? I think she make the best salesman\n'Cause she can sell men anything for that tail end\nGirlfriend, a nigga will spend what he have to\nFor that ass, too, fuck around and spend his last two\nLet me ask you, you ever got some nigga\nWho found out through some gossip nigga his pocket's hit up\nDamn, you see how bitches think\nThat's why I'm runnin' like my kitchen sink\nI don't blink, I'm So Focused\n\n(Hook-Buckshot)\nOpposites attract\nSo you can fall back if you think you all that, miss\nIt's about that time\nOn the street, with the hustle, everyday I'm about that grind\nSo you can play the side, 'cause I'ma get mine\nI don't wait up and I don't waste time\nBut I notice, I roll with\nMy head up when I walk, so I stay Focused\n\n(Verse 3-Steele)\nI wake up in the mornin', give thanks for the moment\nPlan, plot, strategize, keep my third eye focused\nWatch for the rodents\nSilence the cold when the police approachin'\nLivin' my life as a soldier\nJust like roller coaster, all that glitters ain't golden\nKeep toast when I'm posted, don't boast 'bout what I'm holdin'\nI keep fam close, enemies even closer\n\n(Verse 4-Tek)\nI'm seen in these streets on the daily\nSnuffin' you underneath the sun, you can tell me\nAbout what's the opposite sex, what's poppin' on the set\nYou couldn't get it so you needed my connect\nYou ain't look for the shit I went through\nDon't worry 'bout it, when you seem him, tell him that I sent you\nAnd please don't use my name in vein\nI'm so focused, daddy, I'm on top of my game\n\n(Hook-Buckshot)\nOpposites attract\nSo you can fall back if you think you all that, miss\nIt's about that time\nOn the street, with the hustle, everyday I'm about that grind\nSo you can play the side, 'cause I'ma get mine\nI don't wait up and I don't waste time\nBut I notice, I roll with\nMy head up when I walk, so I stay Focused\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}, {"title": "Watch Your Step", "href": "Watch_Your_Step&&7491", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "Excuse me, excuse me\nI be the poetry man that was sent here by the WWBCC fanclub\nYou called the number 1-900-GET-DA-BOOT and you asked the question\nWhat is the world coming to\nHow come nature hasn&#25264; changed us\nHow come we haven&#25264; learned so many things\nThings that rearrange our brains make us think insane\nSee we were sent here on a mission\nA particular one this plan that was sent\nThat was brodcast across the planet earth\nSo to let you know open your eyes realize\nReps, sayin'? Suuweee\n\nRock:Yo watch yo step baby\nLouieville: Watch where ya walk\nRock: When it&#25263; time for some action\nLouie: Yo these reps don&#25264; talk\nRock: That first step&#25263; a doosy\nLouie: So watch where ya walk\nRock: When it&#25263; time for action\nLouie: Real heads don&#25264; talk\n\nCheck this\nI press this nigga next on my checklist\nGet restless bring it where ya rest son di-tect it SEE\nI gets hectic when these reps run through your set bitch\nNo diggy\nSoon we bring it to crews a fifty\nSe it be be niggas that make it shitty in ya city\nA sound simply pounds leaving your grounds empty\nYou just can&#25264; convince me\nThat you got what it takes TO\nSwim in a tank of sharks become bait\nFace 5-8 inches are better, however\nSupreme, means I bring things ya can&#25264; measure\nBring bad weather, like Starang, Louie and D.O.\nSee we blow muthafuckas to rubbish like we C-4\n\nWe&#25262;e known to be triple R rated but gets down for dough\nTo of the first to hit the scene and the last to go\nMove slow if you got the heart to get blazed\nBy the double one mac when you react and get laid\nLeave yo back sprayed, attack fade turn your naps gray\nMove yo monkey ass &#24954;ore I let this fuckin'?gat play\nMelodies that&#25251;l mash your mainframe\nTo bring forth and understand then know why these two niggas came\nGet yo body stained my shotty&#25263; plain far from complex\nBeen trained by the realer soldiers, gods and the non\nBut the bomb threat\nHas yet to be confirmed\nShoulda learned that we de-bone these cats like big worm\n\nRock: Watch your step baby\nLouie: Watch where you walk\nRock: When it&#25263; time for action\nLouie: Yo these reps don&#25264; talk\nRock: That first step&#25263; a doosy\nLouie: So watch where you walk\nRock: When it&#25263; time for some action\nLouie: Real heads don&#25264; talk\n\nAll right here goes the submission holder MC folder\nScold ya supreme sting teams Rock the boulder\nYes I shoulda told ya\nWe bomb crews like Oklahoma\nDon&#25264; come any closer\nLeave those creepers sleepin'?in comas\nPlaytime&#25263; over, draw ya toaster from ya hoster\nRoast ya then watch them fall like October\nIt gets colder, than January\nShoulda ran already\nToo late crews break 'cause they still ain&#25264; ready\nAin&#25264; steady\nDefeat the weak who speak petty\nI sting you with lingual sharp like a machete\nPrepare to meet your maker\nWon&#25264; hesitate to break a snake up\nBomb crews like Arnold then I&#25251;l berate ya\n\nThese rebels are dissatisfied\nSo many dead so many battlecries\nSo many things that change so many niggas try\nTo end me 'cause envy has taken over\nSo many fake thugs so many slugs this shit gets colder\nAs I got older had plans to roll like boulder\nAnd flip the whole set 'cause cash wreck for all my souljahs\nI fumble a well nigga that shelves who have to tumble\nBefore I get locked and blow the spot like Bryant Gumble\nPrepare to rumble we servin'?justice now must this\nNigga get open like a leakhead wit a dutch spliff\nNow fuck this these reps are-a\nNo need to crush shit when I touch shit\nI make this shit more spicier than mustard\n\nAh oh ah\n\n", "album": {"title": "For_The_People_(1997)&&4259", "genre": "East Coast Hip Hop", "year": 1997}}, {"title": "Here We Come", "href": "Here_We_Come&&6067", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Intro-Rock (Starang Wondah))\nHere We Come, Here We Come\nHere We Come, Here We Come\n(Yeah! Starang Wondah in the building)\nHere We Come, Here We Come\n(Dru-Ha, you know you my favorite white boy, right? Duck Down!\nUh-huh, here we go, come on, y'all, bringin' forth Heltah Skeltah)\n\n(Hook-Rock (Starang Wondah))\nHere We Come, Here We Come\nIf you a dedicated soldier, say \"Here We Come\", let's ride\n(Here We Come, oh) Here we go\nIt's time, take what's ours, time to glow and shine (OK, Here We Come)\nWhat's ours is ours and what's y'alls is ours\nBrooklyn keep on takin' it, we shakin' all y'all cowards again\n(Here We Come) Here we go, it's time, mound up, it's goin' down (Sean P!)\n\n(Verse 1-Sean Price)\nHey yo, new shit, out of the blue, Freddy and Duke kick\nBlack and blue shit, fuck it, just listen to the music\nIt's Sean, once again, back it's Da Incredible Rap Team\nSlap steam out your fuckin' physical frame\nListen my nigga, Ruck is the name\nA broke rapper ready to rob niggas, tuck in your chain\nRob a nigga for a buck and some change, play dice with that\nDoubled-up like \"I don't like the rap\"\n\n(Verse 2-Rock)\nYo, son'll get his same two fucks I don't get\nOther than that, we the complete opposite\nHe hot, I'm cold, he high, I'm low-down, he fast, I'm slow\nOr vice-versa, Yin and Yang, not from Atlanta, though\nNo, I'm a New-Yorkian, Doctor Kevorkian\nNiggas ready to die, stick a fork in him\nI got a shot for him without a syringe\nTo walk you up out of your misery quick as you go walk up out of your crib\n(Damn!) Monster mangler, madman man-handle a mob\nOf you mutha fuckas with a backhand on the beat\nHe, he, he, I will mass transit strike down upon thee with massive vengeance\nAnd ye will know that I am thee Lord, Rock, damn it\nThe hot-handed, respec-onizing whether you can or cannot stand it\nMy Boot Camp is the best-est ever to do it, stupid\nWhen you see it, you better salute it, we steppin' to it\n\n(Hook-Rock (Starang Wondah))\nHere We Come, Here We Come\nIf you a dedicated soldier, say \"Here We Come\", let's ride\n(Here We Come, oh) Here we go\nIt's time, take what's our, it's time to shine and glow (Hey, y'all)\nWhat's ours is ours and what's y'alls is ours\nBrooklyn keep on takin' it, we shakin' all y'all cowards again\nHere we go, it's time, mound-up, it's goin' down\n\n(Verse 3-Buckshot)\nSure, I'm the client, but I'm also the president\nAnd I'll still rob your resident\nEver since I became a MC, I made change\nAnd ain't shit change, I'm the reason your chick came\nLiterally and physically, she did it with me\nNow she takin' seeds out my weed\nAnd we gettin' nasty like sneezin' in food\nTwenty-four hours on the grind, we in that mood\n\n(Verse 4-Steele)\nYeah, 'For the People' we 'The Chosen Few'\nWorldwide Boot Camp, pay-per-whole a view\nPeep the symmetry, more then the symphony\nNow each song is a documentary\nThe God's drop the epilogue for greatness\nTook pain off faces, the rage mark pages\nFrom the block to the cages\nYou our main inspiration when we rockin' on stages\nWe came a little way from beats in the basements\nStick-up kids, throw the heat to your faces\nAnd even though we don't be meetin' them cases\nBut we stuck on these chases to get these papers\nAnd the system is ancient, we dishin' the haters\nWishin' that our Clik never make it, but\nWe took it back to the basics\nMastered The Matrix, BC crashin' the station\n\n(Hook-Rock (Starang Wondah))\n(Hey yo) Here We Come (Uh-huh) Here We Come (Uh-huh)\nIf you a dedicated soldier, say \"Here We Come\", let's ride\n(Here We Come, oh) Here we go\nIt's time, take what's ours, time to shine and glow, huh?\nWhat's ours is ours and what's y'alls is ours\nBrooklyn keep on takin' it, we shakin' all y'all cowards again\n(Yeah) Here we go, it's time, mound-up, it's goin' down\n\n(Outro-Starang Wondah (Rock))\nYou see, that's what I'm talkin' about, man\nSittin' here smokin' a Bob Marley the size of the Empire State Building\nBoot Camp Clik, revolution of revolutions\n(What's ours is ours and what's y'alls is ours\nBrooklyn keep on takin' it, we shakin' all y'all cowards again)\nBDI, reflection of perfection\nYou know, Starang One main gun, I'm out, yo\n(Here We Come) Bucktown USA, for life\n(If you a dedicated soldier, say \"Here We Come\", let's ride)\nMFC! You know (Here We Come, Here We Come)\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}, {"title": "Trading Places", "href": "Trading_Places&&1143", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Intro-Sean Price)\nP! Yeah, yeah, yeah, yeah, hey yo, listen\n\n(Verse 1-Sean Price)\nBefore I lay my head down to rest\nI roll up a dimebag of petro, then let the sket' blow\nSean Price from Seflow, nah, I'm from down the block\nBrownsville, peace, my niggaz squeeze all kinda shots\n\n(Verse 2-Steele)\nYou can catch me in your tenement\nHangin' with these thugs, weed, guns and Timberlands\nGrind for the dividends, ride for my siblings\nRoll with a bunch of gremlins, stick you up for your benjamins\n\n(Verse 3-Rock)\nHere we go, breakin' day with a mad lah session\nPlottin' and schemin', somebody gon' die when I catch 'em\nA lot of y'all should be petrified when I step inside\nOf your section, especially if you're stoppin' my cheddar\n\n(Verse 4-Tek)\nSo why oh why did I need cappuccino?\nMust've had a hangover from all that Remy and Clicko\nNah, I don't remember hittin' off in the spot\nToo tore up, don't remember gettin' it on with no cops\n\n(Verse 5-Sean Price)\nNigga, my eyes peep this life in the form you can't picture\nPanoramic view, the hammer damage your crew\nBack flippin', gat spittin', sell crack rapper dude\nBack smack a few rappers who rap with a attitude\n\n(Verse 6-Tek)\nBenjamin Benicar, Afrika Bambaataa\nGet up in your spot with the four-fifth two shotter\nPlay the back with some of my man's\nIt's family first, like the \"Tek\" that's on the back of my hands\n\n(Verse 7-Rock)\nWe all walk around town with the pound strapped down\nAnd clap a clown, and if not, it's cool, I will pound you out\nI get me harders, that's why I'm Rock man, I regulate ya\nScrape bitch niggaz faces cross the pavement, whoever hatin'\n\n(Verse 8-Steele)\nYou asked for it, who want beef? Well here's war\nSilence the .44 so nobody will hear the roar\nNow your body is stretched out horizontally on the floor\nThat's what a snitch get when he talk about what he saw\n\n(Verse 9-Sean Price)\nCommence the rock slide (Oh no!) I'm crushin' your pride by surprise\nI be Sean Price, the forward for the Fab Five\nIt's 'Unbelievable', Christopher Wallace\nThe way I squeeze the tool and dig in your pocket, let's get money, nigga\n\n(Verse 10-Rock)\nYo, from an unknown region, me and my legion\nNever believin' to hear you bitch niggaz breathin'\nThe summer doom, doom, din, nobody eatin'\nNobody leavin' till you pay y'all owe my BCC, bitch\n\n(Verse 11-Steele)\nI'm dwellin' in the cellar with my niggaz Heltah Skeltah\nSmif-N-Wessun pull triggers, the heat melt ya, Lord help ya\nThe Terrible Two, the Furious Four\nI dare y'all to bear arms and square off with this force\n\n(Verse 12-Tek)\nSee, I was taught that two wrongs don't make a right\nBut me and Steele been tight for a while and everything's a'ight\nAnd it ain't never gonna change\nAnd that's as real as the blood that's blue in our veins, bitch\n\n(Hook-Rock)\nY'all don't wanna Trade Places with us, stay in your place\nClaimin' you thug, Trade Places with us, we'll erase your face\nThe wrath of Duck Down, Bucktown is real\nWord to them niggaz Ruck, Rock, Tek and Steele\n\n(Scratched vocals)\n\"We all walk around town with the pound strapped down\"\n\"Nigga, my eyes peep this life in the form you can't picture\"\n\"See, I was taught that two wrongs don't make a right\"\n\"Nigga, you asked for it, who want beef? Well here's war\"\n\n(Hook-Rock)\nY'all don't wanna Trade Places with us, stay in your place\nClaimin' you thug, Trade Places with us, we'll erase your face\nThe wrath of Duck Down, Bucktown is real\nWord to them niggaz Ruck, Rock, Tek and Steele\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}, {"title": "Illa Noyz", "href": "Illa_Noyz&&8030", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Illa Noyz)\nYou didn't know so let it flow my slang bang ya\nCrews move to my tunes before the Macarena\nConsider it danger\nMongol slay it, play a beat like a perfect stranger\nSimple and plain give me the lane-ah\nCatch the beat like grand groove\nMy hustle is mad smooth\nTight platoon since the rise of the black moon\nSince you assume, you've seen my sun shining\nAnd O.G.C you notice me with Heltah Skeltah vibing\nWack venetian blinding\nWreck from mine, charged for manslaughtering at times\nThe Bucktown Judy\nFlow like a swan with rhymes, who you be?\nThe Illa\nYou feel me in your inner\nI deliver deadly like postmen\nI'm holding\nHold up that's an understatement\nWhen the beats break it ain't no move faking\nI'm more them FBI guys with the rude awakening\nFurther contemplation\nMay lead to some titles being taken\nWhen its Noyz your facing\nYour placed in a stressful situation\n\n\nChorus: Illa Noyz and Heltah Skeltah\nAnd it does\nSound ill like noise in Brownsville\nYes it does\nSound ill like noise in Brownsville\nYeah it does\nSound ill like noise in Brownsville\nYes it does\nSound ill like noise in Brownsville\n\n(Ruck)\nHere I am (here we go)\nT-A-W\nL Sean, here to bring trouble to\nPhony MCs I slap 'em up with my pistol\nTry to fuck with Ruck feel the heat from the missile\nWhat's the issue?\nThe issue is the topic at hand\nNiggas rip and never say shit when the shot in my hand\nGot the upperhand brotherman\nSift through the knowledge\nGod cipher divine rhymes will shine like polish\n\n(Illa Noyz)\nDemolish, Ill do just that\nAbolishing funny style cats with them wack acts\nSince that has been fact\nThe underdog from the underground\nLeaves you facedown\nLike a therapeutic back massage\nOr police with a bogus charge\nI'm pulling your card\nTo scar is my specialty (Yo it better be)\nSee you don't have your cheat sheet for this test\nSo take a guess\nAnd become the one to make a rational move upon, you gone\nUnderestimating this Boot Camp bomb\n\n(Rock)\nYo, who is this dufis?\nThinking he ruthless\nBroccoli your toothless\nNow you sound and look stupid\nYou get your head spun around like a screw just\nFor being the only girl in the town full of men like smurf Edna\nLittle blue bitch\nTake a foul, fuck your mama\nSmack her if she never warned you about a walking bombita time-ah\nI ain't lying ya boys-ah\nThat's a fair one ask Illa Noyz (yup, yup, yup)\nAnd like my little nephew I break toys\n\n(Illa Noyz)\nThe Boot Campian phantoms amp son\nSome of this mantel dismantle brothers with anthems\nCheaters want me like them Champion clothes\nBut home info\nStuck inside your head congest like common cold\nWhen I'm on flipmode\nSon Rampage the stage amaze after a Spliff Star\nLord Have Mercy when I Bust them rhymes bar after bar\nSee my mind spread, Its no longer a hobby\nDon't try me\nBut I put that ass to beds so pull a Javi\n\n", "album": {"title": "For_The_People_(1997)&&4259", "genre": "East Coast Hip Hop", "year": 1997}}, {"title": "Blackout", "href": "Blackout&&9844", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Rock)\nI ain't blackin' out yet, man. Yo fuck with dat.\nJust spark... just spark all the rest of them L's, son so we can all just BLACK\nOUT!\n\n(BJ Swan)\nI get the best of the best T-H-C, C-O-U-N-T\nWhether from Jamaica or Hawaii, I stay comin' up with that Jumanji\nC'mon I thought you knew 'bout a brother like me\nWith a name like Swan...\n\n(Rock)\nYou's a buddha junkie!\n\n(BJ Swan)\nChase the taste of the elegance flowin' in the bass\nWhen we in the place, party people know they gotta wait\n'Cause when Boot Camp niggas in the place to be\nOur only mission is to make you Black O-U-T, C'mon\n\n(Rock)\nC'mon, Poster Poster on the wall, who get's the blackest of them all?\nMr. MALDU! smokin' lah till I Black Out\nSometimes it make a nigga rhyme till I Black Out\nNow the'll be plenty ways to Black Out\nOne way is gettin' mashed out, or bringin' yo ass out the Bummy Jab house\nAnd break yo mask out cause the smoke'll make you gag\nSpliff after spliff till you flat on yo ass\n\nI'm fallin'\nI'm fallin'\nI'm fallin'\n\nBlack Out's callin'\n\n(Starang)\nIn the Double D, thinkin' bout all the shit that worry me\nMe and Ville Sluggah had the all black bubbly\nNorth Face Goose, cuttin' loose sticks and seeds out the weed\nRemember that shit?\n\n(Louieville Sluggah)\nTrue indeed...\n\n(Starang)\nYo, when I wake up, I take a hit of the spliff\nWord up a lot of muthafuckas start they day like this\n\n(Louieville Sluggah)\nBut they'll be no more smoke for me\nPull up the Henny, so I can feel my bod drizzy\nAnd max with my staff maintain and keep it nature\nNo chaser, straight up cause this shit is major\nGotta page goin' off in range\nSayin' bring my fuckin' whip back around the way\n\n(Starang)\nOK, now we out on the FDR\nWe both stoned out our minds, we probably won't get far\n\nI'm fallin'\nI'm fallin'\nI'm fallin'\n\nBlack Out's callin me\n\n(Supreme)\nAs I choke from the smoke, throat hot like a kitchen\nEyes heavy from the rezi when the room kept spinnin'\nIn an instant, I could of swore I saw the Reaper\nTHE REZI MONSTER, stuttered and uttered \"nice to meet ya\"\nGrabbed me in the sleeper, he said \"smoke on this\"\nHe said \"nigga, I got some shit for yo rezi spliff\"\nThat's when he pulled the hash out, I maxed out ready to pass out\nLiving evidence the rezi spliff make yaaa...\n\n(Steele)\nA sin like entities on an astroplane\nCrack the Bible, hit the chalice to uplift my brain\nNo strain, meditation helps me to maintain\n(Singing)\"me only smokin' sensi, me no sniff cocaine\"\nSo do what you do to remain, till we return a-gain\nBack on to blackness from which we came\n\n(Illa Noyz)\nMy day starts with a yawn in the early morn, what\nOff to the weed spot to ease tension off my knot\nTwist up the choc-o-lot, and the Fronto to make the brainz blo\nThat's all right, 24-7 that's how we flow, just lettin' you know\nEven in blackness we activists, act as if yo ass won't get dissed\nGet busy like drizzy, act like drazy leave you Swayze\nEven in my state of blackness, I'll attack the wackest\nNigga with fanatics or dramatics, you're done in\nCome with the shit, I bring the havoc\n\nI'm fallin'\nI'm fallin'\nI'm fallin'\n\nBlack Out's callin me\n\n(BJ Swan)\nFuckin' with me dude, you gon' BLACK OUT\nFuckin' wit' me, you gon' BLACK OUT\nCome around my way, you gon' BLACK OUT\nOut in LA they BLACK OUT\nOut in M-I-A they BLACK OUT\nOut in VA they BLACK OUT\nWashington, D.C. they BLACK OUT\nAll over, they BLACK OUT\n\n(ROCK)\nCocoa B's will make ya... BLACK OUT\nTawl Sean will make ya... BLACK OUT\nBen Grimm will make ya... BLACK OUT\nEverybody will make ya... BLACK OUT\nThe Boot Camp will make ya... BLACK OUT\nOh yeah baby... BLACK OUT\nEverybody gonna Black the fuck out\n\nYo, get yo fat humfy, steamy mound of turds off my muthafuckin' couch\nBlack the fuck out, man\n\n(Supreme)\nGet yo fat, stink, chubby ass the fuck up and stop...\n\n(Rock)\nYo, blow his nostrils up, son. Hold Up Hold Up\n\n(Black Out victim coughing hard)\n\n(Supreme)\nLook at the smoke all in his hair and shit...\n\n(Swan)\nLook at the nigga, he about to DIE! look at that nigga Mark Brown, fatso nigga's\nBlacked out\n\n(Rock)\nThat's what happen when you Black Out, you wake up with your nostrils on fire\nAnd shit... BLACK OUT\nBlack the fuck out, man\nBlack out black out black out black out black out black out black out black out\nBlack out black out black out black out...\n\nAll the P.J. niggas and all the wannabe killas... Black Out...\n\n", "album": {"title": "For_The_People_(1997)&&4259", "genre": "East Coast Hip Hop", "year": 1997}}, {"title": "Just Us", "href": "Just_Us&&6061", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Buckshot)\nMost definitely\nWe up in here\nBoot Camp Clik\nOn the beat...\nTY Dizzle\nAh\nOne Shot Deal\nDuck Down in this muthafucka once again\nLet's do this\n\n(VERSE 1: Top Dog)\n(You) thought I was finished, you thought I was done\n'Cause I took time off to raise my son\nBut I rep for the streets, prepared with the heat\nThe Top Dog will rhyme over any beat\nYeah, you rep for the hood, that's all to the good\nMy dogs get high off Henn and backwood\nI got love for the game but some of you lames\nGet me sick tryin' to sound the same\nBut I do what I do, carry the flame\nLike the last child tryin' to carry the name\nI'ma rep for my stripes, that's word to my life\nLike you coward cops tryin' to take my life\n\n(VERSE 2: Louieville)\nYo, I'm just tryin' to do me, high as fuck\nCountin' up bucks, baby boy's lackin trucks\nTryin' to live through all the bullshit\nAddin up chips, a nigga tryin' to get rich\nAnd when I'm aggravated I smoke heavenly\nDrink heavenly until the loss of memory\nIt's the Vi-double to the l-e\nMovin out where it's warm when it's chilly\n\n(VERSE 3: Buckshot)\nThe god is back to put the r in rap\nNo R&amp;B niggas, the streets don't want a part of that\nBecome hard for the game, some starve for the game\nSome don't get the picture till they a part of the frame\nJust cool it, mane, it's simple and plain\nYeah, I'm from Brooklyn but I live in this game\nStill the same and I do the thang like it never was done\nThis little nigga move ahead of the gun\nSo what you sayin'?\n\n(CHORUS: Buckshot)\nEveryday all day\n(I'm) with my niggas\n(Just) hangin' out\n(Just) coolin out\n(Just) on the regular\n(I'm) with my niggas\n(Just) hangin' out\n(Just) coolin out\n(Just) sober for now but\n(I'm) rollin' up\n(Just) hangin' out\n(Just) coolin out\n(Just) everbody together\n(I'm) lovin' it\n(Just) hangin' out\nCoolin out\n\n(VERSE 4: Tek)\nTek son, it's time that you're free\nIt been nights I ain't sleep\nToo busy worried about the moves in the street\nWe send flames down the base of your spine\nWe lose one but we killed two, catch you while you're out on your grind\nA nigga gotta get bloody every once in a row\nGive it and go, let it out, it's good for the soul\nHow you're talkin' but you can't understand it\nI'm 'bout my money, mane, and I gets respect 'cause I demand it\nChief headbuster, throw a ace, come back on the sixth\nGotta jump, yeah, I ran but came back with the fifth\nWe turn May to the 4th of July\nSober you up, you're high\n(?) I'm the voice of the (?)\n\n(VERSE 5: Starang Wondah)\nYo, it's Starang Won with no deal, I'm mobile\nThis rap shit is so real, man, you don't even know Will\nI play the crib, re-runs of _Moesha_\nEatin cold pizza, man, smokin' more reefer\nPassed my bitch up, took the hooker back, it's cheaper to keep her\nTry to escape, a nigga keep gettin' in deeper\nYo, this ain't the same Starang niggas is used to\nI'm neutral but that don't mean a nigga won't shoot you\nYo, I write a check, niggas turn up dead\nI'm like a toaster the way a nigga burn up bread\nAha, I come on, I play chess when I'm rappin'\nFor real yo, a nigga feel like I'm the best when I'm rappin'\n\n(VERSE 6: Steele)\nGeneral Steele, original head, original crook\nReside in Southside Queens, born in the Brook\nAs a youth I was raised up by the books\nMom and pops gave what they could, the rest I took\nCrook put me on, told me, \"God, step to your biz\nThe hood needs soldiers to represent for the kids\nBoom Camp started, so y'all gotta finish the shit\"\nBC legendary, dog, remember these kids\nNo record company can put an end to this shit\nWe click-click-click-connect, stay connect to get bricks\nBlack Smif-n-Wessun's the shit, we puttin' it in\nEntered da Stage underaged and became men\nI shine, you shine, get your papers, mang\nThese cold streets preach the Rude Awakening\nFor the People we gon' do this, we endurin the pain\nDuck Down more than a label, this family, mang\n\n", "album": {"title": "The_Chosen_Few_(2002)&&1762", "genre": "East Coast Hip Hop", "year": 2002}}, {"title": "1-2-3", "href": "1-2-3&&3859", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Verse 1-Buckshot)\nRidin' down the A-V-E in the black A-M-G\nWith the Mac by my lap and they envy\nThe fact that they can't see me\nDippin' through the traffic, I'm relaxin', smokin' black with ease\nNow my cell phone ringin', it's a breezy\nLet me see, yep, it's this chick I just met and won't let me breathe\nFuck that, my mind on my movement\n'Cause when your money stop, they get dumbfounded and do this\n\"Who this nigga next to me?\"\nLike you give checks to me, nigga, it's respect to me\nLet them niggas step to me and I'll handle my biz first\nThen call up my team and they'll handle they biz worse\nThis shirt that I wear on my back\nRepresent every vocalist you hear on these tracks\nNigga, and everywhere that I steer my gat\nI steer my whips and you hear where we at, nigga\n\n(Hook-Tek (Starang Wondah))\nI said 1-2-3 (Uh-huh, uh-huh) Let me know if you're ready for me, lawd\n(And nowadays everybody murder, bustin' they guns\nThe whole hood is corner boys, gettin' they ones)\nI said 1-2-3 (Uh-huh, uh-huh) Let me know if you're ready for me, lawd\n(And now everybody got a sixteen, a beat and 'dro\nThe whole hood is gangsta, pimpin' they ho's)\n\n(Verse 2-Sean Price)\nListen, kick drum, snare and hi-hat\nI pitch jums around here, pa, don't try that\nLouis Satchmo, pull the tool, let the gat blow\nMelon pop, taco meat, extra tobasco\nLittle Rascal, buck heat at Buckwheat\nFor talkin' dumb, but they all love it when Ruck speak\nFuck freaks for free, fuck freaks on E\nProbably fuck freaks that you've seen on BET\nBeen there, done that, no rubber, got clap\nSo it hurt when I piss, this verse is the shit\nSean is a beast, you can hear me holler at the full moon\nColumbine High, settin' fire to school rooms\nNo way, Jose Canseco\nPop popular guys at the pop of the bank-o\nSean Price, big knife, ready to shank those\nNiggas at the dice game frontin' with bankrolls\n\n(Hook-Tek (Starang Wondah))\nI said 1-2-3 (Uh-huh, uh-huh) Let me know if you're ready for me, lawd\n(And nowadays everybody murder, bustin' they guns\nThe whole hood is corner boys, gettin' they ones)\nI said 1-2-3 (Uh-huh, uh-huh) Let me know if you're ready for me, lawd\n(And now everybody got a sixteen, a beat and 'dro\nThe whole hood is gangsta, pimpin' they ho's)\n\n(Verse 3-Tek)\nNow everybody is a hustler, grind to get money\nRemember these same people broke and bummy\nAskin' me for ones, being real hyphy\nYou spendin' all the Grant's and givin' Jackson's to wifey\nNow I got haters wantin' to ice me\nI gotta be careful 'fore they secret indict me\nAnd make me a Mountaineer like West VA boys\nCan't do no crime since I tatted my face boy\nI'll be dead in a lineup, givin' a time-up\nTwenty five-to-life, where I sign up?\nBut I'm straight, my flight, they even need me\nOn the ground at nine, that's more time to grind\n\n(Hook-Tek (Starang Wondah))\nI said 1-2-3 (Uh-huh, uh-huh) Let me know if you're ready for me, lawd\n(And nowadays everybody murder, bustin' they guns\nThe whole hood is corner boys, gettin' they ones)\nI said 1-2-3 (Uh-huh, uh-huh) Let me know if you're ready for me, lawd\n(And now everybody got a sixteen, a beat and 'dro\nThe whole hood is gangsta, pimpin' they ho's)\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}, {"title": "Take A Look (In The Mirror)", "href": "Take_A_Look_(In_The_Mirror)&&4947", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "Why? Yeah, uh-huh, what you see?\nWhat you see? Uh-huh, uh-huh, who dat?\n\n(Verse 1-Buckshot (Steele)\nDamn, how does it feel to see shit change\nLike the season? For no reason, you out of range\nIt's strange how time go by\nLike tick-tick-tock and you don't know why\n(Why ask why? I live everyday like my last\nTake a second, get in check with that nigga in the glass\nWhat he think, how he move, is he ready for action?\nIn the streets when you snoop, then you soon get a casket)\nThe tactics, never throw rocks at a glass house\nMind over matter, no matter who spaz out\n'Cause you could do a ten-to-lifer\nPretendin' life ain't worth it, but you know that you're hurtin'\n(That's why I stay puttin' work in, hood hurtin', some hungry\nOut late, trey-eighty, crazy for that blood money\nTake this quote from the Book of Life from me\nLove hella right, sonny, life ain't all that funny, when you...)\n\n(Hook-vocal samples)\n\"Look In the Mirror\" \"In the Mirror\" \"In the Mirror\" \"In the Mirror\"\n\"In the Mirror\" \"In the Mirror\" \"Look at yourself\"\n\"Look In the Mirror\" \"In the Mirror\" \"In the Mirror\" \"In the Mirror\"\n\"In the Mirror\" \"In the Mirror\" \"Look at yourself\"\n\n(Verse 2-Tek (Louieville Sluggah)\nAin't near 'nother like me, that's one with the streets\nBlow on the mic, become one with the beats\nCan't change who I be, you get what you see\nOnly one way to do it, and that's B-I-G\n(Look, to the day I D, just remember me\nBlow a chronic sack, down some Hennessy\nLife is a hustle, we buck you for money\nI might crack a smile, but ain't a damn thing funny)\nI shoot the dice, I holler \"Get 'em girls\", all my niggaz twirl\nUp the pissy and the swishy, this is Smokey's world\n(Stackin' like a hustler, run a good run for two years\nNow he got two stores in laundromats, ooh yeah\nSo wash the dirty off, 'cause if the boy's burned out\nDinner's gonna be...)\nSince I left the smoke alone, you know my hustle got stronger\nTeam got more guns, our money got longer\n\n(Hook-vocal samples)\n\"Look In the Mirror\" \"In the Mirror\" \"In the Mirror\" \"In the Mirror\"\n\"In the Mirror\" \"In the Mirror\" \"Look at yourself\"\n\"Look In the Mirror\" \"In the Mirror\" \"In the Mirror\" \"In the Mirror\"\n\"In the Mirror\" \"In the Mirror\" \"Look at yourself\"\n\n(Verse 3-Sean Price)\nHey yo, Black African rap, slap your naps with the back of the gat\nAnd smoke a spliff where I traffic the crack\nY'all niggaz can't rhyme, y'all more like a amateur show\nGet out of line and the hammer will blow\nGoddamn it, the flow have' niggaz sayin' \"He's so nice\"\nSupernatural the shit, pa, Rico Price\nI'm an African readin' 'bout Stephen Biko's life\nYou an addict and thinkin' 'bout how you beat yo wife\nListen, that's my word, Sean the best rapper you ever heard\nThat be spittin' that, this and the third\nDon't make me click-clack, put your six-pack on the curb\nIt is what it is then, and that's what you deserve\nSean is the shit, fuck it, you want a assist\nI throw you the pass, bank shot, two off the glass, bam, bam\n\n(Hook-vocal samples)\n\"Look In the Mirror\" \"In the Mirror\" \"In the Mirror\" \"In the Mirror\"\n\"In the Mirror\" \"In the Mirror\" \"Look at yourself\"\n\"Look In the Mirror\" \"In the Mirror\" \"In the Mirror\" \"In the Mirror\"\n\"In the Mirror\" \"In the Mirror\" \"Look at yourself\"\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}, {"title": "Ohkeedoke", "href": "Ohkeedoke&&4928", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Tek)\nLet's go... no time to do your hair, baby\n(Starang)\nAyo! There the go kid!\n(All)\nRight there! Right there!...Oh Oh, Oh Oh...\n\n(MS)\nI'm movin' smooth like a wet foot glidin' across ice,\nBecause these fools who be sliding on tracks, braggin' they nice\nHeadz screamin' they need it, but do you really want hardcore?\nStakes is High like De La, plus I'm fiending to start more\n\n(Starang)\nTrouble on the double, yet cooler than any hooligan\nFrontin' on the mic nigga, who you think you foolin' with?\nY'all be on the mic kickin' nothing but that nonsense\nNigga please, ease back my crew been the bomb since\n\n(Tek)\nTell me to maintain and keep doin' my thang\nKeep my dick in my pants, and just stack the green\nShorties can't be coniving, had to flip about warning\nNow you in a cell tryin' to post bail by mornin'\n\n(Starang):Now in the back of my mind, yo I really do hope\n(Tek):that motherfuckers out here don't take my crew for no joke\n(MS):'cause if our backs against the wall, then we goin' for broke\n(All):but we'll never fall victim to the OHKEEDOKE!\n\n(Starang):It goes on and on and on and on\n(All):you keep on, and you don't stop\n(Starang) Yo, it goes on and on and on and on\n(All): You keep on and you don't stop\n\n\n(Starang)\nSteepin' to ya, Dru Ha, you hit the jackpot\nStarang bust thangs since Tek found the A-Black spot\nMe and Mr. Smokee, playin' the lo-key\nPuffin; on L's, I never fell for the ohkee...\n\n(MS)\n...Doke! when your plan goes up in smoke\nLike a Bob Marley spliff being smoked to a roach\nBut on the contrair, if I smoked an ounce a day\nIt'll only make a mess when I bounce this way\n\n(Tek)\nThe jail scene ain't workin' no more, got me punchin' a wall\nFam put a block on the phone, won't accept collect calls\nAnd to top it all off, heard my co-defendant turned canary\nStutter steeping through the house lookin' all scary\nI'm just waiting to face him in the mess hall\nThinkin' 'bout the Tyson loss, gettin' my reps off\nAnd the niggas in the world that I used to roll with\nDon't even write scripts, that's the ohkeedoke shit\n\n(Starang)\nNiggas say Starang's smooth, just like ice without cube\nI'm nice without dudes, on my motherfuckin' track\nNiggas call me Starang, others call me Jack\nBut if you call and I'm not home, you can call me back\nBut no matter where I'm at, I always rock the show\nThe niggas next up on the mic, y'all niggas gots to go\nPhantom of the Opera, yo I blow scenes North, South, East\nWest, fuck your chest dukes, get it out your mouthpiece\n\n(Tek)\n(I was) laid back sippin' Beck's, gently cleaning off a black Tek\nJP's cuban link got my neck laced (shine baby)\nSteal the show like a thief, blow without a trace\nSee so many wannabe's steadily tryin' to be me\nAct grimy, crimies constantly scheme how to fi me\nOut to get the bonus, becoming assed out like the homeless\nNo disresepct intended, but it's a fucked up world we live in\n\n(MS)\nMy lust for hip hop got me strivin' for perfection\nAnd when my inner glow shine, you vision my reflection\nAnd now chumps had to get a closer glimpse at it\nAs sweat trickle down your face, you break into a panic\n\n(Phonecall 1-900-GET-DA-BOOT)\n\n(Tek)\nLike when your shorties put on helmets and shouder pads, that's the ohkeedoke,\nWhen shorties come to see a nigga with... while you bleedin' is the ohkeedoke,\nToo\n(Starang)\nMagnum Force...\n(Tek)\nWorld wide...\n(Starang)\nStrictly BCC... Strictly BCC...\n\nIt goes on and on and on and on\nYou keep on and you don't stop\n\nWord up y'all everything is nature, word up y'all, I don't hate cha\nWe keep it movin'...we keep it movin'...\n\n(Tek)\nYo, gettin' pulled over when you just got your wallet at your crib\nWith your license... that's the ohkeedoke...\n\n", "album": {"title": "For_The_People_(1997)&&4259", "genre": "East Coast Hip Hop", "year": 1997}}, {"title": "Go For Yours", "href": "Go_For_Yours&&5129", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Chorus: D. Real)\nIt be the B.T.J's, wit lyrics for all\nWe be on point wit the joints, 'cause we takin' no fall\nSo I'mma go for mine (so son, go for yours)\nYo I'mma go for mine (so son, go for yours)\n\n(El Sha)\nMy crew be in the mix, like name brand kicks\nThe kids that only deal wit that type of nonsense\nYou can't get wit, D.K.S. self evident\nAdolescence, reign the supreme court, in any, every, meant\n\n(Lil Knock)\nThe time was approximately eleven forty three\nWhen the D called me, and told me, we must be\nLyrically, the best that he says, the\nK N O C K, and S and K, it's spray\nComin' away, the B.T.J., it be they\nI'mma hold it down, wit sounds\nLike clowns, walk the trey pound\nNow in the underground, B.T.J. just entered\nRemember, the S comes last like December\nOnce shit cock it's time to Rock like the Monsta\nIn reality, B.T.J., is lyrically responsible for all difficulties\n\n(El Sha)\nMy lyrics oppose a threat to the best M.C. yet\nAnd appears nightmares for those who slept\nAlso the biters, claimin they writers\nThey need to think about what they talk about\nWhen you exposin your dirt, that's when you dummin out\nDwellin in the PJ's, all day, hangin' out wit nothin' to do\nThem rebellin niggas is mad, 'cause I'm tellin' the truth\nHittin yo wit mind craftin, flows to molecular cord graphin\n\n(Lil Knock)\nAiyo one day it was me and the D\nWalkin' down the street, some niggas stepped to me\nSaid are you Lil R-U-T-I-Z\nHe said I heard you nice on the muthafuckin M-I-C\nBattle me, battle right here, and let's see\nSo we kicked a verse that didn't hurt\nSo I hit 'em worst, to let him know I don't play those games\nSave 'em for the jerks, D. Verbs said \"Son, let me get some\"\nI said \"No, 'cause he's a victim, and he probably in my premises\nYou know when I open my book wit my lyrics I'm endin this\"\n(No question) All this shit he poppin' in my ears\nFuckin' ejected, he can't hang wit my style\nLook now, here's man fillin it, back to like what I was sayin'\nI start extortin, I'm not playin'\nYou want Lil Knock? I come on your block\nCock and then start sprayin, lyrics\nSo don't start what you can't finish\n'Cause I will be sure to end whatever you created\n\n(El Sha)\nMentally you can't function\nPhysically you dead wit the push of this button\nExplosion be corruptin, from the expert of execution\nI met Lil Knock at the junction\nHe was talkin' about walkin', to the tree spot\nWe took the L to New Rox, we got stopped by two cops\nTalkin' about \"Where the two glocks?\", we doo wops\nHow was I two glocks? Man, it's too hot\nAnd I'm cold, so let me go, I never hold\nWhoever told you, that I do la?\nLil Sha, fuck a do or die\nNigga die, because of what they do\nI do what I do wit my crew\nPo-po was hype, they was like \"You bite, stick wit the mic device\"\nDrivin' off, said \"Have a good night\"\nPersonally I might, and all that shit I said was a psych'\n\n(Break)\nSo who's the crew that give nightmares to those who slept (D.K.S.)\nConstantly flown wit finesse (D.K.S.)\nPuttin' all comp' to rest (D.K.S.)\nBe the best so you can't contest\n\n", "album": {"title": "For_The_People_(1997)&&4259", "genre": "East Coast Hip Hop", "year": 1997}}, {"title": "Don't You Cross The Line", "href": "Don%27t_You_Cross_The_Line&&7247", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Intro-Sean Price)\nPen my mutha fuckin' rhyme, yeah, what up, what up?\nBoot Camp in the house, Sean P, set it off, yo\n\n(Verse 1-Sean Price)\nHey yo, the arm bone connected to the hand bone\nNigga, the hand bone connected to the damn chrome\nSean is a killer, Monkey Barz, Sean a gorilla\nGreat ape in the flesh, the Great 8 is the best\nDuke, I spit bodies and take name, and take aim\nAt wack-ass rappers who be thinkin' that they the king\nStop with the lies 'fore I put a knot on your eye\nPop a popular guy, pa, plot your demise\nIt's not just a rhyme, it's a actual fact\nThat the God would actually clap at any rapper that's wack\nInternet niggas usin' my image, you not Sean\nTriple-w-dot-get the fuck on-dot com\n\n(Verse 2-Top Dog)\nI'm still G'd up, G.C.'d up\nB.C.'d up, blaze the weed up\nHenny in my cup, jump in my truck\nKnuck if you buck and bust if I don't trust, so...\nDon't You Cross The Line, understand?\nOr the gun's in my hand, the gun goes \"blam\"\nMy shit don't jam, murk you and your fam\nIn a military stance, got you pissin' in your pants\n\n(Verse 3-Rock)\nYo, I roll with a bunch of gun dumpers\nYou'se a fag, you roll with a bunch of butt munchers\nI will ghost you, but won't nobody call no Ghostbusters\nBet if you live, next time you'll call some toast busters\nI'm so gutter, since you really shook, I whoop bouncers\nMy reputation precedes me, they know I could and would\nOut countless hood pouncers, I beat fire out of niggas like you\nMy right hand's a recliner, lean back off that\nTrack of the pack of your cabbage, fall flat\nSmack of the earth, with your staff's jacked before that\nHappen, I'm Boot Camp, what you expect from me?\nI ain't askin' for love, you fuckers better love me\n\nSo Don't You Cross The Line, understand?\nOr you'll get this, boy, this shit, boy\nDon't you walk around like you raw\nOr you'll get hit boy, click, click, boy\nDon't You Cross The Line, understand?\nOr you'll get this, boy, this shit, boy\nDon't you walk around like you raw\nOr you'll get hit boy, click, click, boy\n\n(Verse 4-Buckshot)\nBuck is mass murder, I murder the masses\nNew or old school, I shoot up they classes\nNiggas need glasses when you lookin' at I\nTo recognize BDI, I'm a crook till I die\nFuck y'all, why? I was on the low with no dough\nAnd y'all was like, \"Nah, I don't no go\"\nWhen y'all had yo flow, now my attitude is so-so\nYou jealous and you wanna tell po-po, for what, yo?\nI don't sell no crack\nI don't sell no cocaine, weed now or none of that\nBut, I am here for runnin' rap\nI tell you one thing, fuck with that, gun in your back\nBoo-ya-ka! Who ya nah?\nBuckshot, I was here before Tupac died\nNo doubt, One Nation, I'm done wastin' time\nNow my gun facin' while you wastin' lines, we rise\n\nSo Don't You Cross The Line, understand?\nOr you'll get this, boy, this shit, boy\nDon't you walk around like you raw\nOr you'll get hit boy, click, click, boy\nDon't You Cross The Line, understand?\nOr you'll get this, boy, this shit, boy\nDon't you walk around like you raw\nOr you'll get hit boy, click, click, boy\n\n(Verse 5-Tek)\nThis little nigga went out for a night on the town\nWith a cone-head hoodie and a black four-pound\nRan up to the door, told 'em \"open it now\n'Fore I cock back the hammer and blow the shit down\"\nNow you see how bad niggas on my dick\nSayin' what you did to me when you ain't do shit\n'Cept hide behind your man, cop a plea to my dude\nY'all niggas is sweet, easily become food\nSo stay in your lane, homes, before them thangs drawn\nAnd it be you and all of your man's gone\n\n(Verse 6-Louieville Sluggah)\nLook, ain't nobody doin' a got-damn\nForever B-C-C is the fam\nSo sucker niggas hate if you want\nGet your chest blown out, crack a nigga blazin' a skunk\nI'm high as Cheech, levels you can't reach\nSippin' on that 'Nac, tighten up the strap\nFuckin' with this 'Bad Bitch' and her name ain't Trina\nJust a thorough bitch, told me \"Stack and keep your feet up\"\nI'm on mines double time, yeah, your boy gotta shine\nAnd my life consist of more then just rhymes\nNiggas hatin' on the bankroll\nBut nigga, front if you want, stand under the halo\n\nSo Don't You Cross The Line, understand?\nOr you'll get this, boy, this shit, boy\nDon't you walk around like you raw\nOr you'll get hit boy, click, click, boy\nDon't You Cross The Line, understand?\nOr you'll get this, boy, this shit, boy\nDon't you walk around like you raw\nOr you'll get hit boy, click, click, boy\n\n(Verse 7-Steele)\nYeah, if you cross me, that'll be costly\nLose a lung or a limb, slug puncture your artery\nGo thatta-way, you're startin' to bother me\nWhen I'm frustrated, guns blazin', no apologies\nFuck what they told you, I don't know you\nI don't owe you a damn thing, fuck what you go through\nI got issues of my own, pistols made of chrome\nSpecially used to some dudes like you back home\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}, {"title": "The Dugout", "href": "The_Dugout&&284", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(1-900-bootcamp)\n*BEEP*\n'Ello, I would like to meet\nSome people from da Bootcamp\nLike Top Dawg, Louieville, yaknahmsayin?\n...\nWhattup all you at Boot Camp, y'know?\nKnowhatI'msayin?\nYo I just got them new O.G.C. and whatnot\nIt's madd, crazy bangin' kid\nYo uh I just, givin' y'all a call\nTo tell y'all how dope all y'all are\nYou like, one of my favorite groups\nThe whole Boot Camp Clik is like\nYa know, just da bomb, y'know?\n...\n\n(Louieville)\nIs there a caller out there?\n\n", "album": {"title": "For_The_People_(1997)&&4259", "genre": "East Coast Hip Hop", "year": 1997}}, {"title": "Let's Roll", "href": "Let%27s_Roll&&374", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Louieville Sluggah)\nAiyo, bank rolls, face swolls\nBD Boys move, 'cause they know it dollars when I say so\nSay no, if it ain't dough, right up front\nBecause you still got haters right up front\nThat's plottin' on the downfall, creepin' all around y'all\nAs soon as he jump up, I grip that pound sound off\nJust trynna live this, back bone the business\nBCC is the click and, y'all can't get with\nNothing them boys spitting\nCause y'all like female dogs --- bitches\nSo move when we come through, of course with a gun or two\nSo tell me now, what the fuck niggaz gonna do\nH-E-NN-Y, pissy off shots of Hen', rockin' till I die\nNuts I bust off, if I bust off\nSlugs I bust off, if they want war, what?\n\n(Top Dog)\nUp in the club, Top Dog, show me some love\nI got my game face, gun in the place, blaze the place\nWith that yard weed, you know the god we remember that\nYou know we, ten second rolly, bum on the fat\n\n(Chorus 2X: Tek (Starang Wondah))\nHey ma, I'm hollerin', trynna see if you swallowin'\nHey ma, trynna pick out which ride you hoppin' in\nI know you wanna ride, come on, let's roll\n(Aiyo, I kow you wanna roll, come on, let's ride)\n\n(Tek)\nIt's six fifty by the curb, and a fifty ya herb\nThree sixties by the sixth fifty, that's by the curve\nNumber six on the throwback, Julius Irv'\nPound on 36 indites, for use and observe\n\n(Starang Wondah)\nThese niggaz steppin' on the scene, MVP's of the team\nSteppin' outta Yukon, like Alida Lamine, knawmean?\nStarang Wondah, pickin' and crips\nYou know me, low key, bitch, lits on the spliff\nSkinny nigga, I ain't got no time to exercise\nStep to guys, motherfuckers lives is jeopardized\nY'all recognize\n\n(Tek)\nYeah, we dead in the hood, but not dead in the hood\nYou know your boys boys, credit line is good\nCan't afford to see your step, got torned, same as the lords\nSip clubs and smoke purple, like we won the playoffs\n\n(Hook: Buckshot)\nNo matter what you go through\nWe gonna stick gonna together\n\n(Steele)\nGot on my Timb boots, car hard jeans too\nBulletproof vehicle, that's how we steam through\nTen to twenty niggaz deep with me, muggs rollin' the drugs\nBouncers wanna throw us out, but we ain't givin' a fuck\nI'm 3 star general, who you?\nCowards wanna disrespect the God, screw you\nBet if I put the Smif-N-Wess', and to ya head and squeeze it\nKill all the beef, and send you to meet Jesus\nSay y'all, rappers, can hate on\nWaiting on my down fall, mad 'cause we stay strong\nMost record labels too scared to deal with some real shit\nBet they all ride the dick when they feel this\nDuck Down, bitch, you in Bucktown\nLittle homey playin' big man and got struck down\nAin't near motherfucker safe in this game we walkin'\nPuttin' in work, till I'm laid in the coffin\nPlay hard strong, scrape y'all, thing on my waste y'all\nFace off, BC, every thing we been through we still together\nKeep sons on the block, guess to dead ya\n\n(Buckshot)\nRoll with me, ride with me\nYou can get dissed till ya side, or side with me\nWhether it's raw or it's cooked beef, we serve fiends\nProteins in our hooks and beats, from the snow to the streets\nSkeets of the rain, feet in the games\nAnd every nigga eatin' the same, I can't quit\nDrama then we handle it, cause any man'll flip with no prob'\nWanna play ball? Get ya squad\nMy shit is for niggaz behind bars, who do crime\nDo time, and do time hard, play the yard\nLift heavy, get ready for the massacre\nWe came a long way after ya, I see them niggaz gashin'\nCause, you really ain't half the thug\nYou just an average nigga flappin' for love\n\n(Louieville Sluggah)\nHey ma, I'm hollerin', trynna see if you swallowin'\nYou trynna pick out which ride ya hoppin' in\nI know you wanna roll, come on, let's ride\nI know you wanna ride, come on, let's roll\n\n", "album": {"title": "The_Chosen_Few_(2002)&&1762", "genre": "East Coast Hip Hop", "year": 2002}}, {"title": "Rugged Terrain", "href": "Rugged_Terrain&&4452", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Twanie Ranks)\nSometime me shout out, sometime me gon' long\nWhen me big up me chest, call me number one\nMe be represent me click, like me represent me gun\nPussy boy, test me, me chop off ya arm\nIf you weak for the gun, kill it, collection\nMommy do this long time like a barn veteran\nLike Screech and Pac Man or James Bond\nAlso Top Dog, or Louieville don\nSo sit back and watch and spark perfection\nMe used to be young, bout know me older\nMe spit lyrics wrong just like the Twister\nSo know we go, galley wit the one Twanie\nPick up them shoes and rub them for me\nLift up them anger, put them on it\nGimme ya number, girl, before them leave\nI'm not sure anymore, whose knockin' at my door\n\n(Top Dog Big Kahuna)\nIs it a Mom p, who want Hawaiian pie, me\nHit the slim girl, and I deal wit twenty\nOversize, I put my car in overdrive\n'Cause life is a lot of rules wit lots of signs\nI want mines on the dance floor, love the dance hall\nMy nigga Twanie Ranks'll make ya pants fall\nLast call, for the session\nI think that nigga's under the impression\nThat I may accord to the MP, for some more weed\nHe told me to pick up some more fine call-eed\n\n(Twanie Ranks)\nThe life of the true, live trife up ya life up wit\nTrue, I live trife\nWe are the one that cough up ya sack\nCop the Steele, I bust out the Tek\nWant one, come out turn the mic down\nGimme money, I lick a pound, vacation\nTalkin' politickin, I look for convincin\nTake a hundred out me pocket, now put down me pen\nFor are me red, for are me smoke weed-weed and dred\nMe leaf's a bitch now, and leave ya light convent\n\n(Chorus: Cocoa Brovaz)\nWe are the wickedest, wickedest, manor in town\nWickedest, wickedest, mon we don't care\nWickedest, wickedest, how we do\nWe are the wickedest, wickedest, duo\n\n(Top Dog Big Kahuna)\nWhen jah rocks the party, leave 'em your shorty\nI got shorties on watch and they don't wanna hurt nobody\nWorldwide, givin' you the chance to decide\nIf the place to be is on my muthafuckin side\nI let it slide, to a whole world of disorder\nGive you order, put your ass under water\nDespite, we know God Don't Like Ugly\nBut is it ugly, when nature becomes of me\n\n(Twanie Ranks)\nAfter the party, gather my target\nMe have two, gather, me don't know which one to hit\nSo sexy, sexy girl in the air\nWhen will ya come, will ya come out wit a stare\nPush up ya face and lift up ya feet\nAnd when will they come, I'm comin' and creepin'\nIrie, you my collar irie, when I gotta come to a nation\nGive the people what the people want\nWatch me now, watch me now, watch me now\n'Cause me lickin' at them head, lickin' at they back\nKeep the girl locked down just like two partner\nAction, ready for injection\nPull up ya leave, put down ya turban\nCall me a bad man, and me no bust carbon\nA long time me ban, I live in the Brooklyn\n\n(Top Dog Big Kahuna)\nA what do dem, a what do dem dem dem, a who a dem, a who a dem dem dem\nYou didn't know-oh, I thought I told you so-oh\nI be the three from O.G.C., runnin' things wit Twanie, touch me\nThat's why your skin out be burn, you must learn\nWhile we dub ya assess in the urn\n\n", "album": {"title": "For_The_People_(1997)&&4259", "genre": "East Coast Hip Hop", "year": 1997}}, {"title": "Everybody Knows Now", "href": "Everybody_Knows_Now&&3140", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Hook-Buckshot)\nEverybody Know Now, how that go now\nThey never big you up when you goin' down\nSo, when I rise to the come up\nRecognize and don't run up or you might get hung up\n\n(Verse 1-Louieville Sluggah)\nLook, fake smiles, fake hugs, fake love\nYup, all this fake shit just make a nigga thug\nThey think a nigga bug, I'm on some kind of drug\nBut, middle finger in the air, I don't give a fuck\nEverything peachy when you got that cash flow\nBut when it's all gone, you the world's biggest ass\nTold him, you ain't doin' enough, steady chasin' cash\nBut if you let them tell it, you was on your ass\nThat's just not me, I'm a fly, slim nigga\nFuck with mines and I'ma move a few triggers\nMe and a few niggaz, stacked a few million\nBuy a few buildings, open a few stores\nCatch a few fights like cock suckers\nWhere you at? 'Cause it's on tonight\nDo it like it was never done before, you came to me\nI'm guaranteed, you gon' remember the name, Henny!\n\n(Hook-Buckshot)\nEverybody Know Now, how that go now\nThey never big you up when you goin' down\nSo, when I rise to the come up\nRecognize and don't run up or you might get hung up\nEverybody Know Now, how that go now\nThey never big you up when you goin' down\nSo, when I rise to the come up\nRecognize and don't run up or you might get hung up\n\n(Verse 2-Tek)\nI never thought in my wildest dreams\nThat I would be a gangsta with get money schemes\nWho knew snitches be involved\nAlong with some stolen cars and some battle scars\nGang bangin' hard body without the signs\nAnd there's no profit seen without the grind\nHad to shape up and ship out, give samples, get clout\nTake a loss here and there, yeah, no doubt\nBut it wouldn't be the streets without a hustle\nAnd I wouldn't be your man without a struggle\nSo while you re-in, if you ain't seein' double\nJust wastin' your time, livin' life on a chumble\n\n(Verse 3-Steele)\nSon, I might need a muzzle, I'm a beast in this concrete jungle\nWhen I speak, got the streets in a huddle\nReal subtle, if the beef is amongst you\nKeep the grief when I come through, put your peeps in a puddle\nYeah chief, I be humble but I rumble\nLike a water con, get your arms, get involved, get in bomb\nGet a track, get a song, get a block, get a bomb\nGet a spot, get a squad, get your gat, get it on\n\n(Hook-Buckshot)\nEverybody Know Now, how that go now\nThey never big you up when you goin' down\nSo, when I rise to the come up\nRecognize and don't run up or you might get hung up\nEverybody Know Now, how that go now\nThey never big you up when you goin' down\nSo, when I rise to the come up\nRecognize and don't run up or you might get hung up\n\n(Bridge-Buckshot)\nListen, I'm not slackin', by my nuts saggin'\nIs my shotgun, got one for your cabbage\nYou back stabbers get at this\nY'all niggaz ain't real, you actors\nI'm not slackin', by my nuts saggin'\nIs my shotgun, got one for your cabbage\nYou back stabbers get at this\nY'all niggaz ain't real, you actors, ha, ha\n\n(Verse 4-Rock)\nHey yo, I'm from the beast of the east, where we speak to you with heat\nBeat your feet, fuck outta here tryin' to preach the Jesus\nI do dirt, muscle the hustlers, bang out smokers\nMunchers or mufflers, so what if you suckers don't fuck with us\nGood, don't fuck with us, and while you at it, don't fuck with us\nI got nothin' but slugs for your fucker love\nWhere was the love a couple of years ago?\nOh, now I'm back in your stereo, and here you go\nYou big schlong saddling straddling, switch side and dick ridin' and scramblin'\nLookin' for the next Sasha to slam in your maggot ass, male groupie actin'\nHoochie fanatic, Stan look-alike, bandwagon jumpin' bitch bastards\nYou are lookin' at one of the realist gorillas\nY'all some chinchillas, you soft niggaz\nIf I wanted your support, I would just take it\nBut we NFL, No-Fake-Love, keep the fake shit\n\n(Hook-Buckshot)\nEverybody Know Now, how that go now\nThey never big you up when you goin' down\nSo, when I rise to the come up\nRecognize and don't run up or you might get hung up\nEverybody Know Now, how that go now\nThey never big you up when you goin' down\nSo, when I rise to the come up\nRecognize and don't run up or you might get hung up\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}, {"title": "But Tha Game Iz Still Tha Same", "href": "But_Tha_Game_Iz_Still_Tha_Same&&5452", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Intro-Louis Farrakhan vocal sample)\n\"The names and the faces have changed\nBut Tha Game Iz Still Tha Same\" You tell 'em, Farrakhan\n\"Understand it, brothers and sisters\"\n\n(Hook-Rock)\nY'all go 'head, get your hustle on, huh\nWe gon' continue to get our muscle on\nMuscle anybody, muscle y'all 'cause\n\"Tha Game Iz Still Tha Same\" We still B-C-C\nY'all go 'head, get your hustle on, huh\nWe gon' continue to get our muscle on\nWe done watched a bunch of y'all come and gone\nBut, \"Tha Game Iz Still Tha Same\" B-C-C\n\n(Verse 1-Buckshot)\nLook at you, dog, you hustlin' hard\nYou flip the script, true, you playin' your part\nGot the looks, got the chain, earrings, playin' your card\nI know you playin' yourself only to be big, but hey pa\nEverybody's a titan, we do whatever they likin'\nSo I invite you to the spot so you can see the right view\n'Cause, I'm sittin' back and I'm laughin'\nAt niggas spendin' they money, and they don't even have it\nIt's tragic, some do elastic numbers\nFor a look in the mirror and the net full of slum, but\nYou can't tell 'em nothin' when they stuntin'\nLike Evil Knievel, leavin' the needle jumpin'\nSomething's gotta change, kinda strange how niggas start actin'\nWhen a hot record come out, they think it's them rappin'\nThen they get gassed and start clappin'\nWhen them things come out, they get assed and start trackin'\n\n(Hook-Rock)\nY'all go 'head, get your hustle on, huh\nWe gon' continue to get our muscle on\nMuscle anybody, muscle y'all 'cause\n\"Tha Game Iz Still Tha Same\" We still B-C-C\nY'all go 'head, get your hustle on, huh\nWe gon' continue to get our muscle on\nWe done watched a bunch of y'all come and gone\nBut, \"Tha Game Iz Still Tha Same\" B-C-C\n\n(Verse 2-Steele)\nI stay real since 'Atari' and 'Calico'\nLate night hustlin', hangin' with my peoples\nWhat's in my 'X-Box'? Unknown to the cops\n'Cause I don't 'Play Stations' close, I ain't tryin' to get knocked\nIt's not a game, boy, nah, I knew that from the genesis\nWhen you see me, I'm fatigued up, stay in some Timberlands\nSoldier in this 'Game Cube', bang dudes, gang rules\nIt's not a 'Dream Cast' when your life flash in your view\n\n(Verse 3-Sean Price)\nYo, listen, hey yo, Dexter Manning, pull sket's, wet your family\nOverstand the underhanded ways of my Camp, B\nSean P the General, so generally speakin'\nI put ten in your body, your friends'll be leakin'\nNever chill on the weekend, the son don't chill\nGat'll spray on a Saturday 'cause I'm from the 'Ville\nGot no time for petty lines, rappin' your stupid shit\nYou can get the fist in your face for fuckin' with the pugilist\nSean ain't new to this, rappin' a while now\nHappy drug dealer, sell crack with a smile now\nKarate chop grills, Johnny Knoxville\nGettin' high from my own supply, that's not real\nYour arm's too short to box with the God\nYou weed-whack, don't smoke pot with the God\nListen, Sean Price is the prophet, the profit\nThe best Nation is donation, Elijah Mohammad, P!\n\n(Hook-Rock)\nY'all go 'head, get your hustle on, huh\nWe gon' continue to get our muscle on\nMuscle anybody, muscle y'all 'cause\n\"Tha Game Iz Still Tha Same\" We still B-C-C\nY'all go 'head, get your hustle on, huh\nWe gon' continue to get our muscle on\nWe done watched a bunch of y'all come and gone\nBut, \"Tha Game Iz Still Tha Same\" B-C-C\n\n(Outro-Louis Farrakhan vocal sample)\n\"But Tha Game Iz Still Tha Same\"\n\"But Tha Game Iz Still Tha Same\"\n\"But Tha Game Iz Still Tha Same\"\n\"But Tha Game Iz Still Tha Same\"\n\"But Tha Game Iz Still Tha Same\"\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}, {"title": "And So", "href": "And_So&&8047", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "It's Tek man niggaz can't tell me shit\n\n(Tek)\nI do what I do like I do for the hood\nPop tools pop jewels burn backwoods\nSlay DJ's who think they untouchable\nRenegade never been afraid MC's get it too\nThe moral of the story is this\nI used to say get off but this time\nSuck my dick!\nI'm from BK home of Big and Aaliyah\nWatch how the pound of the four-fifth leave ya\n\n(Sean Price)\nI guess I'm back where I started\nOpen up for Buckshot and just rappin' retarded\nI hate the life that I'm livin' I need it\nDon't believe me ask my wife and my children\nSee I'm back on the street packin the heat\nRoyalty checks equal to crack in the street\nNiggaz like fuck crack Ruck rap to the beat\nI'm aight I'll be back week listen\nFrom day one I had bad start\nTo eat moms stole meat out the path mart\nI ain't playin' I went from the prey to the street\nTo blazin' heat to blazin' heat to haze in street\nDid a couple of months and came home\nThought about what I did\nDid the same shit I ain't come back home\nNiggaz like \"why you done that homes?\"\n\"I don't know,(shit... fuck)..I don't know\"\n\n(Buckshot)\nThe saga continues the motherfuckin drama continues\nBuck brought bomb to ya interview and blew the main\nTopic\nWhat's up with boot camp clik son?\nThey ain't knockin' they ain't hot in\nAin't droppin' the now topics\nBut listen nigga this is how I pop shit\nI don't mean Moet corks when the poet talks\nEvery line leave ya blind when the mind get lost\nRhymes are enforced with action\nCause everybody looking like\nIs they slackin', are they back in what's crackin'?\nNigga I'm hip hop like the backspinnen\nNever change the fact that I did back then\n\n(Steele)\nWay before this all began\nBack when I wasn't rappin'\nI was scrappin for ends\nStop crime started rhymin\nKnapsack and my tims\nChart climbin y'all kind can get a ghat to ya ribs\nThere's a thin between what I rep and I live\nWhen you violate mine I'm getting back at you kid\nDon't let it get to the gun clappin and shit\nPlastic wrap back smack you in the back of ya wig\nI, make it so you won't get back to ya crib\nBreak ya wrist, never scratch you never wreck it again\nTake a risk never steal from Steele and Tek again\nTake the fifth, cock the hammer let it rest on ya chin\nMy dudes destine to win\nFuck ya thoughts\nWanna brawl dog my team the sports\nAnd so ya thinking I'm \"The One\" like Jet Li\nTest me Steele will leave you resting\n\n(Top Dog)\nI can't take this\nBlood boiling pressure rising\nOpen my eye's an we narrowed down to 7 guys\nAnd so you ask about the god DO\nI'm top notch holdin' my spot gun by my crotch\nYou think not I'm respected and feared around here\nAnd so I must prepared around here\nYou know everything that glitters ain't gold\nYou ho getting pimped by niggaz you don't know\nThat's whoa, watch out for cars that move slow\nWindows low\nI was taught by the best to do the one\nAnd gain control of this game\nAnd be sold not told And So\nI'ma rep for B-O-O-T C-A-M-P\n'Cause I'm Top D-O-G number 3\nYou know from the O.G.C.\nThat blow trees fuckin' with them Cocoa B's\nWe OD's fuckin' with them Cocoa B's\n\n(Buckshot)\nFuck everything you been told\nShit like Buck ain't never went gold\nHe never have a platinum hit\nHe on that underground backpack rappin' shit\n\n(Tek)\nIf you for real than you know the deal\n\n(Steele)\nI do or I die and I never ran never will\n\n(Sean Price)\nAnd So you still peepin my words\nWords that get niggaz locked up in 73rd\n\n(Top Dog)\nYou forgot who we are?\nHave you lost all your respect for my\n\n", "album": {"title": "The_Chosen_Few_(2002)&&1762", "genre": "East Coast Hip Hop", "year": 2002}}, {"title": "Rag Time", "href": "Rag_Time&&2157", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "Come on everybody let's all get down\nCome on everybody let's all get down\nCome on everybody let's all get down\nWhat we bring to you, is the Boot Camp sound\n\n(Steele)\nSo that nobody out there will be misled\nWe come to bring this to you live and direct\nLive and direct from the Boot Camp set\nWe be W-W-B-C-C, family is our Priority\nWe wan' look out for you, so you look out for we\nSo each one, for each one it's necessary\nTo establish this establishment in a hurry\nDon't worry, Rhino got security very trained\n'Cause we don't know how sometimes things get buried\nBut in my vision I see, how all my peeps\nCongregate in common unity\nThe place soon to be packed in capacity\nIt makes me glad to see all these celebrities\nReminds me of back in the days of Rag Time\nWhen my people used to come and show they face and shine\nSpend a couple of dimes, sip some wine\nBrothers look sharp, sisters lookin' revive\nSo get up, get live, grown folks on line\nYoung folks allowed only if they act pride\nThere's a party tonight, open and vibe\nGet ready, 'cause we bout to let the bomb ignite, the bomb ignite\n\n(Mada Rocka)\nCome in and bring, you divine, simply refined\nPull out the glasses boy, you bout to taste the finest wine\nI'm tryin' to shine like the soldiers Smif-N-Wessun\nCount yours blessings, and take heed, life is full of lessons\nNo need for stressin and dwellin on the past\nHit the blunt and pass, and pick your body up and dance\nChill, let Mada Rocka put you in a trance\nWe gon see who them rag or not\n\n(Steele)\nWe got Brown on the keyboards, Boogie Brown on the q-sticks\nMr. Brown on guitar, oh Lord\nEye an eye, like the Gemini\nSpeakin' of Gemini, caught the B.D.I. smokin' wit Smokey Lah\n\n(LS)\nCome on, you better come on down\nYou better come on down, you better come on down\n\n(Buckshot)\nI got a lesson from the good Reverend Meouphe\nHe told me when the vibe is negative, Buck be off\nI stay in tune, wit the feel of the most natural meal\nWe W B C, brake the seal, make ya squaller and kneel\nKnow you know the deal, Rag Time you better come down for real\n\n(Singing and preaching to the end)\n\n", "album": {"title": "For_The_People_(1997)&&4259", "genre": "East Coast Hip Hop", "year": 1997}}, {"title": "Think Back", "href": "Think_Back&&6125", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "This one here\n(Let's take a sec to think back) --&gt; Buckshot\nBeatminerz in effect\nAin't nothin' ever lost between us\nEvil Dee\nNahmean\n(Let's take a sec to think back)\nBoot Camp Clik\nIt's a framalama thing\n(Let's take a sec to think back)\nIt went like this\n(Think back) (think back) (think back)\nAs we go back...\n\n(VERSE 1: Buckshot)\n1981 - the first year rap begun\nThe first time I saw a backwards spun\nI was in my living room practisin\nWatchin the tube, _Facts of Life_\n_Different Strokes_ in the afternoon\n_Scarface_ looked mean in the flicks\nEverybody who pumped coke back then was fiendin for bricks\n'86, no fades, afro tops\nIn those days your whole ave was the spot\nThe scene locked with Lee patches, Cazel glasses\nSuede Pumas and rumors of rap not lastin\nTill the class of '89 came through\nHigh top fade, tailor-made Gucci suits\nJordan was champ, Mike Tyson was amped\nReagan was the pres and the border was a place to camp\nJust think back like this\nAs you reminisce, reminisce\n\n((Jahdan &amp;) Tek)\n(Think back now)\nWhen Erving said he had the monster\nBaddest bitch in skin flicks was Heather Hunter\n(Think back now)\nRosie Perez titties\n_Def Comedy Jam_, the _Itty Bitty Titty Committee_\n(Think back now)\nWhen _Martin_ was on\nJazzy Jeff, Fresh Prince \"Summertime\" was the song\n(Think back now)\nBuffalo was the spot\nSnitches got stitches and you got jumped 'stead of gettin' shot\n\n(Steele)\nZone with me\nCome home with me\nCome home with me\n\n(VERSE 2: Steele)\nPicture in your mind, a place and a time\nWhere we all can go, don't need dough to shine\nAll you gotta do is, be true to who you is\nI'm original and God is my influence\nHip-hop, be bop, jazz, rock music\nPalladium and Roof Top, Latin Quarters boomin\nWe keep it movin to the beats, tune in to the streets\nThe rumors and the passengers preach\nRap I master so I teach; each I touch\nRespect the power of the microphone in my clutch\nSay ma, your little boy's all grown up\nHey y'all, I told you all we got is us\nI love pops, he raised me on some good old soul\nMarvin Gaye, Curtis Mayfield and Nina Simone\n\"Songs in the Key of Life\" to hold\nWhen the streets get cold\nAlways focused when I'm reachin' for goals\n\n(Tek)\nThat's PNC right behind me\nLet no man take us under, bee\nAnd no bitch for that matter, ya heard me?\n\n(Let's take a sec to think back)\n\n(VERSE 3: Tek)\nThis is for my 18 and under, 20 and over\nWalkin' round with the weight of they clothing on they shoulders\nLook at me, 26 year old, years enfold\nDrive a (?) 'bout a year old\nDid the gold, stepped my game up to grade\nRosary throwback, exclusives and haze\nSeen hoes and dough come and go\nRememberin the reign of crack and power of dope\nWitnessed miracles of babies bein born, niggas bein killed\nNiggas gettin' killed, babies born again\nShowed your block love, Tekno Marine Breitling\nThe class of Lockman, new Jacob thing\nBenz, 4, 5, 6\nTruck, Navigator, Escalade, bitches want dick\nTook it from the end of '89 through '99\nI'm the nigga 2000 and beyond\n\n(VERSE 4: Sean Price)\nMeadowlark Lemon\nWood-sevens on the god neck\nThey the ghetto park reverends (peace god)\nLee patches got snatched, d's in the hatchback\nWith ease, nigga, pass that\nBennetton bag (?)\nNiggas like, \"Son, you fly\" Yo, I can afford it\nDecept niggas, in the party we tangle\nWith anybody, jump on the train, punch Guardian Angels\nDon't believe, we put a stack on it\nCops like, \"You can drink, put a bag on it\"\nBack in the days...\n\n((Jahdan &amp;) Tek)\n(Think back now)\nWhat's today's mathematics?\nSaturday Night Specials, now it's automatics\n(Think back now)\nWhen crack appeared\nVCR's got stole, shorty asses disappeared\n(Think back now)\nIZOD, La Tigra, 8 ball coats\nMy man Earl (?)\n(Think back now)\nKarate flicks, Gucci kicks\nFavorite team the New York Knicks\n\n(Jahdan)\nThink back now\nDem ah see how rapidly things change into the passage of time yah\nThink back now\nHe, style we don't borrow, we no lend\nGo tell dem we ah set trend, yah\nYo (?) dem just can't comprehend, yah\nYo, reset even though the times keep changin\n\n(Steele)\nWord is bond\nYo yo yo son\nRemember goin' Uptown, 125, youknowmsayin\nIn front of the Apollo and shit\nStandin there, went to take flicks and all that...\n\n(Jahdan)\nThink back now\n\n", "album": {"title": "The_Chosen_Few_(2002)&&1762", "genre": "East Coast Hip Hop", "year": 2002}}, {"title": "Hate All You Want", "href": "Hate_All_You_Want&&7244", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Intro-Rock)\nYeah, Boot Camp!\n\n(Verse 1-Rock)\nGo 'head, act like you don't know Boot Camp Clik\nGo 'head, ask who, I will, \"I Stand Alone\", God smash you\nI will pop lamb the chrome at your broad and you\nI will have Xzibit \"Pimp Your Ride\" then carjack you\nHave him shoot you dead, you stressin'\nJust 'cause your girl showed me her best Superhead impression\nI'm Don Rocko, rapper-slash-mutha fuckin' crook-\nSlash-killer, got you mutha fuckas shook, take a mutha fuckin' look...\n\n(Verse 2-Buckshot)\n...At how you lookin' and you look at me now\nI had to move up, you pulled me down\nYup, now I'm shittin' with no tissue\nAnd this is my issue, I'm not kiddin' you\nY'all say it's forbidden for me to be a fly rap star\nIn a fly car, livin' like y'all\nSo, I don't pay you no mind\nGo ahead, switch, have a gay old time\nYou that bitch, rapper-slash-fan\nTryin' to get on with your half-a-ass plan\nI know, you a \"Watch When I\"\nWatch when I this, watch when I, but then I\nShow y'all mutha fuckas how the indies do it\nDuck Down, servin' niggas like Wendy's do it\nWhy y'all fight over release date\nI'm droppin' mutha fuckin' records every month, with a new briefcase, I'm so\nStraight\n\n(Verse 3-Sean Price)\nLike six o'clock, grip the watch\nOff your wrist and watch as bitch get the cops\nSean Price quick to box, grip your gwop\nSplit your knot and go pitch piston rocks\nYou ain't shit to Rock, you ain't shit to me\nTryin' to take out the team, that's some shit to see\nWe the number one independent\nYou a bird, go against your word, snitchin' on your co-defendant, P\n\n(Hook-Rock)\nWe Boot Camp! Y'all can Hate it All You Want\nBoot Camp! All you stunts, all you chumps\nBoot Camp! Have us straight break all y'all fronts\nAnd if it go down, we all gon' dump, Boot Camp!\nBoot Camp! Y'all can Hate it All You Want\nBoot Camp! All you chumps, all you stunts\nBoot Camp! Guns scrape damn near all y'all smuts\nYour man pop off, we all gon' dump, Boot Camp!\n\n(Bridge-Rock)\nHut one, hut two, hut three, hut four\nThat's what we chant when we 'bout to get it on\nHut one, hut two, hut three, hut four\nThat's what we chant when we 'bout to get it on\nHut one, hut two, hut three, hut four\nThat's what we chant when we 'bout to get it on\nHut one, hut two, hut three, hut four\nBoot Camp, it's time to get it on\n\n(Verse 4-Tek)\nYo, ten-hut! That's how I move 'round with the nine tucked\nPlus, I'm in a black truck, the ARS Corsa\nWindow half down with a whistling sound\nNext thing, you in a wheelchair bein' pushed 'round\nHold up, wait a second, get the wrong idea of Tek\n'Cause you paralyzed don't mean I don't show you respect\nBut some of y'all deserve more than two shots to your grill\nHit with a clip full, buried in products-ville, biatch!\n\n(Verse 5-Steele)\nMy team thick like syrup, b-d-rrrrrr-up\nMy gun go, it's time to roll, nigga, hur' up\nCrime mind corrupt, never wanna burn up\nBurn us, ain't no tellin' where your body turn up\nSmif-N-Wessun, dirty, know it's sure us\nWe said \"Headz Ain't Redee\", I don't think ya heard us\nNow we back in position with the gat in the britches\nPut the track in submission, it's a wrap for you niggas\n\n(Hook-Rock)\nWe Boot Camp! Y'all can Hate it All You Want\nBoot Camp! All you stunts, all you chumps\nBoot Camp! Have us straight break all y'all fronts\nAnd if it go down, we all gon' dump, Boot Camp!\nBoot Camp! Y'all can Hate it All You Want\nBoot Camp! All you chumps, all you stunts\nBoot Camp! Guns scrape damn near all y'all smuts\nYour man pop off, we all gon' dump, Boot Camp!\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}, {"title": "Whoop His Ass", "href": "Whoop_His_Ass&&1965", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Buckshot)\nYeah, this one for all you motherfuckers dissing me\nAnd don't I'm listening, well I'm listening you listen\n\nI went from rags to riches, riches to rags\nOn my face and pocket to the one on gat\nFor the ones that be up back like anybody did it\nFronting like fake digits look Kenyta did it\nProlific hard-core shit I gotta spit it\nThe hardest admit it put my heart in it\nI ain't trying to see broke all wanna do is see notes\nA few mill with an ill speedboat\nAnd I quote Buck ain't daily good\nFuck words, I spits shots till you feel good\nLove rap &amp; I love MC-ing\nShit but still love killing every nigga in sight\nNo reason, we in duck season, watch out\nElmer bud, smoke the fuss pull the glock out\nJack in box two shots pop out\nStill money on the dow pitch stock out\nIt's Duckdown I-N-C for niggas who be D-I-C-K ride I-N-G\nDon't hate just holla and you can follow pitbull and rottweilers\nWho wear chain tight collar\nBenz to Impalas\nFriends who just gotta grab they dick, 'cause they love\nHip Hop like Big Poppa\nDog, Heh I know it's hard to see\nBut I'm Whoop your Ass my squad and me\n\n(Rufus Blaq/Chorus)\nThat nigga on block slanging\nWhoop his ass\nTalking bout how he banging\nWhoop his ass\nNigga felt your girl ass\nWhoop his ass\nHe fronting on your cash\nWhoop his ass\nIf he get up in your face\nWhoop his ass\nPut him back in his place\nWhoop his ass\nDon't be playing with these niggas, man\nYou better Whoop his ass (repeat)\n\n\n(Steele and Tek)\nWho dem niggas over there (Steele)\nSome broke dude fronting thinks I was scared (Tek)\nMan., get that thang what he moving onions (Tek)\nStop playing I'll show you how to this younging (Tek)\nSee we about biz feed the kids, no apologies (Steele)\nPushing for you industry niggas no stopping this\n\n(Steele)\nBeen pissing whores before R.Kezzy (Tek)\nWe number one stunners like Baby &amp;Wezzy (Tek)\nDo like it's easy want me, see me (Steele)\nFuck talking, we squeezing my lips is greasy (Steele)\nMy neck, My back (Tek)\nY'all I'm gonna light this head crack (Tek)\nMy neck, My back (Tek)\nSuck my dick and nut sack (Tek)\nBitch! (Tek)\n\n(Buckshot)\nWho this flapping like he started something\nActing like you hard or something\nMan, listen you can sell drugs for life\nI'm a hit-man for hire sell slugs for life\nAnd you that right anybody left goodnight\nRun you down your last sight is the headlight\nIn the Halo niggas better watch what they say yo\n'Cause I don't play no bank broke O.K. so\nUp the world like I saw your girl\nFuck yours I throw up Crowhill you throw up Earl\nI keep a mac by my dog precious\nSo I can bark and bite at the same time\nY'all test up I spaz out ass-low I never ass out\nKeep a gun I be the first one to pull the brass out no doubt\nSo I ain't to prove you nothing\nBut I can prove one thing is that you two-way fronting\n\n", "album": {"title": "The_Chosen_Few_(2002)&&1762", "genre": "East Coast Hip Hop", "year": 2002}}, {"title": "That's Tough (Little Bit)", "href": "That%27s_Tough_(Little_Bit)&&4689", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Chorus: Tek and (Starang))\nGet a little bit of ass and a little bit of head (take that)\nLittle bit of haze and a little bit of dro (pass that yo)\nGet a little bit of goose and a little bit of mo (swig that)\nLittle bit of this little bit of that (true true true) that's tough\nGet a little bit ex and a little bit of sex (mix that)\nLittle bit of coke and a little bit of dope (slang that)\nGet a nice jersey along with a fit\nLittle bit of ones little bit of guns (stack that)\nLittle bit of Rocawear and some nice products (like that)\nLittle bit Nike and a little bit of Gucci (cop that yo)\nLittle bit of this and a little bit of that (true true true)\n\n(Tek)\nI know name is range bout' to get he rover man\nY'all new names finito y'all over lanes\nPeep my form necks backs and pecks\nJeep wagon Cadillac truck drop Lex\nI mean big checks and guns\nAsses on bitches\nE.P.M.D. album \"Strictly Business\"\nI'm mean on the fizzy flow\nBeam on the crizzy fo\nPockets got them lumps and I lean off the drizzy dro\nSo who know fuckin' with smoke besides ya girl\nStick a dick all in her throat until she hurl\nSee Tek in the cars or treat us at the bar\nOr V.I.P. and envy\n(Starang and Tek combined)\n\n(Starang)\nDressed up in Sweatpants, headbands call Dru\nCollect my advance\nHit the club up\nBouncer type chumps looking cut up\nWhat up? Will in the house spark bud up\nSwitch up park the truck pull the six up\nAlmost had to smack some bitch up (for what yo?)\nOpening the door I'm tryin' to get my dick sucked\nAin't no mix up as I spark the spliff up\nIn the club I can't be on the low\nCause some ho from some show\nBe like I know yo\nI can't even get my grime on\nBack up man I ain't here to get my rhyme on\nSpend a little time until my time gone\nWeed and Hennessey got a nigga mind gone yo\n\n(Buckshot)\nWho that little bad ass nigga named Buck?\nMade a little fast cash got a little stuck\nGot a little fucked up in the game so what\nI don't care when I'm here put your dancers up\nHands up or stand down\n'Cause if it get deeper than this in this bitch\nTheir comin' like man down\nA little bit of bouncers now\nI know they wanna bounce us now\nSeein the ___ by the little clout\nLittle shorty bad as hell\nBut look fowl come a little close to the crook\nDon't get shook now\nI'm hooked now\nYou got a little body on you baby\nProbably already took now\nI spit a little game and you came\nGot you like who that little man with the little frame?\nA little fame\nYour fuckin' with the Boot Camp Clik shorty\nRespect the name\n\n(Shorty)\n\n(Steele)\nCocks, cunts, drugs, booze\nPamela Anderson, Penelope Cruz\nJennifer Love Jennifer Lo\nDiaz Rahi ???\nMia, Mya, Alicia, Tyra\nVivica's a fox and Maria's hotta\nThe Titi is fire\nAnd the Vica Secretes\nCame in with Calice and got all my peeps in\n\n(Sean Price)\nI ain't been in the club since the romp and chub rock\nDoin' the electric slide\nWhen it was called the bus stop\nWhen y'all young niggaz was in school with ya luchbox\nI was in club Bentley's silk shirt and my gun cocked\nRed Parrot Rooftop\n20's of coke bitch niggaz got they jewels popped\nYo, Shems to Baron shirt\n?? At Roxy\nMartini and Rossi\nI ??????\nNow that's tough\n\n", "album": {"title": "The_Chosen_Few_(2002)&&1762", "genre": "East Coast Hip Hop", "year": 2002}}, {"title": "Headz Are Reddee, Part 2", "href": "Headz_Are_Reddee,_Part_2&&6168", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "R-U ready...(to my west coast headz come on)\nReady... all my headz are you ready\nAnd to my east coast headz come on\nR-U-ready... I say all my peoples are you ready\nAnd to my headz that's overseas\nI say are you ready\nAll my people are you ready\n\n(Louieville)\nMuthafucka had it up to here,\nFrom my chest to my head\nWhen the led paint the town red bloodshed your dead\nI groove through these pavements\nWe all together there's no slaveships\nSo run these rebels that race this\nBe watchful of large cows hovering covering in the dawn\nHusk it's the storm, I cock back\nRelax and drink the henne-vill slugga\nMy fleet will see ahead so we will see you sucka\nShake 'em down for profound sound\nPunk your down by lightnin, throw your fists up 'cause...\n\n(Tek)\nThe escapade when its followed, move the shit from Guatemala\nMove the Q-U 7 years ago wit my father\nI met shorty whop at a block dice game\nNo words where exchanged, body language did its thang\nThink I didn't when I did take honey back to the nest\nTwist the back as soon as we hit the rest\nMe tongue and kisses sway like a fly wind bloom\nSeductivly undressed as she laid across the room\nAnd cocked her seat up on the bed and grabbed her ankles and said\nIt's been a long time lets see if your ready yet\n\nAll my peoples are you ready\nR-U... all my peopless are you ready\n\n(Steele)\nWe the soldiers of misfortune have fought one common cause\nI keep mine in yours for fallen off\nWhen sources uncontrollable offers coffins for all of you\nSoon we'll see it might be too late to come in unity\n\n(Rock)\nYo its on again,\nWack get gone it when Boot Camp begin swarmin in\nSo I say all my peoples are you ready,\nAre you ready, not the one gas like the Getty let the\nSoldiers get busy light this party like a bar-be\nYou too late once we start we, nothin' gets copy\nWhen squads meet, oh god we gon last\nWhen I'm rockin' you can't escape from me\nFrom the grass out the smash\nWe rock rows, I crash like a drunk driver wit his tire slashed\nPunk you don't know the half and if you do\nThen maybe you can fuck wit me\nAnd my W-W-B-C-C\n\n(Starang)\nOh, oh it's my go, I blow MC's outta the frame\nTell me that it wassnt your last l.p. to blame\nSo I got this shit lockdown like terrorists in airplanes\nNow that my swear is complete I got no time for games\n(I know) me and rino be like the lone ranger and tonto\nStickin niggas up for they weed and they pronto\nI play the background call me the head honcho\nOut to get mine, I ain't got no time for your convo\nI got you, hak-2, hit 'em wit a combo\nMe and ville sluggah out a shorty in diablo\n\n(Top Dog)\nLife is a sound, we a de champions, the champions... yeah\nListen to sound, we a de numba one sound, de numba ones yeah\nFor de people dem, we have to be a little stronger\nAll in all the Top Dog you will be wrong-\nTo miss, the Storm on CD-Rom\nGivin' you the bomb, big up to Tawl Sean\n\n(Ruck)\nFrom an unknown region, me and my legion\nNever believe in the evil ways of a heathen\nI breathe in, out improve on my physical\nTrees keep me blessed, prepare for my ritual\nIts critical when I belittle fools wit syllables\nI choose to use 'cause y'all niggas is pitiful\nIts difficult to see whose ready\nNocoturnal journalist racin through crews like Andretti\n\n(Buckshot)\nAs I come back on tracks\nPut you in the mood to sit back and relax\nI hope you cop a swat 'cause what I got rocks\nYour mind body and soul as I take control\nWhat's the definition of Buck... Force\nI stayed away for 3 years but came back in the 4th\nTo stand alone on the throne of course\nBuck be the boss, the rest gettin' tossed\nTrue...\n\nBuckshot is here to stay you best believe it in\nNow you ready for what we got\nGotta give a big big-up\nTo the whole conference all\nTigga, Tek and Sway, the Bay Boys in the place to be\nB double O T-C-A-M-P, an we busy\nGotta big-up Illanoiz, DJ Swan, The Representativz\nAlways representin y'all\n\n", "album": {"title": "For_The_People_(1997)&&4259", "genre": "East Coast Hip Hop", "year": 1997}}, {"title": "Welcome to Bucktown USA", "href": "Welcome_To_Bucktown_USA&&6381", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Supreme)\nWelcome to Bucktown USA\n\n(Tek)\nYeah\nSmokin' on some of that sticky icky for my nigga\nI said for my nigga who do that joint back there\nThat's Scratch from The Roots, you heard me?\nListen up, learn something\n\n(VERSE 1: Supreme of The Representativz)\nHey yo, it's real out here\nYou better know the drill out here\nSon, you better pack steel out here\nThe minute you show fear you get killed out here\nI seen niggas slip and lose they will out here\nWord, playin' the curb where crack rock and lleyo is served\nWatchin for beast so they don't observe\nAnother day another hustle, nigga, stay in your swerve\nI stay focused and never let it weigh on my nerves\nBack on the block where young thugs blast for they props\nTrash the glock through a 100 yard dash on a cop\nGot half the p's runnin' while the other half watch\nAnd when it's hot stash the work in your sock or get knocked\nThis is a dirty game, so play it to win\nAnd watch them niggas, they some devious men\nYou either love me or hate me, ain't no need to pretend\nCause fake friends always wind up enemies in the end\n\n(CHORUS: Buckshot)\nWelcome to Bucktown USA\nWhere the weak get dissed every day\n(Bucktown is the state of mind that I'm trapped in)\n(Lawd, some bwoy gon' get dead tonight)\n\n(VERSE 2: Steele)\nBucktown USA, where it all started\nRespect to the products and the dearly departed\nBow Leg Dimples, Dotty and Janie\nRob and Smiley made me, the community raised me\nMom left pops, moved to the Eighties\nCanarsie hookey parties was crazy\nGlenwood P's, watch for the d's who down in the trenches\nPlayin' the benches, rappin' to release tension\nWhen Ru got sentenced I knew they meant business\nWhen Bo got hit, shit, I knew we had to flip this\nPNC, BCC, Genereal S-t-double e-l-e\nWe do this like we do this 'cause we all family\nKnown as some of the truest in this industry\nContract combat left casualties\nDuck down when you're marked on target and I squeeze\n\n(VERSE 3: Buckshot)\nI walk up with my boots tight\nLaced up by my leg, I'm beyond your reg hood type\nAnd half of you dudes is like\nHollywood rap act that belong on a movie site\nCome on aight, admit it\nYou really wanna come into my hood but you know it's not good to come up in it\nCause everyday we on a mission\nDon't slip, don't snooze, when you move through disciplined\nListen, never think it's all gravy, it could be yours, baby\nThey'll even take from your lady; and boo\nIf I was you I wouldn't hang with no ducks\nBlue-ball dogs never could bust, but this is us\nAnd we're known for kickin up dust and play no games\nPlus we up in here like Rogaine - hold, mane\nAnd even though we divide we multiply\nBy the division of niggas who still in it to ride\n\n(VERSE 4: Tek)\nAround here they call me Shoot-It-B, it fit for the dice\nHit 'em up two times or I throw trips trice\nDependin on the day I may give you a walk\nTry to save you from a six and peein out on the chalk\nYour nigga had to learn the hard way that family fight\nMight bet against 'cause to see my brother get right\nI go hard till the end till the dropping is finished\nOr clips empty, police in the vicinity\nMy bank ain't in the million but my army is there\nMy loot'll gun a man, shoot the style of braids out your hair\nB's and all, catch you in a club or more\n(?) Your man (?)\nGive him a (?) stab and poke his kidneys\nFlee in the red d boy, big truck series\nWelcome to Bucktown USA\nWhere the weak get dissed every day\n\n", "album": {"title": "The_Chosen_Few_(2002)&&1762", "genre": "East Coast Hip Hop", "year": 2002}}, {"title": "Night Riders", "href": "Night_Riders&&4886", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "Night riders, ni-night riders\nNight riders, ni-night riders\n\n(Steele)\nLet the games begin\nA few good men called in on assignment time to rhyme with\nWar General connection, black Smif-N-Wessun\nWatch your section, the night moves in three directions\nCalculatin, watch those steps you takin'\nYou never know who lies in the shadows waitin\n\n(Tek)\nFor you to make a slipup 'cause they clocked your moves\nPeep where you stashed the night and how you rock the ice jewels\nYou was at the bar mackin, blowin' up the Jack when\nThey caught you off point and stripped you of your royal fashions\nYou thought it couldn't happen -- cause youse the talk of the block\nBut you just been rocked in your man's gamblin spot\n\n(Buckshot)\nRide on, you see B.D.B. when you come on down\nYou see Smoky Ride when you come on down\nYou see S-T when you come on down\nYou see B.C.C.\n\nI float, I fly, I walk with the devil\nBy my side, always and forever days I\nBattle the demon, schemin on my riches\nCause my family switched from un to organized thoughts\nAnd we organize now, how you like that?\nWe strike right, B.D. got you on the eye\nSo I got you trapped, but it seems like the blueprint\nAin't made for that, those devilish and wickedness ways\nBut look at how the wicked get splayed\nThe image that the wicked is goin' in time, but\nTime is the illusion, Buck keep the conclusion\nYou better believe when you walk dem streets\nWalk witcha eyes up when you rise up\nI see, cause every mornin that I wake up there's always\nA five in the air ready to fuck with me\nSo what cha'll here to represent -- Boot Camp\nWhat we here to represent -- Boot Camp\nWhat cha'll people represent -- Boot Camp\nWhat we here to represent -- B.C.C.\nWhen you come on down, you see B.D.B.\nWhen you come on down, you see S.T.\nWhen you come on down, you see Smoky Ride\nWhen you come on down, you see B.C.C.\nWhat cha'll here to represent -- the Boot Camp\n\n(Buckshot)\nHah, connection connect to resurrect those who think\nMind detect if you keep my people in check, one thought\nElevate, manifest light\nWe keep my people equal in my eyesight\n\n(Steele)\nDuck Down Entaprizin, tryin' to get right\nI fight 'cause I believe there's more to life\nThere's a mark on my head, but ain't the mark of the beast\nBut I got beef cause the beast keep runnin' up in my piece\n\n(Tek)\nI'm hearin rumors fly about me that I moved from the hood\nBought a crib out in 'Lanta like it's really all good\nAnd there I push a Ac' with my wifey and seeds\nGot hits that play the yards and I'm sittin' on G's\nCause Da Shinin went gold but you've been falsely told\nDon't believe in everything your ears and eyes behold\n\n(Buckshot)\nAnd just when you thought it was safe -- surprise\nOpen your eyes -- B.C.C.'s on the rise\nHeh, don't get mad, you see, change is good\nIf what you learn don't change, yourself\nThen why are you learnin what you learnin?\nListen, change is good\nAnd we doin' this elevatin in the neighborhood\nSo all my people if you wit me, throw your hands in the air\nAnd let me know you're with B.C.C.\n\n*Singing to end*\n\n", "album": {"title": "For_The_People_(1997)&&4259", "genre": "East Coast Hip Hop", "year": 1997}}, {"title": "Down By Law", "href": "Down_By_Law&&5658", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "Hey yo hey hey hey hey hey tell your momma to put wholes in panties\nYo no funky rollin' allowed\nYo we know the rules fool\nJive turkies over there on the west side\nCome on oh-oh (x5) hey yo yo check this out\n\n(Starang)\n\nI go by the name of Mr Starang\nGet back gimme room let me do my thang\nRepresentin from out the old school\nSmoke straight from queens and my nigga Cesspool\n\n(Tek)\n\nYoung la-ties young la-ties young ladies in the house tonight\nI go by the name of Smokey-lah and I do just what I like\n(What I like what I like)\n\n(Ruck)\n\nYes yes y'all its movin on and on\nI be that afro nigga by the name of Tawl Sean\nHa in the place to be\nOn my side is my man big R-O-C\n\n(Rock)\n\nBum je-dab I rock the show\nMy zodiac sign is scorpio\nScorpioooo we in the house y'all\nCheck it out check it out y'all\n\n(Steele)\n\nST be a sagitarrius\nAnd you know I'm very into tearin it\nI'm about to let you represent\nYo for my Boot Camp Clik and everybody\n\n(???)\n\nWe come to see who in tha party\nThis is how we do\nEveryday all day\nCome on Come on yo yo\n\n(Starang)\n\nHey yo throw your hands in the air\nAnd wave 'em like ya just don't care\nAnd if you make a lotta money\nGot clean underwear somebody say oh yeah\nOh yeah\nAnd you don't stop yo we ain't finished man lets continue on\n\n(Tony Touch)\n\nOne time for your mind kid I'm rollin' thick\nIt's Tony Touch comin' through with the Boot Camp Clik\nYeah suckas get the dis\nCause the word on the street is that they ain't got skills\n\n(Top Dog)\n\nI be the T-O-P D-O-G\nRepresent the reign outta OGC\nLike this like that yeah yeah yeah\n\n(Dru Ha--yes, Dru Ha)\n\nYo what you hear is not a test\nI do this shit with ease\nI go by the name of the Big Cheese\nAnd my sign is Pisces\n\n(Buckshot)\n\nI go by the name of the B-D-Buckshot\nHere to rock the spot and show you what I got\nNow let me see some hands way up in the air real quick\nCause you know B-D-Buck represent Boot Camp Clik\nNow when I say I got the here 90-now solution\nWhen I say Revo when I Revo you say lution\n(Revo-lution 8X)\n\n", "album": {"title": "For_The_People_(1997)&&4259", "genre": "East Coast Hip Hop", "year": 1997}}, {"title": "Likkle Youth Man Dem", "href": "Likkle_Youth_Man_Dem&&64", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "Ride wit me, so easily\nTo the other side of the Timberland tree\nYou can walk wit me, smoke freely\nOn the other of the Timberland tree\n\n(Steele)\nLikkle Youth Man Dem, said \"What's up trooper?\"\nNo disrespect, to Timothy, 'cause I know how the Utah\nYou a true star, shine ya light no matter what ya mood for\nI got my eye on you, 'cause you represent the future\n\n(Louieville Sluggah)\nWe be ya gun busters, your gold rushers\nQuick to touch and stuff ya, D.O. quicker picker upper, truth\n\n(Starang Wondah)\nMy mind dwellin, there's no tellin' who you see whore\nAc' and night, pass to the right\n'Cause the weed cause speed ball\nThrough time laughin', jokin, smokin'\nTalkin' about AK blastin\n\n(Top Dog Big Kahuna)\nDon't make me madder than, I am already\nDespite it might be a fight, between a loose bullet and a machete\nI'm steadily raisin my voice to prove a point\nBetter be on point, or join inside to put my joint\nLike Spike, we might desice to act up\nYou relax, huh, it was Likkle Youth Man, the attacker\n\nLikkle Youth Man Dem, Likkle, Likkle Youth Man\nYou can take a walk wit me and see\nLikkle, Likkle, Youth Man Dem, Likkle Youth Man\nTo the other side of the Timberland tree\n\n(Tek)\nWhat it is? And welcome to the real world, Dig'\nI'm not tryin' to prophecize, I just wanna see ya life\nBut you insist on beein face, to let the world mind them\nDie die, gon, you curse your mother, wit no problem\nAnd steal a chicken, act fly, you couldn't hold back the cry\nWhen officer mon come give your last pat on ya back side\nOffi' take a look at eye, no meet 'em trife and bar\nBecause I choose jah and live as rastafari\n\n(Louieville Sluggah)\nYou can, touch me, hear me, smell, see and feel me\nI pray to God, that makes me real G.O.D.\n\n(Steele)\nI see young bloods in the street yards\nTalkin' bout \"Peace, God\", seen God, became a piece\nAnd nigga slang how hard, to be, but I take you through\nIf you got a few, do it right, somethin' like the God rule,\nThe yonder do\n\n(Louieville Sluggah)\nI see what you mean, I feel, my brother's don't listen\nBut how to capitalize, is how my rod is fishin\nDeep sea, water, time is gettin' shorter\nSo books and things, they get tossed upon the brawler\n\n(Steele)\nYeah, but a lesson learned is a jewel earned for the keepin'\nSo I stay reachin' and keep my ass out the precinct\n\n(Starang Wondah)\nSo, whose to say, crews today\nIs really what them bullshit out there, that niggas is tryin' to say\nEverything I hear, niggas talk about that\nThey be walkin' the streets, and be off wit the gat\nNiggas act like you know, if you don't know how to act\nThen ya set ya self up for the Originoo Gunn Clap\n\n(Top Dog Big Kahuna)\nWe are the wickedest Gunn from outta New York\nPeople them talk about them Gunn out the buck\nYou want them to get just brought up, you fool ed' up\nWar is in the midst, and the richie wound up deader\n\n(Starang Wondah)\nJust the other day, my man from around the way\nUsed to brag to me, how he smoked a pound a day\nHe said \"Resistance\" niggas get hit up wit the instance\nStruck from a far, boyakah from a distance\n\n(Steele)\nAs I knowledge the environment, I ascend\nOn a mission, reminiscin bout memories missin'\nWishin bout moves I should have made\nGames I should have never played\nNights I should have stayed in the crib\n\n(Tek)\nIt's been a while since my sun shine\nSo many dark clouds out tryin' to smother mine\nAs soon as my boot touch asphalt\nPlain clothes and those molds, beemin at my grill, tryin' assault\nOut my features, sayin' I match pictures\nThey had in they possession, said they wanted out for question\n\n(Steele)\nNo lesson soon that we know never\nWhere I'm goin', what I'm doin', who, showin who's proven\nAll I see is fools gluin on the corner snoozin\nChoosin' routes that leave them ass out, straight loosin\nWhose in the case to faced for some irrelevant cause\nFightin was that keep the people back off the walls\nOf course you be lookin' out, like feel look out on the spot\nBout be tooken out, jakes stickin out, where we hangin' out\nSo while I'm just tryin' to see how you makin' out\nWhat you thinkin' bout, who you thinkin' bout\nSeein if it's me then, will it be to make a meanin'\nRight now, seems to be the place\n\n", "album": {"title": "For_The_People_(1997)&&4259", "genre": "East Coast Hip Hop", "year": 1997}}, {"title": "Yeah", "href": "Yeah&&3952", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Verse 1-Tek)\nIt's the chalk cracker, street rapper, x-factor\nSmokey Lah, your girl ass slapper\nTrap rider, nipple biter, spits fire\nThe coptic hitman for hire\nThe rate proper, pound copper, dime chopper\nDon't get it twisted, you'se a cock blocker\nI'm a nigga double-darer, nigga, I double dare ya\nTo act like you want it, touch this boy's a ton wearer\nMe the semi popper, SL shot ya\nTell mo' deep call the copper\n'Cause you wanna flip mo', Bucktown sicko\nAsk my nigga Kicko 'bout Miami strip shows\nReal deal, PNC Steele\nTrue warrior, I'm not Holyfield\nIn the words of Marvin Gaye, \"What's Going On?\"\nBlack mask, black glove, B-I-G love\n\n(Verse 2-Buckshot)\nYeah, that's how I like it\nHigh with a hangover, me and my mic get\nMight just take a little day off to lay off\nNiggas like you that don't pay off, you fake boss\nThis ain't a rap, this reality\nYou sad to see I set up a salary, you mad at me?\nWell, Duck Down is the home\nWhere we put it down for two-thousand and on\nAnd anybody gettin' gully is us\nSo anybody gettin' money is us, the rest is up\nNot really worth the mentionin'\nWhen the last time you heard a rapper with a pension?\nAnd mention him, B-U-C-K\nLook on my grill, duke, do you see play?\nNah, I come fully equipped\nOne rubber, one key to burn rubber, one rubber grip\n\n[Chorus: Tek] + (Buckshot)\nIs Boot Camp the best to do it? (Yeah)\nTell me, do you love our music? (Say Yeah)\nCan I talk to you for a minute? (Yeah, Yeah, Yeah, Yeah)\nAllow my man's to get off in it (You say Yeah, Yeah, Yeah, Yeah)\nCan I talk to you for a minute?\nAllow my man's to get off in it (Yeah, yeah, yeah, yeah)\nIs Boot Camp the best to do it?\nTell me, do you love our music?\n\n(Verse 3-Steele)\nNiggas ain't ready for the shit we got\nThe Clik we got, the heat we bust, the beats we rock\nThe street not Pop, but don't think a T won't pop\nA team that I've got got a mean pump shot\nSleep not, me no speak to cops\nBut not nothin', not one dime drop\nStop snitchin', clock digits, clock chicken\nBlock sizzlin', cops sniffin', pop biscuits, leave not one witness\n\n(Verse 4-Rock)\nNiggas be shakin' like pits when they lock on, I rock on\nCalm, in these streets or in jail, gettin' my high rocks on\nEven though I rock with the red, gettin' my pop on\nI'm a D-E-C-E-P-T-Icon\nYou mutha fuckin' right, Pa, I fight hard and I like crons\nIt ain't my fault I don't like y'all [Word], stop actin' like broads\nFold yo' bitch ass up, you a tripod\nWe don't need no cameras for this version of \"Die Hard\"\nOh my God! Oh my goodness, no, say \"Oh my Rockness\"\nI'm a God to y'all, Rock, damn it, all of y'all my kids\nAll of y'all doin' shit I done did years ago\nSo all y'all suck my dick in stereo\n\n(Verse 5-Louieville Sluggah)\nYou'se a bullshitter, I'm a big-dream go-getter\nThen I go get her, let the whole crew hit her\nThen I send her back room to ya\nWhere you kissin' her and eatin' her, and niggas finish beatin' her\nYou'se a Jackass, your new name is Steve-O\nRay, Ray, Ray, niggas don't believe you\nI take care of niggas I fuck wit\nBut you on the other hand, Uncle Tom ass nigga\nCallin' me a brother man, damn\nYou would've had me if I ain't know no better, man\nBelieve half of what you see and none of what you hear\nIn one ear and right out the other\nYou can't fool me, a G schooled me\nMan listen, my life is somethin' like a movie\nAnd you just a mouse tryin' to get a crumb, get him some\nBut you ain't gettin' shit, or put back on the strip\n\n(Outro-Buckshot)\nHeadz Ain't Redee for the shit we got\nHeadz Ain't Redee, man, I swear they not\nHeadz Ain't Redee for the shit we got\nHeadz Ain't Redee, man, I swear they not\nHeadz Ain't Redee for the shit we got\nHeadz Ain't Redee, man, I swear they not\nHeadz Ain't Redee for the shit we got\nHeadz Ain't Redee, man, I swear they not\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}, {"title": "Soul Jah", "href": "Soul_Jah&&8399", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Hook-Steele w/vocal sample)\n\"Do you remember me? I'm a Soul Jah\"\nOne for all and all for one\nIt's all for all, it's all or none\n\"Do you remember me? I'm a Soul Jah\"\nStand for something or fall for whatever\nWhen we ride out, we ride together, let's get busy\n\n(Verse 1-Steele)\nYeah, I'm a Boot Camp soldier till I D-O-A\nTill I'm in a gunfight and my heat don't spray\nSome of you believe all I do is smoke weed all day\nBut I stay military, mine sharp like a stingray\nI'm a Boot Camp soldier 'cause I rep the streets\nThis means that I'll go to war for my beliefs\nAnd I owe it to my peeps, know that helpin' 'em reach\nAnother level in this rap game where niggaz can eat\n\n(Verse 2-Buckshot)\nI'm a soldier like a political prisoner\nThis is a all-out war so you can load up your Dillingers\nYou willing to step up and play the front? So\nFirst you gotta show 'em how your gun blow, aight though?\nDon't go bailin' on me now, or gun failin' on me now\nOn the real, just hold me down, then\nIf I take aim, you take aim\nIf I bust, you bust, it's simple, do the same thing\nBe a soldier, I told ya, it's all in the mind frame\nThey ain't ready for war, when it come they like \"Ah, man\"\nThis ain't a fashion statement\nWhen they bash your face in, then it's back to the basics\n\n(Hook-Steele w/vocal sample)\n\"Do you remember me? I'm a Soul Jah\"\nOne for all and all for one\nIt's all for all, it's all or none\n\"Do you remember me? I'm a Soul Jah\"\nStand for something or fall for whatever\nWhen we ride out, we ride together, let's get busy\n\n(Verse 3-Rock)\nI always been a Boot Camp soldier, even though I went AWOL\nIt's family, when they call, I bang all\nAt your whole team, though, the 'Wild Boy' is back, I'm Steve-O\nWithout the leopard thong all in the crack (Nah)\nEverything is logical, ain't no emotions here\nCut you, you dyin' fool, I'm Spock without the pointy ears\nI'm goin' there, you ain't goin' where we goin', clear\nThe fuck outta gear, the whole in your rear, we soldier's here\n\n(Verse 4-Sean Price)\nFreak soldier, heat holder, Green Beret\nJohnny Rambo, nigga, make my day\nYour ass is frontin', don't make the God blast at somethin'\nSean Price is the weapon of mass destruction\nCaptain Black America, strapped with the gat, darin' ya\nPop two shots at your knot with the black Deringer\nSean's a soldier, see the stripe on my arm\nHow you wanna do it, knife or the chron's? Really, though\n\n(Hook-Steele w/vocal sample)\n\"Do you remember me? I'm a Soul Jah\"\nOne for all and all for one\nIt's all for all, it's all or none\n\"Do you remember me? I'm a Soul Jah\"\nStand for something or fall for whatever\nWhen we ride out, we ride together, let's get busy\n\n(Verse 5-Starang Wondah)\nYou hear my voice, you got no choice but feel the presence\nAnd in the underground, BCC is still legends\nNow I'm back smarter, but a little older\nNiggaz in my hood said that it was over\nHit the block, Ruck, Rock, black-on-block Rover\nLike \"Hate to say I told you so, but nigga, I told ya\"\nI'm the beast, a Savage like the Macho Man\nNiggaz take your cheese like you the Nacho Man\nAnd I'm not yo man, y'all niggaz so phony\nYou owe me, got dope for me, show me\n\n(Verse 6-Top Dog)\nDo you remember, my Boots and my troops?\nMy troops in those suits, we world wide\nAnd I still rep BCC\nAnd I'm still Top D-O-G 'cause I'm a soldier\nFatigued up, some days I'm jeaned up\nMy two soldiers at home keep me serene and cleaned up\nSo don't make me call my team up\nJust ease up, see my name in them books, you wanna read up?\n\n(Verse 7-Louieville Sluggah)\nChumps at ease, put it on freeze\nHenny's in your presence, I'm about cheese\n'Bout that Play-Doh, haters fuck with mines\nReplace your fitted with a halo\nBoot Camp's stompin' through my veins\nWe are, Sacman street hustlers, ain't shit change\nRespect is everything and I gotta shine\nSuck dick for yours, but I'll die for mines, you know\n\n(Verse 8-Tek)\nPlease take a look at my battle scars\nRealize it's a miracle how I survive\nMy Brooklyn Vietnam\nI was always trained first to bomb\nThe element of surprise'll put your foes on they heels\nTags on they toes, it's kill or be killed\nShould I show you blueprints to a murder?\nNobody no case, you could be the murder\nConfidently move, leave no trace\nConsequently, the DA'll have no case\nYou could take it how you want it, this is just a tip\nBut don't quote me, boy, 'cause I ain't said shh...\n\n(Hook-Steele w/vocal sample)\n\"Do you remember me? I'm a Soul Jah\"\nOne for all and all for one\nIt's all for all, it's all or none\n\"Do you remember me? I'm a Soul Jah\"\nStand for something or fall for whatever\nWhen we ride out, we ride together, let's get busy\n\"Do you remember me? I'm a Soul Jah\"\n\"Do you remember me? I'm a Soul Jah\"\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}, {"title": "Ice Skate", "href": "Ice_Skate&&256", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(CHORUS: Danielle Henry)\nIt's on you if you wanna hate (we stay true)\nYou can ice-skate (you and you)\nBut you don't hold no weight\nThis is how we do around here\n\n(Sean Price)\nI know, you don't like me, I don't like you\nYou wanna fight me? Well fuck it, let's fight, duke\nI'm 1/5th of the Fab, I'm 1/8th of the great\nI got shit on the ave, I make cake out of state\nSmack clown niggas, back down niggas\nIn the front yappin or the background niggas\nB-u-c-k is that town, nigga\nR-u-c-k, the fact's found, nigga\nSo listen as the god body rap\nI pop this and twist it when the god shotie clap\nYo, recognize the name\nSean Price, recognize my game\n\n(Buckshot)\nCritics, rip 'em down like thunderpound\nMakin' niggas wonder how\nThat nigga Buckshot still around\nKnowin' you pop the most shit\nWhile I pop that Cris and that Mo&#235; shit\nI get scoliosis 'cause I ain't straight\nTill I see every one of my niggas rise\nDon't say shit to Buck, I solidify\nCome on guy, recognize and correct\nAnybody disrespect I'ma show you parts of your body you never met\nLet's start with your heart, then next let's visit your butt\nI'm good with the arts, kickin my part\nLike done deal, signed and sealed\nThe contract on your life is a mill\nWhat the deal\n\n(Top Dog)\nI don't know baby, maybe it's the dog in me\nThat got me runnin' around, markin my territory\nDon't try to stop me now 'cause I'm ahead of the pack\nChasin that cat, girl, you know I know better than that\nYou say you love me when you know you hate me\nSee me on the screen and try to date me\nBut I play the streets cause that's where the cake be\nBecause I'm D-o-g you wanna leave me lonely, lonely, loney\n\n(Steele)\nScrew me? Screw you\nWho me? Who you?\nI do me, you do you\nRespect the General, I'm too true to the game\nYou new in the game\nMad 'cause I get up in the clubs with my Timbs and jeans\nWeed in my seams, pass all the fiends\nWe all VIP's, peep my ass in your dreams\nSo my company better have my currency\nBeen actin' funny currently\nY'all might react gallantly\nDon't like the fact that programmers can't stand us\nWe too military, record labels can't handle us\nPress click cameras, we click-click-click hammers, brah\nGet slick, we sic the animals\nFar from amateurs, we professionals\nHard bars and bricks lock shit like correctional\nThis industry two-way like bi-sexual\nBC straight in your face, defrost niggas next to you\n\n(Buckshot)\nYou can ice-skate, meaning bounce and breeze\nBounce, so leave, you could have a ounce of trees\nFuck fatigue, we white t's, cut the sleeves\nYou gotta love it how we (?) with ease\nOh of course Buck the boss toss molotovs in your Ford Explor'\nYou niggas ain't raw, you poor, this is what you can't afford\nTo keep dissin Buck thinkin' I'm soft\nBaby, I put it down when you was in drawers\nI ain't never say pause\nFuck a fad, fuck the latest trend\nI leave bodies where I lay this pen\nAnd next time I gotta say this again\nI'ma say exactly, not a lot but the gun'll spray\nNow gone and play\n\n(Ruck)\nBust on you, baby, for everything\nGrab guns, take rings, chain bling, everything\nNo doubt, Ruck is the best\nMy kids think I'm such a success\nThey don't know a motherfucka's a mess\nI used to stand on the block with Rock for fun\nWith a pocket full of rocks and 1's\nStopped that, now I got chips from illegal stock tips\nWhen I draw heat on crackers on Wall Street\nYo\n\n", "album": {"title": "The_Chosen_Few_(2002)&&1762", "genre": "East Coast Hip Hop", "year": 2002}}, {"title": "World Wide", "href": "World_Wide&&434", "artist": {"unique_name": "Boot_Camp_Clik"}, "lyrics": "(Verse 1-Steele)\nI used to stay in my backroom, listenin' to rap tunes\nDad in the living room, spinnin' back the old-school\nI guess you could call it soul food\nMusic that'll mold you, somethin' you can grow to\nDon't be mad at what the record store sold you\nIf you bought some bullshit just 'cause somebody told you\nMy flow show you that I know what you go through\nPut a gem on your mind, drop a jewel in the vocals\nMy speech local, but I reach all regions\nFly frequent, customs breachin', lah chiefin'\nMy son's favorite rapper is me, I know the reason\nThe Lord keep us breathin' and y'all keepin' us eatin'\nAnd though the flag been tattered and beaten\nWe still stand, not a man in the family retreatin'\nNo set trippin', no slippin', no sleepin'\nFull steamin' ahead on a mission to get this cream, man\n\n(Hook-Steele)\nNew York, Chi-Town, Georgia, Texas\nCali, Florida, VA, Connecticut\nNew Jerz, DA and Mass be reppin' it\nMaryland, we gettin' love in Canada, we respect it\nTour the World and it's back to the essence\nTo the block's we be reppin' where you need protection\nSo, this goes out to you, this goes out to you\n\n(Verse 2-Sean Price)\nHey yo, blam, blammer, innocent bystander\nSean Price, I'm nice with the grammar\nY'all niggas can't rhyme, y'all need to go back to the lab\nFormula one, get a pen and a pad\nLet's start with the basic, A-B-C, one-two-three\nMy g-u-n in your f-a-c-e\nBreak your body down, collapsin' a clown, clap with the round\nHighway to heaven where Michael Landon standin' around\nUnderstand I got my hand on the pound, I fuck you up\nNiggas standin' around nervous, like \"Yo, what up with Ruck?\"\nNone of your biz, fuck around, throw one in your wig\nThen proceed to the nearest high school, put one in your kid\nSean Price, man, I'm done with it kid\nYou ain't tough, you bluffin', plus you left your fuckin' gun in the crib\n\n(Verse 3-Louieville Sluggah)\nI'm an NC king, a BK boss\nHe can floss, 'cause he came off\nWith big black, housin' bags of money\nShit, I had to get it, ain't a damn thing funny\nWhen your money lookin' funny, they play you for a dummy\nYeah, they play you for a dummy\nAnd I ain't havin' that, go grab my gat\nYou gotta respect it, I'm well connected, you know\n\n(Hook-Steele)\nNew York, Chi-Town, Georgia, Texas\nCali, Florida, VA, Connecticut\nNew Jerz, DA and Mass be reppin' it\nMaryland, we gettin' love in Canada, we respect it\nTour the World and it's back to the essence\nTo the block's we be reppin' where you need protection\nSo, this goes out to you, this goes out to you\n\n(Verse 4-Buckshot)\nWe be the movement, new and improved and\nFuck the hammers, y'all niggas is screwed in\nLeeway, go 'head and play, see if I\nJoke around, one stroke around that four-fifth I\nMight start gettin' that vibe again\nForget lookin' at yours, thinkin' it's mines again (Gimme that)\nI see you get the bigger picture\nAnd now that I'm in your frame, I wanna maintain with ya\nYou know, chop it up for a bit\nBuild for a little while, get a plan to make some real chips\n'Cause, gee I've been down for a while\nBut I'm Duck Down, so now, I'm only down for a smile\nWhen the check come, respect 'em, we ain't stop\nBut you workin' over there though, huh, that's hot\nMe, I'm worldwide, jumpin' from block-to-block\nLovin' it, 'cause everyone I hit'll pop the top, ugh\n\n(Hook-Steele)\nNew York, Chi-Town, Georgia, Texas\nCali, Florida, VA, Connecticut\nNew Jerz, DA and Mass be reppin' it\nMaryland, we gettin' love in Canada, we respect it\nTour the World and it's back to the essence\nTo the block's we be reppin' where you need protection\nSo, this goes out to you, this goes out to you\n\n(Verse 5-Rock)\nMr. Alkatraz, ain't no escapin' when my arms go, heard me\nBeen on more rap tours then Soran O'Jersey\nRecruit a beast in every city, my squad so dirty\nI'm the beast master don, pa, y'all gon' learn, B\nStunned on the new improved Boot Camp\nYou gon' look real small like a deuce-deuce in Bruce Bruce hands\nHow many niggas eatin' off us? We the new food stamp\nWe go World Wide with this wild shit, we do, you can't\n\n(Hook-Steele)\nNew York, Chi-Town, Georgia, Texas\nCali, Florida, VA, Connecticut\nNew Jerz, DA and Mass be reppin' it\nMaryland, we gettin' love in Canada, we respect it\nTour the World and it's back to the essence\nTo the block's we be reppin' where you need protection\nSo, this goes out to you, this goes out to you\nNew York, Chi-Town, Georgia, Texas\nCali, Florida, VA, Connecticut\nNew Jerz, DA and Mass be reppin' it\nMaryland, we gettin' love in Canada, we respect it\nTour the World and it's back to the essence\nTo the block's we be reppin' where you need protection\nSo, this goes out to you, this goes out to you\n\n", "album": {"title": "Last_Stand_(2006)&&4878", "genre": "East Coast Hip Hop", "year": 2006}}]