[{"title": "Release The Dogs", "href": "Release_The_Dogs&&7614", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "In a moment of weakness they've gone for the throat\nPrayers answered for the ruling classes, and we swallowed them whole\nHeads down and hands up our need for safety has been hijacked again\nThey've got their fingers on the pulse of our mourning with knives poised\nDecide- right now -which side you're on, invest our freedom in failure by design\nHands tied with pleasure now we're choking on their cum\nGuided deception allegiance to a goal\nThat never mattered until they told us so\nBlowback has blown back into our face and ignited a war\nOn home turf between control and our free will lines are drawn\nRelease the dogs, they've picked up the scent, moving in for the kill\nUnchained and hungry teeth ready to feast\nRelease the dogs\n\n", "album": {"title": "Tomorrow_Come_Today_(2003)&&9724", "genre": "Post-Hardcore", "year": 2003}}, {"title": "When Rhetoric Dies", "href": "When_Rhetoric_Dies&&5563", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "We raise the flags and statues to our mission\nWe've spoken out in slogans and in campaigns\nTalked and talked on almost every issue\nWhere oppression of the masses is the constant theme\n\nBut what does this mean to a little town in Iowa\nWhere the jobs have gone down-stream, down-south, down-and-out\nWhere their fingers used to work to the bone all day\nProfits rise and fall and starvation is a game\n\nWhere is the food that used to cover their table\nWhere is the sense of pride at the end of the day\nTo the face of a thriving corporation\nWhat could a dying family possibly say\n\nOn the face of every American worker\nIs the constant fear that their job will not remain\nAs the CEO is planning his vacation\nTo kill or be killed is the nature of the beast\n\nWhere is the food that used to cover their table\nWhere is the sense of pride at the end of the day\nTo the face of a thriving corporation\nWhat could a dying family possibly say\n\nStand in line, take a number, you sell your soul\nThen watch it crumble into a pile of rubble that used to be\nYour job, your life your family's daily bread\nDry and stale malnourished kids\nThe house is sold for a degrading bid\nDo we continue to talk\nOr do we take a hammer to their chains\nTo their chains ...\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Unspoken Request", "href": "Unspoken_Request&&6405", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Failed coercion\nLeads to intrusion\nAnd the blood forever runs\nIn her hair\nInto her hands\nBetween her legs\nWhere his mind lies\n\nPower drives him on\nTo murder innocence\nOn the rack of his devices\nVices and designs\nShe will never scrub the stains\nFrom her arms from her neck\nFrom her legs\n\nThe dirt will remain \nAs a reminder of his hateful face\nReach in\nRip apart the inner fibres of her soul\n\nBoy, you'll never know how it feels\nTo fear the shame\nFeel free to walk down\nAny dark street without fear\n\nWithout shame no one is\nGonna touch you\nAnd you don't need protection\nShe shouldn't need protection\n\nAnd you can sit there\nWith that stupid smile on your face\nAnd try to convince me that you care\nDefined by your power, defined by her body\n\nThe innocence she feels everybody else contains\nIt's lost, it's gone\nBut I guess it doesn't matter anyway\nReach in, rip apart the inner fibres of her soul\n\nAnd you can sit there\nWith that stupid smile on your face\nAnd try to convince me that you care\nDefined by your power\nDefined, redefined\nFucked, tortured and discarded\nFucked, tortured and discarded\nFucked, tortured and discarded\n\nAnd if he ever cares\nMaybe he will feel ashamed\nFor everything he's stolen\nFor all the trust she gave\nPossessed and broken, she cries\nBut it's not our problem\nPull down your goddamn blinds\n\nHe will never think he's wrong\nShe will never feel quite right\nHe will never think he's wrong\nShe will never feel quite right\nYou will never think he's wrong\nYou will never think he's wrong\nYou will never think you're wrong\nShe will never feel quite right\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Vehicle", "href": "Vehicle&&9619", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "(The average American citizen is taught to be passive. He learns at an early age that obedience and submission will lead to a reward, often unattainable and almost always at his own detriment. Marx discussed this idea in Das Kapital when he refers to religion as being the opiate of the people. It is painfully obvious that this allusion to religion can be applied to anything that citizens follow blindly, whether it be radical ideology because of its inherent shock value, patriotism, television idols, or media instilled demagogues. The citizen must learn that the truth will not be spoon-fed to them. The citizen must learn the beauty of doubt, for all they have to lose is their chains.)\n\n\"Wheels turn crush me I am the machine heaven helps those who forget to dream I see a spark great is what we are eyes towards my reward compensated for I am no one I am nothing mold me make me into something you find worth in deem special I am no one I am nothing and I'm sure I'll remember the love this brings me the love this brings me by the glass cuts on my feet fate damns/guides me into life's fear and shame bully me into submission it's the only thing that keeps me sane I will never break free I don't want to break free comfort in my torture there must be reward I sold myself out to you you told me that you were truth use me as your new disease I just need to please I live die kill just for you my self esteem I remove cut me and bleed me dry I can serve just let me try mold me into what you want me to be I can't stand this I feel removed I feel remorse for my understanding take me change me into something.\"\n\n", "album": {"title": "This_Crying,_This_Screaming,_My_Voice_Is_Being_Born_(1996)&&7898", "genre": "Post-Hardcore", "year": 1996}}, {"title": "In The Wilderness... No One Can Hear You Scream", "href": "In_The_Wilderness..._No_One_Can_Hear_You_Scream&&4130", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "(Often in the process of electing political officials, the voices and ideas of candidates other than those offered by the two major political parties, fall upon deaf ears. This creates a streamlining of the views held by political hopefuls, forcing them to conform to the standard beliefs and ethical systems that are already in practice. Unfortunately, this also brings into being a situation that leaves the average American citizen with a fortuitously basic choice, conservative or liberal (example a:1). Notable critics of this process include Tocqueville, who stated that \"democracy breeds mediocrity\". This is not to say that democracy itself is undesirable, it does however point to the possibility that democracy coupled with capitalism authors an environment that is antithetical to itself. It takes government from the hands of the people, and delivers it into the hands of those whose sole interest is the profit of themselves and of those they are most closely affiliated with (i.e. the American Medical Association fighting legislation that would provide universal healthcare; big oil companies, lumber companies, chemical / pharmaceutical companies, and commercial restaurant chains fighting environs-mental legislation that would impose on the profitability of their business interests; the American Lawyers Association lobbying against tort reform, which would make the laws understandable to the average American, and lawsuit reduction acts.) These forces in mind, the American public is pitted against its national enemies, its political defectors, the media, big business, the Federal government, and itself. Opportunely, in a democracy people do have a voice, if they choose to use it. A voice not used is a voice stolen.)\n\n\"Mercy. victim. of your own ego's creed. of your own postulation. maintain your pure design. your pride. too many punches pulled. iscariotic lips. betrayal of your own words, and actions. unmoving. unchanging. staggering. inactive. destroy. their fables. half truths lies. said masked by good intentions. their knives all hanging lamp behind a brick facade. stand in line for possession. branded for. watching. feeling. touching. tearing. dignity is for the weak. mercy.\"\n\n", "album": {"title": "This_Crying,_This_Screaming,_My_Voice_Is_Being_Born_(1996)&&7898", "genre": "Post-Hardcore", "year": 1996}}, {"title": "Handful of Redemption", "href": "Handful_Of_Redemption&&4615", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "The sick and tired refrain of everyday is branding itself into you\nDiscouragement defined by all the times when everything just falls apart\nAnd your skeletons have broken down the door and left you there for done\n\nHow do we find a little piece of heaven\nIn our time before we find acceptance\nWhen no one understands at this point\nThat a handful of redemption's all we need\n\nFrom remorse to rebirth finding it hard to think that this is really true\nAsk how long should we wait before we take instead of waiting to be free\n\nHow do we find a little piece of heaven\nIn our time before we find acceptance\nWhen no one understands at this point\nThat a handful of redemption's all we need\n\nAnd all, all the fear all the anger falls away\nAll the days that were wasted cut and pasted fall away\nNever walked so tall until that moment when fate and circumstance collide\nWhen all it takes is a step that you never saw and burdens fall away\n\n", "album": {"title": "Tomorrow_Come_Today_(2003)&&9724", "genre": "Post-Hardcore", "year": 2003}}, {"title": "Pariah Under Glass", "href": "Pariah_Under_Glass&&4037", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Symbolized. patronized and then tossed out dry\nRevolution or humiliation\nPromise the bread. the wine, a life that always shines\nIf only they vote in the proper direction\nPick them up from the floor to get knocked down again\nWhen you're bored with your mission and a new one begins\n\nRide your new thrill\nSmug it suits you well\nGod in your new science lab\nMaster of your new promised land\n\nPick them up from the floor to get knocked down again\nWhen you're bored with your mission and a new one begins\n\nEcho, care and fake some tears to show your opponent\nThrowing bones with bread and circus to disguise the proof\nYou only empower yourself when those in need become\nYour new test subjects in your smear campaign, 101\n\nRecycle control from their hands to your own\nEvery word is dropping empty\nRecycle control from their hands to your own\nEvery word is dropping empty\n\nPromise again\nFocus away\nFrom day to day\nFor your own ends\nTheir means are dying\n\nShame the act is old\nCount your saintly sermon cells\nAngel for your own rewards\nBring the mercy merchants down\n\nPick them up from the floor to get knocked down again\nWhen you're bored with your mission and a new one begins\nPick them up from the floor to get knocked down again\nWhen you're bored with your mission and a new one begins\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Endorsement", "href": "Endorsement&&3809", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "(It is the belief of Marx that the personal is dead; that all is the political. Throughout history this can be seen as true; that the choices we make every day influence and shape the world around us. Edmund Bruce wrote in his book Reflections that government preyed on the basest instincts found in man; the fear of death and the desire to make money. Bruce found that government did not do anything to promote any ideals or values; all that was left was death and taxes (the often cited \"only sure things\") and people were left empty and suspicious of one another. Imagine the American citizenry as a group of rats squabbling over refuse found in a garbage, fighting viciously fighting with one another over that one piece of rancid cheese, while the real rats (big business, government) sit in their great halls and eat their pounds of flesh. This distrust and fear of each other has permeated every aspect of American life. A stranger is treated with fear and distrust at best, and outright hostility at worst. The media fosters this distrust by airing and reporting the most brutal sensationalized stories possible. The American citizen must learn to trust their fellow man again and realize whom the real criminals are.)\n\n\"I create my own. I no longer revolve. around your resentment. I can smell the hatred behind your tearing sneer. I am no longer threatened by this judgment throne. lies. dead. stagnant. change. forgetting one more day. I could really care less about your lame confinement. my ego's not worth saving when true change is not met. forgetting one last day. I can't understand. but I feel this rage is spreading on inside me. you tread on me like you have before. my body is broke but my soul's unbowed. your laughter fuels a will to move inside of me that I've never felt. standing, grabbing ground. your faces all drown out. I can't understand but I can't stop forward moving. I won't be pulled down anymore this is all I have no matter what scorn. ears sliced off by complacency do their bodies no good for the words they speak. you tried your best to take me down and then explained that's what friends are for. your ruled me out. you ruled me out.\"\n\n", "album": {"title": "This_Crying,_This_Screaming,_My_Voice_Is_Being_Born_(1996)&&7898", "genre": "Post-Hardcore", "year": 1996}}, {"title": "The Tyranny Of What Everybody Knows", "href": "The_Tyranny_Of_What_Everybody_Knows&&8582", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "The pooling of blood From your neck to the floor Makes a beautiful trophy To parade and even the score Their words in stone of persuasion in sound Fall on open ears And sewn shut mouth taught the answers Ignored the questions As we vomit choke and die Truth is truth is lie As history portrays this time Truth is truth is blind Their money pays for the transcripts we sign Derailed from birth designed to serve Everyone knows the solution to the problems We bought Credentials unneeded decide for you The books are written our choice is proof.\nWe are taught that Christopher Columbus discovered America. From the American Revolution to the Civil War, history is written from the biased perspective of the power elite. From our birth we are told lies and myths and expected not to only believe them, but to worship them at America's false altar of progress. We must learn to question history and measure each \"fact\" on its own merits. (Please read Howard Zinns \"A People's History of the United States\" and/or Noam Chomsky's \"What Uncle Sam Really Wants\")\n\n", "album": {"title": "In_Chrysalis_(1998)&&9008", "genre": "Post-Hardcore", "year": 1998}}, {"title": "Across Five Years", "href": "Across_Five_Years&&9345", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "I said I'm crazy one more time\nPicked up the phone and wondered why\nSo many years of hidden dreams\nPushed down too far to ever win\n\nLocked doors and hidden ghosts\nDenied myself with every joke\nThis was not me\nThis could never be me\n\nLocked doors and hidden ghosts\nDenied myself with every joke\nThis was not me\nThis could never be me\n\nRemembering so many times\nSo many lies, so many lies\nRan so fast the years passed blind\nSo much time lost killing five\n\nLocked doors and hidden ghosts\nDenied myself with every joke\nThis was not me\nThis could never be me\n\nLocked doors and hidden ghosts\nDenied myself with every joke\nThis is not me\nThis is not me\nThis is not me\nThis could never be me\nThis is not me\nThis is not me\nThis is not me\nThis could never be me\n\nWhatever poison you may drink\nAnother list of \"no\"s persist\nAntique and out of reach\nI lost my life and take it back\n\nCrashed this side of happiness\nHit the floor or hit and miss\nWithout the strength to follow through\nWalked right past this life in you\n\nJust one more kiss \nJust one more chance\nJust one more life\nCircumstance\nJust one more call \nTaking a chance on circumstance\n\nJust one more kiss \nJust one more chance\nJust one more life\nCircumstance\nJust one more call \nTaking a chance on circumstance\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Holiday in Cambodia", "href": "Holiday_In_Cambodia&&6895", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "So you been to schools\nFor a year or two\nAnd you know you've seen it all\nIn daddy's car\nThinkin' you'll go far\nBack east your type don't crawl\n\nPlay ethnicky jazz\nTo parade your snazz\nOn your five grand stereo\nBraggin that you know\nHow the niggers feel cold\nAnd the slums got so much soul\n\nIt's time to taste what you most fear\nRight Guard will not help you here\nBrace yourself, my dear...\nBrace yourself, my dear...\n\nIt's a holiday in Cambodia\nIt's tough, kid, but it's life\nIt's a holiday in Cambodia\nDon't forget to pack a wife\n\nYou're a star-belly sneech\nYou suck like a leach\nYou want everyone to act like you\nKiss ass while you bitch\nSo you can get rich\nBut your boss gets richer off you\n\nWell you'll work harder\nWith a gun in your back\nFor a bowl of rice a day\nSlave for soldiers\nTill you starve\nThen your head is skewered on a stake\n\nNow you can go where people are one\nNow you can go where they get things done\nWhat you need, my son...\nWhat you need, my son...\n\nIs a holiday in Cambodia\nWhere people dress in black\nIs a holiday in Cambodia\nWhere you'll kiss ass or crack\n\nPol Pot Pol Pot Pol Pot Pol Pot etc...\n\n'Cause it's a holiday in Cambodia\nWhere you'll do what you're told\nIt's a holiday in Cambodia\nWhere the slums got so much soul\n\n", "album": {"title": "In_Chrysalis_(1998)&&9008", "genre": "Post-Hardcore", "year": 1998}}, {"title": "My Own Restraints", "href": "My_Own_Restraints&&3248", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "(Exemplifying the current standards placed on United States political officials, the relaxation of many ethics has come to warp and often replace the code of conduct originally expressed in writing to protect against corruption. Once in place, a new code of ethics can be loopholed to then to another, and then to another. Change is not the culprit, instead investment in bending moral practices to suit personal and singular liberty blures the already networked and confusing practice of law and lawmaking. Not seeing the cycle, politicians all too often fall prey to the \"Washington\" way of life. In this way, then, traditions and attitudes are fostered in this moral environment. It may be stated, with a certain amount of reassurance, that a country which was founded on the idea of illegal (example b:1) and unethical expansionism cannot prosper in a way that is beneficial to the whole of humankind. One act of terror and murder neturally leads itself to another act of retaliation. It has been theorized that that the human animal learns by example. We can look at this in a personal level; a father beats his wife, the son beats his wife, and in this way a violent cycle is founded. The truly unfortunate and important aspect of this succession is that most people believe their actions to be not only correct but inherently plausible and morally justifiable.)\n\n(\"Lyrics were and improvised ouburst, and are subject to change, though the ideas and meaning remain the same.\")\n\n", "album": {"title": "This_Crying,_This_Screaming,_My_Voice_Is_Being_Born_(1996)&&7898", "genre": "Post-Hardcore", "year": 1996}}, {"title": "Still Waiting For The Punchline", "href": "Still_Waiting_For_The_Punchline&&8828", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "I want to find the water\nThat will wash this whole damn slate clean\nBreak down, break up\nWe sleep in what we create\n\nRight now, I'm iving so much hate\nRight here, my sins have all been paid\nTo you, your friends and for your sake\nDirty and so depraved\n\nMy knees have bled \nTo hold you here\nBut now I've lost the taste\nFor lies force fed as time well spent\n\nRight now, I'm iving so much hate\nRight here, my sins have all been paid\nTo you, your friends and for your sake\nDirty and so depraved\n\nAnd if another angel says 'Just grin and bear it'\nI might be forced to smash his head\nAgainst the wall and never sin again\n\nAnd if another angel says 'Just grin and bear it'\nI might be forced to smash his fucking head\nAgainst the wall and never sin again\n\nAgainst myself or trust in anyone\nWrite me off for suffering\nIt's a joke I give up\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "High Wire Escape Artist", "href": "High_Wire_Escape_Artist&&6313", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Bleed out all empathy\nThis vessel has no spirit left\nTo hold on\nTo lies I've lived in full\n\nHow long can I hold tight?\nWith every movement tension binds and denies\nMy true nature\n\nBalance has shifted\nWarped sick and twisted\nGrabbing at angels when I fall\n'Cause I am more than this idle\nEndless recital\nFor all my demons to applaud\nI am free\n\nHide myself from it all\nWhile every fear is screaming\nNight into dawn\nUntil I find\n\nThe balance has shifted\nWarped sick and twisted\nGrabbing at angels when I fall\n'Cause I am more than this idle\nEndless recital\nFor all my demons to applaud\nI am free\n\nI have to believe them (<i>lies!</i>)\nIn order to attain fulfillment\nI have to succumb to <i>lies!</i>\nAll my inner fears that tear at me\nI will never believe them (<i>lies!</i>)\nI'm sick of the weakness that controls me\nNow that I have fallen\nI will not repent\n\nBalance has shifted\nWarped sick and twisted\nGrabbing at angels when I fall\n'Cause I am more than this idle\nEndless recital\nFor all my demons to applaud\nI am free\n\n", "album": {"title": "Tomorrow_Come_Today_(2003)&&9724", "genre": "Post-Hardcore", "year": 2003}}, {"title": "Our Time Honored Tradition Of Cannibalism", "href": "Our_Time_Honored_Tradition_Of_Cannibalism&&9688", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "(All obsessed with the taste of flesh)\n\nFrom Black Panthers to the CIA\nInto a sharp wit with a stupid slag\nWe've gone and dug our own hole\nCause everybody knows\nWe eat our own\n\nUnconcerned with the battle within\nInstead we're shooting ourselves in the foot\nSo busy fighting each other\nWhile the real bastards run for cover\n\nWe shoot our own leaders down\nBefore those in power get the chance\nSo they sit back and laugh\nWhile we destroy ourselves\n\nWake up and shudder,\nWe've become our worst enemy\nWake up and shudder,\nWe've become our worst enemy\n\nWe've sold ourselves out\n\nTurning inward to our own detriment\nForgetting the message that we were to send\nWe've lost, count up\nVictims, roll call\n\nTurning inward to our own detriment\nForgetting the message that we were to send\nWe've lost, count up\nVictims, roll call\n\nThey're all our own\nLook back at what we've done\nDrove out\nThe wrong side\nKicked sand in our own eyes\nKicked sand in our own eyes\n\nWith every hero's welcome is another group on the side\nReady to fire if they step out of line\nJust one mistake and the jealous hands claw away\nAny hope for a better way \nYou bought it, forget it, goodbye\n\nSo saints be on your toes\nAnd heroes be not proud\nBecause as soon as the people rise\nSomeone will tear you down\n\nWake up and shudder\nWe've become our worst enemy\nWake up and shudder\nWe've become our worst enemy\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Rookie", "href": "Rookie&&8899", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "I never thought this could be me\nI guess you never do\n'Til it's happening to you\nLike all the fun turns into shame\nAnd all the could-have-beens\nRearrange\n\nSo little time, so many crimes\nGuilt like a chain\nChokes my will away\nRedemption never seemed so cruel\nAnd all my gods\nNever seemed so weak\n\nWake up, engage\nNow derailed and enraged\nIt used to be so easy\nGet up, I'm game\nNow I'm sick and I'm tame\nCounting cost with lost\n\nWhere is the hope they gave\nAnd don't think that I can't hear you laugh\nI used to be a lot like you, but now I'm only me\nI used to be a lot like you, but now I'm only me, I'm only me\n\nDrink to pills, to shots\nTurns into shock\nA habit and a pawn\nFor every hand goes round\nThe pain gets so damn loud\nThe hammer hits and I'm down, and I'm down, and I'm down, and I'm down\n\nTrust no one, hey, why should I\nThey gave me the poison dressed like life\nCheated, smacked up and diseased\nCry to sleep and fight to eat\n\nUsed to be a pro at this\nNow I've broken my own wrist\nRotten teeth and life unsung\nYou'll forget me when I'm gone\n\nWake up, engage\nNow derailed and enraged\nIt used to be so easy\nGet up, I'm game\nNow I'm sick and I'm tame\nCounting cost with lost\n\nI used to be a lot like you, but now I'm only me\nI used to be a lot like you, but now I'm only me, I'm only me\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Loser of the Year Award", "href": "Loser_Of_The_Year_Award&&9145", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Always had the dream\nNow I have the action\nSpent my time hearing \"this is wrong\"\nBroken down disasters smoke filled empty rooms\nAnd life of eye to eye to head to head\nYou'll never understand what this means to me\nNot for approval, not yours anyway\nArrange by the numbers\nArrange by your casualty\nDefined by a submission to a common sense\nThat never had anything to do with me\nAs friends are made and lost\nI always look back smiling\nNever moved by struggle fate or cost\nI'd rather stay a loser\nAnd laugh at common sense\nThen rely on safety nets and reminisce\nAs they struggle for mediocrity\n\n", "album": {"title": "In_Chrysalis_(1998)&&9008", "genre": "Post-Hardcore", "year": 1998}}, {"title": "The Abominations Of Those Virtuous", "href": "The_Abominations_Of_Those_Virtuous&&5805", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "We rely on subtle points\nAnd stabs at biting humor\nTo reveal our tired roles\nOf slave and domination\n\nWho did you enlighten today\nHumiliate to sell your point of view\nCreate an image for mass consumption\nInsecurity as intellect\n\nSee your soul in your eyes\nHope your trophies will not mind\n\nI'm sick of this grain of salt\nThat I must take you with\nI want to lash out\nBut I bite my lip\n\nThe talk gets older and the lines get stale\nYour chance at godliness has already failed\n\nYou can't deny\nYour thirst and drive\nFor your time in the spotlight\n\nWhy are you so damned sure that you shut your friends out\nI have learned to shut out every hateful word\nYou'll never see the friends you've lost\nFrom behind your transparent mask\n\nI haven't grown to hate you\nI've just grown to forget you\n\nYou label me class, rank and station\nYour intellectual masturbation\nYou're absolutely intoxicated\nBy your own mouth running in circles\n\nYour tongue always tends to lose it\nEvery chance you get you abuse it\nYou have now spent a lifetime \nKilling time\nKilling time\nTow the line\nBut you're eager, withdraw and I'll follow you\n\nThough you're quick to act\nLike a threat\nTo make others feel so small\nThe thought that you repeat\nAnd the letter that you scream\nBefore that you were killing time\n\nIn time\n\nI'm sick and tired of your reaction\nI'm sick and tired of your reaction\nI'm sick and tired of your reaction\nWhy don't you shut the fuck up\n\nWhen you discover just how easy it is to impress\nWithout demanding all the attention for no reason\nMaybe you'll believe me\n\nYour own will to power has come back to haunt you\nYour own will to power has come back to haunt you\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Twelve Step Hammer Program", "href": "Twelve_Step_Hammer_Program&&3897", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Bring it on\n\nI've got your life when I've got your fear\nI'll give you all what you want to hear\nYou've got me figured out so perfect\nI'm on the couch lying to your face\nJust to see what you can cut and paste\nOf my life on your next banner\n\nWait, I'm not finished with you yet\nRace, run frantic, eating from my hand\nCome on\n\nScrape your knees to the finish line\nThe weak get pulled and you're left behind\nYou think you know me, feel the comfort\nThe rug gets swiped and you've fallen down\nSo many times that you have kissed the ground\nJust for a piece of fact or fiction\n\nWait, I'm not finished with you yet\nRace, run frantic, eating from my hand\nCome on\n\nConsider yourself the punchline in my new gag\nThank you very much, you've given all of us\nA fantastic laugh\n\nBring it on\n\nNose to nose and toe to toe\nTell me everything you know\nOr is everything for show\nTabloid garbage in your fangs\nSuck and you'll be duped again\nI get the last laugh in the end\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Dying on Principle", "href": "Dying_On_Principle&&3482", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Legislate forget the facts of your drug war casualty\nSo many dead but you wear your morals on your sleeve for all to see\n\nAnd the billboards lie - denial thrives -\nWhich is the crime and which is the lie\nAnd who defines it\n\nPolicing the oppressed\nWhile the real pushers run frantic with their poisons\nCorporate sponsors will see to it that the right product kills us off\n\nAnd the billboards lie - denial thrives -\nWhich is the crime and which is the lie\nAnd who defines it\n\nInfection will thrive\nDespite poor intentions\nSupplying the lesser class with their own crucifixion\nMartyrs for your statistics\n\nAnd every death is on your hands\nDesigned to stain diseased and bled\n\nAnd the billboards lie - denial thrives -\nWhich is the crime and which is the lie\nAnd who defines it\n\nAnd the billboards lie - denial thrives -\nWhich is the crime and which is the lie\nAnd who defines it\n\n", "album": {"title": "Tomorrow_Come_Today_(2003)&&9724", "genre": "Post-Hardcore", "year": 2003}}, {"title": "With Every Intention", "href": "With_Every_Intention&&9566", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Not in the running but this rain is nothing new to me anyway\nI see my reflection nowhere near who I should be\nThe spirit is willing but the anchors of my flesh still hold me down\nWith every distraction I lose more of who I should be\n\nHad many times to try\nBefore I realized\nThe flaws in my design\nMade me have to ask why\nWhy'd you make me so weak?\nI tried but I'm incomplete\nIs this all there is?\nAll there is to me?\n\nHow many chances at redemption do I think I'll ever get?\nKeep changing my rhythms for a shot at something more\nMiracles happen so why do I feel like I'm being left behind?\nIt's still in my nature to look for what I can't find.\n\nIs this all there is?\n(Is this all there is to me?)\nI should be all better now\n(Is this all there is?)\nThis is all there is to me\nI can pick myself up again\nIs this all there is?\nI hope that one day I will make a stand\nBut right now this is all there is to me\n\nNo matter how I dream\nI will never be good and clean\nCause right now this is all there is to me\nYeah right now this is all there is to me\n\n", "album": {"title": "Tomorrow_Come_Today_(2003)&&9724", "genre": "Post-Hardcore", "year": 2003}}, {"title": "Full Color Guilt", "href": "Full_Color_Guilt&&3078", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Ideals of beauty set to color\nIn savvy death camp chic\nThe runways turn to gauntlets of disgrace and sickness\nFor your spectacle your piece\n\nFreeze - her hollow eyes now give you anything\nDead - she never saw it coming anyway\n\nAcceptance is the starving girl that you created\nBleeding your disease\nFor images of tragedy that you take pride in\nTo make her feel ashamed\n\nFreeze - her hollow eyes now give you anything\nDead - she never saw it coming anyway\n\nArticles will not redeem\nThe dead now lying at your feet\nYou know she doesn't matter\nSo don't act so coy\nShe's starving for you\nDid you even notice what you took\n\nFreeze - her hollow eyes now give you anything\nDead - she never saw it coming anyway\n\n", "album": {"title": "Tomorrow_Come_Today_(2003)&&9724", "genre": "Post-Hardcore", "year": 2003}}, {"title": "Voiceover", "href": "Voiceover&&1496", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "They don't even have to kick down our doors\nWe let them in with a smile and a thank you\nMedia ingrained police state\nOur fears create the cycle of reliance\nAnd if you think for one fucking second\nThat they're not bleeding you for all their worth\nDig your grave now and save them the trouble\nTie yourself down to the fairy tales\nThe Holocaust will not be televised\nThat is unless it becomes marketable\nIn the market of fear\nIn the market of flesh and blood\nSold to you by the new improved\nJack booted thugs\nWe've lost direction\nSenses rot away\nKneel and beg for safety\nJust forget the whip marks on your back\n\n", "album": {"title": "In_Chrysalis_(1998)&&9008", "genre": "Post-Hardcore", "year": 1998}}, {"title": "On in Five", "href": "On_In_Five&&7310", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Force-fed on a hunger strike, tag them dead before you focus in,\nSpoon feed the impact that you leave us with\nBring denial with a worldwide expansion team brand so deep into our minds\nThat it soon becomes our history and image that's been marketed well\nOn the assembly line of our lives, shut it down before it ever starts\nTurn on to the weakness we've been raised upon (we'll turn you off again)\nYou've written up all the answers we've followed them word for word\nDisguised as our own subconscious defining our wrongs and rights\nNo more working on the strings you've made us\nDrive the stake into your hardened hearts we're done begging for the scrapes\nYou throw us we'll take the truth and our lives\nInvestigate and drain us we've found you out regaining\nAll the knowledge that you hid, you are no longer needed we'll keep our own hearts beating\nAgainst the pulse that you denied\nDemand it back our lives our minds you stole them,\nNothing else will quench the hunger that will turn you off\nAnd certify that we are free to find our own truth without you\nThis is not a test. This is not a test. Yes it has come to this. This is not a test\n\n", "album": {"title": "Tomorrow_Come_Today_(2003)&&9724", "genre": "Post-Hardcore", "year": 2003}}, {"title": "Eviction Article", "href": "Eviction_Article&&5127", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "<i>Who are the real patriots?\nWho the real traitors?\nWho will stand up?\nWho will be the new leader?\nIf you love this country,\nTake it back from those that would destroy it!\nProtest is patriotism!\nProtest... is... patriotism!</i>\n\nNow you've thrown your past agreements\nInto the fire\nAnd your government's become a whore\n\nFor outside interests\nThat now enslave the poor\nTheir suffering now stands ignored\n\nPushed out\nSpat on\n\nTurn jobs into weapons\nTo make a profit\nOut of blood, sweat and lies\n\nFree trade sounds easy\nAnd so damned harmless\nUntil they're exploited by blind eyes\n\nChewed through\nSpat out\n\nThe evil that you feed improves economy\nFor the rich that run your campaign\nIncrease the bottom line, your role again defined\nOut with the old and in with the same\n\nTime to unmask the devil\nDivide and conquer\nKill off and prosper\n\nRecite the game that you've been sold\nManifest destiny, your life atrocities\nResponsibility annulled\n\nPushed out\nEnslaved\n\nThe evil that you feed improves economy\nFor the rich that run your campaign\nIncrease the bottom line, your role again defined,\nOut with the old and in with the same\n\nWhen will their wants meet our needs,\nWhen will their words match their deeds\nWhen will the time come to stand\nTo take it back from their hands\n\nWhen will their wants meet our needs,\nWhen will their words match their deeds\nWhen will the time come to stand\nTo take it back\n\nThe blood is on your hands, life stealing motherfuckers\nThe constitution burns to ash in front of you\nThe people know what you are up to\nYour sins will come back on you\n\nThe evil that you feed improves economy\nFor the rich that run your campaign\nIncrease the bottom line, your role again defined,\nOut with the old and in with the same\n\n", "album": {"title": "Tomorrow_Come_Today_(2003)&&9724", "genre": "Post-Hardcore", "year": 2003}}, {"title": "(Compassion) As Skull Fragments On The Wall", "href": "(Compassion)_As_Skull_Fragments_On_The_Wall&&2529", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Front and center\n\nTen percent pulled apart, vilified\nTolerate, but only to patronize\nHang a noose like a crucifix dangled high\nLeg breakings for your sheep becomes suicide\n\nSticking to your guns provokes an ugly picture\nOf a child gagging on those same guns\nTransforming more self loathing youth\nFrom queers to corpses in two seconds flat\n\nYou've got correction tape for every transgress\nImmediate approval for distress\nCall out your icon from its white washed tomb\nYour perversion, your blame, your truth\n\nTrigger finger prints in a pool of blood\nPray for us that our sins will come undone\nNow that you've decided in all of your tirade\nThat we are not worthy to live\n\nYou've got correction tape for every transgress\nImmediate approval for distress\nCall out your icon from its white washed tomb\nYour perversion, your blame, your truth\n\nYou will burn in hell for everyone you've killed\nFor every drop of blood that you've ever spilled\nAnd you will burn in hell for everyone you've killed\nFor every drop of blood that you've ever spilled\n\nAnd you will burn in hell for everyone you've killed\nFor every drop of blood that you've ever spilled\nAnd you will burn in hell for everyone you've killed\nFor every drop of blood you ever fucking spilled\n\nDiseased and deranged\nBecame a draining mass\nOf death at your request\n\nIn your prayers\nIn your speeches\nYou claim our death\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Foundations to Burn", "href": "Foundations_To_Burn&&9401", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Justify, as if it were our right to say\nNow decide, which liar you trust and which one chose our fate\n\nFed in time as a choice we think we're making\nIt's the guns that we know vs. the guns we never will\nWhen illusions burn where will we be left standing\nStill with the guns that we know vs. the guns we never will\n\nPacify, with false hope of safety within\nNever mind that they were never there where could we begin\n\nFed in time as a choice we think we're making\nIt's the guns that we know vs. the guns we never will\nWhen illusions burn where will we be left standing\nStill with the guns that we know vs. the guns we never will\n\nWe call upon god for which killing's permitted,\nAnd then brag out loud that our side made the grade\nWe better pray, with this as our position\nOur wrongs don't come back and burn us down to the ground\nAnd what gives us the right to judge without reprisal\nTo strike retaliation and wash our hands of blood\nAnd who gave us the crown to claim that we're divine\nWithout needing repentance and drive them into hell\n\nFed in time as a choice we think we're making\nIt's the guns that we know vs. the guns we never will\nWhen illusions burn where will we be left standing\nIt's the devil that we know vs. the devil that we kill\n\nThe devil that we kill\nThat we kill\nThe stations of our will\nFulfil\n\n", "album": {"title": "Tomorrow_Come_Today_(2003)&&9724", "genre": "Post-Hardcore", "year": 2003}}, {"title": "White Wedding Dress", "href": "White_Wedding_Dress&&423", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Every day she fears her life will end\nEvery time the call rings they are late\nThey never come quite in time to see his fist\nLeave its mark on the side of her disgrace\nThey'll never charge him anyway and you know it\nSay we can't get involved today\nSo where's the choice and who protects her now\nBruised and battered the blood has stained her gown\nUseless screams for help can't save her now\nChoices rendered the house is burning down\nNo one will ever understand 'cause they don't have to feel his crushing hands\nAnd the ears that ignored her screams before are now wondering what she did it for\nBut with a bottle of kerosene she found her freedom\nAnd then burned the bastard to the ground and ran\nThe fire will now wash away the blood on her white wedding dress\n\n", "album": {"title": "Tomorrow_Come_Today_(2003)&&9724", "genre": "Post-Hardcore", "year": 2003}}, {"title": "My Life In The Knife Trade", "href": "My_Life_In_The_Knife_Trade&&4928", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "How many times have I noticed that our eyes hardly ever meet\nFrom your judgment seat I can feel the anger for my very being\nFill me in on when you became such a big part of my life\nThat I should bother with all your lies designed to bring me down\nWrong again, don't depend on any reaction again\n\nI remember the icy walls that shot up from nowhere\nAnd I can see every lie you've ever told yourself\nYou bleed me dry and I don't ask why, but I'm left with the dust\nJudas kiss, I dismiss, thank you all for this, I am untouched (I am)\n\nWait again, not through with the screaming\nI contend that you've got nothing better to do\n\nI'd trade my life for a barrel of gold\nFind someone else before I get too old\nIf I live my life for aesthetic gain\nWill you repay me with all your shame\n\nI can see every light inside your brain\nGo on every time that I walk by for nods and whispers\nYour comfort in my suffering is no longer disturbing\nI'm lost beyond your petty stopwatch in life's real time (life's real)\n\nWait again, not through with the screaming\nI contend that you've got nothing better to do\n\nI'd trade my life for a barrel of gold\nFind someone else before I get too old\nIf I live my life for aesthetic gain\nWill you repay me with all your shame\n\nDon't get up I was only leaving the room\nWhen the door of your judgment swings back around again\nMaybe I'll stop to watch your act and I'll go on my way\nI've seen quite enough of too many childish games\n\nI'm ashamed of every moment\nThat I ever gave them the time of day\nAll the worst enemies\nAre somehow always friends that used to be\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Timothy", "href": "Timothy&&7368", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Ends and means\nRedemption\nOf your past are painful reminders\n\nTake these wings\nAnd make good on all the promises\nUnkept in this life\nThe judgments weighed against you\nFell away to embrace\nYour memory again\n\nTake these wings\nAnd make good on all the things \nThat were controlling you\nAnd then destroyed you\nYour short breath of life\n\nTake these wings\nAnd make good on all the promises\nUnkept in this life\nThe judgments weighed against you\nFell away\n\nFulfill all of the unsaid promises you made\nTo family and friends\nThrough blessings and understandings\n\nAnd I can't seem to understand why\nThe end of your pain meant the end of a rope\nBut I guess it's the only freedom that you've ever known\n\nThe price you've paid is dying alone\nPlease bless this child\nAll that he's dreamed\nAll that he worked for\nEvery dream\n\nMake his love, his compassion\nInspiration to us all\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "After The Eulogy", "href": "After_The_Eulogy&&9865", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Rise, Rise, Rise, Rise,\nRise, Rise, Rise, Rise\n\nWritten signed off in the obituary\nWhat happened to us\nWhere's your anger, where's your fucking rage\nWatered down senses lost\n\nLazy, privileged,\nDenial and self-gratified\nA tradition, passed down to\nOur blood stained hands\n\nGive in, give up\nGive in, give up\n\nRise, Rise, Rise\n\nContented to strive for\nNew worthless slogans\nWe miss our potential\nFor action and substance\n\nContended to lie in\nOur boring vomit\nSuggesting arrangements\nWhile others are dying\n\nStand up, fight back\nStand up, fight back\n\nHow many starving millions\nHave to die on our front doorsteps\nHow many dying millions\nHave to crawl to our front doorsteps\n\nWritten signed off in the obituary\nWhat happened to us\nWhere's your anger, where's your fucking rage\nWatered down senses lost\n\nWhere's your anger, where's your fucking rage\nWhere's your anger, where's your fucking rage\nWhere's your anger, where's your fucking rage\nWhere's your anger, where's your fucking rage\n\nWhere's your anger, where's your fucking rage\nWhere's your anger, where's your fucking rage\nWhere's your anger, where's your fucking rage\nWhere's your anger, where's your fucking rage\n\nContent and corrupted\nContrive and disgusting\nDig a whole it's all over\nForget the words and good intentions\n\nUnless we rise\nUnless we rise, rise ...\n\nTear it down\nRise ...\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "The Force Majeure", "href": "The_Force_Majeure&&6342", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "On shift from 9 to 5\nAnd then from 6 to 3\nSteals the soul; machine forever turning\nClass rebellion\nUnder our noses\nThe boss is feeding on living corpses\n\nTheir broken backs\nCall for us to rise\nBut for now we'll all just smile and sympathize\nDenied our movement\nNow lost, replaced by fear\nWe ask nothing less then settle for nothing more\n\nBehold the capitalist\nBathing in the blood\nOf the working class\nMartyrs bleed\nUntil spoken to\nVultures get fat from the harness coup\n\nRevolution\nAnother empty promise\nOf the leftist elite\nFrustration\nAnother soul is crushed\nUnder the rulers' feet\n\nAnd as the boot is forced\nInto their teeth\nOur safety\nIs their defeat\n\nYour station has been assigned\nYour rebellion will be confined\nYour rebellion will be confined\nYour rebellion will be confined\nYour rebellion will be confined\n\nTired doctrines\nKilling just as many\nAs the leaders that they decry\n\nTheir backs\nAll well patted\nFor a job well done\nWithout the use of their spines\n\nIndentured servants\nWithout the shackles\nCalloused hands and drying hearts\nRise up and destroy\nThe disease\nThat stole your soul\n\n", "album": {"title": "After_The_Eulogy_(2000)&&5179", "genre": "Post-Hardcore", "year": 2000}}, {"title": "Blame (Live at Eleven)", "href": "Blame_(Live_At_Eleven)&&1740", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "\"Broadcast. talking words. real words. painful words. makes you look so cheap. you can't stand on your own. and I have ceased to care. digging. digging deeper. digging for your precious heir. discredit. the job's too easy and so painful. and way to fucking real. the dirt is on your hands. the blood is in your hands. and I can see right through them. your only a receptacle for me. respectability is the weapon of the \"in scene\". dirt is law. new is wrong. can't we just let all this fall out of our laps again. how many sorrys does it take. well I'm sorry, so sorry that weren't cool enough. lies. time. pray for your inheritance. preys on your life.\"\n\n(ASSIGNMENT: Take an evening and watch your evening news. With a pad of paper and pen, write down the stories covered (you can be brief). At the end of the half-hour, compare the stories that cover rape, murder, kidnapping with the number of stories on what your government has done today. The results may be surprising. Then think about what the media wants you to believe.)\n<b>Points to consider:</b>\n(1 the idea that you need protection from other citizens)\n(2 the idea that only your government can provide that protection)\n(3 who benefits from these ideas)\n\n", "album": {"title": "This_Crying,_This_Screaming,_My_Voice_Is_Being_Born_(1996)&&7898", "genre": "Post-Hardcore", "year": 1996}}, {"title": "Cavity", "href": "Cavity&&3191", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Fall, kneel and beg\nCrying and blind\nJust try harder\nAnd you will find the way to everlasting sight\nDon't take this light away, it never did you any harm\nJust when I thought that I'd find my way\nPageantry are all the same\nSo here I am\nDefiled and divine\nSelf respect should never have to bleed from my knees\nDon't take this light away, it never did you any harm\nJust when I thought that I'd find my way\nPageantry are all the same\n\nWait, wait, wait for something to happen\nWait, wait, wait to understand\nWait, wait, wait for something to happen\nWait, wait, wait to understand\n\nI slip, I grasp, I always miss in cycles\nFallen angels never regain control\nFallen angels never fully regain control\n\n", "album": {"title": "In_Chrysalis_(1998)&&9008", "genre": "Post-Hardcore", "year": 1998}}, {"title": "Last Year's Nest", "href": "Last_Year%27s_Nest&&3300", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Discontent\nIn this life as is\nOur mechanisms deviate\n\nRust debrided\nInspires change\nAnd leaves behind exhausted dreams\n\nIgnition engaged\n\nSo save your wishes for the sky\nDiluted and disguised\nAs a perfect fuel that won't ignite\nBut hope will heal us all\n\nSet to action\nOur forward thought\nTo allocate and stabilize\n\nThe truth for so long\nCan only hide\nIn shadows of our own design\n\nAmend and revise\n\nSo save your wishes for the sky\nDiluted and disguised\nAs a perfect fuel that won't ignite\nBut hope will heal us all\n\nA wish will leave you empty handed\n(Hope will provide)\nShun your responsibilities\n(And lead an empty life)\nA dream alone will bear no seed\n(Hope is alive)\n\nAnd wishes will leave you\nDead and buried\nLost and forgotten\nWith your lives\n\nSo save your wishes for the sky\nDiluted and disguised\nAs a perfect fuel that won't ignite\nBut hope will heal us all\n\n", "album": {"title": "Tomorrow_Come_Today_(2003)&&9724", "genre": "Post-Hardcore", "year": 2003}}, {"title": "Bathory's Sainthood", "href": "Bathory%27s_Sainthood&&5034", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Do you feel alive now\nNow that you own the dead\nPreying on the corpses\nTheir hearts no longer fed\n\nYour sainthood is obvious on every starving face\nYour deception gives us\nA way to separate\nThe poor from the hate\nThe rich from the stone\n\nGenuflect away the sins that we've known\nSure one percent rules, but heaven's made of gold\nChalk it up to folly and consequences alone\n\nDo we really want do we really need\nA bastard messiah\nWrapped up in the dream of patriotic clean\nWhite washed desire\n\nAnd every time the real war's defined\nThe trenches are filled to hide battle lines\nTorches to bridges and bridges to torture\nHeadlines distort what we see as our borders\nWhat gives us the right to feel with remorse\nFor a god they created\nA god for the poor\n\nDo we really want do we really need\nA bastard messiah\nWrapped up in the dream of patriotic clean\nWhite washed desire\n\nFor bathory\nWe're bleeding out\nThe devil hides in angelic shrouds\nBlasphemy\nAs speaking out\nWe've asked for it\n\nFor more of the same sad scheme\nOf ghettos created by the power elite\nFor our minds and souls\nBurning no longer for freedom invoked\n\nMore of the same\n\nDo we really want do we really need\nBastard messiahs\nWrapped up in the dream of patriotic clean\nWhite washed desire\n\nYour sainthood is obvious on every starving face\nYour deception's given us a way to separate\nDo you feel alive now\nNow that you own the dead\n\nMore of the same ...\n\n", "album": {"title": "Tomorrow_Come_Today_(2003)&&9724", "genre": "Post-Hardcore", "year": 2003}}, {"title": "Management Vs. Labor", "href": "Management_Vs._Labor&&1539", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "Sacrifice, did it really mean that much to them\nAs it was killing you\nThey've locked you out after all that you have done for them\nYou toil yet they profit more\n\nSave yourself today in tearing down the design that they built with our hands\nSave yourself today in tearing down the design that they built with our hands\n\nStruggle by to feed your kids while theirs grow fat, privileged and disdained\nThey've bled you dry\nUntil all that's left of you is sold to build their paradise\n\nSave yourself today in tearing down the design that they built with our hands\nSave yourself today in tearing down the design that they built with our hands\n\nWhat have we worked for we've been scraping by for all our lives\nOnly to find that we're left behind\nWe'll own our own time and give you nothing in return\nOur next meal will come from your table\n\nSave yourself today in tearing down the design that they built with our hands\nSave yourself today in tearing down the design that they built with our hands\n\nSo our lives can become something more\nThan what you buy and sell\nAmerica will be reborn\n\n", "album": {"title": "Tomorrow_Come_Today_(2003)&&9724", "genre": "Post-Hardcore", "year": 2003}}, {"title": "Resection", "href": "Resection&&3368", "artist": {"unique_name": "Boysetsfire"}, "lyrics": "\"Now my life is full of so many simple crutches. they help me walk they help me sleep the help me suffer. hte love was never there and I just didn't seeit. the weapons take on so many painful attachments, the faces change but they all tell the same damn story. the love was never there and I just didn't see it. the love was never there and now I don't think I even care.\n\nI've built this wall around my heart\nTo shut you out I've, played my part\nIn this game that I thought was real\nIn this pain that I now feel\nAnd if I ever fall again\nWill I just turn in the wind\nOr let it fly away with pain\nOr let it fester into the same\nA small dark place inside my mind\nWill keep my safe and far behind\nSo you can never hurt me again\nSo you can never hurt me again\nYou can never hurt me again\nNothing can ever hurt me again\nNothing can ever hurt me again\nThe way you did\nThe way you did\nAnd nothing, nothing can ever\nErase\n\n\nI pull this glass out of my skin\nThe 'wish I hads' replace my sins\n\n\nI release the lies but the disdain and nothing can ever wash this away. a small quiet place where I can hide. a small quite place where I can hide. where you can never hurt me again.\nWhere you can never hurt me again.\"\n\n\n(Endnotes:)\n(a:1)\n(Conservatism is generally affiliated with the Repiblican Party of present. Conservatives oftten take stands that appear to support family values, the value of human life (unless the life is deemed unproductive), and economic well-being at the expense of the individual. THat is not to say that these points are all inclusive, but they provide a brief overview. Looking at the otherside of the same coin, liberal politicians takes positions that are in favor of individual choice, socialist economic values, and the control of big business (of course replaced by big government).)\n(b:1)\n(The author uses the term illegal to describe the westward expansion movement due to the fact that governments often violated treaties with America's indigenous people in doing so.)\n\n", "album": {"title": "This_Crying,_This_Screaming,_My_Voice_Is_Being_Born_(1996)&&7898", "genre": "Post-Hardcore", "year": 1996}}]