[{"title": "Check mal die Rhetorik ab", "href": "Check_Mal_Die_Rhetorik_Ab&&9845", "artist": {"unique_name": "Dendemann"}, "lyrics": "Yeah! Ladies and Gentleman,\nPlease welcome on the great stage of life\n- you can applaud if you wanna -\nDendemann, the reine Rap-Titan Dendemann\n- der reine Rap-Titan ihr Nasen -\nund Dende, greif dir die Microphone\nund zeig die Partypeople wie wir die Rhetorik abchecken!\n\nAller Anfang l&#228;uft meist ein wenig schief\nAllerdings nicht dieser du wei&#223;t jetzt gehn wir tief.\nReime sind f&#252;r mich nur die Geister die ich rief\nAuf der Suche danach werd ich zum Meisterdetektiv\nDende Blomquist schreibt Raps zum weiterkommen\ndenn mein tr&#228;ger Sch&#228;del kennt beim Texten kein Pardon.\nBist du alt genug dann checkst du mein Jargon\nwenn ich sach Achtung jetzt kommt ein Karton\nDas hei&#223;t Cartoon ich wei&#223; was nun\nSchmei&#223; das Teil wieder an\nUnd ich geb mein Schei&#223; dazu.\nKacke, Mist, AA, Schiss, Exkremente\nDie Grundzutaten in jedem Text von Dende\nAlle ZwiggediZweifel erstick' ich im Keim\nDenn wenn die Mucke l&#228;uft, verdammt dann kick ich den Reim.\nAugen zu und durch doch ich nicke nicht ein\nCheck mal die Rhetorik ab ich schicke dich heim.\n\nManche nennen mich Volker Racho manche Dende Liston\nDenn sie wissen mit Larusso kann man herrlich reminissen\nSch&#246;n abh&#228;ngen und in Erinnerungen schwelgen\nMeine 26 Kumpels sind immer noch die selben\nMeistens chill ich mit a, e, i, o, u\nIch wei&#223; zwar nicht warum ich frage nie wozu\nIch feile und style Zeile f&#252;r Zeile\nImmer sch&#246;n der Reihe nach Eile mit Weile.\nMit Geduld und Spucke web ich mein Spinnnetz\nHab dues schon gepaid sobald ich mich hinsetz\nDoch viele Faker begreifen es erst jetzt\nWenn ihr schon in der Heia seid schleif ich noch am Text\nZerrippe das Mic im Eifer des Gefechts\nWenn ich anfang zu spitten wird der Cypher hier zerflext.\nIch fronte nicht aber nein niemals ich\nCheck mal die Rhetorik ab ich schreib wie mans spricht.\n\nMein Rap ist derbe ich wei&#223; selbst nicht wieso\nDein Rap ist Poison wie Bel Biv Devoe\nIch bleib zwar nicht gern h&#228;ngen auf dem selben Niveau\nDoch fahr immer noch um Block in Mamas gelben Peugeot.\nHab weder Chromfelgen noch Ledersitze\nUnd stieg um von J&#228;germeister auf J&#228;gerschnitzel\nFr&#252;her riss ich &#252;ber solche Streber Witze\nHeut bin ich selbst klein kariert wie Megapixel.\nHab zwar vieles gesehn, vieles erlebt\nDoch bin noch nicht angekommen denn das Ziel ist der Weg\nNur meins ist vielleicht viel leichter zu erreichen\nF&#252;r mich den Chef von unvergleichbaren Vergleichen\nDas pumpt Saft in die leere Batterie\nUnd ist Ausschlag gebender als jede Allergie\nCheck mal die Rhetorik und streng dich an\nDenn jedes kleine d hat ein gro&#223;es ENDEmann..\n\n", "album": {"title": "Die_Pf%C3%BCtze_Des_Eisbergs_(2006)&&2220", "genre": "Hip Hop", "year": 2006}}, {"title": "Bad Rhymes", "href": "Bad_Rhymes&&627", "artist": {"unique_name": "Dendemann"}, "lyrics": "(I've sung a lot of songs, I made some bad rhymes)\n\n\nJa, mehr ist mehr und ich hab manch ein Lied geschrieben\nEinige kamn' raus, andre blieben liegen\nSchon da gewesenes hab ich ja eigentlich nie gemieden\nDoch ich kleb das Logbuch zu und zwar mit sieben Siegeln\nPlatz f&#252;r frohes Neues, weg mit dem alten Schei&#223;\nWort drauf, leg ich die Hand aufs Herz, wird mir kalt wie Eis\nWas hab ich von der Technik, ohne N&#228;chstenliebe\nDie ich bekam aus der Krebs- und Vogelperspektive\nIch bin 'n Seelenstripper, vielleicht nur ein Flitzer\nUnd schmeckt das Leben bitter, dann vergleich ichs mit Pizza\nDrum schick ich mir selbst ne letzte Flaschenpost\nDenn der Opi(?) zieht um, vom ersten Stock ins Dachgeschoss\nAha, Aha es war ihm wohl zu laut da unten\nDoch alle Achtung, denn er hat den Weg hier rauf gefunden\nJa oft ging ich fr&#252;h los und kam erst sp&#228;t Heim\nDoch dann hatt' ich was ich wollte (some bad rhymes)\n\n\nChorus\n\n4x\n(I've sung a lot of songs, I made some bad rhymes)\n\n\nJa ich komm mit den &#252;bleren Reimn'\nDenn ich gr&#252;bel daheim an ausgekl&#252;gelten Zeiln'\nUnd was nicht passt, das pr&#252;gel ich rein\nDenn so kann ich dem Siebenschl&#228;fer Fl&#252;gel verlein'\nUnd w&#228;hrend Engel und Teufel noch im &#220;berich weiln'\nK&#246;nnen sie sich mein Gewissen gerne Br&#252;derlich tein'\nUndschuld vom Lande sein gen&#252;gt nicht allein\nDer daf&#252;r &#252;bliche Schein, der tr&#252;gt will ich mein'\nDenn echte Mitarbeiter f&#252;gen sich ein\nIch hatte das Gl&#252;ck nur mit den derbsten Typen zu reimn'\nMit Falk, Sam, Ferris, Bo, Majo und Nico\nMit Sleepwalk, Willie, Dougie, Carlo(?) und Frico\nMit den Moquis, den Beginnern, Wasi und Chima\nDen Deichkidds, Broten, Fischmob, Jaleel und Tefla\nUndsoweiter hab ich mich durchs Land gefeatured\nDenn (Bad Rhymes) steht auf meinem Lieblings T-Shirt\n\n\nChorus\n\n4x\n(I've sung a lot of songs, I made some bad rhymes)\n\n\nMal \"Danke, gut\", mal nicht es bleibt ein Wechselbad\nUnd f&#252;r die Rechte dritter Strophen brauch ich ein Extrablatt\nEgal ob Geniestreich oder Schnapsidee\nIch such das Haar in der Suppe, wie Gr&#228;te im Lachsfilet\nIch such und ich such nach den wildesten Reimn'\nUnd wenns nicht so ist, tja dann bild' ichs mir ein\nJede Silbe ist mein, doch schon bald in deim' Ohr\nMit mehr Galgenhumor als auf den Alben zuvor\nDenn f&#252;r die n&#228;chsten f&#252;nf, hab ich f&#252;nfzig Themen\nUnd weil die Zeiten wieder mal nicht grade g&#252;nstig stehen\nDank ich allen die in mit 'n wahren K&#252;nstler sehen\nUnd statt nur zu brenn' mein Wort f&#252;r bare M&#252;nze nehmen\nSch&#246;n, dass es euch gibt, ihr wisst wer ihr seid\nMir fehlte bisher die Zeit, doch jetzt ist es so weit\nAlso bist du bereit, Dendemeier l&#228;dt ein\nZu den frischen Beats und den (Bad Rhymes)\n\n\nChorus\n\n4x\n(I've sung a lot of songs, I made some bad rhymes)\n\n", "album": {"title": "DasSchweigenDilemma_(2003)&&6655", "genre": "Hip Hop", "year": 2003}}, {"title": "So siehts aus", "href": "So_Siehts_Aus&&2812", "artist": {"unique_name": "Dendemann"}, "lyrics": "So, ist es nicht so, dass ich so drei Minuten hab'\nWas im Normalfall so grad mal reicht f&#252;rn' guten Tag\nIst es nicht so, dass ich jede davon nutz'\nUm am Ende festzustellen es war wieder mal zu kurz\nIst es nicht so, dass kaum einer mehr Zeit hat\nAlle warten wie Crusoe nur so weiter auf Freitag\nIst es nicht so, dass jeder zweite sein Leid klagt\nUnd ist das hier dazu nicht nur 'n bescheidener Beitrag\nIst es nicht so, dass wir seelenruhig warten\nWeil wir vorm' Durchstarten scheinbar soviel Furcht haben\nIst es nicht so, ein Schritt vor, zwei zur&#252;ck\nNeuer Beat, gleiches St&#252;ck und Repeat bleibt gedr&#252;ckt\nIst es nicht so, so das gleiche in schneller\nUnd so manch ein Weichensteller stapelt die Leichen im Keller\nIst es nicht so, wenn ich so er so sacht es w&#228;r so\nDas ich der Dende bin und wers nicht glaubt schaut nach im Perso\n\n\nChorus\n4x Genauso, genauso, genauso sieht es aus(a)\n\n\nSo, ist es nicht so wie das Hip-Hop Einmaleins\nDas jede kleine T&#246;le bellt aber keiner beisst\nIst es nicht so, dass ich auch nicht weiter weiss\nDoch meinerseits sicher nicht die ersten Steine schmeiss\nIst es nicht so, so wien' Klotz am Bein\nDas wir weder k&#246;nn' noch wolln' so ganz ohne Motzerei\nIst es nicht so, jeder will ein Popstar sein\nAber trotzdem reim' er lebt von Luft und Probs allein\nIst es nicht so, wie das alte Ph&#228;nomen\nDas echte Heads nat&#252;rlich nur so auf dein Demo stehn\nIst es nicht so, so in jedem von uns\nDas wir Business machen wolln' nach allen Regeln der Kunst\nIst es nicht so, so zum Scheitern verdammt\nDenn Gier und Neid in dem Land reichen sich weiter die Hand\nIst es nicht so in diesem gottverdammten Bizzo\nEs ist so wie es ist, ich bin der Laru doppel Is-O\n\n\nChorus\n\n\nSo, so Ist es nicht so, endlich kling' die Reime rund\nDoch hier misst man sich lieber an schlimmen Beleidigung'\nIst es nicht so, man findet zwar keinen Grund\nDoch schiebt die Dinge aus seinem Mund auf den inneren Schweinehund\nIst es nicht so, mal Zeit Gassi zu gehen\nDem Ego mal ne Pauso g&#246;nn' von assigen Them'\nIst es nicht so, dass wir trotzd alledem\nStrahlen wolln' wie Halogen und fett sein ohne Kalorien'\nIst es nicht so, dass Fortschritt leider nicht geht\nWenn jeder denkt er h&#228;tt' schon bessere Zeiten erlebt\nIst es nicht so, es hat sich weiterbewegt\nGenauso sch&#246;n im Kreis, wie sich die Scheibe hier dreht\nIst es nicht so und schon immer so gewesen\nDas alles Auslegungsache ist, so wie Spesen\nIst es nicht so, Kopf in' Sand wie Vogelstrau&#223;\nDa kommt nur Z&#228;hneknirschen raus, genauso sieht es aus\n\n\nChorus\n\n", "album": {"title": "DasSchweigenDilemma_(2003)&&6655", "genre": "Hip Hop", "year": 2003}}, {"title": "Lieblingsmensch", "href": "Lieblingsmensch&&3414", "artist": {"unique_name": "Dendemann"}, "lyrics": "Ja.\nDu hast noch nie ein Lied bekommn'\nUnd so viele schei&#223; Lovesongs gibt es schon\nDu hast was derberes verdient\nweil es halt nur eine B&#228;rberessel (???) gibt\nDu wei&#223;t doch eh schon was ich mein,\nS&#252;&#223;holz passt nicht rein, raspeln lass ich sein\nDu kriegst 'n Lied das rockt mit Raps f&#252;r dich und n'Beat der schockt\nDu merkst es eh, du checkst es schon\nDenn du stehst unter \"Echt\" im Lexikon\nDu bist so ehrlich wie's nur geht\nUnd zeigst dem Hass wie man den Spie&#223; umdreht\nDu zeigst mir wie man liebt und lebt\nUnd der Track kommt eigentlich viel zu sp&#228;t\nDoch da du das Lied jetzt kennst\nDu bist und bleibst mein Lieblingsmensch\n\n\n(Chorus:)\n(\"You.\")\nDu und ich, du und ich und du\n(\"You.\")\nVielmehr geh&#246;rt wohl nicht dazu\n(\"You.\")\nDu und ich, ich und du und ich\n(\"You.\")\nVielmehr brauch' es vermutlich nich'\n(\"You.\")\nDu und ich, du und ich und du\n(\"You.\")\nVielmehr geh&#246;rt wohl nich' dazu\n(\"You.\")\nIch kann nur ganz laut schrein':\n(\"You.\")\nVerdammt, ich will dein Dende sein\n\n\nJa.\nDu wei&#223;t ich bin verr&#252;ckt nach Rap\nDoch nur deine Meinung macht ein St&#252;ck komplett\nDu machst f&#252;r mich mein Gl&#252;ck perfekt\nDenn nur du brachtest mich zur&#252;ck aufs Brett\nDu hast Style wenn du rollst mein Schatz\nUnd ich bin oft schon fast vor Stolz geplatzt\nDu denkst: Was kann das sein\nIch will nur ganz laut \"Danke\" schrein'\nJa. \nDu k&#252;sst als g&#228;bs kein Morgen mehr\nWas wei&#223; ich was aus mir geworden w&#228;r'\nDu hast mich aus dem Dreck gezogn'\nUnd mich aus meiner Schei&#223;welt weggeholt\nDu hast mich endlich frei gemacht\nUnd hast mir Leidenschaft neu beigebracht\nUnd da du das Lied jetzt kennst\nDu bist und bleibst mein Lieblingsmensch\n\n\n(Chorus)\n\n\nJa.\nDu unterst&#252;tzt mich wo du kannst\nUnd oft sicher nich' ganz ohne Angst\nDu hast l&#228;ngst durch mich durchgesehen\nDoch hast genug Mut mir die Furcht zu nehmn'\nDu bist so deiner Zeit voraus\nWeil du nicht zur&#252;ckblickst sonder weiterschaust\nUnd wer zu dem Beat hier danced,\nder wei&#223; du bist mein Lieblingsmensch\n\n\n(Chorus)\nVerdammt, verdammt, verdammt, ich will dein Dende sein\n\n", "album": {"title": "DasSchweigenDilemma_(2003)&&6655", "genre": "Hip Hop", "year": 2003}}, {"title": "Intro Dilemma", "href": "Intro_Dilemma&&2056", "artist": {"unique_name": "Dendemann"}, "lyrics": "Dendemeier, Das Schweigen Dilemma\nFalls du noch nicht wei&#223;t, wie man Gold aus Dreck filtert\nMach's wie ich, reim' Quacksalber auf Quecksilber\nH&#246;r zu, wie ich was in meinen Raps schilder'\nDenn so mal ich in deinem Kopf mit jedem Text Bilder\nKein schwarz/wei&#223; nur die buntesten Farben\nSpontan ohne 'n Plan ohne 'n Grundriss zu haben\nNiemand wei&#223; ob es gesund ist zu warten\nNur weil die Kumpels dir sagen: Mit dem Schund gehst du baden!\nDer Punkt ist zu starten, das Dilemma zu schlachten\nDas Schweigen zu brechen statt auf die Penner zu achten\nBrenner zu machen (hei&#223;) nicht nur br&#252;hwarme\nUnd so schlagfertig zu sein wie Spr&#252;hsahne\nIch f&#252;r meinen Teil bin l&#228;ngst dr&#252;ber hinweg\nHab' die verzwickte M&#252;hle schon viel fr&#252;her entdeckt\nHab' mich ein f&#252;r allemal f&#252;rs Reden entschieden\nUnd wenn's nichts zu sagen gibt dann wird eben geschwiegen\nIch bin am Leben geblieben und froh hier zu sein\nHab's grad eben geschrieben um's mit dir zu teil'n\nDenn dass ich wiederkomm' hab ich doch x-Mal gesagt\nIch war nur von dem Schrott nicht vom Schicksal geplagt\nDoch dass ich deshalb gleich Zettel und Stift wegleg'\nIst und bleibt so ausgeschlossen wie der Rechtsweg\nDenn bis die erste Taube auf meinen Grabstein kackt\nTanz ich meinen Tanz in diesem Drahtseilakt\n\n", "album": {"title": "DasSchweigenDilemma_(2003)&&6655", "genre": "Hip Hop", "year": 2003}}, {"title": "Was auch immer", "href": "Was_Auch_Immer&&841", "artist": {"unique_name": "Dendemann"}, "lyrics": "(Whatever it is) Was immer es ist\n(I know that it's real) Ich weiss es ist...&#228;h\n(I know that it's real) K&#246;nnt' es etwa sein, dass...&#228;h\n(I know that it's real) Ist es vielleicht einfach nur..\n(I know that it's real) Ich weiss es ist einfach nur\n(I know that it's) DENDE (real)\n\n\nIch f&#252;hl das was in mir, krieg da irgendwas zu sp&#252;rn'\nIch falt mein Stift, spitze mein Papier und lass mich f&#252;hrn'\nIch horch in mich hinein und kotz mich richtig aus\nDenn egal wohin ich fl&#252;chte, ich komm trotzdem nicht hier raus\nZu oft sitz ich zu Haus wie ne kleine Stubenfliege\nF&#252;r Probs, f&#252;r den Applaus und f&#252;r meine Jugendliebe\nIch mach ne gute Miene doch es bleibt ein b&#246;ses Spiel\nUnd mich davon frei zu machen ist zur Zeit mein gr&#246;&#223;tes Ziel\nSo schreib ich m&#246;glichst viel, &#252;ber was mir Sorgen macht\nDoch schon Gestern wusst' ich Heut denk ich nicht &#252;ber Morgen nach\nUnd schon Morgen denk ich: Heute war genauso wie gestern\nDoch nur jetzt und hier kann ich was da drau&#223;en verbessern\nUnd wenn ich die n&#228;chste Strategie auf meinem Sofa plane\nF&#228;llt mir ein, dass ich 'nen gottverdammten Flow drauf habe\nDazu ne Stimme, penetranter als ne Knoblauchfahne\nUnd Rap so krank, mein zweiter Wohnsitz ist die Notaufnahme\n\n\nChrous\n\nWas immer es ist, was immer passiert\nWie schief es auch l&#228;uft, wie schlimm es auch wird\nIch steh wieder auf und rei&#223; mich zusammen\nWeil ich bin, wer ich bin und weil ich wei&#223;, was ich kann\nIch sag was immer es ist(a), was immer geschieht\nIch steh wieder auf, weil es schlimmeres gibt\nIch sag ich pack mich am Kragen und ich rei&#223; mich am Riemen\nIch will mir doch nur endlich das holen, was ich verdien'\n(Whatever it is)\n(Whatever it is)\n(Whatever it is)\n(I know that it's real)\n\n\nIch f&#252;hl das was in mir und such nach meinen Instinkten\nIch will mich &#252;berholn' und lass den Reim links blinken\nIch fahr dicht auf und wart nicht drauf bis ihr in den Laden lauft\nDie Platte kauft und euch bei jedem zweiten Satz die Haare rauft\nIch komm geradeaus, viel Spa&#223; keine Faxen\nDenn irgendwann will ich so Indie sein wie meine Achsen\nIch bin da rein gewachsen, kam nicht zuf&#228;llig dran\nUnd Heut mach ichs allein, ich mein so gut, wie ich kann\nEs kommt vermutlich nicht an, wie ernst ich das nehm'\nDoch ich hoffe, dass du irgendwann lernst zu verstehn'\nWir sind im Fernsehn zu sehen, doch ham' nichts mehr zu erz&#228;hlen\nK&#246;nn' uns nur noch unsern neuen Shit w&#228;rmstens empfehlen\nDoch der Schei&#223; ist billig, doch der Schei&#223; ich flach\nDenn das Fleisch ist willig nur der Geist ist schwach\nUnd weil ich das &#228;ndern will, lieg' ich meistens wach\nTja, so denk ich &#252;ber meine Faulheit flei&#223;ig nach\n\n\nChorus\n\n2x\nWas immer es ist, was immer passiert\nWie schief es auch l&#228;uft, wie schlimm es auch wird\nIch steh wieder auf und rei&#223; mich zusammen\nWeil ich bin, wer ich bin und weil ich wei&#223;, was ich kann\nIch sag was immer es ist(a), was immer geschieht\nIch steh wieder auf, weil es schlimmeres gibt\nIch sag ich pack mich am Kragen und ich rei&#223; mich am Riemen\nDenn ich will endlich das kriegn', was ich verdien'\n\n", "album": {"title": "DasSchweigenDilemma_(2003)&&6655", "genre": "Hip Hop", "year": 2003}}, {"title": "Saldo Mortale", "href": "Saldo_Mortale&&4882", "artist": {"unique_name": "Dendemann"}, "lyrics": "Chorus\nJa, Scheine, Schotter, Asche, Zaster\n(Geld) f&#252;r manche Tugend f&#252;r manche Laster\nZaster, M&#228;use, Patte, Piepen\n(Geld) L&#228;sst manche hassen, l&#228;sst manche lieben\nPiepen, M&#252;cken, Schleifen, Kr&#246;ten\n(Geld) L&#228;sst manche Lieben, l&#228;sst manche T&#246;ten\nKr&#246;ten, Taler, Kies und Kohle\n(Geld) irgendwie gehts nicht ohne\n\n\nScheine, Asche ,Kohle, Zaster\nDresd'ner, Hypo, Volksbank, Haspa\nEin bedruckter Zettel, eine kleine M&#252;nze\nErf&#252;llen dir Heut fast alle deine W&#252;nsche\nNur ganz manchmal gibts Krach oder Zoff\nDenn manche wolln' Cabrio und manche Dach &#252;bern' Kopf\nManche wolln' in letzter Zeit ihre Yacht nicht mehr oft\nUnd manche wollen einfach nur kein Tach ohne Stoff\nManche wolln' vollere Lippen und neuere Titten\nManche wolln' nur ein frisches Pils, Feuer und Kippen\nManche wolln' gr&#246;&#223;ere Villen und teuere Schlitten\nManche sch&#228;mn' sich den N&#228;chsten um nen Euro zu bitten\nManche schwimmen im Geld, doch ersaufen im Geiz\nManche Stecken im Dreck aber kaufen nur Schei&#223;\nEs m&#252;ffelt zwar etwas doch weil es eben nicht stinkt\nist (Geld) genau das was im/ihr Leben bestimmt\n\n\nChorus\n\n\nScheine, Asche, Kies, Dukaten\nSaldo, Soll und Dispo haben\nEin bedruckter Zettel, eine kleine M&#252;nze\nDer dritte Nerz im Schrank oder endlich warme Str&#252;mpfe\nJa manche wollen nur ihr Hab und Gut zur schau tragen\nManche wollen nur 'n Platz f&#252;r ihren Bauwagen\nManche hauen sich die Plauze voll mit Saumagen\nW&#228;hrend manche schon seit Tagen nichts im Bauch haben\nManche lebn' im Saus und Braus vom Zinseszins\nManche halten einfach Zocken f&#252;r die Quintessenz\nManche sagen nicht h&#246;chstens, h&#246;chstens mindestens\nUnd manche halten schwarze Zahlen f&#252;r ein Hirngespinst\nManche k&#246;nnen von ihren P&#246;mps jeden Pfennig absetzen\nW&#228;hrend manche sich mit der Steuer st&#228;ndig versch&#228;tzen\nEs m&#252;ffelt zwar etwas doch weil es eben nicht stinkt\nist (Geld) genau das was im Leben bestimmt \n\n\nChorus\n\n", "album": {"title": "DasSchweigenDilemma_(2003)&&6655", "genre": "Hip Hop", "year": 2003}}, {"title": "Das erste Mal", "href": "Das_Erste_Mal&&7999", "artist": {"unique_name": "Dendemann"}, "lyrics": "<i>REFRAIN</i>\nWas immer du tust, was auch immer\nAlles machst du irgendwann zum ersten Mal\nWas immer du tust, was auch immer\nAuf die Fresse fallen ist derbe geil\nWas immer du tust, was auch immer \nAlles machst du irgendwann zum ersten Mal\nWas immer du tust, was immer du tust\nSing mal den Blues, das Leben ist so derbe geil\n\nWann hast du zum ersten Mal so dagesessen\nUnd gedacht das erste Mal ist ja total beschissen\nWann hast du zum ersten Mal so hmmberlegt\nUnd zum ersten Mal gedacht besser fr&#252;h als sp&#228;t\nWann hast du zum ersten Mal vor Lachen geheult\nUnd wann zum allerersten Mal ne Sache bereut\nWann hast du dich zum ersten Mal nackt gesch&#228;mt\nAber jegliche Gespr&#228;che dazu abgelehnt\nWann hast du dich zum ersten Mal als Ma&#223;stab benutzt\nUnd wann zum ersten Mal deinen Arsch abgeputzt\nWann hast du dir zum ersten Mal nen Knochen gebrochen\nUnd hat dein Gips auch schon nach zwei Wochen gerochen\nWann warst du zum ersten Mal im Krankenhaus\nUnd schl&#228;gst noch heute Kantinenfra&#223; dankend aus\nOb als Erstes oder X-tes, ich tu als w&#228;rs egal\nIch tu als t&#228;t ich alles grad zum ersten Mal\n\n<i>REFRAIN</i>\n\nWann hast du zum ersten Mal die Schule geschw&#228;nzt\nNur weil du denkst, dass du dann bei den Cooleren h&#228;ngst?\nWann hast du zum ersten Mal zu &#252;bel gefeiert\nUnd den Nachbarn in die Blumenk&#252;bel gereiert?\nWann hat dich zum ersten Mal der Ekel gepackt\nWeil dein Sch&#228;del dir sagt, dass er den Pegel nicht mag?\nSchw&#246;r dir, nie mehr so 'n benebelter Tag\nHerzlich willkommen in deinem ersten Knebelvertrag\nWann warst du zum ersten Mal edel und stark\nHast auf die Paragraphen und die Regeln gekackt?\nWann hast du zum ersten Mal 'n Faible gehabt\nF&#252;r den coolsten Kerl oder das tollste M&#228;del der Stadt?\nWann hast du zum ersten Mal richtig geknutscht\nUnd h&#228;ttst danach am liebsten gar nicht mehr geduscht?\nAuch nach tausend mal bleibt 1 die derbste Zahl\nIch tu alles, als t&#228;t ichs grad zum ersten Mal\n\n<i>REFRAIN</i>\n\nWann hast du zum ersten Mal festgestellt\nDas man sich heut gef&#228;lligst f&#252;r den Besten h&#228;lt?\nWann hattest du zum ersten Mal Stress mit Geld\nUnd hast so gecheckt du spielst gegen den Rest der Welt?\nWann hast du zum ersten Mal nen Laden beklaut\nUnd das Adrenalin hat dir den Atem geraubt?\nWann hast du zum ersten Mal alleine gewohnt\nUnd schnell gemerkt von Heimweh bleibt wohl keiner verschont?\nWann hast du zum ersten Mal zu dir selber gesagt\nH&#228;tt ich doch verdammt noch mal meine Eltern gefragt?\nWann hast du angefangen Rap zu verstehen?\nWann hattest du die Schnauze voll von &#228;tzenden Themen?\nWann h&#246;rtest du deinen ersten Text mit Ideen\nund hast deinen ersten Wholecar oder Headspin gesehen?\nSoll ich, oder soll ich nicht ist und bleibt die schwerste Wahl\nIch tu alles als t&#228;t ich's grad zum ersten Mal\n\n<i>REFRAIN</i>\n\n", "album": {"title": "Die_Pf%C3%BCtze_Des_Eisbergs_(2006)&&2220", "genre": "Hip Hop", "year": 2006}}]