[{"title": "The Majesty of the Nightsky", "href": "The_Majesty_Of_The_Nightsky&&4003", "artist": {"unique_name": "Emperor"}, "lyrics": "Like the tide, shadows flow towards the shore of light\nThe night comes whirling like a maelstrom\nWarring waves of crackling clouds embrace this nightside landscape\nThe heavens bleed, through open wounds, the dim light of the moon\n\nThe winds are crying mournfully and tears fly with the gusts\nThey whip my clenched faces freezing skin with ice-cold burning cuts\n\nToo long I have suffered\nThe desert sands of time\nBut as I drown in darkness\nIt will release the sign\n\nMy soul will leave this mortal coil of flesh and earthly life\nTo fly into the mist of night, into the nightside eclipse\nAnd experience existence on the other side\n\nAs a stone of scorching enthusiasm\nI refract the reflecting surface of this unfathomable sea\nGrowing circles of grief and pain slides across the land\nAs an omen of the horror yet to come\n\nThe strength of a thousand fire-breathing demons breed in my infernal, sinking soul\nAnd as I reach the surface once again, these powers are under my control\nNow I am one with the night sky majesty\n\n", "album": {"title": "In_The_Nightside_Eclipse_(1994)&&2206", "genre": "", "year": 1994}}, {"title": "Wrath Of The Tyrant", "href": "Wrath_Of_The_Tyrant&&6323", "artist": {"unique_name": "Emperor"}, "lyrics": "The wolves bark with wind in summertime.\nAs the moon passes the shadows. It was a grim tale.\nThe wolves pry the limbs from the conquered ones.\n\nCarnage consumes the emptiness.\nWait till my spirits come forth.\nViolate all his chosen ones.\nDrink the fires of death.\n\nCarrying the deaths of his fallen warriors\nDeep inside of him, in his eyes.\nWalk upon this Earth tonight,\nCarrying the staff of cold souls.\n\nAppear the sign of evil will.\n\nThey appear, Death and Destruction,\nTo a time (when) the angel cries.\nOpen your eyes again now, he is here.\nHe is the master of fear.\n\nHe is the wind, He is the storm.\nHe is the woods, He is the roots.\nNobody will escape the wrath of the Tyrant.\nForever the Beast shall wander the Earth.\n\n", "album": {"title": "Emperor_(1993)&&4792", "genre": "Black Metal", "year": 1993}}]