[{"title": "Untitled 9", "href": "Untitled_9&&5062", "artist": {"unique_name": "I_Can_Make_A_Mess_Like_Nobody%27s_Business"}, "lyrics": "You're always in control, you never make a big deal.\nYou always are your own, you never need someone to feel good.\nFor yourself.\nYou always watch yourself, after everyone else.\nYou never change shoe, because it's on the right foot.\n\nAnd we're all finding ways, to find ourselves.\nThrough these, broken, fallen walls that we call, we call our own.\nAnd we're never looking away.\nHopefully someday we can just stay young.\n\nI'm too afraid to talk, I never even curse...\nWell, I think them all the time.\nIs this the reason I'm so built, up inside?\nDreams went off the screen, I save the world with my toys.\nI have another girl, for every adventure.\nOh yeah, I try. but that's me.\n\nAnd we're all finding ways, to find ourselves.\nThrough these, broken, fallen walls that we call, we call our own.\nAnd we're never looking away.\nHopefully someday we can just stay young.\n\nTake a look, and see what you'll find.\nMaybe look and see who you'll find.\n\nAnd we're all finding ways, to find ourselves.\nThrough these, broken, fallen walls that we call, we call our own.\nAnd we're never looking away.\nHopefully someday we can just stay young.\n\n", "album": {"title": "I_Can_Make_A_Mess_Like_Nobody%27s_Business_(2004)&&6281", "genre": "Rock", "year": 2004}}, {"title": "I Know The Sum And Substance Of My Evil", "href": "I_Know_The_Sum_And_Substance_Of_My_Evil&&6548", "artist": {"unique_name": "I_Can_Make_A_Mess_Like_Nobody%27s_Business"}, "lyrics": "We all knew this day was coming\nOur bitter hearts can hear it calling\nSo proud of what you've done so proud of who you are\nStanding tall next to all the buildings\nAnd filling up with all the reasons why you should never trust yourself\nThe way to fool yourself... I'm fooled\n\nIts those nights alone where your driving\nAnd the sky just looks a little funny\nYour thinking of the worst you figure out the worst\nRight after you figure it all out you find a way to straighten your head out\nBut what if you are wrong and the world is adding up\nIts throwing signs from random places\nTo keep you at your toes so you don't figure it out\nBefore you figure it out\n\nWe fall to our knees and beg\nThe words are gone\nIts just a thought\n\nAnd we fall and we fall\nAnd we fall to our knees\nAnd we fall and we fall\n(Our bitter hearts can hear it calling\nSo proud of what we've done)\n\n", "album": {"title": "I_Can_Make_A_Mess_Like_Nobody%27s_Business_(2004)&&6281", "genre": "Rock", "year": 2004}}, {"title": "Untitled 8", "href": "Untitled_8&&5000", "artist": {"unique_name": "I_Can_Make_A_Mess_Like_Nobody%27s_Business"}, "lyrics": "Wake under the sheets\nThe morning took the sun\nSo you forget to wait but they sent you flowers\nTo forget your lies and make it up to you but I woke up and knew.\n\nIt's all about being scared,\nLife can only give you so much before you have to learn on your own\nIt's most important to me that no one trust anything\n\nAnd you wake under the sheets the morning\nTook the sun so you forget to wait but they sent you\nFlowers to forget your lies and make it up to you\nBut I woke up and knew.\n\nIt's all about being scared,\nSometimes I trace the lines but you taught me everything,\nIt's most important to me that no one trust anything and wait\n\nEveryone's asleep\n\nAnd you wake under the sheets the morning\nTook the sun so you forget to wait but they sent you\nFlowers to forget your lies and make it up to you\nBut I woke up and knew.\n\nSo wake up and know you're gone, your alone\n\n", "album": {"title": "I_Can_Make_A_Mess_Like_Nobody%27s_Business_(2004)&&6281", "genre": "Rock", "year": 2004}}, {"title": "Untitled 12", "href": "Untitled_12&&5765", "artist": {"unique_name": "I_Can_Make_A_Mess_Like_Nobody%27s_Business"}, "lyrics": "So now think of fear, as a person who, wants to know everyone, and what they love,\nAnd he comes at night, while you're laying there, he just knows, oh he knows, he gets in your head\n\nNow walk through the door, the same one you came in, so we can go back, to how things used to be,\nAnd just walk through the door, the same one, you came in, so we can go back, to how things used to be\n\nHe holds the key, to your smile and he, won't let you, too close to half of what you want,\nBut not I, think of it, we've known him our whole life, and we still don't know who, or what he wants\n\nJust walk through the door, the same one, you came in, so we can go back to how things used to be,\nAnd just walk through the door, the same one, you came in, so we can go back to how things used to be\n\nSo now walk, through the door, the same one, you came in, so we can, go back, how it used to be,\nAnd I'll wait, right here, with my arms, by my side, till I can, have back, what I loved before\n\nNow walk through the door, the same one you came in, so we can go back how things used to be,\nAnd I will wait right here, with my arms by my side, until I can, have back, what I loved before\n\n", "album": {"title": "I_Can_Make_A_Mess_Like_Nobody%27s_Business_(2004)&&6281", "genre": "Rock", "year": 2004}}, {"title": "Untitled 13", "href": "Untitled_13&&1227", "artist": {"unique_name": "I_Can_Make_A_Mess_Like_Nobody%27s_Business"}, "lyrics": "Breathe in... out slow\nThere's only one confusing part\nWhere did all the innocence go?\nWe love what we did we love too much\nWe need to much\n\nBreathe in... out slow\nThere's so much now that brings us down\n\nWhere did all the innocence go?\nWe love what we did we love too much\nWhere did all the innocence go\nWe love what we did we love too much\nWe need to much\n\n", "album": {"title": "I_Can_Make_A_Mess_Like_Nobody%27s_Business_(2004)&&6281", "genre": "Rock", "year": 2004}}, {"title": "An Oak Tree Stands Beside A Linden", "href": "An_Oak_Tree_Stands_Beside_A_Linden&&4364", "artist": {"unique_name": "I_Can_Make_A_Mess_Like_Nobody%27s_Business"}, "lyrics": "She's so smart today\nShe thought she could be right here again, but\nShe can only see, what she's afraid to see\nShe's now scared...\n\nShe says, I, I can't please myself\n(Applause please..)\nAnd it's you who I can't be from, unless\n\nEmpty stares, did you find it there...\nAlways by your side, knowing nothing well it's always right\nAnd we've come oh so far to gain some strength and now we've pulled too hard\nNow all you want is gone [x2]\nAnd now I'm all I've got\n\nSo he tested time\nIt's time he thought she'd meet again\nIt's his selfish mind\nThat gives him this empty life\nHe now escapes, he said \"I, I can't please myself\"\nAnd it's you, you're all I want, unless...\n\nEmpty stares, thought we'd go down there\nAlways by your side, knowing nothing, well it's always right\nAnd we've come oh so far to gain some strength and now we've pulled too hard\nAnd now all you want is gone [x2]\nAnd now I'm all I've got\n\nWait and see, that it's not just me\nIt's everything... in our lives...\nI'll make some space but it's hard,\nBut I can't do anything to make this wait\n\nAnd if all you want is gone\nAnd now all you want is gone\nAnd now I'm all I've got...\n\n", "album": {"title": "I_Can_Make_A_Mess_Like_Nobody%27s_Business_(2004)&&6281", "genre": "Rock", "year": 2004}}, {"title": "Untitled 1", "href": "Untitled_1&&1838", "artist": {"unique_name": "I_Can_Make_A_Mess_Like_Nobody%27s_Business"}, "lyrics": "[Screaming] I can make a mess\n\n", "album": {"title": "I_Can_Make_A_Mess_Like_Nobody%27s_Business_(2004)&&6281", "genre": "Rock", "year": 2004}}, {"title": "The Kindler Burns", "href": "The_Kindler_Burns&&2120", "artist": {"unique_name": "I_Can_Make_A_Mess_Like_Nobody%27s_Business"}, "lyrics": "See james he loves to walk,\nIt's he all he knows from them\nIt's all he wants, and some day someone said,\n\"James if you run for me, I can make your dreams come true.\"\nHe said,\"it's not quite what I want, but sign me up.\"\n\nWell think before you write.\nYou will see when you left but you hate your life.\nAnd you don't want to be that some day.\nYou'll thank me tomorrow.\n\nBut james said,\"no, I will go, and run many many miles.\"\nAnd he had always be someone he didn't want to be,\nBut james that's tough\nHe says,\" oh no what have I become.\"\nHe says,\" oh no what have I become.\"\n\nBut look at what you'll find.\nYou can't see that he loves, but he hates his life.\n'Cause he hides it so well when he smiles,\nAnd he knows that you'll never find out.\n\nWhat have I become,\nWhat have I become,\nWhat have I become,\nHe says,\"what have I become\",\nWhat have I become,\nHe says,\"what have I become\",\nWhat have I become,\n\nSee what james didn't know, that it's a shadey business out there.\nAnd everyone is punching up your back, while they took everything you had.\n\n", "album": {"title": "I_Can_Make_A_Mess_Like_Nobody%27s_Business_(2004)&&6281", "genre": "Rock", "year": 2004}}, {"title": "But When The Little Fellow Came Close And Put Both Arms Around His Mother, and Kissed Her in an Appealing Boyish Fashion, She Was Moved To Tears", "href": "But_When_The_Little_Fellow_Came_Close_And_Put_Both_Arms_Around_His_Mother,_And_Kissed_Her_In_An_Appealing_Boyish_Fashion,_She_Was_Moved_To_Tenderness&&1431", "artist": {"unique_name": "I_Can_Make_A_Mess_Like_Nobody%27s_Business"}, "lyrics": "I remember a man who was true to himself, if he put his mind to something it was done, he could\nHelp everyone just by doing what he loved, he could work with his hands so good, but when no one\nCares to know, that he works them to the bone.\n\nHe comes home to himself and he sits in his chair, gets lost inside pictures on the wall, he's\nHad some loves in his life that he's lost but knows why, he's lived with mistakes for so\nLong... he's the best man that I know, he sleeps happy all alone, he gives me\n\nHope for the best in everyone, in understanding what we've done, I laugh to myself, it gives me\nHope for the best for what we lost, to understand when no one wants, it makes me laugh, it gives\nMe hope.\n\nI know this lady who grew up so quickly, she had a child when she was so young, without the time\nOr money to pursue what she wanted, she slowly lost touch with her love, I bet she tried to run,\nBut she didn't have the guts to leave her, son who was born on a day in the spring, grew up to\nRespect her so much, for all that she had lost and for never giving up, for loving the mistake\nThat she loved... well lady you deserve more than anyone I know, you give me\n\nHope for the best in everyone, in understanding what we've done, I laugh to myself, it gives me\nHope for the best for what we lost, to understand when no one wants, it makes me laugh, it gives\nMe hope.\n\nI'm sitting alone and I think to myself, it'd be great if people could know, if we wore big tags\nOr we threw big parties where only lost people could go, so we'd never think we're wrong, and\nWe'd never feel alone... alone.\n\n", "album": {"title": "I_Can_Make_A_Mess_Like_Nobody%27s_Business_(2004)&&6281", "genre": "Rock", "year": 2004}}, {"title": "Salvy", "href": "Salvy&&7216", "artist": {"unique_name": "I_Can_Make_A_Mess_Like_Nobody%27s_Business"}, "lyrics": "Everybody wants to be the person be who you look up to\nAnd you see on TV but you know you're not,\nYeah you know you're not.\nNo rather, he's been running since the day he was 12\nHe knew he could be something, he just couldn't tell.\nCause' he was too cool, but he knows he could.\n\nI think it gets him everyday.\n\nLook at yourself, tracing circles of life.\nThat everybodies on.\nWalk on your own, trip and you'll fall. get up.\nBut you love who you've become.\n\nMaybe it's the people that you see on TV\nLike the doctor who thinks that he knows everything.\nOh I'm sure you do, you should live it too.\nNow deby she's been wrong since the day she was born,\nThere's always someone telling her of how she's wrong.\nShe knows she's not, yeah I know you're not.\n\nAt least listens everyday.\nLook at yourself, tracing circles of life.\nThat everyone's on.\nWalk on your own. trip and you'll fall. get up.\nBut you love who you've become.\n\nLook at yourself, tracing circles of life.\nThat everyone's on.\nWalk on your own. trip and you'll fall. get up.\nBut you love who you've become.\n\nNow salvy he's been yelling for about 50 years,\nHes such a family member let me telling you something,\nOh he knows he's right, oh he knows he is right.\nEveryone's been telling me for my whole life\nThey know I was wrong, and I know you're right.\nBut I'm still unassigned, well I know you're right.\n\n", "album": {"title": "I_Can_Make_A_Mess_Like_Nobody%27s_Business_(2004)&&6281", "genre": "Rock", "year": 2004}}, {"title": "The Best Happiness Money Can Buy", "href": "The_Best_Happiness_Money_Can_Buy&&6019", "artist": {"unique_name": "I_Can_Make_A_Mess_Like_Nobody%27s_Business"}, "lyrics": "Time goes by,\nAnd we watch our lives,\nAs they're sadly slipping away.\nAlone, we cry.\n\nSo follow that tune quickly\nOr you'll lose the melody you never heard\nWhen you were young you didn't care.\nIt's the one that stole your fathers pride,\nThat mighty mighty dollar sign.\nThese are the things that matter now,\nSo sing along and be...\n\nPrepared to jump,\nWhen the ship has sunk,\nAnd you're slowly watching it drown.\nAlone, you cry.\n\nSo follow that tune quickly\nOr you'll lose the melody you never heard\nWhen you were young you didn't care.\nIt's the one that stole your fathers pride,\nThat mighty mighty dollar sign.\nThese are the things that matter now,\nSo sing along and be prepared.\n\nMaybe we, care about too much\nTime we lost in in spite we run,\nThat night, but you know I'm wrong.\n\n", "album": {"title": "I_Can_Make_A_Mess_Like_Nobody%27s_Business_(2004)&&6281", "genre": "Rock", "year": 2004}}]