[{"title": "Touch The Sky", "href": "Touch_The_Sky&&426", "artist": {"unique_name": "Kanye_West"}, "lyrics": "I gotta testify, come up in the spot looking extra fly\n'Fore the day I die, I'mma touch the sky\nGotta testify, come up in the spot looking extra fly\n'Fore the day I die, I'mma touch the sky\n\nBack when they thought pink Polos would hurt the Roc\nBefore Cam got the shit to pop, the doors was closed\nI felt like Bad Boy's street team, I couldn't work the LOX\nNow let's go, take 'em back to the plan\nMe and my momma hopped in that U-Haul van\nAny pessimists I ain't talk to them\nPlus I ain't have no phone in my apart-a-meant\nLet's take 'em back to the club\nLeast about an hour I stand on line, I just wanted to dance\nI went to Jacob an hour after I got my advance, I just wanted to shine\nJay favorite line, \"Dawg, in due time\"\nNow he look at me, like, \"Damn, dawg, you where I am\"\nA hip hop legend, I think I died\nIn that accident, 'cause this must be heaven\n\nI gotta testify, come up in the spot looking extra fly\n'Fore the day I die, I'm a touch the sky\nGotta testify, come up in the spot looking extra fly\n'Fore the day I die, I'mma touch the sky\n\nNow let's take 'em high-igh-igh-igh-igh-igh la la la la la la la\n(Top of the world, baby, top top of the world)\n(Top of the world, baby, on top of the world)\nNow let's take 'em high-igh-igh-igh-igh-igh la la la la la la la\n(Top of the world, baby, top top of the world)\n(Top of the world, baby, on top of the world) Uh\n\nBack when Gucci was the shit to rock\nBack when Slick Rick got the shit to pop\nI'd do anything to say I got it\nDamn, them new loafers hurt my pocket\nBefore anybody wanted K. West beats, me and my girl split the buffet at KFC\nDog, I was having nervous breakdowns like, \"Man, these niggas that much better than me?\"\nBaby, I'm going on an aeroplane and I don't know if I'll be back again\nSure enough, I sent the plane tickets but when she came to kick it, things became different\nAny girl I cheated on, sheets I skeeted on\nCouldn't keep it at home, thought I needed a Nia Long\nI'm trying to right my wrongs but it's funny them same wrongs helped me write this song, now\n\nI gotta testify, come up in the spot looking extra fly\n'Fore the day you die, you gonna touch the sky\nYou gonna touch the sky baby girl\nTestify, come up in the spot looking extra fly\n'Fore the day you die, you gonna touch the sky\n\n<b>Lupe Fiasco:</b>\nYes, yes, yes\nGuess who's on third?\nLupe steal like Lupin the 3rd\nHere like ear till I'm beer on the curb\nPeach fuzz buzz but beard on the verge\nLet's slow it down like we're on the syrup\nBottle shaped body like Mrs. Butterworth\nBut, before you say another word\nI'm back on the block like I'm laying on the street\nI'm trying to stop lion like I'm Mumm-Ra\nBut I'm not lyin' when I'm laying on the beat\nEn garde, or touch&#233;, Lupe cool as the unthawed\nBut I still feel possessed as a gun charge\nCome as correct as a porn star\nIn a fresh pair steps in my best foreign car\nSo, I represent the first\nNow let me end my verse right where the horns are like uh\n\n<b>Kanye West:</b>\nI gotta testify, come up in the spot looking extra fly\n'Fore the day you die, you gonna touch the sky\nYou gonna touch the sky baby girl\nTestify, come up in the spot looking extra fly\n'Fore the day you die, you gonna touch the sky\n\nWe back at home, baby\nSky high\nI'm, I'm sky high\nI'm, I'm sky high\nI'm, I'm sky high\nI'm, I'm sky high\nI'm, I'm sky high\nSky, uh, sky high\nI'm, I'm sky high\n\nYeah\nKeep it rollin'\nYeah\nUh, feels good to be home, baby\nFeels good to be home\n\n", "album": {"title": "Late_Registration_(2005)&&3198", "genre": "Hip Hop", "year": 2005}}, {"title": "We Can Make It Better", "href": "We_Can_Make_It_Better&&2300", "artist": {"unique_name": "Kanye_West"}, "lyrics": "(Kanye West)\n(\"Make It Up\") We can make it better\n(\"Make It Up\") We can make it better\n(\"Make It Up\") We can make it better\n(\"Make It Up\") We can make it\n\nSomebody told me that Delta's brownskinned, AKAs' lightskinned\nAnd they supposed to be bougious, so they got white friends\nFirst day of school, I'mma take you sight seein'\nShow you what we do on weekends for excitement\nShe said, \"I know what you about to say, like your hypeman\"\nShe let a nigga hit it, and now she only date white men\nAnd if a nigga even wave at her, it's frightnin'; but\n\n(Chorus: Kanye West)\n(\"Make It Up\") We can make it better\n(Better we can)\n(\"Make It Up\") We can make it better\n(Better we can bring it on up, we can)\n(\"Make It Up\") We can make it better\n(Better we can)\n(\"Make It Up\") We can make it\n\n(Talib Kweli)\nThe night fallin' over Brooklyn, where they murder for change\nThe converter remains faithful to the drugdealer priestess\nHe in search of the word of fame, you heard of the name\nKweli the truth, like I'm comin' out the mouth of babes\nOne for it, one for out the grave\nNiggaz want they reperations, How you calculate the amount to be paid\nYou try to imagine America without the slaves (the slaves)\n\n(Q-Tip)\nHer tenament yo, is rat infested\nHer heart is like a gold bouillon 'cause she wouldn't protest it\nCause, her bestfriend's man got popped\nHe was sixteen years old, the cop thought his phone was a glock\nIn the hood is a everday happenin'\nA friend of the priest say she chewed out the captain\nShe yelled out \"Why you do this to black men?\"\n\n(Common)\nI think of eighty seven ways, to make better days\nWhether climb or rhyme, I heard of rebel pays\nOn the scene, tryin' to get green like everglades\nMusic, rhymin' good like escalates\nIn the ghetto infested by shade and drama\nAnd niggaz wit' thangs ain't afraid of karma\nI'm thinkin' big like Little Wayne in the (?)\n\n(Rhymefest)\nC'mon; Tell people the truth, but never give 'em ya true thoughts\nTerrorism on blacks, they poison our Newports\nPartiot Act in effect, make it hard to breathe now\nJohnny Cochran dead, who gonna get us free now?\nClinton ain't in office, who gon' give us shit free now?\nWho gon' make it better for the thugs and Ps now?\nWho gon' make it good for old folks that's senile?\nOh, it's good music, yeah dog I see now\n\n", "album": {"title": "Late_Registration_(2005)&&3198", "genre": "Hip Hop", "year": 2005}}, {"title": "Heard 'Em Say", "href": "Heard_%27Em_Say&&2067", "artist": {"unique_name": "Kanye_West"}, "lyrics": "<b>DeRay Davis:</b>\nMr. West\nMr. West\nMr. West\n\n<b>Kanye West:</b>\nUh, yeah\nUh, yeah\nUh, yeah\nUh, yeah\n\nAnd I heard 'em say\n\"Nothing's ever promised tomorrow today\"\nFrom the Chi, like Tim it's a harder way\nSo this is in the name of love like Robert say\nBefore you ask me to go get a job today\nCan I at least get a raise of the minimum wage?\nAnd I know that the government administer AIDS\nSo I guess we just pray like the minister say\nAllahu Akbar and throw him some hot cars\nThings we see on the screen that's not ours\nBut these niggas from the hood so these dreams not far\nWhere I'm from the dope boys is the rock stars\nBut they can't cop cars without seeing cop cars\nI guess they want us all behind bars, I know it\n\n<b>Kanye West and Adam Levine:</b>\nUh, and I heard 'em say\n\"Nothing's ever promised tomorrow today\"\nAnd I heard 'em say\n\"Nothing's ever promised tomorrow today\"\nBut we'll a find a way\n(And nothing last forever but be honest babe\nIt hurts but it may be the only way)\n\n<b>Kanye West:</b>\nThey say people in your life are seasons\nAnd anything that happen is for a reason\nAnd niggas gun clapping and keep to squeezing\nAnd gram keep praying and keep believing\nIn Jesus, and one day that you see him\nTill they walk in his footsteps and try to be him\nThe devil is alive I feel him breathin'\nClaiming money is the key, so keep on dreamin'\nAnd put them lottery tickets just to tease us\nMy Aunt Pam can't put them cigarettes down\nSo now my little cousin smokin' them cigarettes now\nHis job try to claim that he too niggerish now\nIs it 'cause his skin blacker than licorice now?\nI can't figure it out, I'm sick of it now\n\n<b>Kanye West and Adam Levine:</b>\nUh, and I heard 'em say\n\"Nothing's ever promised tomorrow today\"\nAnd I heard 'em say\nNothing's ever promised tomorrow today\nBut we'll a find a way\n(And nothing last forever but be honest babe\nIt hurts but it may be the only way)\n\n<b>Adam Levine:</b>\nWith every worthless word, we get more far away\nAnd nothing's ever promised tomorrow today\nAnd nothing last forever but be honest babe\nIt hurts but it may be the only way\n\n", "album": {"title": "Late_Registration_(2005)&&3198", "genre": "Hip Hop", "year": 2005}}, {"title": "Wake Up Mr. West", "href": "Wake_Up_Mr._West&&8610", "artist": {"unique_name": "Kanye_West"}, "lyrics": "Oh, whoa ho ho\nI knew I was gon' see, knew I was gon' you again\nKnew I was gon' see you again\nWhere your goddamn book bag at?\nAlways carryin' that little book bag, nobody wants to see that\nGoddamn fourth grader, sit your ass down\nHe wanna play it again like he got somethin' else to do\nYou ain't got somethin' else to do\nYou ain't doin' nothin' with your life, nothin' with your life\nYou think this is?\nYou better look at me when I'm talkin' to you\nYou think this shit easy, don't you?\nYou think this is promised\nWell ain't nothin' promised to you\nLook at my face, do I got a promised face?\nDoes it look like I promised you anything?\nKanye, nigga, is you snorin' in my class?\nWake up Mr. West\nWake up Mr. West\n\n", "album": {"title": "Late_Registration_(2005)&&3198", "genre": "Hip Hop", "year": 2005}}]