[{"title": "Warrior's Drum (Westside Remix)", "href": "Warrior%27s_Drum_(Westside_Remix)&&6364", "artist": {"unique_name": "King_Just"}, "lyrics": "Can I get the phat intro?\nThis is how you was gon start it off?\nYeah, knowhatimsayin?\nThis is the God, the Drunken Monk, King Just\nComin' through for the Shaolin crew\nBlack Fist, yo hit 'em wit a uppercut\n\nShaolin, Black Fist, they do the job\nShaolin, Black Fist, they do the job\nShaolin, Black Fist, they do the job\nAnd Just came back wit that ol' funky rhyme\n\n(King Just)\nHeya heya, can I get some?\nThe sounds of the Warrior's Drum\nOn the warpath, don't make me laugh\n'Cause you never in your life, wanna ever see the God's wrath\nI'mma chief that smoke *weed* outta peace pipes\nYo, bro, I'm half Indian, so you're right\nI'mma about to show you wit my mic sword\nYo Shaolin sling, come on raise the sword\nCharge, they all crowd from the Black Fist\nI got fudge in my mouth, they say that'll let your own wrist\nM.C.'s fall and they can't get up\nI do the rap, why, yes that's a cut\nHuh, right back at you, *niggas* better run\nOr feel the force of the Hell Razah's gun\nGupao, gupao, my style is wild chopped in the Shao'\nZoo, aow, aow, I can flip it acapello\nI'll make you jelly like Jell-O, figaro, figaro\nWho would think that the Just would go opera\nYou could ask Hammer, he know my *shit* is popper\nStopper, stopper, like Cuddy Ranks\nI'm takin' money to bank, and my moms I like I'd like to thank\nShaolin, Black Fist, they do the job\nAnd Just came back wit that ol' funky rhyme\nBring it\n\n(King Just)\nAnd there's a thousand M.C.'s, lined up against the wall\nTimber, they all gonna fall\nHassan Chop, yo I can't stop\nGivin' you that off the wall hip hop\nTo ya ear, make ya wanna cheer\nHallelujah, ch-ch grrrr, now I'm in second gear\nYo, I'm out of here, to get the mo' tical\nFrom the Meth-Tical, hit the budd' tical\nKnow I'm headed to the hotel\nBut I'll be pokin and strokin\nYo the hair, got Tical, got a *nigga* open\nHey daddy, who them those over there?\nShaolin Soldiers, huh, wait a minute, no one told ya\nThat I'm the *nigga*, that they call Stompy\nWho got the looks of a killa dead zombie\nI take 'em off, sure fast cannin ya tour\nThey couldn't catch my style if I was a baseball\nBases loaded, and I got my back gun\nBlaow, boom, bang, oh *shit* a home run\n*Crowd cheerin noise* Yo, the crowd goes crazy\nBring it, if you want, 'cause you really don't amaze me\n\n(King Just)\nLook who's back, it's the Hell Razah, raisin hell\nAnd I've been rockin' rhymes, since *niggas* been rockin' gazelles\nMy slang can bang, so I guess I be the man\nYou couldn't hang wit my style, if you invented the Ku Klux Klan\nI'm like AT&amp;T, I'mma reach ya through ya speaker\nI got more sole than a sneaker\nAsylum, I'm crazy, I guess I'm wildin\nMy stylin, is the record straight from the Shaolin\nBy the kiss of the Black Fist\n*Shit is* sick, here to make ya wanna drown a fish\nUnder water, I'ma slaughter, like a change machine wit no quarter\nOut of order, run for the border\nThe hardcore rap act is back\nI stick out like a thumbtack, I wipe *niggas* off the map\nAnd I rhyme to get paid, 'cause when I raid\nI wouldn't wanna hear ya style wit a hearing aid\nStraight up crook, meaner than Captain Hook\nLook out, look out, stomp like Bigfoot\nAnd I don't give a *fuck* about a girl\nMy crew is more crazy than Bebe Kids in *fuckin* Fun World\nI'm causin *niggas* doom, I mean sonic boom\nI'm *fuckin* stupid, I write rhymes in the boiler room\nLike Krugger, funky dope maneuver\nThe Drunken Monk is so funky, they call me manure\nHorse *shit*, I flip *shit*, oh my God, I rip *shit*\nI talk *shit*, no one can *shit*, like I *shit*\n*Shit* like this, get you upset\nBecause the *shit* that I was singin', was pumpin\nThrough ya projects\nHow much times must I say *shit*?\nWell, if the *shit* ain't worth the *shit*\nThen I don't wanna be wit the *shit*\nAnd then you be like \"Oh *shit*, he flipped it\"\nNow ain't that some *shit* kid?\n\n", "album": {"title": "Mystics_Of_The_God_(1995)&&7378", "genre": "", "year": 1995}}, {"title": "Hassan Chop", "href": "Hassan_Chop&&5989", "artist": {"unique_name": "King_Just"}, "lyrics": "(\"King Just\" scratched up)\n\nHassan Chop! Yo, I can't stop\nGivin' you that off the wall hip hop\nHassan Chop! Yo, I can't stop\nThis the type of shit that you pump on your block\n\n(King Just)\nOff top, I came to blow the whole spot\nSolid as a rock, my whole style is unorthodox\nAstronomically bait, to a state\nWhere I create rappers rate, snatch ya bodies like the dirty mate\nWait, till you hear the next album drop\n'Cause this shit right here is strictly for the block\nPut your hemp pump cock, licka shot if you wanna\nEspecially if you drink beer and smoke marijuana\nI'm a goner, to this world of society\nThat's why kids admire me\nIt must be the sounds that I put in ya ear\nCrystal clear, have no fear, in any mic I tear\nIn half or to pieces, my style is so ill\nThat my middle name should become Jesus\nOh please kid, this is off the wall terror\nA new era, man, I got the illest shit ever\nWhatever, if you wanna bring it, let it be brought\nAnd I'mma watch the Mob hold down the fuckin' fort\n(Hold it down) And show 'em what my skills can do\nReal niggas represent from the muthafuckin Zoo\n\n(King Just)\nDon't fuck around buck-o, I'm stickin like stucco\nUh-oh, better get makeover, rhymes is Play-Do\nThe cradle who rock the hand, I'mma slam\nDu-Ra-du-Ra, spinnin like Rodan\nNo man can hold me down, I'm like Conan\nThe Barbarian, muthafuckas, I'm crushin 'em\nThey can't uphold the King Just touch of gold\nNow everything I drop becomes a heavy load\nI explode on the road, doin' shows\nGivin' pounds to my bro's, chasin after big ol' widows\nThey know, that I got this rap shit lock\nFrom the Desert Oasis all the way to the Hilltops\nAt the speed of a hat drop, I make you move ya bumblera\nAnd make Two-Six buck shots, boy, you fuckin' blood clots\nAnd why not, must I make the music?\nAs if not man, yo, I just might lose it\nDon't confuse it, we all in the same game\nYou don't know me, you just know my name\nWas it the fame, that made me insane in the brain\nDrivin' this track like a runaway train\nAll aboard, Shaolin scored\nWe goin' on a world tour, raise ya hand if you're sure\n\n(King Just)\nNow who's true to hip hop?\n'Cause if not, I throw 'em in the headlock\nAnd smoke pot, like if I was raised in Woodstock\nThe hand cot, got me mesmerized\nCesstify, look at the red in my eyes\nOh why, must you test the best of this rap profess\nAnd guess that I would settle for less\nYo, I'm stressed, and it keeps buildin up\nWhat the fuck, roll up, hold up, throw up\nThe stage, my face is on front page\nNow I'm a rage, they let the Zoo niggas out the cage\nWatch me raise, and burn shit up like the inferno\nThoughts so deep you need to write them in your journal\nAsk the colonel, my shit is finger linkin\nI'm flippin, and ain't enough shit till I put the shit in 'em\nAnd strike like the 5 Deadly Venoms, and dead 'em\nForget 'em, fuck 'em, turn around and uppercut 'em\nFor frontin, talkin' shit and really wasn't sayin' nothin'\n\nA new era, a new day and age\nOff the wall hip hop\nRaow, raow\nOnce again, peace\n(\"Ah\" scratched up)\n\n", "album": {"title": "Mystics_Of_The_God_(1995)&&7378", "genre": "", "year": 1995}}, {"title": "Leave Now", "href": "Leave_Now&&3015", "artist": {"unique_name": "King_Just"}, "lyrics": "(Intro: King Just)\nFalalalala\nYo, this is how we do this shit\n\n(Chorus 2X: All)\nNiggas better move, niggas better get back\nNiggas better move, don't fake no jacks (Leave Now!)\n\n(King Just)\nI come like a river, I'll make ya shake ya zipper\nThe liver, here comes the nigga that'll dick ya\nRaw, hardcore, sounds that pound\nStop, look, what's that sound?\nCome on now, you've got to swing with the King\n'Cause the things I bring'll cause more ruckus than Rodney King\nRiots, gimme ya head and I'mma fry it\nTry it, I just might be the nicest you ever saw or seen\nCats are jammin like Mitch Green, more albums than Al Green\nA fiend for rap, puttin' this shit on back\nFor my niggas who put me on the map (Like that, like that)\nBack, flash his ring around the axis\nFeel my mark upon ya chest when it slashes\nSlow like molasses, Black Fist is massive\nAnd I rock rhymes from here to Shaolin to Dallas\n\n(Mega Don)\nBoom, the bomb, the Mega Don drops\nWhat the Blood Clots? Two-Six fuckin' shots\nStand clear for the warfare\nOr surrender, throw the white flags in the air\nYeah, the Mega Don's repossessin shit\nAnd I'll represent, kid these misfits are militant\nSince, life's a bitch, I'mma use her\nOne life to lose her, the Mega Don's a death abuser\nLike a butt, niggas better spit at you\nI'm sick, with what I'm dealin' with, Shaolin be rippin shit\nOn the wreck, Mega Don, Knotty Dread Brothers\nWe actin' live, but this way, all that's dead\nSo act like you know, black\nIt's the Mega Don, check the stat\nNinety-four, fakin no jacks\n\n(Profes)\nCheck it out, it's the mutt who rules like King Tut'\nYou rappers suck, it's another Black Fist uppercut\nAll I wish for is blunts and stunts\nYou get played like a dunce, I get props makin' mutts\nMisfits, a bunch of hoods with Knapps, hairs twisted\nSteppin to my crew, you wouldn't wanna risk it\nJust listen, I'mma school that ass like the Board of Ed\nA skin head, with chicken-heads jumpin' on my dick head\nNuff said, eyes is mad red, mouth full of smoke\nBlow it out through my nose, then take another tote\nI hope, that I could live large like Boss Hogg\nThe cat's out the bag, fuck it, let loose the dogs\nI'm walkin' niggas like a pit, it's the Profes\nBe on my face, hard like an erect dick\n\n(Star)\nI damage an amateur, clean up styles like janitors\nVan Clans are canned, they can't understand my slammin' stamina\nI master trash in blastin, ass-rappin'\nThis gat-clappin black, attacks the wack actin'\nApproachers, choke from the smoke of snub noses\nAnd die, high off highly potent doses of dopeness\nI posted, roast up these jokers, it's over\nQuit, I'm rippin off your shit like strip poker\nEach one, teach one son, but you was taught wrong\nI swarm, rip four pawns, you're torn, sick thoughts form\nBut if I ever want z's chief, I just repeat\nNo wack styles, count sheep, and go to sleep\nBlack Fist, the Shaolin Click, declares war\nSo move, move muthafucka, what you waitin for?\n\nFuck that, blood clot!\n(Easy, easy, selecta, Black Fist is ours, celestial\nAny man want some must get after dem)\nBig shout out, all right\nBig shout out to all my man lock down\nShitty Brown (My man Will)\nAh... Two-Six Mob, my liners\nAh... MZA (L.K.) Ah... GP Wu\nAh... Barry', ah... Meth-Tical\nBoogie, ah... K.C., yes... uh...\nMeth-Tical! Haha\n(Chris) Two-Two's\nAll right, all right, Little MZA\nUh... Shaggy, Shaggy, Shaggy... *fades*\n\n", "album": {"title": "Mystics_Of_The_God_(1995)&&7378", "genre": "", "year": 1995}}, {"title": "Pain", "href": "Pain&&9065", "artist": {"unique_name": "King_Just"}, "lyrics": "There's one brain\nThere's two halves to one brain\nOne half's the pen, the other half's a steel\nCheck the story\n\nPain, yo, is all I feel\nI'mma die wit my pen, or I'mma die wit my steel\n\n(King Just)\nA young shorty on the block, wit no props\nFightin every day, turn the pot, and crackin' beer top\nIn the hallway, gettin' fucked up, everyday\nYou ever thought about goin' to school? No way\nI always thought I'd be a big rap star\nDrive fancy cars and travel like far\nAha, dream didn't come true, now it's 1982\nSo what the hell you want me to do?\nI wanna sell drugs and hang wit the thugs\nFrom the projects, and own a nickel plated tech\nBut yet, I still got the skill to rock the crowd\nI guess rappin' should just be style\nBut now, I can't take it no more\nI'm ready to get my gat and tell you face down to floor\nGive me what you got, nigga, shit is real\nI'mma die wit my pen, or I'mma die wit my steel\n\n(King Just)\nSo damn confused, this life just don't seem the same\nKids on the smelly court, playin' the ghetto games\nI reminisce about the shit that I did\nYou couldn't be soft and live where I lived\n'Cause only the strong survive, and the weak die\nWell ain't that a bitch, oh, my, my, my\nMomma, why I gotta be like that?\nFace the fact, I want the respect of my ghetto back\nSo I dig deep 'cause I got a lot to give\nAs the world turns, but only one life to live\nSo come on my children, let's start rebuildin\nA new foundation for every man's nation\nI try to make a stand, but every stand's a downfall\nI sat on the bench while other kids played ball\nIt's not the fact that I lack athletic\nI'd rather grab a pen and pad, and get poetic\n\n(King Just)\nBow, boom, bang, same to the '90's\nTwo-Six Mob, nigga, that's where you'll find me\nDown wit Black Fist, now, my promo's on Kiss\nAnd everybody around town want's to talk shit\nI guess that's the way life goes, I guess no one knows\nYo, we all choose our own roads\nSo you choose yours, and I'mma choose mine\nWho knows, we just might make it at the same time\nDefine, yo, the meanin' of jealously\nAnd I show you a hundred rappers that can't fuck wit me\nTrue, so what's the moral to the story?\nThe God is on his way to glory, but yet there's more G.\nI became that nigga to the cess\nMy lifestyle change and now it's headed to the West\nI guess, I have to do some shows out there\nBut when I appear, the crowd shook wit fear\nYo, I can't die wit my steel\nI got a career now, to make at the top of my field\nSo you ask, how does the story end?\nOne love to Shaolin, we gotta die wit our pen\n\nYo this is a message from the God\nDreams come true only if you make 'em happen\nOne love to Shaolin\n\n", "album": {"title": "Mystics_Of_The_God_(1995)&&7378", "genre": "", "year": 1995}}, {"title": "Escape From the Zoo", "href": "Escape_From_The_Zoo&&1103", "artist": {"unique_name": "King_Just"}, "lyrics": "(King Just)\nTiger uppercut, yo, what the fuck?\nA lotta you rappers, adapt me, so you better duck down\nCheck out the sound that pound\nRugged raw rap is back, from Shaolin's underground\nWho's in town? You guessed it, you guessed it\nIt's the Drunken Monk, and I came to get cessted\nInfested, wit deep thoughts that's insane\nWhether the pen or steel, you gonna feel the pain\nI reign, just like a storm droppin' bombs\nIf you wanna get it on, let's get it on\nWords is bond, 'cause I ain't got no time for you suckas\nWhen the pen hits the pad, I blow past ya muthafuckas\nAin't nothin' funny, stop smilin', I'm wildin\nFunky freestylin, straight from the Shaolin\nIsland, but you already know the half\nCaught in between the world of science and math\nFeel the wrath, as I feel the fire down your back\nI attack the track like contacts in Cow Stack\nBring it back, press rewind, on each swine\nAnd my mind intertwines wit rhymes, here's the bottom line\nYou niggas can't get wit it, forget it\nLookin' so sweet, that you make me wanna hit it\nAh shit it, the mentals is lost\nBut of course, my style is always comin' off\n\nEscape from the (Shaolin Zoo, Zoo, Zoo)\n\n(King Just)\nAin't no stoppin' me now, I'm gonna blow\nIn a way I go, wit another ill flow\nYo, who really started this rap shit, I'm addicted\nAnd I can't stop sayin' shit, like Sega\nI'm Street Fightin niggas like Vega\nBlack Fist, I like to give a finger to ya majors\nFuck you, and all ya groups and ya phony ass troops\nNiggas think they rough 'cause they trees on they boots\nThat'll make ya, plus talk is cheap\nI roll wit a Mob, that rather take it to street\nAnd smoke got me open, I'm chokin\nThey say I'm brain dead, but how the hell I keep on flowin\nOn, they wonderin how I've lastin long\nIt's the bong that I smoke, by the palm wit don\nAow, that make ya wanna sing\nI knock ya ass, just like Legends of the Ring\nDing-ding, nigga let's get ready to rumble\nYou stumble, if this was football, you fuckin' fumble\nWhat the bumba, I sleep around ya shit like slumber\nParty, organize crime like John Gotti\n\n(King Just)\nAnd the way we go, blast off I'm on the next level\nMaybe it's because I dance wit the devil\nA rebel, without a pause, go four yours\nI'm droppin' drawers, my metaphor scores on the billboard\nRaw, my hardcore sound, uh, touchdown\nI'm Shaolin bound, for my brother's who ain't fuckin' down\nI pose a threat, don't forget, I expect that ass\nTo try and front, and talk all that cheap trash\nSmash, hits and shit, I done flip\nIf my mouth was a automatic, my brain'll be the fuckin' clip\nSlip, into another case of bass\nI face the race, and then be ghost without a fuckin' trace\nPlace the winner, I might eat that ass for dinner\nThe head spinner, when ya just a beginner\nSinner, I wanna be wit you boo\nBut I gotta do, what I gotta do, and represent the Zoo\nTwo-Six Mob is you wit me, Special D you in my head\nAnd in all my memories, 2 Cent, Rauf and Hect\nRest in peace from the ill rock vet, time to get right\n\n(Break)\n(Shaolin Zoo) '94\n(Shaolin Zoo) Shaolin Soldiers goin' to war\n(Shaolin Zoo) King Just\n(Shaolin Zoo) What nigga?\n\nYou should have let us out, muthafuckas (Shaolin Zoo)\nAh\n\n", "album": {"title": "Mystics_Of_The_God_(1995)&&7378", "genre": "", "year": 1995}}, {"title": "No Flows On The Rodeo", "href": "No_Flows_On_The_Rodeo&&7996", "artist": {"unique_name": "King_Just"}, "lyrics": "(King Just)\nWell here I am, the funky man wit the ill manner\nDon't spasm, 'cause I be y'all bad mamma jamma\nI told ya couldn't fuck wit me, nanananana\nI turn Incredible Hulk back into David Bammer\nI am a slammin' this shit just like a human hammer\nAnd rock suits from Timbuktu to Alabama\nIs the matter, and chocolate here comes the sword\nHit us hard, but now we livin' large, oh my God\nYo it's on, movin in like Desert Storm\nDroppin' bombs, ring the alarm, where's my bong?\nLight it up, 'cause I'mma smoke shit just like a Gemini\nFor niggas who don't remember, yo Mo Bee\nMake it easy, girls wanna seize me\nBelieve me, it's the same shit at the 6 G\nHarvard tactics, breakin niggas backwards\nThe Zoo stickin niggas like cactus, for practice\nThese fake rappers, try to chill and make a pill\nKnowin' they ain't real, knowin' they ain't got skills\nI'm from the Hill, where niggas go to toe to toe\nIn other words, no flows on the rodeo\n\nYippeekiyay, yippee yay, yippee yo\nYippeekiyay, yippee yay, yippee yo\nYippeekiyay, yippee yay, yippee yo\nYo, no flows on the rodeo\n\n(King Just)\nHoly cow, the kangaroo, they let the wildest nigga out the Zoo\nIt's the bird who flew the coup on the first scoop\nWho blew the roof? Poof, straight into the Mystics\nSuper sadistic, I'm butter like a biscuit\nOh shit kid, watch the sonic boom get boomer\nI flip hits and shits, and free my kazoomas\nOn like Pumas, and niggas can't throw me out\n'Cause the rhymes I give'll get ya dick hard like pencil stout\nShout, a little bit louder now\nWho's that nigga goin', aow, aow\nStyle, makes me superhyginetic\nFuck athletics, I'm dope and poetic\nForget it, 'cause niggas don't want none\nCan't get none, probably done before they see the outcome\nThe Drum, is the constant beat in my ear\nThe Warrior, is me, because I have no fear\nI sware, to my little seed, take heed\n'Cause in this rap shit, I'mma succeed and smoke weed\nAnd get lifted, high as a kite\nYou can't fuck wit the rhymes I write\nSo you write, tonight's the night\nI'm ready to fight, it's on and it's war\nI turn, I shoot, I score\n\n(King Just)\nI'm like a threat to a needle, make more hits than Beatles\nAnd stay sharp like a church steeple\nFor my people, I gotta put 'em on somehow\nIs the faces you meet up, is the ones you meet goin' down?\nBow, I'm blowin' up spots this year\nI don't care, so rollin' up the owls in the stairs\nBe prepared, for all types of shit like this\nHits after hits, it can only be Black Fist\nShit, what you thinkin'\nThe reason, I'm the shit is 'cause I'm stinkin\nYa niggas is dead like Abe Lincoln\nI'm thinkin', I'm a fuckin' master plan\nIt be the man, that made me the man that I am\nGod damn, the nigga slams like NBA Jam\nTryin' to battle me, is tryin' to drown Aquaman\nIt couldn't happen, I'm still on the Staten\nStill rappin', still keepin' the crowd clappin\nI'm blastin, all up in the like a shuttle\nMakin' other rap squads go in a huddle, leave a puddle\nOf blood for my niggas lock down, one love\nFor you niggas who don't like me, blaow, catch a slug\n\nWhat, '95\nNo one survive\n\n", "album": {"title": "Mystics_Of_The_God_(1995)&&7378", "genre": "", "year": 1995}}, {"title": "Shaolin Soldiers", "href": "Shaolin_Soldiers&&7425", "artist": {"unique_name": "King_Just"}, "lyrics": "That's all we got, we gonna need\nChoose, you ready\nYeah, let's do this shit\nYeah, yeah, yo who be that?\nYo that's the God?\nYeah, word up, niggas gotta learn to fuckin' answer me dude\nI want 'em all, fuck that\nShaolin, Shao!\n\n(King Just)\nWhat, what, my Gods is raced up\nThe thought that I throw is like a blow to your gut\nWord up, what the fuck, the God creates drama\nTwo-Six horror, terrorize the nigga mama\nI smell marce in the air, yeah\nWhere, all my Gods standin right here\nIn the rear, tryin' to sneak me from behind\nShaolin, rush 'em, nah nah he's mines\nDie Earth scum, die, die\nIt's just like a needle goin' straight to my eye\nOh why, does it have to be this way\nI don't know, but I flip the shit everyday\nSo come on, where you at, where you at\nPass me my gat, I'ma kill a cat, if they ever fuck wit the rats\nAnd that be the shit in my life\nThe God ain't trife, yikes, yikes\nFool strikes, kung fu, killa comin' through\nOoh, that be that nigga from the Zoo\nBut yet ya wanna ask me, how I slam a jam\nIt's simple, all I do is gram on a gram in a cracker\nHit ya like a linebacker, I'mma gat ya\nWhen I get ya, I'mma blast ya\nBlaow, like Kool Moe Dee, how ya like me know\nWhen my style is ill, raow raow\n\nShaolin Soldiers! (Hey!)\n\n(King Just)\nEnough is enough, wit this corn ball stuff\nAbout who can get rough and tough, or who can get snuffed\nPlease, if you came to battle, then rap\n'Cause your name ain't Scarface, and you don't own no gat\nYou ain't hurtin' nothin', ain't no future in frontin\nYou probably ain't even sayin' nothin'\nYo you're bluffin, puttin' like your styles is phat\nBut your rhymes are wack and you sound like you on plaque\nNew Jack, you're a wanna be, down to be, soon to be\nWhatever you want, let it be\nAnd I'mma hit ya wit a safer rap\nTo make you shut ya trap, and get the God hand clap, smack\nHit across your lips wit some shit\nThat make ya wanna spit and do two back flips\nBlue top, I clear through the air\nYou against me? Well I don't think that's fair\nYou need more people to match my equal\nAnd even if then, there won't be no sequel\nYo, let's get straight to the matter\nHow my thoughts get phatter and phatter and phatter\nAsk Betty Crocker, yo it's in the batter\nAnd I'mma climb the charts and splatter\n\n(King Just)\nWhy would you wanna write my shit like that?\nWhy must the God chase the cat?\nWhy would you even wanna front like that?\nSmile in my face, and talk shit behind my back\nDamn nigga, you must of wasted ya time\nIf you wanted to be rapper, I done wrote you a rhyme\nYo, you don't get no props, for bitin my shit\nYou only get props, for bein on my dick\nBut when you hear this, don't be mad\nJust be glad, that I ain't whip on ya monkey ass\nYou got a lotta balls bitin my style\nSoon we gonna be on it like aow, aow\nPut your shit on the court\n'Cause this one here takes to take 'em, yo I'm brake\nLord forgiveness sake, for they do not know what they do\nWhen they bent the Zoo, I should of brought it to they whole crew\nBadoop a doo, oh my God nigga, let's be real\nThe eight commandment, says thou shall not steal\nHelp police, I'm being robbed\nBy some corns on the car, that need to get a fuckin' real job\nThe Mob rocks more shit than boulders\nI told ya, everybody can't be a soldier\n\n", "album": {"title": "Mystics_Of_The_God_(1995)&&7378", "genre": "", "year": 1995}}, {"title": "Can I Get Some", "href": "Can_I_Get_Some&&9389", "artist": {"unique_name": "King_Just"}, "lyrics": "Hell yeah\nThis is how we supposed to do\nUh-huh, Black Fist we gon' do?\n\nDrop the grenade, niggas ain't larger\nTime to get paid, you're in the alarm\nRappers get slayed, and they cause no harm\nI'm about to lay, hey, can I get some?\n\n(King Just)\nYo, come get a fuckin' taste of reality\nCasualty, wept over the whole fuckin' galaxy\nBattle me, your styles a game like Sorry\nOr like Atari, I'm gnarly just like a Harley\nDavidson, I take on the bravest one\nAnd turn into that bitch ass nigga he was\n'Cause, ain't no fakin and no playin'\nAnd every word that I say, is every word that I'm slayin\nOh God, why do they think I'm broad\nIs it my lyrics is hard or is I'm wit the Mob\nFrom the Six, now all these rappers talkin' shit\nBut I must be schemin on my life to make hits\nBlack Fist on the rise, oh now you're surprised\nYa niggas don't exist, like fuckin' pens you pry\nBut I'mma ride, this beat like girls ridin' my meat\nFuckin' wit Just, that's like swimmin in Shit's Creak\nWit diarrhea, oh mamma mia\nSkills is ill, real faster than a cheetah\nIn a jungle, and I'mma watch ya empire crumble\nIf rap was football, ya niggas would have been fumble\n\n(King Just)\nBack up, back up, yes Zoo's in town\nWit the new twist and a brand new sound\nWhat you want? Ya niggas ain't ready for war\n'Cause it take ten more, before I get raw\nHardcore, off the wall hip hop\nNonstop, settin up shop on your block\nWit glocks, let ya brain rot\nMob tactics, bustin' shots, there's a freeze on the pop\nWhat blood clot? Means no money, no honey\nAnd that's what make us better than you dummies\nSayin' all types of shit like Shaolin wouldn't last\nBut just like an automobile you been gassed\nPassed, just like the rest, you wanna come for test\nMy brain's half rhyme, the other half cess\nI've been blessed wit the success\nWhat did you except? Look at the way I catch wet\nFrom the projects, and I'mma live here\nTill I die, gettin' high, Shaolin Soldiers take over in '95\nAnd I'mma make sure all my shit is raw\nFor ya niggas who front, spell it backwards, war\n\n(King Just)\nHey good lookin', what you got cookin\nPack your nerve quick, I have this in the street shookin\nThe fucked up, niggas better duck\nSomebody call a bomb squad, 'cause I'm about to blow up\nBoom, there goes the building\nThe bomb makes a killa stackin loot to the ceiling\nWho dwellin and dealin', maybe I got the fuckin' feelin'\nThat I'mma make platinum, I gots to see the million\nI'm destined to buck fuckin' wild just like a Western\nThey goin' two in the quarter, and have mad sessions\nAin't no second guessin, I'm back, where's ya heart at?\nShaolin's on the map, Zoo niggas attack\nThe track, got my mind flippin a hundred miles a minute\nAnd as long as I'm in it, boy, I'mma finish\nA M.C. off, they got lost and tossed by the source\n'Cause I pay the cost to be the boss\nYou get flagged like Betty Ross and the Spangled Banner\nSlammin' shit more harder than fuckin' Thor's hammer\nThe ill manner, wit ill grammar\nWhen I get mad, I turn the opposite of fuckin' David Bammer\nThe incredible, unedible, turn backwards\nTerrible, cock a phony rappers offa pedestal\n\nYeah, how we on that Shaolin Soldier shit\nKing Just, the Mystics of the God\nSex, Money, and Cess and the Blas'e Blah\n\n", "album": {"title": "Mystics_Of_The_God_(1995)&&7378", "genre": "", "year": 1995}}, {"title": "Warrior's Drum", "href": "Warrior%27s_Drum&&606", "artist": {"unique_name": "King_Just"}, "lyrics": "Can I get the phat intro?\nThis is how you was gon start it off?\nYeah, knowhatimsayin?\nThis is the God, the Drunken Monk, King Just\nComin' through for the Shaolin crew\nBlack Fist, yo hit 'em wit a uppercut\n\nHeya heya heya, huh\nHeya heya heya, huh\nHeya heya heya, huh\nHeya heya heya, huh\n\n(King Just)\nHeya heya, can I get some?\nThe sounds of the Warrior's Drum\nOn the warpath, don't make me laugh\n'Cause you never in your life, wanna ever see the God's wrath\nI'mma chief that smoke weed outta peace pipes\nYo, bro, I'm half Indian, so you're right\nI'mma about to show you wit my mic sword\nYo Shaolin sling, come on raise the sword\nCharge, they all crowd from the Black Fist\nI got fudge in my mouth, they say that'll let your own wrist\nM.C.'s fall and they can't get up\nI do the rap, why, yes that's a cut\nHuh, right back at you, niggas better run\nOr feel the force of the Hell Razah's gun\nGupao, gupao, my style is wild chopped in the Shao'\nZoo, aow, aow, I can flip it acapello\nI'll make you jelly like Jell-O, figaro, figaro\nWho would think that the Just would go opera\nYou could ask Hammer, he know my shit is popper\nStopper, stopper, like Cuddy Ranks\nI'm takin' money to bank, and my moms I like I'd like to thank\nShaolin, Black Fist, they do the job\nAnd Just came back wit that ol' funky rhyme\nBring it\n\n(King Just)\nAnd there's a thousand M.C.'s, lined up against the wall\nTimber, they all gonna fall\nHassan Chop, yo I can't stop\nGivin' you that off the wall hip hop\nTo ya ear, make ya wanna cheer\nHallelujah, ch-ch grrrr, now I'm in second gear\nYo, I'm out of here, to get the mo' tical\nFrom the Meth-Tical, hit the budd' tical\nKnow I'm headed to the hotel\nBut I'll be pokin and strokin\nYo the hair, got Tical, got a nigga open\nHey daddy, who them those over there?\nShaolin Soldiers, huh, wait a minute, no one told ya\nThat I'm the nigga, that they call Stompy\nWho got the looks of a killa dead zombie\nI take 'em off, sure fast cannin ya tour\nThey couldn't catch my style if I was a baseball\nBases loaded, and I got my back gun\nBlaow, boom, bang, oh shit a home run\n*Crowd cheerin noise* Yo, the crowd goes crazy\nBring it, if you want, 'cause you really don't amaze me\n\n(King Just)\nLook who's back, it's the Hell Razah, raisin hell\nAnd I've been rockin' rhymes, since niggas been rockin' gazelles\nMy slang can bang, so I guess I be the man\nYou couldn't hang wit my style, if you invented the Ku Klux Klan\nI'm like AT&amp;T, I'ma reach ya through ya speaker\nI got more sole than a sneaker\nAsylum, I'm crazy, I guess I'm wildin\nMy stylin, is the record straight from the Shaolin\nBy the kiss of the Black Fist\nShit is sick, here to make ya wanna drown a fish\nUnder water, I'mma slaughter, like a change machine wit no quarter\nOut of order, run for the border\nThe hardcore rap act is back\nI stick out like a thumbtack, I wipe niggas off the map\nAnd I rhyme to get paid, 'cause when I raid\nI wouldn't wanna hear ya style wit a hearing aid\nStraight up crook, meaner than Captain Hook\nLook out, look out, stomp like Bigfoot\nAnd I don't give a fuck about a girl\nMy crew is more crazy than Bebe Kids in fuckin' Fun World\nI'm causin niggas doom, I mean sonic boom\nI'm fuckin' stupid, I write rhymes in the boiler room\nLike Krugger, funky dope maneuver\nThe Drunken Monk is so funky, they call me manure\nHorse shit, I flip shit, oh my God, I rip shit\nI talk shit, no one can shit, like I shit\nShit like this, get you upset\nBecause the shit that I was singin', was pumpin through ya projects\nHow much types must I say shit?\nWell, if the shit ain't worth the shit\nThen I don't wanna be wit the shit\nAnd then you be like \"Oh shit, he flipped it\"\nNow ain't that some shit kid?\n\nHerb like this, mound up and roll it out\n\n", "album": {"title": "Mystics_Of_The_God_(1995)&&7378", "genre": "", "year": 1995}}, {"title": "Move On 'Em Stomp (Remix)", "href": "Move_On_%27Em_Stomp_(Remix)&&8947", "artist": {"unique_name": "King_Just"}, "lyrics": "Shaolin What! Move on 'em, stomp!\n\n(King Just)\nHama-hama ley! As I fly through the air\nAppear, rip and tear just like a spear\nFreakin it, wit that ol' crazy ol' flow\n(There I go, there I go, there I go)\nYo, see what I mean, I'm fuckin' sick\nLight the bomb, tick-tick-tick-tick, boom\nAll I smell is terror, doom\nI be the nigga that escape from the patted room\nGoo-goo retarded, sickness, the shit\nWho put the \"Hey ya\" shit, on that first shit, yeah that shit\nWho spits words like you never heard, I'm absurd\nAh, gettin' on ya nerves\nCrazy, who could amaze me\nBrain stay cessted, I stay lazy\nDrivin' Miss Daisy, dukes\nShaolin stomps like boots, and we get deep just like roots\nAnd culture, I leave the style for the vultures\nI told ya, you never in your life should of fucked wit the Soldiers\nOf Shaolin, a/k/a Staten Island\nI heard the fuckin' kids be wildin\n\n(Profes)\nShaolin Zoo, who, Wu, Wu\nI deserve a medal for the clicks I be runnin' through\nChumps that front, catch lumps\nI'm runnin' down clowns, my shit is comin' down like a dump\nBlack chumps, sunk into the shit that I flip\nI bump, pumps, resultin in my triumph\nChumps who front get dissed\nI burn like syphilis, and you be that dick that try and piss\nPa Baby, you already saw\nWhile I be on some new shit, that I ain't even ready for\nI'm sick, but what you want me to do\nI come through, and you couldn't win if it was three of you\nIf you're concerned, I yearn to burn\nAnd if you're fakin, I straighten niggas out like perms\nEvery rhyme you wrote before\nBecause the Shaolin moves on more niggas than U-Haul\nThese niggas ain't no calm\nSo run for you gats, but until then the Shaolin stomps\n\n(Baby Pa)\nDo you know me? The Obiwan Kenobi\nClaustrophobic sick, bigger than Moby Dick, bastard bitch\nYeah right, save it for the judge\nBut it wasn't me, send us to the sumptuous slash ya M.C.\nSevere in the worst form, here comes the Swarm\nSound the alarm, now Pa drops the bomb\nWhile you're in the hall, look out below\nPa burnin, fuckin' wit my sick ass flow\nPing-ping like Ricochet Rabbit\nOr Quickdraw McGraw, 'cause this is the last straw\nAlakazam, I be the magician master\nThere she blows, and it Fall like Niagara\nM.C.'s be swearin they could flip the script\nBut ya best pour like Malky and don't be ridicolous\n\n(Leatha Face)\nA soldier, straight from the battlegrounds of Hell\nLyrically, I'm killin' M.C.'s like brain cells\nTill we, are precede to commit bad deeds\nA roughneck from the projects, live like New Year's Eve\nChicks on my dick, like my hand when I'm pissin\nIn fact, I got more tricks than a magician\nTo be, or not to be, a real M.C.\nDeal wit me, I stay black like B.E.T.\nShaolin, oh my lord, niggas is tryin' to front\nThey want beef, so give them craps what they want\nRhymes be down like members of the enterprise\nYou can't defeat me, so when will you realize\nYou guys get black eyes, when I smoke chocolate cha\nMy styles massive fly, like plains in the sky\nThe baddest brother in the Shaolin hemisphere\nIt's a nice place to visit, but you wouldn't wanna live here\n\n(Star)\nRelease, masterpiece constructed\nIf nigga is pussy, I leave 'em cherry busted\nDusted, who can fuck wit\nOr master absent minded bastard, burns crowds like acid\nYeah, I'm blowin' the spot wit a loaded glock\nNiggas get popped like a condom\nAnd tight twat, blaow, my Shaolin style causes death\nMy brainstorms are more deformed than birth defects\nA sick individual, rips more material\nIll type subliminal, calm the street criminal\nDisrespect, you'll get recked, kid, I'm serious\nThou shall burn like an infected clitoris\nNone can match me, technique's too nasty\nPussy punk chumps bleed without a maxi\nBring ya, who dare play me on the trigga\nI love guns so much, I bust nuts when I kill a nigga\nOut you end, the rugged top contender, surrender\nYou're style, I Bone like Linda\nYo, pass the gat, kid, so I could blast those\nAnd let off more shit than that split between ya asshole\nI maintain, to pull my frame, out the corn\nShaolin What! Move on 'em stomp\n\n", "album": {"title": "Mystics_Of_The_God_(1995)&&7378", "genre": "", "year": 1995}}, {"title": "Round 'Em Up", "href": "Round_%27Em_Up&&5995", "artist": {"unique_name": "King_Just"}, "lyrics": "Yo man, yo, I don't know man\nYo this rock thing got me buggin yo\nWord, I be buggin out and shit\nYo, yo\n\n(King Just)\nBaby are you ready? On the zone high\nOh why, must these bastards try\nTo test, my buddha cess, mine I remind\nThe Fist knew the time, and I came wit the rhyme\nFly, on top of the world\nI came to kick this shit for the boys and the girls\nTwirl, into the wind of Shaolin\nBegin where you want, and end where you in\nCome on, send, a message to you crew and your troops\nThat my Soldiers stomp like Timberland boots\nFruit, roll up, yo hold up, lucky\nMake your the 'cal is tight, packed in tuckly\nI might be, comin' at a project near you\nWit the Zoo and the Two, and the whole shaboo\nShebang, it's the God doin' his thing\nAnd it ain't no thang, but a chicken wing\nThe King, sits on the throne wit a bone\nAnd I'm known, from makin' a fuck wit microphone\nIn the zone on my own, always singin' alone\nAnd I'd be damn, if I take a fuckin' ugly bitch home\nRoam through the ancient tomb of doom\nA metamorphosis, that becomes a cocoon\n\nRound 'em up, move 'em up, lay 'em down (flat)\nShootin M.C.'s wit my lyrical (gat)\nNever had to front 'cause the Mob got my (back)\nLike that (like that) like that, like that\n\n(King Just)\nYo, I'm back, to set shit straight\nAiyo, waitin from the King\nYou never make it past the castle gates\nNorman Bates is my fate, but I gotta escape\nI fuckin' hate the plate, but I know I gotta date\nEscape to the next cut, and blow up, grow up\nAh, rhymes that'll fuckin' rot\nTo your ear, my style is sharp just like a spear\nI see fear, whenever the God presence is near\nClear, the way, 'cause I slay\nEveryday in May, and niggas don't come around my way\nYou better head for the door\n'Cause I get raw, plus I'm Shaolin stompin through ya floor\nI want more, pounds and sounds, I'm gettin' down\nLick 'em down, I represent place, home and sound\nPeep my style, I'm back wit the high pro-lo\nAnother flow, another sound boy over the rainbow\nAiyo, can I get a fat one? I'm back son\nDead men tell no tales, will be the outcome\nThe wild hon', hit ya so hard\nTo make a buck reign rock it to Meth\nAnd blow the fuck up\n\n(King Just)\nIt's the return of the bad h-h-holes\nNo one knows where I get my strange flow\nYou're slow, it's the Mystics of the God\nThe Sex, Money, the Cess, and the Blas'e Blah\nNo sellout, no doubt, 'cause I'mma represent\n'Cause Wayne's World, I'm excellent\nBah humbug, he'll catch a slug from the slug (blaow!)\nBlack Fist make the way while the Shaolin show love\nOh lord, that means it's my turn to rock\nHemp pump cock, as I'm smokin' up the block\nNonstop, I got skills to go on and on\nFrom dust to dawn, from night to morn'\nWord is bond, you're corn, will get eaten\nJust like a Terrier, I ain't scared of ya\nYo what's on in the area\n\nHarvard tactics from the Black Fist\n\n", "album": {"title": "Mystics_Of_The_God_(1995)&&7378", "genre": "", "year": 1995}}]