[{"title": "Take You Home", "href": "Take_You_Home&&4996", "artist": {"unique_name": "King_Tee"}, "lyrics": "(*Yawns*)\nAh man\nSuckers bite my stuff, man\nCan't get no sleep, man\n\nYo, what's up, DJ Pooh?\nNice to see you back, man\nFor 1990, right?\nFinna do it up\nBut I want you to do somethin' for me, Pooh\nYou could do me a favor right quick?\nW-won't you pump up the beat a little bit right here, come on, right here\n\nSuckers\nSuckers\n1990, y'all\nKing Tee back on the map\nAnd we gon' tear it up like this\nI wanna dedicate this song to all the L.A. rappers out there\nCheck it out\n\n(Don't turn away, I think you should listen) -- &gt; MC Lyte\n\nWell I'm the one for my treble, two for my bass\n3, 4, 5 just to stay on pace\nNow that I got your attention you'll be happy to know\nThat they call me Tee the King but King Tee's how it goes\nSo suckers, get your shit and get packed\nCatch the next boat out, supreme Tela's back\nAnd I'm funky once agaian, so run and tell a friend\nThey said I wouldn't last but I'll be here until it ends\nYo, I'm the king at being cool but get a load of this\nThey wanna label me best L.A. soloist\nI couldn't be like that, but then again I could\nCause half of you MC's ain't no good\nAnyway, hey, I got somethin' to say\nDirected to every MC in L.A.\nYou run up on the King - huh, how dumb\nYou knew from the beginning you shoulda brung a gun, son\n'Cause I be shootin the gift like it's a gift\nTake the punk, slide 'em up just like a spliff (*inhales*)\nThen everything's cool and copastetic\nI wrote the book on being cool - oh, you read it?\nHow'd you like the part where I tell you how to walk\nThe kinda clothes to wear, the use of slang in your talk?\nNo need to look around cause there ain't no clone\nKing Tee came to take you home\nCome on\n\n(You can make it)\n(Don't turn away, I think you should listen)\n(You can make it)\n(Don't turn away, I think you should listen close)\nI came to take you home\n(You can make it)\n(You can make it)\n(Don't turn away, I think you should listen)\n(You can make it)\n(Don't turn away, I think you should listen)\n\nNow this tune right here allows you to get funky\nLiterally you can do what you want, see?\nI'm more like the pilot or the driver of the scene\nOr somethin' that you usually dream\nYeah, I'm manufacturin the sickest metaphor\nLyrics you're not ready for\nHear it, I keep a steady score\nOf suckers and muthafuckas who like to suffer\nI wear big ropes in clusters\nAnd I execute, never wore a sexy suit\nI wear khakis with a t-shirt and hiking boots\nA rare fashion with the gangster touch\nBecause Ballys don't mix and turtlenecks suck\nBut hey, I be crashin, throw in a accent\nMaxin while I'm waxin the boots with passion\nHappens to be one of my favorite attractions\nThe name's King Tee, but the T's for taxin\nPhoney MC's, them sucker punks wanna riff\nJust because I wanna give the party a lift\nYou know, build your spirits expand your horizon\nThis particular production is mine's\nAnd E-Swift's, the DJ E-Swift to be exact\nHolds a hypnotizin scratch, make the others look wack\nSo look all you want cause there ain't no clone\nKing Tee came to take you home\nCome on\n\n(You can make it)\n(Don't turn away, I think you should listen)\n(You can make it)\n(Don't turn away, I think you should listen)\n(You can make it)\n(Don't turn away, I think you should listen close)\n(You can make it)\n(Don't turn away, I think you should listen)\n(*E-Swift cuts up*)\n(I think you should listen)\n(I think you should listen)\n(I think you should listen close)\n(Don't turn away, I think you should listen close)\n(Don't turn away)\n(Don't)\n\n", "album": {"title": "At_Your_Own_Risk_(1990)&&8049", "genre": "West Coast Hip Hop", "year": 1990}}, {"title": "On the Dance Tip", "href": "On_The_Dance_Tip&&8269", "artist": {"unique_name": "King_Tee"}, "lyrics": "(Dancefloor, baby)\n\nHa-ha\nWhat's happenin'?\nWhat's goin' on, man?\nChillin'\nFinna do somethin' a lil' different, youknowmsayin?\nGot my man E-Swift in the house\nE-Swift, you wanna dance?\nAll right come on, let's dance now\nBust it\n\nGoin' out on the rhythm and blues tip\nWith my man Rashad and Bronick\nWe got Bob in the house\nYeah\nAnd I'ma bust it off like this\nOn the first verse\nCheck this out\nBust it\n\nNow dancers, here's another hit for your collection\nTake a deep breath, let's start sketchin\nMoves for the dancers to get into\nI'ma wait on you, now here's your menu\nJust order what you want cause you know\nI can rock a slow or a swing tempo\nSo swing to it, it ain't nothin' but a good feelin'\nAnd if you're willin' I'ma tell you the deal then\n\nI got to see you move it (on the dancefloor, baby)\n\nYo, that's how we doin' it in 1990, youknowmsayin?\n\nI got to see you move it (on the dancefloor, baby)\n\nYeah\n\n(*E-Swift cuts up*)\n(Get funky with it)\n\nAin't it funky now\n\nHold up, hold up\nWhat I wanna do right here is talk to all the dancers\nThat call theyselves dancers but they really can't dance\nI'm finna teach you how to do it, all right?\nCheck this out\n\nNow all you gotta do is get loose\nYeah, show you got juice\nIf punks wanna jump, run 'em up and I shoot\nSlick, slick poetry for those who got couth\nAnd if you'll dance even if you can't dance\nEnhance a rhythm that'll glance\nUp against your body as the music just swings\nKnockin' out the suckers now who's left? (Kiiiing)\nTee, yeah, that's mee, see\nThe cool gangster, the gangster, that's me\nSo just skip while I make that grip\nDon't worry about a thing, I'm on a dancin tip\n\nI got to see you move it (on the dancefloor, baby)\nYeah\nLike that, yeah, y'all doin' it right\nCheck this out\nE-Swift\nI got to see them movin (on the dancefloor, baby)\nAll right, yeah\nWhere?\n(On the dancefloor, baby)\n\n(*E-Swift cuts up*)\n(Do what you want)\n(Let's have some fun y'all)\n\nNow keep on movin, better yet keep steppin\nYou know, from the right to the left and\nDance all night till your knee caps break\nYou can do the Biz Markie, then the Heavy D Shake\nIf you like to boogie from sun to the moon\nWell, cut the rug to my rhythm and blues tune\nJust remember if the phonograph skips\nDon't worry about a thing, we're on a dancin tip\n\nAnd I got to see you move it (on the dancefloor, baby)\nYeah yeah\nCome on come on come\nE-Swift\nWe got to see you move it (on the dancefloor, baby)\nYeah\nPeace\nI'm outta here\n\n(Do what you wanna do)\n(On the dancefloor, baby)\n(I know you got the feeling, let's dance)\n(Let's have some fun)\n(On the dancefloor, baby)\n(I know you got the feeling, let's dance)\n(On the)\n(I know you got the feeling, let's dance)\n(On the)\n(On the)\n(Have some fun)\n(On the dancefloor, baby)\n\n", "album": {"title": "At_Your_Own_Risk_(1990)&&8049", "genre": "West Coast Hip Hop", "year": 1990}}, {"title": "3 Strikes ya Out", "href": "3_Strikes_Ya_Out&&990", "artist": {"unique_name": "King_Tee"}, "lyrics": "{*Whispered*}\nLove me... give me love...\nGive me love food...\nGive me love, so that I can... kill...\nGive me love, because I can... kill...\nHe's not real... (the devil) and she must die...\nDie... (he is the son of man, he is the son of God)\n{*Beat drowns out whispered vocals*}\n\n(King Tee)\nThree strike you're out they're makin' niggaz behave\nNo more slaps on the wrist gettin' 90 days\nWelcome to the next level, it's the new world order\nSnatch ya like a tractor, might kill ya for a quarter\nI put that on my moms, that's on everything I love\nNigga what? Catch a L, make you cry like a dove\nSo sucka free is the only way for me\nYou don't get paid just for bein O.G.\nWe've been had, we've been tricked, we've been played\nRight when we, went left, for what? We shoulda stayed\nStressed all the homies just to show they mean business\nRushed 'em with the quickness, killed 'em with the sickness\nTried to save his life, give him CPR, huh\nSomethin' for the lungs, fat African drums\nSo clear up your sinus and keep your nose clean\nKhakis so hot it makes the one-time stop\n\nThree strikes, you're out, then a nigga pays\nWe in the cage, black man is bein slayed\nThree strikes, you're out, then a nigga pays\nWe in the cage, black man is bein slayed\n\n(King Tee)\nGet with the lyrical miracle whippin up\nGingerbread cookies out you rookies, huh\nI can't stands no more, grab the floor\nHit the deck when I let loose the tec (c'mon)\n'Nique, freak any beat nigga\nWestside 106 (?) Street, uh\nThe loco's, chocolate like cocoa\nGet your punk-ass balled up in the trash (Ah!)\nYou stepped on my stars, motherfucker say sorry\nThis wild style's like lion country safari\nThis is for my loc's back at the Ponderosa\nCheck my file, bring it to trial\nGet with that new, ninety-fo' shit\nYes it's funky like a jackass, don't even trip\nI got pages and pages of metaphoric phrases\nToo complex for the human eye to catch\nIt's the, gangsta boogie, do you want a example\nOr do you just wanna taste a sample?\nOut of control, gone, warped, zoned, toned\nHand me the heater, I need the speakers\nSparks, flames, no name but peep game\nSmoke like a choo-choo train\nIt's the criminal minded nigga King Tee\nWith the Westside Riders, comin' creepin' crawlin like spiders\nWe've been bit by the dog, call the catcher stretcher\nJudge Fletcher betcha, raise your blood pressure\nThe unsolved mystery, mixed up our history\nPut us in the twist, we no longer exist, like\n... Dinosaurs disappeared, then it's like\n... Mine and yours disappear, so it's like\nServin' soon, here comes your doom\nRight when the world go ka-boom, so am I\nSane, or, sick in the brain?\nOr do everybody style sound the same? (Yep)\n\nYeah... beat terrorist... (?)\nTR, the funk ignitor\nMy nigga King Tee with the funky West shit right?\nCheck this out...\nBeat terrorist, beat terrorist, beat terrorist, beat terrorist, (?)\n\n", "album": {"title": "IV_Life_(1995)&&758", "genre": "West Coast Hip Hop", "year": 1995}}, {"title": "At Your Own Risk", "href": "At_Your_Own_Risk&&540", "artist": {"unique_name": "King_Tee"}, "lyrics": "It's at your own risk, sucker\n\nYo, whassup? Yo, what's happenin?\nE-Swift, you cuttin the records nice boy\nDJ Pooh whassup man? We all chillin\nYo, yo, J-Ro's in the house, we all cold coolin out you know what I'm sayin?\nAnd I'ma bust it off like this for Compton\n\nWell, look who sprung up, comin the fuck up\nI came in the place to let you know what's up\nwith a bunch of trunk jewellery\nTwo or three fat gold chains, ring plates with my name on 'em\nYeah I rhyme fly, real fly Hobbes\nI wear Nike's cause I run from the cops\nPops taught me lots he said \"Toys are for tots\"\nAt four, bought me a box, when I was six I wore a jock\nCause my jimmy was gettin kinda big\nAt nine I was a kid but I took my first swig\nHugged that Olde English beer\nSo my peers wouldn't think that I was queer\nYeah, right off I got the title of a gangsta\nPranksters run because they know that there ain't a\nPerson, runnin a verse on like this, hahahaha\nWhassup?  This at your own risk, sucker\n\nThis at your own risk, sucker\nPooh man fuck it\n\nPeople always say, \"Are you the King of the West?\"\nBut there's always some pest who try to put you to the test\nEven though, they know I'm King, I'm on a higher level\nI even dust the church and sold their sold to the devil\nI mean really, how you think I'm livin?\nOn the strength I'm livin like it's Thanksgiving\nSo yo, whassup turkey, tryin to jerk me?\nYour rhymes don't work see, you can't hurt T\nThe almighty individual\nYou said you knew, but I don't think you really know\nAbout the K-I-N-G super cool mack daddy\nI drive a Caddy, and I'm livin fatly\nHad me on stage in a rage\nYellin what's what you know, that's how I get paid\nMade my mark but rappers still insist to diss\nBut yo it's at your own risk sucker\n\nSup? It's at your own risk\nAiyyo, E-Swift, bust the break\n\nVerse three is another one for those to remember\nKing Tee is the champ, smashin all contenders\nFor those who disbelieve, just step in my direction\nI'm snappin arms, legs and even necks and\nSuckers who thrive to drive me crazy\nYou know the ones who front tryin to amaze me\nTake it as a warnin cause I'm hopin that you don't diss\nBut get a load of this, it's at your own risk, sucker!\n\nYo, it's all about me and DJ Pooh and E-Swift\nRockin the house, you know what I'm sayin?\nWe got Walkman in the house\nWe got J-Ro in the house\nWe got (??)\nYou know what I'm sayin we cold chillin, you know\nI wanna send this record out, to the Piano Man\nPiano Man, won't you play somethin for me\nAight, get busy, right here, c'mon c'mon\nGet funky, get, get funky, c'mon c'mon\nGet funky as oh, oh yeah\nGet funky, aw oh shit\nIt's at your own risk suckers, know what I'm sayin?\nYeah, E-Swift, scratch that in\nAw yeah\nAw you're doggin it man, you know what I'm sayin?\nSee ya\n\n", "album": {"title": "At_Your_Own_Risk_(1990)&&8049", "genre": "West Coast Hip Hop", "year": 1990}}, {"title": "E Get Swift", "href": "E_Get_Swift&&8072", "artist": {"unique_name": "King_Tee"}, "lyrics": "Get Swift\n\n(Everybody's dancin)\nGet swift\n(Quiet on the set)\nDJ Pooh's in the house\nBut yo, this is for my deejay\nAll right, check this out\n\n(King Tee)\nThis is for you little weak deejays\nThe weak record spinner, the weak P.A.\nWhoever's in charge of the turntable equipment\nYou haven't heard cuts until you heard the ones Swift gets\nYes, when I rhyme he keeps the break flowin steadily\nNever off-beat so suckers can't get ahead of me\nYour deejay's had it, we're terminatin his membership\nE's back, now come again with some different shit\nYou wanna learn about cuttin' and scratchin and mixin\nHe'll be fixin to show you some good tricks and\nA new style shown to those that's worthy\nLord have mercy, he's number uno, first, E\nSwift we call him Swift because he's swift on the cut and scratch\nNo one can match or catch, then stand back\nFor those who wanna see him, I give you a good tip\nHave a seat and watch E get swift\n\n(*E-Swift scratches*)\nWatch him\n(Are you ready)\nWatch\nYeah\nWatch E get Swift\n(Are you ready)\n(Ready) (ready) (ready)\n(Hey, listen to the man)\n\n(King Tee)\nNow what you just saw is probably funky to you\nYou and your crew (but what about them girls?) them too\nWho wants to step up, some never kept up\nThey wanna flex up, so E-Swift wrecks up\nShop, hops, so how could you diss E?\nYou need to play like Janet and just miss me\nWith that conversation, that blah-blah-sation\nE, bust a rap while I go on vacation\n\n(E-Swift)\nE-Swift, the golden deejay with the knack to make a track\nTo make you dance till your back snap\nPooh on the drum, the cuts - mine\nK-i-n-g Tee writes the rhyme\nSo wack deejays who run off at the lip\nThe ones who talk shit while your records skip\nIn a battle (battle him) (*record skips*) you need mo' practice\nMy cuts are more sharper than the needles on a cactus\n\n(King Tee)\nYo, that was dope, E-Swift\nCheck this out\nBut you got some dope scratches and cuts\nYo, yo, yo\nBust it\n\n(*E-Swift cuts up*)\n(Turn it out)\n(DJ)\n(Turn it out)\n(Listen up)\n(Mr. Deejay)\n(Listen up)\n(Hey, listen to the man)\n(He is the master of a scratch)\n(Huh-huh)\n(He is the master of a scratch and cut)\n(Huh-huh)\n\n", "album": {"title": "At_Your_Own_Risk_(1990)&&8049", "genre": "West Coast Hip Hop", "year": 1990}}, {"title": "Let's Get it On", "href": "Let%27s_Get_It_On&&8095", "artist": {"unique_name": "King_Tee"}, "lyrics": "(Singers)\nLet's get it onnnnn... it's time to get down\nLet's get it onnnnn... it's time to get down\n\n(King Tee)\nHuh, for your convenience I'm fully equipped with the madness\nPlus I bring joy to the sadness\nMr. Insane chose to bring the noise\nI flex out the best out, and I brought my boys\nFor the function, wait bring the pumps and the bumps in\nNiggaz wanna trip I got pumps in my trunk then\nI rule all I survey, bust a move\nAin't nothin' changed but the god damn groove\nI bring forth fat shit on the money\nHomies wanna trip but I'm chillin' with the honies\nMy girl (?) and Nikki Nicole, gets papes\nI brought Sable just for old time's sake\nThe real ruler wrecks records, I mean wrecks wombs\nBut now I got the psychadelic tune\nI dedicate this to my true black sisters\nNiggaz bump this while they rollin' on them twisters\n\n(Singers)\nLet's get it onnnnn... it's time to get down\nLet's get it onnnnn... it's time to get down\n\n(King Tee)\nYo I told you man I don't play around with the music\nI'm funkdafied, blowin' up acoustics\nI'm rather remarkable when I kick the matter\nSkilled in the field of rough grammar\nI electrify and intoxicate the moment\nI branch out and crush my opponent\nIt's +Super Nigga+ in the skies, wild mannered\nReportin on the sound, you got to gets down\nLike I toldja, and peep you can write it in your book\nCause, yo - that's that shit with that Soul Train hook, yeah\nThe blackness gets stronger, the soul gets deep\nMake room for the Alkaholik Sheik\nI persist to be the infinite all-time great\nI'm told that my name gained weight\nSince the past, so hell, let me take it on the blast\nYo yo, pass the rug before I bust my ass\n\n(Singers)\nLet's get it onnnnn... it's time to get down\nLet's get it onnnnn... it's time to get down\n\n(King Tee)\nHey nig bust the funk, I feel somethin' comin'\n+Tales From the Crypt+ or I might just be buggin\nNo propaganda, I stand outstander\nA +OutKast+, like them kids from Atlanta\nI perform microphone exorcism on rappers\nI cast out the demon from them bastards\nAnd oh Nikke, you did the track, what's the plan?\nStep to the mic and show these hookers how to slam\n\n(Nikke Nicole)\nFlash for a style, Nikke is the picture\nOpen as I enter, I'd like to send a\nTrack that's fat, constant non-stoppin'\nFrom Brooklyn to Compton, my shit is stompin\n... I like to parlay on the Ave\nEvery now and then smoke a blunt, sip a Heineken\nI know a King named Tee, Tha Alkaholik\n\"I can rock a rhyme no matter how you call it\"\nProduce hits from the bassment\nI make loops, if they're used, I replace 'em\nNikke Nicole, the soul sound, bring the whole crew\nWe can all get down...\n\n(Singers)\nLet's get it onnnnn... it's time to get down\nLet's get it onnnnn... it's time to get down\nLet's get it onnnnn... it's time to get down\nLet's get it onnnnn... it's time to get down\n{*Fades out*}\n\n", "album": {"title": "IV_Life_(1995)&&758", "genre": "West Coast Hip Hop", "year": 1995}}, {"title": "Drunk Tekneek", "href": "Drunk_Tekneek&&5458", "artist": {"unique_name": "King_Tee"}, "lyrics": "(Well all right)\nOh shit\n\nMany, many asked if I knew the way to go\nI thought I knew the answer, it seems I wouldn't, so\nI picked and I picked, for the label I searched\nI slipped and I tripped for the pop, it didn't work\nSo now I take the stage of my what? 3rd comeback\nNow I know the tricks of the trade, and where the slum's at\nBlows to the chest, buckshots from the gauge\nPage after page King Tee takes the rage\nLord have mercy when I pick up my pen\nThen I ask the Lord to forgive me for my sins\n'Cause I get drunk when I get trucked (*shots*)\nThere go some gunshots, wait - I gotta duck\n(Get down, fool, get down...)\nWhat everybody runnin' fo'? (Awww shit!)\nCan't take the plug of a .38 slug\nCan't take the drug from the teenage thug\nSo I'ma break loose and do a flip-flop top\nAnd land on my feet and show a drunk tekneek\n\n(Couldn't walk a straight line)\n(Ladies and gentlemen, I...)\n(Couldn't walk a straight line if you let me crawl)\n(Leanin to the side)\n(I know I'm drunk, man)\n(Leanin to the side, people everywhere)\n(Well all right)\n(Wants to get funked up)\n\nM-M-M-MC's seem to get souped when they group\nWith a big name, but see, none of them is game\nFor the royal, loyal, the one that stole yo\nCoupe De Ville when you thought you could chill\nOn my street, with your freak, to freak me, the freak\nPlayed out along the week and fell steep in the creek\nSo I'ma put my crown upon the peak\nAnd do it just for the thieves with the jeeps\nI know you feel scared, I got a criminal path\nFor a laugh I watch devils get whipped by Shaft\nPooh has a mack-10, E-Swift's in the Benz with a glock\nTakin' some young girl's cock\nI grab that geno-St. Ides by the stack\nNever smoked crack, but I drunk a lotta 'yac\nMostly by the cup, grabbin my nuts to the beat\nHey yo, it's the drunk tekneek\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Can This Be Real", "href": "Can_This_Be_Real&&752", "artist": {"unique_name": "King_Tee"}, "lyrics": "Yo\nWhat's up\nKing Tee's in the muthafuckin house\nGot my homeboy Young Floyd in the house\nJ-Ro's in the house\nBut yo\n\nNow here's somethin' everybody can relate to\nI know you hate to, but I feel great to\nBe the man to shake you, awake you and make you\nStop sleepin', and I do what it takes to\nBring a screechin halt to the snoozin\nFirst listen to the jam before you start choosin'\nAnd refusin, sayin' you can't hack it\nYou never even bothered to take it out the jacket\nPut it on the turntable, have a listen\nThen if it's wack, start dissin\nNow I understand why you're dissin my cut\nSo I spit in my foot and stick my fist up your butt\nCause you have no business, really in this\nAnd I have no time for that diss-diss\nI shoot a rhyme at you like I'm shootin to kill\nAnd you can do is ask yourself, can this be real?\n\nNow this song, I dedicate it to the sleepers\nNothing real hard, just a little teaser\nFor those who told those that the King Tee was done with\nNo, not quite, yo Pooh, pump it\nSuckers don't front, I know it's me you admire\nI take your girl, set her soul on fire\nI use the mic like a gun and my rhymes like ammo\nI go Tyson while others go Rambo\nPoo putts are warned, break north while you can, bub\nGive up rappin', join my fanclub\nI'm the rap reverend, hip-hop evangelist\nYo, I can handle this, pass me the canabis\nPro rap artist, and my rhymes are kinda raunchy\nStart with somethin' smooth, end with somethin' punchy\nSee, I can rock, funk, rock, reggae or salsa\nHeavy metal with some soul, disco at the casa, man\nJust to the point of a final conviction\nTee does the rappin', E does the mixin\nSo if you're still sleepin', yo, that's ill\nBut when you're awake, what's your question?\n\nTell me, can this be real?\nLet me see if I can bust this one off\nRight here\nOne take\n\nAs I resume with my rhymes or should I say continue\nYou got the nerve to try to pretend you\nDon't like what I'm doin' or sayin' so far\nBut usually when I'm done you're satisfied, of course\nI don't front or fake, don't base or sniff\nDon't rob or steal or shoot dice and pimp\n'Cause I love to hang out with my posse and chill\nYou might think I'm a thug, so think what you will\nI got a girl with a curl, and a homie named Sonny\nNever smoke crack, cause the shit smell funny\nKing Tee, my alter ego, there's not to be a sequel\nSuckers try to diss me when I entertain the people\nHey, I'm a murderer, your girl, I'm servin' her\nYou feel like beefin, hah, the nerve of ya\nI hit you so hard, it make your mother feel dizzy\nBack up, punk, the King came to get busy\n\nTell me, can this be real?\n\n", "album": {"title": "At_Your_Own_Risk_(1990)&&8049", "genre": "West Coast Hip Hop", "year": 1990}}, {"title": "Duck", "href": "Duck&&6267", "artist": {"unique_name": "King_Tee"}, "lyrics": "King Tee:\nHey! Here comes the funk of the future\nAnd I can rock a rhyme from Perquorma to Hoover\nThe westside kid, quick to do a bid\nJust watch me cock the glock and make room\nShit man I got a 12 gauge with the infared scope\nI found a Tec 9 it use to be a radio\nBut now I'm a G, psycho, crazy\nFuck what you say and buck buck and I'm suazy\nIn my rag coup, front and back and it's quick\nPunks with bump and that 3 wheel shit\nCause that's all you need when you need to be poppin'\nBust a U-turn on 3 wheels by the cops and\nDamn if feels good to be triflin', you know what I'm sayin' 'cause?\nWho got the wallet, 'cause I'm buzzed\nI got the black mack-11, sendin' fools to heaven\nGet the fuck out my way, this is Compton fool just...\n\nDuck!Duck! I'm about to bust some rounds.\nDuck!Duck! I'm fiendin' to bust some rounds.\nDuck!Duck! Yeah, I'm about to bust some rounds\nDuck!Duck!\n\nKing Tee:\nYo check it, they be like \"He's a maniac!\"\nYeah, bitch ant that's real, get the fuck up out the car and just peel\nYo punk I said right before I crash you in the grill\nWith the ass of my glock, watch the blood spill\nGangstas got love the nigga King Tee\nJust ask 'em who's the great weight, just watch 'em scream me\nQuick with the punch, rollin' like clunch\nComing with the real shit, runnin' with a bunch of crazy niggas with wires\nHammers and plyers, your money and your blood\nPlus the daytons and them tires\nI be goin' so low, you can't get under\nNiggas can't see me, ask Stevie Wonder, blazed in the chronic\nBumpin' Delphonics, and my shit's screamin' like that group Onyx\nBut hey, I'm the man that'll Bust That Ass open\nWhen I was young me BB gun even has a scope so...\n\nKing Tee:\nGod damn it's King Tee with the funky bumrush\nSmoke a lot of herb, but I never hit the dust\nI can wreck them efx 'cause I ain't got my check baby\nThis ain't no punk shakin' shit, I'm goin' crazy\nI think I'm goin' out of my head (say what!)\nI said I think I'm going out of my head, so E-Swift\nSince you rule in the cuts, give me the gun and just duck, come on\n\nE-Swift:\nYo, I got a black case but it ain't for the mase\nIt's for the 4-4 I use to blast you in the face\n'Cause I be actin' kind of triflin' like my nigga Tela\nCock the hammer blow you out your socks and your Filas\nWhich way did he go? Which way did he go?\nNiggas don't know, I got to play the down low\nPunks jump up and get blasted to the ground\nSo motherfucker duck, I'm about to bust a round\n\n", "album": {"title": "IV_Life_(1995)&&758", "genre": "West Coast Hip Hop", "year": 1995}}, {"title": "King Tee's Beer Stand", "href": "King_Tee%27s_Beer_Stand&&7599", "artist": {"unique_name": "King_Tee"}, "lyrics": "* This song was originally a St. Ide's Malt Liquor commercial\nIt's appearance on promotional St. Ide's mixtapes caused\nPublic outcry, and both the tape and the commercial were pulled\n\n(King Tee)\n\nNow step up, to the King Tee's beer stand\nAnd let me know what beer is grand\nNo no wait, I got somebody that might convince ya\nHold up hold up wait\n\n(Ice Cube)\n\nOnce again it's on, I'm goin' out the front do'\nIce Cube in the glass house, headed for the sto'\nTo get a beer that's better than the rest\nThe S-T-Period-I-D-E-to-the-S\nAnd it'll put hair on your chest\nIn the black can, so won'tcha grab a six pack and\nGet your girl in the mood quicker\nGet your jimmy thicker, with St. Ide's Malt Liquor\n\n(King Tee)\n\nHold up hold up\nSo when you get a forty, roll to the spot\nHug and kiss your girl and screw the cap off the top\nAnd get a taste of the beer that makes you tingle\nAnd just remember that jingle\n\n(Singers)\n\nHere's something that sweepin the nation by surprise\nIt's that fabulous malt liquor they call St. Ide's\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Just Flauntin'", "href": "Just_Flauntin%27&&2746", "artist": {"unique_name": "King_Tee"}, "lyrics": "Hay-ya!\n'Sup\nGot my homeboy Jazzy Ren in the house\nThis is the mighty King Tee\nAnd my homeboy DJ Aladdin is in the place\nBlunt-smokin' Mike\nAnd I'ma flaunt these lyrics right here\n\nMoves - I got moves for the mind\nKind of weary but if you hear me, you'll find\nNo one could conquer the Kingdom I resurrected\nPerfected this, watch out, there's a hectic\nMan on the stage, screamin out a page I wrote\nThe type of shit MC's wanna quote\nAnd get broke off somethin' real swell\n'Cause I can tell you try to swell when you bail\nBut you ain't big, don't try to stick out your chest\nJust phantasize you bein the best\nNot a clear picture, huh, not vivid\nMediocre MC's can't deal with this\nAnd what you're hearin now is Tha Great\n(Is that right? - Oh yeah, he's back, for haven's sake)\nYes, I'm comin', I'm bringin' what you're wantin\nIt might sound like I'm goin' off, but hey, I'm just flauntin\n\n(Suckers try to knock him but they never succeed) --&gt; W.C.\n\nBack at home I got a throne where I sit\nPiecin up metaphoric bits\nMy style is the quiet, cool gangster type\nBut when the 40 hits, it gets hype\nNiggas can't understand and trip\nWhen I be rockin' that old school shit\nThat I used to play when I rolled like a professional\nHittin side to side in my fo'\nFlauntin the technique just like when I speak\nMy words come above the average peak\nE can get swift with a scratch\n(*E-Swift scratches a quote*)\nPeople keep askin: does King Tee still have his Coupe?\nOr will he flip and make a song like 'Knockin' Boots'?\nCome on, hop, picture that on a flick\nI ain't goin' out like a trick\nNo matter what you do, I always pop up, troop\n(Like what?) Sort of like if I was wild rumour\nAnd this is how you pump it when you're livin' in Compton\nCause it ain't about nothin' but flauntin\n\n(Suckers try to knock him but they never succeed)\n\nYeah, I'm just flauntin'\n\n(Suckers try to knock him but they never succeed)\n\nBreak it down\n\n(Suckers try to knock him but they never succeed)\n\nCome on\n\nNow homes! (What up?) Homes!\nI need headphones to hear the funky tones\nNo more switchin, I'll pitch the bitch and\nNow we're gonna swing\nWith the Coolest King\nThe imperial\nI'm the one that makes you go buy your stereo\nSo you can hear me flow\nAnd bro, on the microphone I'm a flexer\nYou got played, and on the mic you're a extra\nI go deep for the dope style and I stay sharp\nFrame my lyrics up like art\nMC's keep on runnin' cause my tracks are stunnin\nBack in '85 is where I spun, and\nUp jumps the crowned royal King of Cool Rap\nAnd when I rock the joint, they be like \"Who's that\nFly rappin' nigga?!\" and rappers be like, \"Pull the trigger\nLet's assassinate King Tee Tha Great\"\nBut faith keeps me on top of the crop\nWith a 40oz. of beer and a blunt full of pot\nAnd this is for the suckers that be frontin\nIt's King Tee Tha Great, in '92 I'm just flauntin\n\nBaby!\n\nJust flauntin'\n\nI wanna say peace to my homeboys DJ Aladdin and DJ Pooh\nMy homeboy MC Jazzy Ren\nBlunt-smokin' Mike\nYouknowmsayin?\nAnd we outta here\nOn out\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Where'sa Hoe Sat (Cont.)", "href": "Where%27sa_Hoe_Sat_(Cont.)&&6755", "artist": {"unique_name": "King_Tee"}, "lyrics": "\"Warning..\"\n\n(King Tee w/ a voice modulator)\nAh...\nWhere da hoes at? Where da hoes at?\nWhere da hoes at? Where da hoes at?\nWhere da hoes at? Where da hoes at?\nWhere da hoes at? Where da hoes at?\n\nPlease can I go, huh, please can I go?\nI don't wanna kick it in your pocket no mo'\nI need some pussy bad, I need some pussy bad\nAnd I don't give a fuck if the bitch is on the pad\nMr. Applebaum, you gotta put me on\nTo fuck Anita, pump up the bass and not the tweeter\nHuh, I really need her, huh, I really need her\nOr if you know another bitch then I would like to meet her\nHuh\n\nWhere's the hoes at? Where's the hoes at?\nWhere's the hoes at? Where's the hoes at?\nWhere's the hoes at? Where's the hoes at?\nWhere diggy diggy diggy where's the hoes at?\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "A Hoe B-4 Tha Homie", "href": "A_Hoe_B-4_Tha_Homie&&1805", "artist": {"unique_name": "King_Tee"}, "lyrics": "(Feat. Deadly Threat and Ice Cube)\n\nYo nigga, let's go scoop up some of these hoes at the 'Paradise', man\nHey man, ah - I'm engaged now, man\nWhat?\nI'm engaged\nTo that bitch?\nAw man, don't be talkin' about my woman like that\nOh, now you're gon' trip on me\nWait, wait, hold up, hold up\n\n(VERSE 1: King Tee)\nHow you gon' go and put a hoe before me?\nWhen I'm the one that helped your broke ass on the streets\n'Damn, I'm starvin, what you got to eat?\nI'm short, I need a place to sleep'\nOh, but amnesia, that damn skeezer\nMade you forget who was down witcha\nI thought birds of a feather flock together\nAnd don't a damn thing change but the weather\nBut now I know the real, I guess I had it all wrong\nWe used to hit the Ides until the shit was all gone\nWhere was she when you needed niggas off your ass\nAnd who'd you come to get to go blast?\nNot that once-a-month-bleedin, always on her knees\nSuckin every Tom, Dick and Harry like a berry\nI seen her with a trick at the Motel 6\nAnd you still tryin' to get that bitch Afro Fix\nShe got you by the nuts, playin' with your wiener\nWrapped around her finger when the last time you seen her\nWell, when you do, bust her lip\nAnd if you don't, you'se a bitch\nSo sit down when you piss, muthafucka\n\n(It's a shame, but it ain't no thang to me) --&gt; Deadly Threat\n\n(VERSE 2: Deadly Threat)\nThe bitch got you gone, talkin' on a phone\nTellin' muthafuckas when you see me, it's on\nBut little do he know that she a zero\nAnd I'm still her favorite superhero\nSee, I got the 411 on a hoe\nJust like I was tellin' you before\nYou're just a piece of the mission\nGuess where her lips been?\nI told you don't be kissin', but you don't listen\n(King Tee)\nYeah, Jaws (Jaws) Jaws the only hoe I ever saw\nThat could suck a basketball through a straw\nShe don't like niggas with Nissan trucks\nUnless they got the monster bumps\n(Deadly Threat)\nThat's right, honey, bunny's money-hungry\nAnd she'll frame ya, she's out to getcha\nGet the picture, cause the bitch'll\nTake you for a long-ass ride like the hitcher\nSo don't be surprised if they find you in a ditch\nWith your guts hangin' out lookin' like Top Ramen\nAnd when I see the bitch, I'm bombin\n'Cause she's a false tenderony, plus tossed balony\nAnd she ain't your home, she's a hoe\nDon't put a hoe before the homie\n\n(Hey yo bitch, you better tell em) --&gt; Ice Cube\n\n(VERSE 3: Ice Cube)\nWho's wearin the pants, who's wearin the pants, nigga?\nIf you ask me, I think that her dick is bigger\nThan your little dick, and I'm tellin' you, Jay\nThe bitch got you locked down like Pelican's Bay\nNow I told you if you fuck with the hoe\nShe's guaranteed to have you trippin'\nAnd me and you set-trippin'\nI told my muthafuckin crew\nTo kidnap the hoe, and they came back with you\n(King Tee)\nI can't fade a nigga that's bitch-made\nKool-Aid pumpin, tell a bitch somethin'\nShe'll have your ass cookin dinner\nWhile she's lettin every nigga in her hood run up in her\n(Ice Cube)\nGot you runnin' like Bruce Ginner, and the hoe be\nPussy-whippin your ass like Toby\nNow you act like you don't know me\nOnly a mark'll put a hoe before the homies\n\nWord - this muthafucka is different\nYeah\nTell me your secret\nNot just any secret\nJust answer one question for me, baby\nDo you love me?\nI love you\nVery, very, very, very much\nBaby\nCan I come pick you up and take you shoppin'?\nSpend all my money...\nI love you\nI love you\n\nDon't put a hoe before the homie\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Super Nigga", "href": "Super_Nigga&&9947", "artist": {"unique_name": "King_Tee"}, "lyrics": "(DJ Pooh)\nIt's the P-double-O-H in the sky\nI don't need a cape 'cause I'm already fly\nLike a skydiver, a nigga got drag\nLike a race car driver, plus I'va\nSpit saliva, liver, than McGyver\n(\"BAM!\") Bump mo' bitches than a drunk driver\nFaster than a crackhead, mo' powerful\nThan a loco when I gotcha in a chokehold\nI'm here to rid the city of them wack-ass groups\nThem wack-ass lyrics with them wack-ass loops\nThey fakin like gangsters, turn into a Crip-tonight/Kryptonite\nThey don't faze me, 'cause we can still fight\nBut look, it's all about comin' (up) up (up)\nUp and away without bummin\nBut a nigga don't need no Wonderwoman, hmm, I wonder\nWho she been shuckin and jivin and fuckin'\nOr some bitch named Lois cause the hoe is the lowest\nAnd she's Whiter than Snow is (\"Too much of that Snow White!\")\nI think I'll fly back to the hood\nKick it with the homies where you know it's all good\nI'll be the first superhero with a strap\nI know I'm all that... (\"It's a crow, it's a bat, no it's..\")\n\n(Rashad)\nThe Super Nigga Boogieman is out to make a killin'\nSo fuck wastin time leapin over tall buildings\n'Cause I can get loose like fluid\nLike diarrhea - I can, run right through it\nI see through walls, 'specially at the malls\nLadies dressing rooms is where my duty calls\nA lot of super niggaz be trickin they powers\nGivin' hoes money, and flyin 'em flowers\n(But can you think of one thing you ever gave a hoe?)\nNo 'cause we Super Niggaz, not Captain Save-A-Hoe\nSo back on up look, I'll catch yo' ass so quick\nAnd letcho' ass know we the wrong super niggaz to be fuckin' wit\nI flash like lightning, powerful as bombs\nI flied back twenty years ago and fucked your moms\nAnd now it's ninety-fo', ain't shit changed\nBut now you call me daddy, when you call my name\nCause youse a silly mortal, you ain't down for combat\nI'ma Super Nigga, and you an Uncle Tom cat\nWhen I'm rollin' through the hood they wonder is he\nThe nephew, of Aunt Kizzy\nOr Dizzy Gillespie, and the rest be like\n\"That's the guy that's super, the fat track mover\"\nSo wack MC's come step to these nuts\nAnd get your crews cut below half, nigga do the math\nI'm the M-A-N, mayne\nI got a fly bitch with an invisible plane\nMe and her be doin' some X-rated shit\nWhen I get the skins, in the cockpit\nShe be callin everything from mommy to Jesus\nJust ask the homies, cause them niggaz can see us\nCause them super niggaz too, from the crew\nSo please stay tuned, for more adventures of... a Super Nigga\n\n(King Tee)\nMr. Insane King Tee motherfuckers from the boondox\nI bust the drunken style on my corner with the boombox\nI'm badder than the baddest inmate at (?)\nRetarded, but let me show you what this can do\nCreate fright, niggaz scared to touch the mic\nI shock 'em, amazed cause the wino rocked 'em\nThe best yet to like really catch wreck on the scene\nO.G. from the Alkaholik team\nI just scream (Ah!) let my backbone slip\nGotta get it on then take another sip\nMake it hip, a feeling MC's won't forget\nBust crazy rounds then load another clip (well bust it)\nLike R. Kelly, \"My mind's telling me no!\"\nBut fuck that, I kick the ill flow\nAnd deep down, I know niggaz is jeal'\n'Cause I'm pullin all the hoes and dickin 'em swell\nBut hey, cut the crap, cause like herpes I'm back\nTo give you what you want, I don't front or skip rap\nWith the bo, ba-ba-bye, the wicked with Tha Likwit\nI'm wild like a winner with the lot-to ticket\nBut kick it, you could grab a comb and try to pick it\nThe nappy head sound comin' from the underground\nOh shit it's the great, the man with the strap\nI know I'm all that... (\"It's a crow, it's a bat, no it's..\")\n\n", "album": {"title": "IV_Life_(1995)&&758", "genre": "West Coast Hip Hop", "year": 1995}}, {"title": "Jay Fay Dray", "href": "Jay_Fay_Dray&&6823", "artist": {"unique_name": "King_Tee"}, "lyrics": "He-he-he-he yeah\nIt was a real cool day, you know?\nAll the pimps came out to play\nKing Tee was the spokesman and guess what he had to say...\n\nHm-hm\nYo, my name is King Tee and I like to say hey\nLove catchin stunts cause the King ain't gay\nRock the mic like Al B! Sure, you know 'night and day'\nFor you sucker chump rappers: step off, make way\nHey, I once knew a girl by the name of Fay\nHer titties was bigger than the Frisco Bay\nOne night I got her drunk with a little Tanqueray\nThen I asked her for some head and Fay said 'okay!'\nI knew a brother, big dope dealin' Jay\nHe liked to sell crack to the basehead Dray\nOne day Dray got amped and jacked Jay for his pay\nSo Jay came and found Dray and shot him dead with an A.K.\nAnd I say with my rhymes I slay\nI serve sucker MC's on a silver tray\nIf you got a bad cake use a little ????\nAnd if your underarm stinks use deodorant spray\nBaby, yeah, it's like that, it's like that, y'all\nIt's like this, y'all\nI don't rap long, still make a hit, y'all\n\n", "album": {"title": "At_Your_Own_Risk_(1990)&&8049", "genre": "West Coast Hip Hop", "year": 1990}}, {"title": "Bus Dat Ass", "href": "Bus_Dat_Ass&&3906", "artist": {"unique_name": "King_Tee"}, "lyrics": "King Tee:\nI'm the man that'll bust dat ass, I'm the man that'll bust dat ass\n\nJ-Ro:\nNaw, I'm the man that'll bust dat ass, I'm the man that'll bust dat ass\n(Say what?!)\n\nE-Swift:\nNaw nigga, I'm the man that'll bust dat ass, I'm the man that'll bust dat\nAss\n\nI'm the man that'll bust dat ass, I'm that man that'll bust dat ass\n\nKing Tee talking:\nYo check this out. This is Tha Alkaholik crew. E-Swift didn't they say it\nCouldn't be done? They said King Tee couldn't bring out the Alkaholik crew\n(But we doin' it). Yo, it's the fresh shit. The dope shit for 1993. Tha\nAlkaholik crew. I'm gonna bust out like this, here we go, come on.\n\nKing Tee:\nNow bust it, I'm a try to freak it with the drums\nAlkaholik funk, bass for the trunk\nAnd I'm kinda crazy, stupid and hey I can do the nasty and drink like a\nSailor\nI'm real smooth, free from germs\nEven walk away when my homie smokin' sherm\nCause this is how I kick it, hoes got to lick it\nIt's Tha Alkaholiks and J-Ro is wicked\nE-Swifts mad, 'cause he Got It Bad\nKing Tees phat and I sport a blue rag\nFor the little whips and the honey dips\nIt's gang truece so I put away the clips\nBaby baby baby I might flip\nGot to get it on, let my backbone slip\nIf I fall back then give me some gas\nIf you try to play me I'll bust dat ass\n\nJ-Ro:\nPut the mic down clown, you can't get down\nJump around stage like your name was Charlie Brown\nWhen the kid is played out your rap record is finished\nDeminish, you couldn't come strong if you ate a gang of spinish\nPopeye, you could never drop by, you can never stop by\nCause you can never top I\nI got to hold back now I'm out before your turf\nBecause I want it all like the nigger Greedy Smurf\nIt's time to scoop the wack up, E-Swift bring the track up (all right)\nPunk you better pack up, cause the unit got my back up\nYou're a mic stand, got a steady woman\nBut I been in more sheets than the Klu Klux Klan\nI'm the J to the Ro, and I want to make it clear\nThat you're rappin' like a queer so why don't you get on out of here\nWith the alley cat coat wearin' Hush Puppy shoes\n? Seen you with (punk you ain't shit!)\nKing Tee and the Liks blowin' up like gas\nI bend your rhyme over, I bend your rhyme over\nI bend your rhyme over, I bend your rhyme over\nI bend your rhyme over, then I bust dat ass\n\nTalking:\nTha Alkaholiks, Tha Alkaholiks, I'm drunk, I'm drunk, Tha Alkaholiks.\nStraight for 93. Rippin' shit up. Tha Alkaholik, now you join E-Swift\n\nE-Swift:\nI fiend to get busy like a bee, check 1,2,3!\nE-Swift and Tha Alkaholik crew with King Tee (baby)\nBangin' niggas out the box, drink my scotch on the rocks\nAnd I'm makin' more hits than the motherfuckin' cops\nI'm kickin' lines like Tyson kickin' ass\nNiggas can't laugh, I put your neck in a cast (whoa)\nYes, I\"m the man with the skills to talk shit\nAnd I'm back by the crew that none of y'all can get with\nSo back to the lab to fix your demo\nOr get played like Sega or Nintendo\nSimple as that, give me a beat that's phat\nAnd watch a nigga jump on a motherfucker like cheese and a rat\nIt's strickly, dirty underground ass funk\nThat's busting out the weak 15's in your trunk\nSo don't be scared, be prepared when it hits\n'Cause the average motherfucker can't hang with the Liks\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Black Togetha Again", "href": "Black_Togetha_Again&&8415", "artist": {"unique_name": "King_Tee"}, "lyrics": "And that's how we do\nSmokin' 'em muthafuckas\n\nNo justice, no peace then, Mr. Policeman\nSave a life for your kids and your wife\nNo more donuts and coffee\nAnd I'll be back once I get off these concrete streets\nInfrared scope and I'm mad as fuck\nI'm on the roof tryin' to duck from the pigs, 'cause they suck\nPick 'em all one by one, 'cause they all got a strap\nTryin' to beat us with the stick and the gat\nLookin' at the news and now I see pals\nCarlton, Koons, Hearns comin' up sooner than he thought\nIt might be at a stop light or maybe at the station\nEither way it go, I'm stilll makin' bacon\nStuff him with a apple in his mouth, make sure he's gaffled\nTie his ass up and bring him back to my castle\nThrow him in the dungeon, leave his badge and his gun\nIn the car, turn it upside down, burn it up\nAnd let it blaze, all I got left is one gauge\nI slung all the ones that I brung from the gun\nStore, I gotta get at least three more\nAnd I could give a fuck what you think I got 'em for\n\nAnd all the King's hoes and all the King's men\nGo try to put this shit black together again\nCome on\n\n12 whites on a black, what's next?\nPull a man out his truck and get stretched\nI got a grudge with the judge\n'Cause he don't show no love for chocolate fudge\nHe only likes vanilla\nBut we do all the work like Cinderella?\nAnd I'll be damned if I get paid at a minimum wage\nWhile they afford to eat like a smorgasbrod feast\nAnd leave us here down in the dumps\nThe place where Donald Trump would get his ass jumped\nSlavin at Mickey D's for 4 bucks and a quarter\nAnd can't afford a Big Mac with a soda\nThe biggest crooks, the biggest thugs there ever was\nWas the ones that they vote for and hope for\nQuicker than a zig-zag, they got big bags\nFill 'em to the ceilin, now who's doin' the killin'?\nThen they point the finger at the young male black\nWorkin two jobs, so he gotta sell crack\nSo all the King's hoes and all the King's men\nGo try to put this shit black together again\nCome on\n\nLet's do it like the wild wild west\nTake off your holster and your gat and let's scrap\nBut Porkey the Pig don't wanna get 'em up\nUnless you got your hands in some cuffs\nWill I break the law if I break your jaw?\nTurn around take two steps and draw\nAnd make sure your plastic kill\n'Cause I came to get busy for real\nSo when you jump in my fo'\nMake sure you slam the do'\nAnd no bullshit on my flo'\nCause all the King's hoes and all the King's men\nHelp put this shit black together again\nAnd I'm Audi\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Down Ass Loc", "href": "Down_Ass_Loc&&1955", "artist": {"unique_name": "King_Tee"}, "lyrics": "(King Tee)\nWell it's the musically drunken King Tee, with the fifth of funk\nGuaranteed to make you jump like my 12 gauge pump, huh\nI've been around since the days of the Sugarhill groove\nBust it out with \"Act a Fool\"\nWhen I was seventeen, made some mad-ass green\nBought a six-fo' and some more gold things\nHad to play the part for the G's on the block\nSo I bought a blue rag, bought a black glock\nRan with the bunch that was out to get paid\nThe Westside of Compton over where the dead laid\nOn (?) and Central, where niggaz get mental\nFor a dollar, makin' punk niggaz holla\nI used to kick it on my front porch, drinkin' some 'gnac\nWhile the homies stripped cars in the back\nLifestyles of the short and broke\nAin't worried bout shit, 'cause I'm a down ass loc\n\n(Chorus: repeat 2X)\nSo break the nigga off when you come to my hood\nCause the little B.G.'s, is up to no good\nJackin motherfuckers for they Dana Dane's\nGot 'em jumpin' out they shit like the House of Pain\n\n(King Tee)\nYeah, a young man with the grown man's gun\nTryin' to stay full while he's livin' in the slum\nI used to bang on fools like I was goin' insane\nFrom a notorious Compton gang\nIt's King Tee, strapped \"IV Life\"\n'Cause I don't trust niggaz, I use the middle finger for the trigger\nEase back, watch bullets, flock through the sky\nFor the homies that died, and don't know why\nIt's the crazy motherfucker with the hot-ass tec\nMakin' hard niggaz hit the deck\nLifestyles of the short and broke\nAin't worried bout shit, 'cause I'm a down ass loc\n\n", "album": {"title": "IV_Life_(1995)&&758", "genre": "West Coast Hip Hop", "year": 1995}}, {"title": "You Can't See Me", "href": "You_Can%27t_See_Me&&6433", "artist": {"unique_name": "King_Tee"}, "lyrics": "(King Tee)\nI run that old gangsterism on the normal\nThe name is King Tee, I pack guns like it's formal\nWith the utmost respect I be chillin'\nKnockin' MC's out 'cause I'm the best in this building\nI be the G-R-E-A-T, plus majestic\nMagical, radical, the technique is hectic\nI, floss upon the scene in the front and back Caddy\nYeah, here goes Big Daddy, heh\nIn my trunk I keep a whole fifth of 'gnac\nIn there with some extra hollow points for my strap\n'Cause I bust on fools, I shoot down fools that front\nThe last of the few with the funk\nKing Tipsy, who flips the, rhymes like I'm crazy\nYou know these artificial gangsters can't fade Tee\nThe original G, from the C-P-T\nI'm no joke on the funk fool, you can't see me\n\n", "album": {"title": "IV_Life_(1995)&&758", "genre": "West Coast Hip Hop", "year": 1995}}, {"title": "Free Style Ghetto", "href": "Free_Style_Ghetto&&9961", "artist": {"unique_name": "King_Tee"}, "lyrics": "Verse One: Xzibit\n\n(See look look)\nI grab the mic and start breakin down niggas\nWit out no problem\nBroadcastin live from the bottom/ain't no mic checkin' worse\nKick some rhymes if you got/but if it's wack\nI draw back the cap for the peelin\nShould of stuck to rock dealin'\n'Cause it's the blood stealin/super vill...\nChill... stayin high like the ceilin\nSee there ain't enough room for the both of us\nSee it's a showdown/throw down\nYour best style I'll bust\n(Yo) I write rhymes that make niggas throw they sets up\nCouldn't hold my style if you had a pair of handcuffs\nIn all disrespect\nI'll snatch you by your neck\nAnd do a suplex and step\nSo nigga you can check my credentials\nJust hard rhymes and instrumentals\nXzhibit smash you wit a dental\nAnd a loaded pistol\nNo longer lookin' in the window\nI'll bust a field wit indo\nKillin' quarts of beer\nSadie's outta here...\n\nVerse Two: MC Breeze\n\nLike a fuze/start spreadin the news\nIts 94 and Breeze is givin' niggas the blues\nI paid my dues/and now it's time to go on to the next mode\nMake room for the kaboom/'cause I'm about to explode\nAnd drop bombs like a B1/cops I seize none\nAnd niggas step up/I soak emcseason\n3 seconds to detinate/you betta evacuate\nNo time to hesitate/you fuckin' featherweight\nI ain't the type to pic up the mic\nAnd catch the stage fright\nI'll pull a gauge if I ain't paid right\nTo the promoters on tour\nShort me a buck and a buckshot and the barrel is yours!\nI'm psycho pathic like Manson\nAin't wit the dancin\nBut still I get more Cheers than Ted Danson\nMore dough than Marino or roles than Pacino\nYou beatin' me? that's only in your dreams ho\nI'm not sayin' I'm unbeatable/I'm sayin' I'm untouchable\nLivin' comfortable just like a Huxtable\nPlus I'm rollin' wit the cross roads\nMovin fast forward/while you other suckas\nStuck in a pause mode\nI goes deep like a great white\nBut I'm a stay black\nNo matter how high the pay stacks\nOr if my rep gets bigger\nYou might get take this nigga out the ghetto\nBut not the ghetto out this nigga...\n\nVerse Three: J-Ro, Tash\n\nFor the balls basketballs\nMicrophones gassin grass (hey)\nSome of the few things J-Ro likes to pass\n93 mandingo/94 I'm the pharoah\n'Cause I'm b-bbad to the bone marrow\nI get wild\nWit more styles than the martial arts\nI need weed\nI roll more grass than golf carts\nApril 92 you no the Ro was a looter\nNow I'm writin raps on my lab-top computer\nJ-Ro the tittie fiend/rap dean/wearin green\nBeen on the scene/since the age of 13\nI learned I had to earn the mic\nNow's my turn\nI got Furious Styles like Larry Fishburne...\n\nWit da bitches tunin me in\nLike it's the Young and the Restless\nNext up to bust my shit\nFrom the L-I-K-S's\nYes it's the freshest\nWit lyrics rough around the edges\nI'll smoke you on the mic\nLike a pack of Benson Hedges\nBut... hold up wait\nI'll bust rhymes that'll circulate\nThat'll wake yo punk ass up like MC Eiht\n'Cause I be rockin' rhymes\nSince the roof was on fire\nSo point me to the bitch who's the dopest butterflyer\nI'll make her break it down like she Patra when I catch ya\nBroadway is on the tables\nWhile I throw these lyrica atcha\nSo... slow down before ya fuck wit my sound\nYou betta do the hokey pokey\nAnd turn ya self around...\n\n", "album": {"title": "IV_Life_(1995)&&758", "genre": "West Coast Hip Hop", "year": 1995}}, {"title": "Skanless", "href": "Skanless&&2077", "artist": {"unique_name": "King_Tee"}, "lyrics": "Yo\nE-Swift\nYo, still out here actin' a fool, man\nWell, we gon' bust it off like this, youknowmsayin?\n\n(VERSE 1: King Tee)\nYo, woke up this morning at a half past 10\nNext to me was this stunt named Lynn\nShe's cute, long hair, light skin\nAnd she's married to my homeboy Ken\nHey, it's all right, she says Ken don't know\nYeah, Ken don't know you're a hoe\nBut oh, you're wonderin, how could I sleep with Lynn?\nWhen she's married to my homeboy Ken?\nWell, it's plain and simple and true\nThe girl asked me if I wanted to screw\nBust it, I take her up to a nice hotel\nThe ???? Fox where I dwell\nBefore we got there I had to make a stop though\nI almost forgot the u-know-what and Super Saco, yo\nShe said, \"Yo, you're really gonna bust out your homeboy's wife?\"\nI said, \"Baby, let me tell you about my life\nI'm skanless\"\n\n(Everyone's got to make a livin') --&gt; 20th Century Steel Band\nSkanless\nYeah mama, I'm skanless\n(Everyone's got to make a livin')\nSkanless\n\n(VERSE 2: King Tee)\nWell, Lynn got up, got dressed and left\nStill felt skanless, so I called Beth\nI know you're thinkin: he's from one woman to another\nBut Beth was my homeboy Ken's mother\nI said, \"Hey girl, ?????? money?\"\nShe said, \"What's up, I been waitin on your call, honey\"\nI said, \"Really? Well Beth, check this\nI'ma pick you up around a quarter to 6\nSo wear somethin' sexy and cute\n'Cause I'm about to crash the boots\"\nShe said, \"You need to because pops can't hang no more\"\n10 minutes later I was knockin' at the door\nShe opened up, I said, \"What's up\"\nShe said, \"My husband's inside,\" I said, \"What the - hold up\nJust wait, I'ma go away and let you handle this\"\n?????? The mack 'cause I'm skanless\n\n(VERSE 3: King Tee)\nYo, it's a girl named Vicky\nShe kinda knows my rep so I had to get slick, see?\nI had to turn like super skanless on her\n(But yo, I know I love you, baby) you know, that Compton drama\nShe said, \"We can't make love 'cause I'm not like that\nI have to get to know you,\" all the yakety yak crap\nI said, \"Baby, I feel my heart crackin' up\nI really thought you liked me so I bought you this\nLuxurious solid gold bracelet\nGo 'head, put it on, let me see if it fits\"\nShe says, \"Ooh, I guess you're serious\"\n\"I mean what can you say? I mean you drive me delirious\nIf we make love I buy you anything you want\nDookie gold ropes, silk suits to flaunt\"\nI knocked boots, she made me feel like a mack\nSo like a pimp I jacked the hoe and stole all my shit back\n'Cause I'm skanless\n\nE-Swift, break it down\n\n", "album": {"title": "At_Your_Own_Risk_(1990)&&8049", "genre": "West Coast Hip Hop", "year": 1990}}, {"title": "Got it Bad Y'all", "href": "Got_It_Bad_Y%27All&&7758", "artist": {"unique_name": "King_Tee"}, "lyrics": "Ladies and gentleman, that nigga King Tee and the al-cum-a-holiks\n\nVerse One: J-Ro\n\nPooh-butts play the rear 'cause I'm makin' yapes\nThe rhymes ain't no thicker than a, skittle grapes\nA lot of girls would like to thank me, for the hanky-panky\nOn the mic I hold a belt, now I know no one could spank me\nIt took a long time for the people, to hear my rhymes\nSeems like I been rappin' since my birth in '69\nSorry to keep you waitin', I run rhymes like Walter Payton\nI get a rhyme like spokes on a Dayton\nBut I won't knock off, because I just rock off\nThe beats to get funky, like when you take your sock off\nTo all the white folks I would like to say howdy\nAnd to all my brothers I say peace quit actin' rowdy\nWack MCs in ninety-two, ew you need to take a rest\nThe public don't you aim the best you're softer than a hookers chest\nRaps, I make em, snaps, I make em\nFor duties movin' booties 'cause I shake shake shake em\nAnd I got rhymes, funky funky rhymes\nE-Swift hold the needle down with nickels and dimes\nI drink Olde English, St. Ide's and Mickeys\nWhen it's time to roll I throw on my black dickeys\nOn the mic I get wicked, like Wilson Pickett\nI get the place jumpin' like a cricket when I kick shit\nI'm from the West coast but don't sleep home-stimpy\nEven if I was a paperboy you still couldn't rip me\nI walk up and chalk up pairs like the Knicks\nI'm all in the mix like snares, and kicks\nWhen it comes to rhymes I get loose like belt buckles\nThose who chose to oppose this nose is felt knuckles\n\n(Where you goin' to?) To the tip\n(And what cha bout to do?) Bout to rip\nSome people use the word funky too loosely\nAnd just how many rappers say they kick it like Bruce Lee\n(What's your favorite brew?) Olde E\n(And what it make you do?) Go pee\nIt used to be about rhymes, all about rhymes\nNow rappers rearrangin, and changin' like times\nI got it bad y'all, I got it bad y'all\nWhen it comes to the pen and the pad y'all\nI got it bad y'all, I got it bad y'all\nWhen it comes to the pen and the pad y'all\n\nVerse Two: E-Swift\n\nBack the fuck up, gimme room to breath\nNot too many niggaz can flip the rhymes like these\nI freak the technique as if it was a bitch\nGot more soul than the pit with a fifth\nPitch the ball, so I can beat it with the bat\nTalk some shit, so I can smoke ya with my gat\nI'm feelin' kind feelin' kinda feelin' kinda feelin' kinda\nFeelin' kinda buzzed off a sack of chocolate tie\nMy my my ho, I like to rip the shows up\nSmack the hoes that walk around with they nose up\nRun to the liquor store, before they close up\nBuy a few 40s, cause daily I get to' up\nSit at the crib and write RIGGY RIGGY rhymes\nLine after line after LIGGY LIGGY line\nYo I can get funky, buy my tape and bump me\nTo the break of dawn I hit the bud and pass it on\nHangin' at the park, shootin craps on the weekend\nMy brown bag is wet cause my tall can is leakin\nStarin' at the cops, beatin' up on Rodney\nWhile a pack of O.G.'s steppin to me tryin' to rob me\nJust because I'm dope, niggaz wanna smoke me\nOn the mic I get funky while you're doin' the hokey-pokey\nDance steps, I think that you should leave to Paula\nAlkaholiks is the shit, E-Swift's the smooth bawler\nIs slangin these rhymes like a rock\nLife ain't shit but money and a glock\nDon't punch a clock, but I cock a fat knot\nSo I can smoke a lot of pot that I roll up with tops\nAnd ya ain't heard shit yet, I'm just gettin' warm\nLike hot butter on, SAY WHAT?, THE POPCORN\nI'm headed to the top, please give me my props\nMy beats are fat as fuck so bump my shit in your box\nI love to hit the skinz, but then again WHO DOESN'T\nI love to hit the herbs cause it leave me feelin' buzzin\nI dedicate this chumpie to the poets who can wreck\nAnd to all the nottie dreads I gots to give them nuff respect\n\n(Where you goin' to?) To the tip\n(And what cha bout to do?) Bout to rip\nSome people use the word funky too loosely\nAnd just how many niggaz say they kick it like Bruce Lee\n(What's your favorite brew?) Olde E\n(And what it make you do?) Go pee\nIt used to be about rhymes, all about rhymes\nNow rappers rearrangin, and changin' like times\nI got it bad y'all, I got it bad y'all\nWhen it comes to the pen and the pad y'all\nI got it bad y'all, I got it bad y'all\nWhen it comes to the pen and the pad y'all\n\nVerse Three: King Tee\n\nUp jumps the man with the loot\nRockin' like a troop with the Alkaholik group\nEverything is kosher, got a little taller\nLivin' kinda phat cause King Tee's a bawler\nI just, irritate the wack, leave 'em so confused\nWhen I'm checkin' on the mic with the ones and twos\nSneak you a peek of the drunk technique\nCan't stand up, need to take a seat\nBaby baby baby it's the Alkaholiks\nBut I can freak the mic no matter how ya call it\nMetaphors grand, and I'm the great man\nDrink a whole fifth YES I CAN YES I CAN CAN\nThe girls call me dick-em-down\nGot that title rockin' for the crown\nCatch y'all later, around next weekend\nI'm a Alkaholik and I'm late for my meeting\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Diss You", "href": "Diss_You&&9002", "artist": {"unique_name": "King_Tee"}, "lyrics": "(Hello)\n\nI should diss you\n\nExcuse me, lady, you're lookin' real nice\nWhere you been, I been lookin' for you all my life\nSo how's about lunch with a winner?\nThen again it's kinda late, so what's up with dinner?\nAt my place or my place or my place or my place\nBy the fireplace or the candle light\nAbout 7, or make that 8 o'clock tonight\nMake up your mind, let's wine and dine\nGet with me or back up off my line\n'Cause I can't wait for you to call me\nYou're steppin on your suit the very second you saw me\nI thought you said that I'm the only one\nThat can send chills up and down your - ehm\nGold rings and estate, too\n(Hello, is this you?)\nMan, I should diss you\n\nYo, I been waitin all night long\nAnd you didn't even ring my phone\nI should diss you\n\nSince you tried to play me like booty\nI just feel that it's my duty\nI should diss you\n\nSo don't give me no excuse\nBut before I cut you loose\nI should diss you\n\nAnd there's nothin' you can say\nAnd there's nothin' you can do\nI'ma diss you\nI'ma diss you\n\nDiss you\n\nYou claimed you would stick like SuperGlue\nBut you're low, down and dirty, so I'm dissin you\nYeah, I'm dissin you, I won't be missin' you\nI won't be kissin' you, I hope you're listenin, too\n'Cause I realized that I'm real fly\nSo (see ya) later (bye)\nCause you only get one chance at this\nYou played me wrong, so I'ma diss you, miss\nFor the fact that you thought that I could get done\nThe K-i-n-g Tee ain't the one\nSo miss me with all that stuff you're talkin'\nI know you're sorry, but keep on walkin'\nOn about your business, I'm almost finished\nTyin up loose ends, and\nLet the door hitcha where the dog should bitcha\nEven though I should dissed you\n\nI shoulda dissed you\n\n", "album": {"title": "At_Your_Own_Risk_(1990)&&8049", "genre": "West Coast Hip Hop", "year": 1990}}, {"title": "Way Out There", "href": "Way_Out_There&&9746", "artist": {"unique_name": "King_Tee"}, "lyrics": "Let's give it up for the fabulous {*scratched: \"King Tee*}\nFa-fabulous {*scratched: \"King Tee*}\nLet's give it up for the fabulous {*scratched: \"King Tee*}\nFa, fa-fa-fabulous {*scratched: \"King Tee*}\n\n(King Tee)\nAll aboard the mothership, prepare to set sail\nLyrics fat, swell as a killer whale\nEnemies approachin, identify yourself\nThey're raisin up the flag, backin up they get to blast\nOpen fire, cannons let loose\nShut 'em down like the spruce goose\nCaptain aye aye, they still floatin\nGive the order - blow they punk ass out the ocean, got 'em\nDrink hit the dank as they sink to the bottom\nSchools of sharks circles then the sea turned all purple\nEven Jacques Costeau punk-ass was scared to go\nAnd that just goes to show to uh, let you know, uh\nAs I chill again like Gilligan and the Skipper\nA nigga kickin it with two hoes like Jack Tripper\nSwabbin the deck, just stabbin in my cabin\nRubbed the magic lamp and out popped Aladdin like \"What's happenin'?\"\nI said, \"What's up? I want my rhymes to be the dopest\nAla... cadabara... hocus pocus\nYou think they can see me?\" He said, \"Nope not really\nCause the fog's in the air plus you're way out there\"\n\nWhen you look up in the sky, oh me oh my\nIt's a bird, it's a plane, it's a god damn shame\nTela come wicked and you best beware\nYou will see when he kick it that he's way out there\n\n(King Tee)\nMy style pattern's unique, exquisite, so come visit\nExhibit A through G, through Z, E-N-T\nStuck your equilibrium on activate\nCaptivate the ear and then his eyesockets upon my pockets\nI left him in suspense, who's the, tribes and crews?\nCompetition none exists bitches be blowin' me kisses\nOthers fall like missiles, the cap was artificially flavored\nMy first verse, it quenched your thirst\nFor instance, I'm makin' people boogie but yet\nFrom long distance, causin it to interfere with your hemisphere\nFlee, it's a G recipe\nIt get you hooked, havin' fits off my shit\n\n(King Tee)\nThey wanna wipe us out! I think they hate us\nKillers with the pencils and the papers and erasers\nI'm comin' through ya living room boom, shok-a-lok-a boom\nShake ya whole area, break your sound barrier\nSo wake up if you sleep cause like a clock I tock I'm tickin\nEarly bird, get the worm, and I stopped slangin chickens\nBut I still be kickin facts, black, black on black crime\nWhy the hell you jackin me? I don't have a damn dime\nMy skills kill you like a deer with my spear\nWhen it rains it pours he fell from the tier off the third floor\nThe pieces of the puzzle huh, figure it out\nAnd start fuckin' around and we'll be diggin you out\nAnd it's just that simple put the thang up to your temple\nAnd now you got a permanent dimple\nIt's King, Tee, the name nigga and don't get snotty\nBetter knock on some doors and ask somebody (yeah)\nSo fuck that other shit and grab my hand with all your might\n'Cause I'ma show you what that West coast like\nThe flavor's unbelievable, nutritious, delicious\nNigga when the Tee get loose it gets vicious\n\n(Both parts scratched ad lib for four bars)\nLet's give it up for the fabulous {*\"King Tee\"*}\n\n{*\"King Tee\" scratched*}\n\n", "album": {"title": "IV_Life_(1995)&&758", "genre": "West Coast Hip Hop", "year": 1995}}, {"title": "Blow My Sox Off", "href": "Blow_My_Sox_Off&&209", "artist": {"unique_name": "King_Tee"}, "lyrics": "(Suck my dick)\n\nYeah\nCheck it out y'all\nI see Tha Alkaholiks just stepped in the house\nIn the middle of vocals\nCheck this out\nBobcat's in the house\nBig Mac's in the house\nAnd all the bitches in -\nCheck - wait\nSpeakin' of bitches, you know\nCheck this shit out\n\nHoes don't know, man, hoes don't know\nAll they have to do is blow my socks off and go\nAnd ain't no need to kick it, 'cause we're not goin' out\nNo movies, no grub, no pancake house\nI thought you knew the deal, I thought you knew who I was\nI spring for the budge, so you can get a buzz\nIf you're a real cutie we can hop to the snooty\nAnd I slap that and tap that and wax that booty\nJust ask all your friends, they'll tell you the proof\nGive your sole to the lord and hand me the boots\n'Cause I can make 'em scream, I can make 'em holler\nDon't ask me for no change, 'cause I won't give a dollar\nCause bitches be trippin' when you ain't got the ends\nYou ain't got the Benz, well, you ain't got the skins\nSo I don't play the games, cause these hoes been tossed\nStraight out, you little hooker, just blow my socks off\n\n(Gobblin up nuts, sort of like a humming bird) --&gt; Ice Cube\n(Suck my dick)\n(Suck my dick)\n\nBlow it, baby, blow it, then lick them nuts\nBoy, you drive me nuts, socks fly when you suck\nMy ding-a-ling-a-ling-a-lingy, long like a slinky\nLet me reach around and tease your nipple with my pinky\nTramp, don't front, I know you're out there skeezin\nKam said you do it like 'every single weekend'\nWalkin' round the club straight lookin' for a trick\nBut Tee'll never slip, 'cause I never trick my dick\nHoes try to flip sayin' that I look tacky\nEven though I'm dipped in a fresh pair of khakis\nAnd got the nerve to say I'm bony and I'm phoney\nJust because I won't take your ugly ass around my homies\n'Cause I know you wanna fuck the whole crew\nFirst Starvin and Bobcat, Wavey and Pooh\nSo I don't play the games, cause these hoes been tossed\nStraight out, you little biatch, just blow my socks off\n\n(Gobblin up nuts, sort of like a humming bird) --&gt; Ice Cube\n(Suck my dick)\n(Suck my dick)\n\nLike I said in the first verse, I can make 'em holler\nAnd King Tee won't turn down nothin' but the collar\nNot lookin' for a lover, just a good dick sucker\nJimmy'll rise when I hear the lips pucker\nSuckin and smackin, gaggin and slurpin\nGrab you by the head, cause your tongue keep workin\nA bitch'll stand up and say that she don't give head\nThat bitch'll suck your dick like she was bein cum-fed\nSo (blow me, blow me) even though you don't know me\n(Show me, show me) and then show my homie\nAnd I don't play the games, cause these hoes been tossed\nStraight out, you little hooker, just blow my socks off\n\n(Gobblin up nuts, sort of like a humming bird) --&gt; Ice Cube\n(Suck my dick)\n(Suck my dick)\n\nYeah\nStraight out to all them Compton hoes\nYa know what I'm sayin'\nBobcat's on the funky track\nTha Alkaholiks in the house\nAnd I'm out\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Where'sa Hoe Sat", "href": "Where%27sa_Hoe_Sat&&2384", "artist": {"unique_name": "King_Tee"}, "lyrics": "\"Warning... you must use, Jimmy Hat condoms\"\n\n(King Tee w/ a voice modulator)\nHahahahaHAA! Ah...\nWhere's the hoes at? Where's the hoes at?\nWhere's the hoes at? Where's the hoes at?\nWhere's the hoes at? Where's the hoes at?\nWhere diggy diggy diggy where's the hoes at?\n\nI'm elastic, bendable plastic\nIf I ain't witcha then you need your ass kicked\nFuckin' bitches that smell like trout\nDumb nigga, whatcha thinkin' bout?\nWhere's the hoes at? Where's the hoes at?\nGet butt-naked and fuck, I want my clothes back\nBut if the hoe's wack, take the hoe back\nStreet beat hooker, I ain't got no crack\n\nAh...\nWhere's the hoes at? Where's the hoes at?\nWhere's the hoes at? Where's the hoes at?\nWhere's the hoes at? Where's the hoes at?\nWhere diggy diggy diggy where's the hoes at?\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "We Got Tha Fat Joint", "href": "We_Got_Tha_Fat_Joint&&1167", "artist": {"unique_name": "King_Tee"}, "lyrics": "Wrap\nThen pass that joint\n\n(*In the background*)\nWhere the joint, man?\nSomebody got it\nI ain't got it\n\nCheck it out y'all\nMad Kap's in the house\nNefrettiti's in the house\nAnd she finna kick it like this\nCome on now\nCome on\n\n(VERSE 1: Nefretiti)\nSo just call me the spark, held by the flame\nOnce again my beats make white boys reclaim\nA stain on your brain, and yet I'm stayin the same\nBust another rhyme, move into the hard time\nMy lifeline revolves into a circle of zero\nAnd like for real I never liked no superficial hero\nNow this joint is fat, so spark up that fat joint\nAnd yes, you best believe I'm born again to prove my point\nTo say the least, I know you know that hip-hop won't stop\nI smooth will get wreck, then pass me the joint\n\nPass it around\nPass it around\nPass it around (2x)\n\n(Motif)\nImprovisation is the key to this freestyle\nHip-hop style, while jazz in the meanwhile\nStride, glide, and all that good stuff\nRide to the rhythm of this jazz, it's rough\nYou're crippled in the brain from a late night feature\nThe government is run by the beast and the creatures\nHanger for the hook-up, for the jab it's junk\nThey're comin' in your speaker with the funk-fu-fu-funk\nSome want you to say today I can't fit on one caper\nTake out the seeds and begin to rollin' papers\nThen I roll the blunt or a spliff or a fattie\nFeelin' like a hood with a beanie in a Caddy\nI love my herb, I love my money, 'cause I'm young, matty\nNever eat the pork, 'cause it's much, much too fatty\nSo come down, selector, and give me my props\nI'm runnin' through a field of marihuana crops\nI'm thinkin', all the green, fat, crazy, stinky buds\nFlow on the instrumental, cause this rhyme is not a dud\n\n(Coke)\nGettin' crazy blunted, and you'll never say I fronted\nOn the raps, 'cause I take the track and run it\nInto the ground, I'm ghetto clown number one\nRhymes are kinda fat like two tons of fun\nSmash, boom, bam! and I never sound flam\nIt's that nigga King Tee with the Mad Kap band\nGettin' stupid high off the chocolate ghetto thai\nSo pass the dutchie on the left-hand side\nKing Tee and Nef, and the rhymes are on point\nBut now it's time for Coke to pass the fuckin' joint\n\nPass it around\nPass it around\nPass it around (5x)\n\n(King Tee)\nNow here comes the bomb...\nPass it around, throw some flex in\nPeek-a-boo! I mean - ooh! I be fresh when\nI do that, but wait - who dat? It's the King\nMad Kap, Nefrettiti's the queen\nWith the sound of Africa to the streets\nSomethin' the Man can't cheat\nAnd make it pop, 'cause we're already poppin'\nSo I'm whistlin, sittin' on the dock by\nThe bay, singin' 'ay-hey,' can you copy?\nBoomin like a jeep, deep with my posse\nWhat's up, sister? yeah, it's Mister\nK-i-n-g Tee, I brung a mixture\nOf ruff rhymes, I drove by to shoot the pop rap\nCause you know you gotta stop that\nBullshit, but when my pull hits, it's on point\nAnd I got the fat joint\n\nPass it around\nPass it around\nPass it around (4x)\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Check The Flow", "href": "Check_The_Flow&&4676", "artist": {"unique_name": "King_Tee"}, "lyrics": "* Not 100% sure this is the MC's name\n\nWe got them, Sledge, (?) ruff heads (check the flow)\nKing Tee's on the set (check the flow)\nWhen niggaz try to get high-tech (check the flow)\nThe dialect's on the flex\n\n(Sledge)\nWatch this, when I shine I bring rain\nClouds, bust storms, yo, this ain't the norm\nWhen I perform, I get you up out your seat\nGet down with the real deal skills, then chill\nThen show your ass how to get amped, then lamp\nStretch, flex, then tackle what's next\nCause MC's, that luck up, need to hush up\nWho can't brush up, on their rap style, shut the fuck up\nThen duck from the one that gets buck-wild\nI chop your ass in half, with a smile\nBig grin, all teeth, for those who got beef\nFuckin' with me ock, you're six feet deep\nDown in the ground, alone with no sound\nWhile I'm up here CHILLIN', top billin\nAnd illin, on all those, who oppose\nI wanna take one more shot, strike a pose, uh!\n\n(King Tee)\nSmash, here comes the one that talks trash\nTo garbage MC's, who try to diss me\nAnd my crew - the ill ville animal cannibal\nBackbreakers, government amputators\nBounce to this if you think you know the hits\nAnd all you gassed-up critics, put the brakes on the shit\n'Cause I'm tired of this, and I'm tired of that\nMotherfuckers sayin' King Tee's shit was wack\nBut in fact, my rhymes crack backs and make money stacks\nBy the truckload, now let's go for the gold\nSo strap on your seatbelt yo and let's go\nAnd get down, to the sound that burns quick\n'Cause I'm about to burn rubber, on this number\nAnd any MC who claims his style is legit\nSuckers wanna try me? (I know not why Tee)\nI light that ass up like the 4th of July G, uh!\n\n[T] Check the flow, check the flow, check the flow yo\n[S] Check the flow, check the flow, check the flow yo\n[T] Check the flow, check the flow, check the flow yo\n[S] Check the flow, check the flow, check the flow\n\n(Sledge)\nCapital S-L, crooked letter humpback fuck that\nThump that, shit that's never wack\nCause this goes out too all the niggaz that we rushin\nTo hear the shit I'm bustin' over ruptured percussion\nIt ain't my fault that I'm layin niggaz down like asphault\nAnd blow your ass away like chalk, dust\nThen crush your monkey-ass unto the side\nCause wrecked dialect is causin lyrical genocide\n\n(King Tee)\nI stress facts like IRS wants tax\nFrom anyone claimin that they're livin', kind of fat\nYou see, I could get sick in the thick of shit\nI turn my toes up, when it goes up, my foe's butt\nHey nigga back-steps, even you can get hit\nI'm more crankier than a bitch on the shit!\nNiggaz get heated 'cause they just got defeated\nBy the two man team, the Sledge and the King, uh!\n\n", "album": {"title": "IV_Life_(1995)&&758", "genre": "West Coast Hip Hop", "year": 1995}}, {"title": "Triflin' Nigga", "href": "Triflin%27_Nigga&&2118", "artist": {"unique_name": "King_Tee"}, "lyrics": "{*Opening skit: man talking to girlfriend in car*}\n[M] You won't have to worry about anything when you're with me\n[M] 'cause I'm... (?) reliable (?)\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Time To Get Out", "href": "Time_To_Get_Out&&2986", "artist": {"unique_name": "King_Tee"}, "lyrics": "(All together now)\n(I want everybody to get up out their seat)\n(All together now)\n(I want everybody to get up out their seat)\nAll right, check this out\nYo\n\n(VERSE 1: King Tee)\nNow this is for the gangsters, now trip\nA message to the Bloods and the Crips\nIt's time to get out because a lot of things changed\nThe way it used to be, well, today it ain't the same\nYou got the Blood gang shootin up churches and shit\nL.A. and Compton don't mix, so it's Crips fightin Crips\nBack in the days it was whites against 'coloreds'\nNow you got brothers just killin' each other\nAnd drive-by shooting's like a sport for you now\nBut when you shoot for your victim with him you hit a child\nI gotta ask ya: how do you feel after that?\nYou brothers blow wind in your gat\nLike you was John Wayne or Clint Eastwood\nYou shot another black for your hood\nGet caught, you wanna cry like a ass\nI kinda giggle when the white man laughs\nNot too long ago you had to fight for your territory\nToe to toe and a gun was a different story\nI guess you can't squabble no mo'\nYour fist is a .44\nBut on the real, hops, I'm on the same boat\nBut the Man got us all by the throat\nAnd since I got the power to deliver this to ya\nI'ma tell ya like it is, I won't fool ya\n\nI want you to\n\n(Singer (&amp; King Tee))\nStop fighting and come together as one\n(It's time to get out)\nUnity is what we need, get your job done\n\n(VERSE 2: King Tee)\nNow you're out drunk, cold wildin\nKill another brother, on your neck is a medaillon\nThat resembles the shape of the motherland\nBut let me tell you where my color stands\nBlack is you, black is me\nAnd black is creativity\nBlack is present and black is past\nAnd black is of a higher class\nBlack is kings and black is queens\nBlack is what the sunset brings\nBlack is rap and black is soul\nBlack is even rock 'n' roll\nCheck it, black is locks, black is braids\nBlack is men with high top fades\nBlack is love, black is devine\nBlack is first of all mankind\nSo\n\n(Singer (&amp; King Tee))\nStop fighting and come together as one\n(Get out)\nUnity is what we need to get the job done\n(All together now)\nStop fighting and come together as one\n(Go ahead and get out)\nUnity is what we need to get the job done\n\n(King Tee)\nCome together, brother\n(Singer)\nAnd have unity, you know what I'm sayin'?\n(King Tee)\nYeah\nOn the strength\n(Singer)\nWord to the mother\n(King Tee)\nTo the motherland, youknowmsayin?\n(All together now)\n(Singer)\nWe don't need ?????\n(All together now)\nAll we need is a chance\n(King Tee)\nGo ahead and get out\n(Singer)\nWe don't need ?????\nWhat we need is a chance\n(King Tee)\nPeace\n\n", "album": {"title": "At_Your_Own_Risk_(1990)&&8049", "genre": "West Coast Hip Hop", "year": 1990}}, {"title": "On Tha Rox", "href": "On_Tha_Rox&&8296", "artist": {"unique_name": "King_Tee"}, "lyrics": "(King Tee)\nCheck this out\nHey, I knew this nigga named Johnnie Walker\nA nightstalker, a big shit-talker\nEven though he liked a lot of vodka (say what?)\nHe was from Tennessee, sprung off Hennessey\nMakin' enemies fast - in L.A.N. they didn't play (what?)\nHe got into a Tanque/tangle with +Ray+, he had on too much gray\nRay had a Strawberry sister named Daquiri\nJohnnie politely her ass behind the back three\nNow, all four uncles E&amp;J wanna tossi\nMartini and Rossi had to get the niggaz off me\nHe got jacked for his Dana's, in other words\n(Give it up nigga, give it up!)\nHe caught the Nighttrain and blasted his Thunderbird\nWith the pistol, him and Cisco, couldn't stand him\n'Cause he caught him lickin' Brandy off his sister named Kandi\nAt this point he had more bad luck than a trash truck\nHe lost his girl, Remi spent his last buck up\nRemi caught him shootin game at Elayne, so now\nFlowers and champagne don't mean a damn thang\nRemi ended up runnin' off with Martin\nHe was wanted for arson for startin fires in Carson\nSo Johnnie hired a gun named Rum, and paid him\n151 and the job got done\nWith a thirty-eight straight to the face\nHe caught him in a six-pack and got they ass back\nUp close he made 'em post and broke all their glasses\n(?) And Rum threatened their families with matches\nHe felt he needed more men just like Gin\nSo he packed his strap and started claimin Silver Satin\nFrom then on in, anybody caught bailin\nDown Seagram's 7 was bound to get sweated\nExcept Bartyles and James, 'cause they was cool\nHe knew 'em from school when they didn't bang and made moves\nTurns out, he never reached the top\nThey found his ass at the beach \"on tha rox\"\n\n{*Ocean, sound of seagulls, closing DJ scratch*}\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Dippin'", "href": "Dippin%27&&3342", "artist": {"unique_name": "King_Tee"}, "lyrics": "Well it's a hot hot Sunday jump up around a quarter to ten\nHad to run and get this blunt that I left in my Benz\nI lit the shit and caught a early mornin buzz\nAnd called my nigga E 'What up loc?,' 'What up 'cause?'\nI'm thinkin' bout pullin out the trey for performance\nAnd maybe hit a few corners\nI let the batteries charge while the kids stood waitin\nFor me to hit the switch and floss the Daytons\nI tap my shit, yo, my shit was hot\nSo I drove her straight down to the wash spot\nThey shine my shit up real glossy\nSuckers starin' but my shit jumps like Kriss Kross G\nSo fuck what ya heard cause my trey does flips\nThe superclean three with the lifts\nI guess I got my whole day planned and I'm trippin'\nQuick to hit the switch so let's go dippin\n\nLet's go dippin, dippin through the streets (repeat 3X)\n\nNow I'm rollin' cocked up, flossin down the street\nI took Imperial to the beach\nBut before I arose on the scene\nI saw the individuals rollin' like a team\nDrove a little bit further saw mafia for life\nWithout a doubt everything was tight\nBut they gotta watch out for the King\n'Cause I can make my sixty-three sing\nNo pigs round, no I ain't no sucka\nI'm doin' sixty just hangin' this muthafucka\nMore Bound To The Ounce is what counts so I show it\nEven if it means I gotta total it\nSwervin from lane to lane\nA Cadillac just ain't the same\nIf you don't know what I mean and ya sittin'\nCome on, get in, let's go dippin\n\nLet's go dippin, dippin through the streets (repeat 3X)\n\nI felt like Cube cause today was a good day\nFor me to act the fool in my trey\nI'm not worried 'bout a sucka tryin' to stick and rob\nI just buck 'em down with my thirty-odd\nCreeped up to the beach, packed to capacity\nHoes walkin' by 'Hi Your Majesty'\nI said I'm not Young MC but what's the flava\nI played it like Troop 'cause I'm not ??souped??\nI park my shit on three wheels 'cause I'm ill\nCompton's on the set with the real deal\nThis one's for the riders all around the world\nDippin through the hood wit your girl\nBumps in the back, sunroof top\nNiggas lookin' crazy so I'm reachin' for the gloc\nEvery hood knows where the blood and are crippin\nAin't nothin' like a Sunday out just dippin\n\nLet's go dippin, dippin through the streets (repeat 3X)\n\n", "album": {"title": "IV_Life_(1995)&&758", "genre": "West Coast Hip Hop", "year": 1995}}, {"title": "Advertisement", "href": "Advertisement&&9369", "artist": {"unique_name": "King_Tee"}, "lyrics": "Christian Brothers man...\n{*Burrrp*} Excuse me\n(Watch your manners man, what the fuck is wrong with you?)\n\n(King Tee)\nCheck it out (\"keep on\") boo-yaow!\nAh one-two, yeah bust it bust it...\nWhat the fuck is goin' on man?\nAh one-two, who's comin' through the door?\n\nOh shit, well there he is! Tha Alkaholik funk in person\nYo, what should I do?\nPlay like Heavy D and \"Don't Curse\"\nHe's a mean one, no a clean one, he's the King hon\n{*Sniff*} I smell blunts\nHey, ask him has he seen one!\nIt doesn't look like he has blunts in his handles\nLooks, more like, a fifth of Jack Daniels\nLook what you dropped!\nSome crazy-ass shit for listeners\nUp against the wall with the bitches\nDamn, I wonder why he don't want the Chronic like snoop\nBecause he's from Tha Alkaholik group!\n(Oh yeah yeah that's right)\nThere's one thing that can be certain\nWhat's that?\nThey be mixin Tanqueray with the Squirt and\nDownin St. Ide's like water, oops (??) WHAT?\n(??) Water, y'all can get looted\nCause King Tee with the stupid fat funk, hey\nWhat is this?\nAdvertisement...\n\nHah... ah one-two\nYeah, when you're in that Benz\nIt's advertisement...\nThat's some shit, shit!\nYo, ah one-two (yo yo yo)\n\nDid you peep his walk?\nYeah he walks real cool\nI guess that bulge in his coat is a tool\nYeah but for what?\nFor those who don't know who he is\nThe neighborhood jackers that bumrush kids\nBut yo I think he's straight, it looks like a 9 millimeter\nYeah POW-POW, nice to see ya\nLook he's stretched like he just got released from the county\nWith a gang of little hoochies all around me\nWell he always been a pimp\nHaha, yeah that's true\nSome say they bob with the K-Swiss shoe\nAww, you're buggin\nNah man, that's the truth\nThey say, Tela got hoes like Luke\nFuck luke!\nYeah his records kinda shitty\nKing Tee'll bust rhymes for the whole city\nHe's from Compton\nYeah, just like Most Wanted\nHe drives a grey beamer with the blue pearl on it\nIt's advertisement\n\nAh one-two... uh!\nAh one-two...\n{*Scratching \"Keep on\"*}\nHuh, yeah, ah one-two...\n\nWell, guess who got the fat shit for 1994?\nWho is that?\nAlkaholik crew\nYeah I seen 'em on tour\nThat shit's wicked, wait, oopsy-daisy, here's your ticket\nWe paid $20 to see E-Swift mix\nYeah he wrecks shop\nYeah that kid is kinda groovy\nRip the turntables then step with a cutie\nJust get down, get down, the man like Ed Lover\nYeah, take his picture for the cover\nAdvertisement!\n\n", "album": {"title": "IV_Life_(1995)&&758", "genre": "West Coast Hip Hop", "year": 1995}}, {"title": "Tha Great", "href": "Tha_Great&&1195", "artist": {"unique_name": "King_Tee"}, "lyrics": "(Really like to rock the funky beats) --&gt; Chuck D\n\nThe majestic great from the head to the toes\nI ain't in a gang, I'm in my favorite clothes\nBut I can scrap with any enemies or foes\n'Cause I'm champion, just ask all my hoes\nPlease don't push, or you wish that you didn't\nWe're goin' toe to toe, and it ain't no kickin\nMy moves are kinda slick and my punches be stickin\nSo put up your dukes, you little half-priced chicken\nDon't brother-brother me, 'cause I ain't your kin\nI'm aimin for the end, and I'm off that gin\nTee came to separate boys from the men\nIf I see another dance step, I'm shootin for the chin\nI sag when I stroll, 'cause I'm known as a hood\nI fuck real good, got trophies for the wood\nHub City hangin', I love shootin fakes\nSo bitch, make way for King Tee Tha Great\nCome on (say yeah)\n(Check it out y'all\nYou don't stop\nKeep on) --&gt;; Big Daddy Kane\n\nBack on the block I got juice with the gees\nI was writin rhymes while they picked up ki's\nYeah, I got homies that be throwin' up b's\nAnd I got family that be throwin' up c's\nBut to the O.G.'s it's all about paper\nLet's sling these birds and gangbang later\nI gotta be the great, cause ain't nobody greater\nA obvious rhyme would be E-Swift is on the fader\nSince I'm out west I bought a holster for my glock\nSittin' on the roof [censored] at the muthafuckin cops\nAnd the fuckin' bitches that's burnin in a cock\nAnd Lord forbid, don't let me see my pops\nCause it'll be a buck-buck, and another buck-buck\nI don't give a fuck, he left mom duke stuck\nNo remorse, 'cause I love shootin fakes\nSo run, nigga, run, here comes King Tee Tha Great\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "King Tee Production", "href": "King_Tee_Production&&3687", "artist": {"unique_name": "King_Tee"}, "lyrics": "(So I went into the record store\nAnd I saw this album sittin' there\nI saw this sharp lookin' dude on the cover and I said:)\n\nIt's another production from the King Tee crew\nYou know, E-Swift and the DJ Pooh\nWe brung a little somethin' that we thought you might get hip to\nTake a trip to a beat that gets you\nUp and just swingin' doin' your thing and\nBangin' on the walls while the King Tee's singin'\nFunky old lyrics that I made when I was drunk\nSo I can care less about a MC chump\nTryin' to diss me with some rhymes that suck\nSissy rhymes you must've bought for a buck\nI usually don't squeal but your rappin' is weak\nBust some rhymes, I even let you rap on my beat\n(Trashin MC's) yeah, that's the must and\n(Doggin all punks) no need for discussion\n(But what about that Cadilla you had?) it's plushed and\nYou better get ready, it's the King Tee Produciton\n\n(I mean I have seen many, many productions in my life..)\n(Oh yeah?)\n(..But this production pulled off here by)\n\nKing Tee, a super cool male\nIt felt kinda good to see \"Act a Fool\" sell\nBut hey, I'm back again with another new topic\nI mean it's 90, a nigga's gotta rock it\nAnd my intentions is to keep you steppin\nNo suckers allowed 'cause I ain't lettin\nYa mess up the party with your wacky-wack rappin'\nThe crowd starts booin soon as you start flappin\nYour mouth, Ralph, so go ahead, break south\nI knew you was a chump when you walked in the house\nYou tried to bust a move but your rhymes don't function\nBecause of the King Tee Production\n\n(All right y'all\nI want y'all to put your hands together\nAnd to bring on a brother that's bound to lay more dips in your hips)\n\n(Now I think everyone in the production should make their talents known\nTo everyone out there)\n(Let's hear it, boy)\n\nDJ P-double o-h\nBeats so funky that you cover your face\nDJ E-Swift on the cut\nGot quarters on the head so the needle won't jump\nK-i-n-g T-double e, period\nI yell a lot (TO MAKE THAT YOU'RE HEARIN IT!)\nJust like old times when I walk across stage\nWith the forty in my hand cause that was soft of a trade-\nMark, cool lyrics I'm bustin'\nYou say a few lines and you're huffin and puffin\nMe, I just flow, no need to be rushin\nPeace from the King Tee Production\n\n", "album": {"title": "At_Your_Own_Risk_(1990)&&8049", "genre": "West Coast Hip Hop", "year": 1990}}, {"title": "Played Like a Piano", "href": "Played_Like_A_Piano&&4309", "artist": {"unique_name": "King_Tee"}, "lyrics": "(King Tee) King Tee's drunk again... Yo, check this out: awww shit, aw shit, I\nWanna dedicate this song to all them motherfuckers out there that-that-that-\nThat-that-that-that (not again) perpentratin'...perpetratin'... perpin'\nTratin'. Wait, rewind. (eh but yo... King Tee, man, what is this? What is\nThis?)\n\nSome cool shit for the King's anthology,\nAnd when I'm done, don't expect no apology.\nStupid motherfuckers shoulda stepped when I warned 'em.\nI'm from the Boondocks of Compton, California.\nI'm just anxious to whoop some ass,\nI went to high school, but I flunked every class.\nSo what makes you think I give a fuck about respect?\nI'll put your bitch in check, and I'll bet\nYou won't run up, son of a punk and a bitch, too.\nI shoulda did a drive by on you and your crew.\n'Cause y'all be poppin' some shit that's unheard of.\nFor you, what's the word? Uh...(wack!)...it's murder, son.\nWhen I be crushin' your hood with a passion,\nAnd I ain't talkin' that Action Jackson.\nWhen I come you better run for ammo,\nOr get played like a fuckin' piano...\n\nAnd yo, we got my homeboy Ice Cube in the house from the motherfuckin'\nLench Mob (what's up, nigger?), and yo Ice Cube, I heard you're a singer now,\nMan what's up? Yo, yo...\n\n(Ice Cube)\nDo-Ray-Me. But I don't sing, mothafucker.\nI kick shit with the King, mothafucker.\nIce Cube will clock the cash, rock the mass,\nAnd if you run up, I'll sock your ass.\nAnd watch that eye get swollen,\n'Cause I'm playin' punk niggas like Beethoven.\nSo bust a cap or swing and die.\nFuck Yul Brynner, it's still The King and I.\n'Cause where I'm from the sun don't shine,\nSo One-Time hope I only bust one rhyme.\nBut I bust one more for the suckers,\nLast year I was Ruthless, now I'm Lenchin' mothafuckers.\nAnd you'll see in a tree, MCs and crews.\nNow they're lookin' for me, King Tee, and Pooh.\nNow every nigga that crossed me's soprano,\n'Cause I played their ass like a fuckin' piano...\n\n(King Tee) Yo, check this out, we got my homeboy Breeze in the\nMotherfuckin' house from the L.A. Posse, and he got some shit to holler. Come\nOn, man, bust this shit.\n\n(MC Breeze)\nWell, I'm-a take the mic like it was a jack move.\nRun with the beat as long as the track moves.\nHot as lava, organized like a seminar,\nServe you, your crew, him, and them and a\nCouple of rap-saps who think they can get butt.\nYou slipped and shit, so nitwit, just get the nuts.\nStealin' your high hopes, watchin' you write notes,\nBetter walk a chalk line, not fuckin' a tightrope.\nRap slicker, thicker, quicker than others, then I stop swift.\nShift from 1st to 5th, while you stop to shoplift.\nTake the mic stand whenever the duty calls,\nIf I bust a nut for every rhyme I had, I'd get blue balls.\nSerious as drama, I'm-a watch her say \"Me too.\"\nYou're shorter than Michu, your rhymes are see-through.\nYou're nothin' like GQ, transparent, I made it apparent.\nI'm here to wax and tax the incoherent.\n'Cause B-R-E-E-Z-E will eas-i-ly re-main to be-e a top MC.\nWhen you see me, I wear a beanie, and not a Kangol.\nNow you got played, like a fuckin' piano.\n\n(King Tee)\nThis is just a sample of three black Nig-roes\nWho grew up in the heart of the ghetto.\nDoin' what we had to just to make ends meet,\nSome steal for a livin', some stand on the street,\nJust slang. Some gang-bang, but big deal.\nThey say in Compton, you gotta kill or get killed.\nMothafuckin' police pull ya over, slam ya down,\nThen tell ya that your hood is their town.\nAnd I ain't goin' for no shit like that;\nCuff me up, take me to jail, I'll come back.\nTalkin' much shit, 'cause I talk what the fuck I feel,\nA few weeks in the county ain't no big deal.\nSo a punk like you can't fuck with me,\nThat big ballin'-ass nigga named King Tee.\nYou think ya can? I don't think that you can, though.\nPeace to Ice Cube and Breeze, and the fuckin' piano.\n\n", "album": {"title": "At_Your_Own_Risk_(1990)&&8049", "genre": "West Coast Hip Hop", "year": 1990}}, {"title": "At Your Own Risk (Budha Mix)", "href": "At_Your_Own_Risk_(Budha_Mix)&&5546", "artist": {"unique_name": "King_Tee"}, "lyrics": "I'ma bust it off like this for Compton\nYo! Whassup? Yo... what's happenin', what's happenin'?\nE-Swift, you cuttin' the records nice boy\nDJ Pooh whassup man? We all chillin'\nYo, yo, J-Ro's in the house, we all cold coolin out y'knahmsayin?\nAnd I'ma bust it off like this for Compton\nLook who sprung up, comin' the fuck up\n\nI came in the place to let you know what's up\nWith a bunch of trunk jewerly\nTwo or three fat gold chains, ring plates with my name on 'em\nYeah I rhyme fly, real fly Hobbes\nI wear Nike's 'cause I run from the cops\nPops taught me lots he said \"Toys are for tots\"\nAt four, bought me a box, when I was six I wore a jock\nCause, my jimmy was gettin' kinda big\nAt nine I was a kid but I took my first swig\nHugged that Olde English beer\nSo my peers wouldn't think that I was queer\nYeah, right off I got the title of a gangsta\nPranksters run because they know that there ain't a\nPerson, runnin' a verse on like this, hahahaha...\nWhassup? This at your own risk, sucker\n\n\"This at your own risk..\" This at your own risk! Uh!\n\"Marley Marl remix..\" This at your own risk SUCKER!\n\"This at your own risk..\" This at your own risk!\n\"This at your own risk..\" This at your own risk!\n\nPeople always say, \"Are you the King of the West?\"\nBut there's always some pest who try to put you to the test\nEven though, they know I'm King, I'm on a higher level\nI even dust the church and sold they soul to the devil\nI mean really, how you think I'm livin'?\nOn the strength I'm livin' like Thanksgiving\nSo yo, whassup turkey, tryin' to jerk me?\nYour rhymes don't work see, you can't hurt T\nThe almighty individual, you said you knew\nBut I don't think you really know about\nThe K-I-N-G super cool mack daddy\nI drive a Caddy, and I'm livin' fatly\nHad me on stage in a rage\nYellin' was what ya know, that's how I get paid\nMade my mark but rappers still insist, to diss\nBut yo it's at your own risk sucker\n\n\"This at your own risk..\" This at your own risk! C'mon, SUP?\n\"Marley Marl remix..\" - \"Marley Marl remix single of..\"\n\"This at your own risk..\" This at your own risk!\n\"This at your own risk..\" This at your own risk!\nBust the break!\n\n{*Marley Marl cuts and scratches*}\n\nVerse three!\nIs another one for those to remember\nKing Tee is the champ, smashin all contenders\nFor those who disbelieve, just step in my direction\nI'm snappin arms, legs and even necks and\nSuckers who thrive to drive me crazy\nYou know the ones who front tryin' to amaze me\nTake it as a warnin 'cause I'm hopin that you don't diss\nBut get a load of this, it's at your own risk...\nSucker!\n\n\"This at your own risk..\" This at your own risk!\n\"This at your own risk..\" This at your own risk!\n\"This at your own risk..\" This at your own risk!\n\"This at your own risk..\" This at your own risk!\n\n{*Marley Marl cuts and scratches*}\n\nC'mon get funky, get, get funky\nC'mon c'mon get funky\nAh oh, oh yeah get funky\nAww ooh shit! This at your own risk\n(This at your own risk suckers)\n\n\"This at your own risk..\" This at your own risk!\n\n", "album": {"title": "Tha_Triflin%27_Album_(1993)&&8545", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Ruff Rhyme (Back Again)", "href": "Ruff_Rhyme_(Back_Again)&&7263", "artist": {"unique_name": "King_Tee"}, "lyrics": "Yo Pooh, man\nWhat you build in there, man?\n(Ah - one of those hypso-change-o-calypso-beat-a-matics)\n\n(There'll) (be an-) (other ruff rhyme) --&gt; Rakim\n\n(When I'm done)\n(There'll be another ruff rhyme)\n\nAnother package from your slick Royal Highness\nPay attention, so you won't have to rewind this\nPut yourself together for another funky clip\nI bring a lotta magic, but this ain't no trick\nIt's pure skill I possess in my possession\nA crazy rhythm and my funky horn section\nAnd Pooh hyped up this funky ol' track\nSo I thought about it, I'm comin' (I'm back)\n\n(When I'm done)\n(I'm back)\n(When I'm done)\n(King Tee is back again)\n\nNow let me talk to ya to the best of my ability\nAbout the kid that's rockin' this facility\nI bring to you peace and tranquility\nDon't try to front, 'cause I know you feel it, see\nMy beats are masculine, I think that there hasn't been\nA better groove to keep you like dancing, man\nI feel thankful to feel there ain't no\nSucker tryin' to gank my spot, least I think so\nBut I don't sweat, 'cause I can stand on my two feet\nHold the mic and just curse the beat\nI don't complain about the crowd I attract\nRoll out the red carpet, I'm comin' (I'm back)\n\n(When I'm done)\n(There'll be another ruff rhyme)\n(King Tee is back again)\n(There'll be another ruff rhyme)\n(When I'm done)\n(I'm back)\n(King Tee is back again)\n\nWell, this might seem odd\nYou ask who taught me, well, it musta been God\nCause ain't none of y'all cool like me\nThe impresario, majestic Tee\nSome rappers are scared of me, they say when they dare to be\nThreatened, well, keep on steppin, I'll be prepared to be\nJacked, Jack, cause your rhymes don't match\nYou got bold when I left, now I'm back\nTo stomp you, cause you stomp wrong, so I'ma stomp on\nFool, you forgot, I'm from Compton\nThis is just a taste of my album, really nothin'\nJust to show you I'm back (I'm comin')\n\n(When I'm done)\n(There'll be another ruff rhyme)\n(King Tee is back again)\n(There'll be another ruff rhyme)\n(When I'm done)\n(There'll be another ruff rhyme)\n(King Tee is back again)\n(There'll be another ruff rhyme)\n(Back again) (back again) (back again)\n(There'll be another ruff rhyme)\n(There'll be another ruff rhyme\n(When I'm done)\n(There'll be another ruff rhyme)\n(Ruff rhyme)\n(Ruff rhyme)\n(Ruff rhyme)\n(When I'm done)\n(There'll) (be an-) (other ruff rhyme)\n\n", "album": {"title": "At_Your_Own_Risk_(1990)&&8049", "genre": "West Coast Hip Hop", "year": 1990}}]