[{"title": "Sweet Unique Pete", "href": "Sweet_Unique_Pete&&8453", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Yeah! Kool Keith\nBlack Sil (yeah yeah) and company!\nAs we party... two-zero-zero-zero\n\n(Kool Keith)\nStep in coat check, vocal supreme sound perfect\nYou wack man, haven't you heard this?\nMatador king ladies swarm around me like Jon B\nAs I stop rappers tryin' to copy Alpo (?) Rich Port (?) and AZ\nMy temperatures one-thousand-three\nLook at these big head kids on labels tryin' to MC\nWith a globe dome\nI told you to tell that man to stay home\nTell Russell to call me with Sylvia Rhome\nGave him the gas, now he gotta pump in his ass\nI don't care if you go out with Stacey Dash\nRentin cars, you tryin' to copy Nas\nSound like A.G., you ain't my man from Cold Crush KayGee\nDon't try to play me\nYou never made a record with Mo Bee, and Master P\nI saw you on the Greyhound bus station floor\nLayin down with a doo rag on like a circus clown\nStrippers keep dancin around, I'm Bronx bound\nYour fans catch migraines from me doin' my thang\n\nChorus: Kool Keith (repeat 4X)\n\nWe sweet unique Pete\nLook at these ladies massagin our feet\n\n(Black Silver)\nYeah\nYo showdown, sho' shot, double-K, flow pop\nNavigate, interactive flashback\nNow who nice wit it? Spit it on the block daily\nProduct, never shady, slang the real\nSend it to backstage, flame created a rage\nMays (?) bump that in my mezzanine controller\nHigh-roller, program, this shit jam\nTo quick access, asses on my lap crouches\nDip through; y'all need a piece of this mental\nPlus a sip of this dick in your mouth\nEither that or stop sleepin', peepin the next man's style\nI elaborate on fraudulent and stick to the wild\nPhone-tap, we order Ocean Spray with that\nFuji film, honey spread that\nFinger the asscrack in fact I'ma bounce with that\n(Yeah, bounce with that)\n\n(Kool Keith)\nFuckin' dancers back to back\nAww yeah\n\nChorus Two: Kool Keith (repeat 4X)\n\nWe're sweet unique Pete\nLadies massagin our feet\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "Party In Tha Morgue (Club Mix)", "href": "Party_In_Tha_Morgue_(Club_Mix)&&5273", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Repeat 8X)\nParty in the morgue...\n\n(Intro: repeat 2X)\nParty in the morgue (party in the morgue) party in the morgue... (party in the)\nParty in the morgue (party in the morgue) party in the morgue... (party)\n\n(Repeat 4X)\nC'mon! (Party in the morgue)\nParty in the morgue (party)\n\n(Repeat 4X)\nC'mon! {*indecipherable*} party in the morgue (party)\n\n(Verse One: Reverand Tom - Kool Keith)\nWomen know the flame, I can't shame your fame\nWe bought the bottles, club bring in the reign\nDon Don of Pino, bottle up first\nCall Vegas casino, the top cat with the dark blue Cadillac\nUp to Reno from there\nHit the Filipino, let her roll, get bold, reload\nFirst name Gino, Valentino\nTake her to the patio, park the spot, slut you're hot\n\n(Repeat 4X)\nC'mon! Like that y'all\n\n(Repeat 3X)\nLet me see you say hoo! (hoo!)\n... Party in the morgue ...\n\n(Repeat 2X)\nLet me see you say hoo! (hoo!)\n\n(Verse Two: Reverand Tom - Kool Keith)\nWomen know the flame, I can't shame your fame\nWe bought the bottles, club bring in the reign\nDon Don of Pino, bottle up first\nCall Vegas casino, the top cat with the dark blue Cadillac\nUp to Reno from there\nHit the Filipino, let her roll, get bold, reload\nFirst name Gino, Valentino\nTake her to the patio, park the spot, slut you're hot\n\n(Repeat 4X)\nC'mon! (Party in the morgue)\n\nLet me see you say hoo! (hoo!)\nParty in the morgue... party in the morgue\nC'mon! Party in the morgue\n... Party in the morgue\nC'mon... let me see you say hoo! (hoo!)\nLet me see you say hoo! (hoo!)\n[M-Balmer] I be makin' all the noise\nC'mon (party in the morgue)\nLet me see you say hoo! (hoo!)\n[M-Balmer] I be makin' all the noise\nParty in the morgue (party in the morgue) party in the morgue (party)\nC'mon...\nC'mon...\nParty in the morgue (party in the morgue) party in the morgue (party)\nParty in the morgue (party in the morgue) party in the morgue (party)\n\nLet me see you say ho!\nIt's a party in the morgue, Bronx Brooklyn style!\n\n(Repeat 2X)\nParty in the morgue (party in the morgue) party in the morgue (party)\n\nLet me see you say hoo! (hoo!) C'mon...\n\n(Repeat 2X)\nParty in the morgue (party in the morgue) party in the morgue (party)\n\n", "album": {"title": "Kool_Keith_Presents_Thee_Undatakerz_(2004)&&2279", "genre": "Hip Hop", "year": 2004}}, {"title": "Same Sound", "href": "Same_Sound&&7217", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "We built the robot, called Voltron\nWho will replace the music industry in ten years\nWe're working on him right now\n\nEverybody sound the same\nEverybody rap the same\nEverybody sound the same\nEverybody rap the same\n\n(Kool Keith)\nI got 7 million Bentleys, two thousand Range Rovers\n8 Jaguars designed up, 600 million ladies lined up\nShoes with built-in air conditioner\nAll 48 Mack trucks parked in position\nCredit cards by the pages\nYou can't stop the helicopter and baller stages\nI take care of adults\nSend 20 thousand grants to kids all ages\n10 grand pianoes, my TV show's The Sopranos\n800 acres of free land\nWith a custom made zoo don't touch the animals\nBathroom toilet, and bathtub with diamond handles\n8,000 flights a year\nSend the women to El Salvador first class tickets to come over here\n\n(Kool Keith)\n22 Porsches in front of 7 gas stations I own\nGive every girl a New York a cellular phone\nInterstate highway controller 22 thousand cars on the freeway\nCo-signer by myself, under me one owner\n800 thousand in charity, to the Red Cross and blood donors\nDiamonds on my shoe soles\nBears and sheepskins, hunters make my coats from Polars\nSupport women, give 'em section 8 loyalty\nWith 50 thousand baby strollers\nSend private jets out every 5 seconds to pick up high rollers\nMilk containers with my name on 'em\nWashing machines with my embrodiery and fame on 'em\nWho could stop me?\n\n(Kool Keith)\nWith 8 bodies, I can perform in Dallas and L.A. and New York\nAnd Miami, Texas and Denver, 3 more cities at the same time\nSimultaneously sync'd up with the same rhyme\nLyrics come in braille\nDid a show in Montreal, in an arena 62 thousand packed\nEverybody was blind, 6 thousand pythons around my neck\n3 tigers and 4 lions, just bought the tampon maxipad company\nThere's no slouch or slum in me\nHotel investory - been in the game since Watergate\nSix million suits, paid in full\nThrowin' iced up Rolexes at A.J. Lester\nWe New Jack City, CMB! You see\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "Stop Frontin", "href": "Stop_Frontin&&255", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nI wanna talk about Hollywood mon, y'know?\n\nEverybody's leasin, dey frontin\nCar payments, dey wantin\nEverybody's on the phone, dey somethin'\n\n(So what you sayin', so what you sayin'?)\n\n(Kool Keith)\nYou're not that good on Tech\nI'ma ask Sway, the Fantastic 4 every day\nWe know the worst rapper\nIf you hear the same records too much, get off the dizzicko\nYou got men that suck the station off\nA group of men and women that pay for airplay\nThat hit the station off on air day\nSuck the program director's nuts\nThe right hand is slippery, relationship to DJ\nIf he's cautious, he'll go the other way\nA West 4th Street connection\nBut payola baby need affection\nWatch everybody in the music game\nThere's an undercover lover kissin', ask Lena\nYou got the contract, the label not satisfied\nEverybody flout, spent 9 million to go gold\nAsk Benny Medina\nThey flop, he flop, you know they got dropped\nWith an option to sign again\nYou jackasses won't never sing a rhyme again\nFrontin on \"That's How I'm Livin',\" in the mansion\nPapers on your floor, you break out like Robin\nYou saw the international star, with Miss Givens\nStraight behind takeout Jamaican posse with mad triggers\n\n(So what you sayin', so what you sayin'?)\n\n(So what you sayin', so what you sayin'?)\n\n(Uncredited rapper)\nI come with the clique if you slip get clipped\nMoney be flipped, the dope we ship\nFrom Beach Street to Dancehall\nMake the call, play the mall, we buy it all\nThis O.G. don't respect a suspect\nYou're low-tech, squash you like insect\nYou sniff blow, I count dough\nA pimp with lamp to glow or grow\nGet crunk, you won't make it to the trunk\nI'm all you want, your boy's a punk\nPopular and Briz, hers and his\nThe kid won't fiz, the kid's a whiz\nYour career's coma, Tommy Mottola\nOpiola, can't help you it's over\nYou're dismissed, don't return, hope you learn\nH-Bomb, 7th Veil, our turn\n\n(So what you sayin', so what you sayin'?)\n\n(Kool Keith)\nHe pays for the rotation\nYou pay for the relation\nYour lyrics weak, the DJ must play\nThe town suffers, the people laugh at your frustration\nYour vocals need Yugoslavia\nYour rhyme need a vacation\nWhen you rap I flip through the dials\n18 million people change the station\nSince the war, your rap's been depression\nIt's causing cities to suffer\nKids buy your whack CD, the families feel inflation\nA recession like you the best and\n\n(So what you sayin', so what you sayin'?)\n\n(So what you sayin', so what you sayin'?)\n\n", "album": {"title": "Dr._Octagon_Part_II_(2008)&&1223", "genre": "Hip Hop", "year": 2008}}, {"title": "Girl You Know", "href": "Girl_You_Know&&8956", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(You know the outcome)\nGirl you know the game, and when you start to run\nWho is this new guy, thinkin' he's funky\nHe ain't nothin', girl you know\n\n(Kool Keith)\nRappers who freestyle forever\nCan't afford to buy a cup of cocoa admire my leather\nYour girl get wetter, touchin my custom made chains\nYour lip gloss on my, Italian sweater\nI know you hate me already, go debate me with Freddie\nDJ's gonna act like little feminine, in more places\nBought the high heels, on the hard concrete\nRemove your women's bra, feel chest\nWipe your eyeliners off your baseball cap\nThe Starter jacket don't match yo' faces\nYou put the thongs on, move your panty protectors in the right places\nTerror in America, feel my drama, defecate on your baby's momma\nI sport the real gators, Lou Casey and Tony Llama\nY'all act like divas with a flat ass like Madonna\nParty whereabouts don't ask me\nHold your Zippendales, this ain't Chippendales\nY'all flippendales, move slow like snails\nThongs show your girl's tails, y'all blaze L's (L's)\n\nGirl you know, the man ain't funky\nBut the brother is whack yo\nAh-what you tell your man girl?\n\n(Kool Keith)\nRemington blows with shells\nBig Hank movin dank comin' up the road with a full tank\nMake your girl buy another drink\nJoe Greico, we break neck-o, hand your wife the peppermints\nWho represents, y'all couldn't close to me one inch\nY'all need to sit down on the wood like Johnny Bench\nY'all know the Borden family, your fiance drive a Camry\nYour hype man name is Annie\nYour producer in the background wear the black panties\nNo time for the clean-up service or nannies\n\n(Kool Keith)\nFeeble position wackster, what's up blackster\nLyrical master, asshole plaster\nYou a known hitter, with the first base glove\nYour mom with the catcher's mitt-er\nPamper for your babysitter\nFoul smells, your house smell like cat litter\nDon't get bitter, I move and get rid of\nCan't flow average, maverage\nRabid food, vegetable particles, final cabbage\nYou got the nerve to rap like you live in Paris\nStandard reels, I clown dummies\nWhen your first advance is in your deal\nStage level, stiff with no skills\nA bird with beak and bills\nI crush you from New York all the way out to Hollywood Hills\n\nKoooooooooooooooooool, Keith, whatevah\nLike rappers say\nLike Big Daddy Kane say rappers steppin to me\nThey wanna get some, you know the outcome\nYou wanna get some, you know the outcome\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "Midnite Madness", "href": "Midnite_Madness&&2226", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Verse One: Thee Undatakerz)\nStep to the altar as a sacrificial lamb\nWhen you enter 12 o'clock, on the dot, bet he drops in the center\nOf a star sided circle pentagram, it's official\nWorse than Heaven's Gate baby, massive family come to get you\nStab your body till you with it, drink your blood mixed with liquor\nBloody meat, chew on {?}, smokin' weed and a Swisher\nWhile you bleed I'll read the scripture, snatch a snake while it slither\nCeremonies of a black moon risin' on you tit\nIt's the {?} gettin' sicker, now the world is into war\nEverybody led a beast who fell asleep with a whore\nRevelation on the rise, tribulation at the door\nDon't nobody know the time, so throw your Rolex to the floor!\n\n(Chorus One: Reverand Tom - Kool Keith)\nMidnight madness! Ah, we the undertakers\nMidnight madness!\nMidnight madness!\n\n(Verse Two: Reverand Tom - Kool Keith)\nWith Anacin and Dexetrim, medical pharmaceuticals\nAnd tetracycline\nWith the Michelin Man on stage\nSoaked thongs wrapped around Been Grim\nSpace Ghost!\nPopeye and Brutus was supposed to smuggle Barney's work\nBut the Teletubbies waitin by the Greyhound bus station\nBig Bird wanted to kill Oscar\nBut Minute Mouse was runnin' the East coast with Bat Mike and Gazoo\nOn Harley Davidson bikes, Kermit the Frog was the project guard\nMr. Slate and Barney Rubble drivin' a Cadillac Escalade\nDonald Duck walkin' across the street with Link from Mod Squad\nDavey and Goliath in the purple 6-4 with mink rugs on the floor\nSippity Sam and Talcon Sam\nFrank'n'Berry on the corner worried about Perry (Perry)\n\n(Chorus Two: Reverand Tom - Kool Keith)\nMidnight madness! {*repeat 4X*}\n\n(Verse Three: M-Balmer)\nI buck one I buck two, could even buck you\nKick back nasty-minded ways to fuck witchu\nCause this is what I do, kill yo' whole crew\nTold you I'm incredible game, so fuckin' spit and\nNo compassion is shown to my victims\nEach battle I'm winnin' 'cause I'ma get wit it\nI'm this Don that strike, get yo' cap peeled tonight\nUnbelievable, nobody unpredictable\nHood life queen puttin' it down for the S.C.\nBefore I leave, who they really wanna see\nNobody baby\nFuck with the queen of the tribe of the knives\nNobody who surprised, come take a walk with me, and you gon' ride\nYou died, a body bag, cause you made a bitch mad\nMadder than a hatter, not really that that matter\nMy noggin so fucked up, I'm convinced I'm a psycho\nLet my vocalistic rhymin take you to another level\nFeel the fire, look at how we burn but the sherm\nKeep the flick of the flame jumpin', now lemme hear ya say somethin'\nI keep it comin'\nLet my vocalistics carry ya, represent yo' area\nSix 4-5 automatics in my rifle\nReady to set it off, BOO-YAA, when it's a quick draw\nGet yo' ass kicked tonight\n... 'Cause it's the midnight madness\n\n(Chorus One] + [M-Balmer ad libbing)\n\n", "album": {"title": "Kool_Keith_Presents_Thee_Undatakerz_(2004)&&2279", "genre": "Hip Hop", "year": 2004}}, {"title": "Lyrical Magic", "href": "Lyrical_Magic&&8526", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nYeah, 7th Vail (7th Vail)\nKool Keith, the prince of New York\nMy man... H-Bomb\nLike no other\nMy breed is no other\nThe world fashion instructor\nNew wave gator conductor\nMy name written on the back of your hiphuggers\nGotta handle that flashes\nAdjust my speed shutter\nFuturistic vocalist, Kool Keith\nI'm pro at this\nI'm too high up in the sky\nMany are lower at this\nGirls look out the colossal windows\nIt's on when the wind blows\nScroll through your bank accounts, I'm not a pimp\nYou wanna give me your pocketbook\nI'm not a violatin guy, I'm not a pocket crook\nThe empire of all this\nPeople say what kinda style you call this\nMy sparkle shine, it's all wrist\n(Uh-huh, it's all wrist)\n\n(Chorus - singer)\nYour girlfriend got in me mayn\nShe been givin' me brains\nThere's no shame in her game\nBut you should be ashamed (I'm the prince of New York)\nYou see I'm runnin' thangs\nGot diamond rings and chains\nSee I move in big ways\nI like the finer thangs (I'm the prince of New York)\n\n(Uncredited rapper)\nFrom age 14 I been walkin' this talk\nFuck Bill Cosby, I'm with the prince of New York\nIn ninety-four, {?} play with Eric B.\nLeft {?} for the West coast from Jersey\nAnd that's the time where about Big and 'Pac\nThe time on the mic, niggaz had to rock\nDon't cuss the Lord 'cause he had blessed\nSome distressed from the shine on the chest\nThe men remain, many get slain\nFlipped perks for personal gain, money woodgrain\nI changed the code, I save a load\nI've crossed the road and L.A. showed\nThe flyest chicks, the dopest whips\nThe cush is the shit, out of town is flipped\nYour hustle stopped cause you can not\nDo what I do so you chill with a half knot\n\n(Kool Keith)\nThe National Enquirer, tornado mister\nEssence Magazine\nYou the model with the nice legs in sister to sister\nYou got a little resume with Mannie Fresh\nSo you worked a couple of videos\nFor Mario Winans and Tung Twista\nWho's your contact? And who should I call back?\nTurn around girl, all I see is a wineglass shape\nIt's nice right there, the thong gets lost\nI see all back\nI'm tellin' your man, I'm all that\nThe industry bore me, y'all all whack\nI created Hustler, I ball back\nWhen I shop, I'm all back\n\n", "album": {"title": "Dr._Octagon_Part_II_(2008)&&1223", "genre": "Hip Hop", "year": 2008}}, {"title": "Fright Night", "href": "Fright_Night&&3382", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Flavor Flav)\nI can't hear nuttin though\nAll right, where you want me to start at?\nAiyyo you can kill the music then\nYo, check one two, check one two in the place to be\nFrom the bottom to the T-O-P\nThat's right, Flavor Flav, Public Enemy\nFrom Bronx to L.A., we don't fail\nKickin right here for 7th Veil\nMy man Kool Keith, H-Bomb, no jive\nYo, H-Bomb, hit 'em in the head son\n\n(H-Bomb)\nNo blazes, tennis shoes and denim\nPimp I got the gators, leathers I kill 'em\nYour bullshit events, don't play right\nNo tribute awards for Mr. Barry White\nIt's Guantanamo Bay, industry's gay\nHard to get rich, I don't swing that way\nThat switch to funny make record in Kingston\nJesus is black, tell Mel Gibson\nWho wears a skirt, Sting and Dave Navarro\nMy strap, my money, don't lend, don't borrow\nThe Sunset Strip is Gaza Strip\nYour clothin line is shit, H is fuckin' sick!\nThe rap game industry too quiet\nHehehehehe hah hah Atkins Diet\nNo backpackers pro-athlete actors\nI rep for pimps, pushers, jackers\nThe P on the fitted I'm all for pimps\nI throw ropes down for my niggaz in the clink (yeah boy!)\nFirst and foremost, the industry don't want it\nFuck it, I take what I want and flaunt it\nI'm not vexed, they spend for sex\nWho's next after Michael, fuck Funkmaster Flex\n\n(Flavor Flav)\nYeah boyee, kickin it for 7th Veil\nThat's right, H-Bomb (fuck the industry, fuck it)\nKool Keith (fuck the industry nigga fuck it)\nHit 'em G\n\n(Kool Keith)\nNo game here, I shit on you ill son\nFuck Hollywood's best guest list\nMaximum dead-ass parties with flat-ass Paris Hilton\nMy shit shine bright with Von Dutch wipe\nJockin my gators, bitches with fake titties act like\nThey don't suck dick, can you see me under the standard light\nFuck the red carpet, I'm in here with standard hype\nYou just at the crib on Sycamore\nYour blonde cocker spaniel, my rings shine in your face\nYouse a asswipe, you basketball player nut and scrotum jocker\nYou the givin' ass type, with the Minnesota Timberwolves\nGarnett's clockin your ass pipe\nUgly monster-face bitch, you think you dressed tight\nEvil bastard, you make your grandmother upset\nDon't flush the toilet motherfucker, you tryin' to start a fight\nRelease the shit off my chest, get rid of the gripe\nI shit inside your grey and white Nikes\nExercise your fat stomachs, no hamburgers at Chevies\nYou ride them fuckin' bikes\nCorny-ass 42 year old player's club bitch\nThe funky face motherfuckin Wanda Sykes\nThat baldheaded motherfucker just put a weave in, on UPN\nWhack-ass tattoos above your titties\nYour hard faced bitch, you'll see me again\nLike Faith Evans is the only one that sniffs\nAll you cocaine motherfuckers in the hills\nEven Vivica Fox is a ugly bitch, chasin Curtis for his chips\nEngineer, just put me in that mix\n\n", "album": {"title": "Dr._Octagon_Part_II_(2008)&&1223", "genre": "Hip Hop", "year": 2008}}, {"title": "Grave Undataking", "href": "Grave_Undataking&&4014", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(M-Balmer)\nIt's like a million cars deep, in this cemetery\nI'm dressed in black, high heels, black veil, and a strap\nHomies sheddin tears about it, reminscin\nOlder yesteryears, how we kicked it there\n\n[F.D.] It's a great day for undataking\n[R.T.] Jim, back the truck up\n[F.D.] I'm backin it up a little further\n[R.T.] Hurry up, back the truck up\n[F.D.] Gotchu\n\n(Reverand Tom - Kool Keith)\nA hundred percent of you think you're popular\nI haven't watched cable and television, in 20 years\nYou catch the hook\nI don't even know how the average jackass with a jersey look\nCheck the format, Mr. and Mrs. Unknown\nI'm like the Amish people\nCandles, no phone, although jocked by many stars\nWho copy me, still on my bone - been ridin' limos\nWatching crossing guards move you to the Immature zone\nFrom top to middle, down to the bottom\nYou face the highway, lookin' at Leatherface\nThree miles away, you'll be in wrong place\nI will make the move with the truck\nThe Funeral Director, will come with his own\nBlack suit and that spector, to step in his ride\nWill we see, when the cow walks at night midnight with the leather hide\nI will walk and stand in the dark zone, with the light, from the lamp\nThis is no sleepaway camp\n\n(Funeral Director)\nThat's right, I am, the Funeral Director\nAnd we do not, run, a sleepaway camp here\nWe only, take\n\n(Thee Undatakerz)\nManic depressive, mental patient\nIn a basement smokin' wet in the morgue\nWith a swordfight, cat up, runnin' meditatin\nWithout no ouiji board\nMy omnipotent potential crush skulls\nChewin through yo' favorite rapper's nails\nWalkin' with body parts in L-A-X airport\nWith a briefcase kept confidential\nA natural born menace runnin' loose through yo' neighborhood residential\nUrban suburban section a killin' machine, with 187 credentials\nMy bladin through South Central, South Bronx, walkin' through South Chicago\nIvan Durago, Red Dragon, Hannibal Canibal, chewin through human jawbones\nHandle your mandible with a iron claw, black iron eagle with evil thoughts\nI release human form, drink blood drops\nLove to watch when a body drops, when the shotty pops, better drop\nWhen I strike yo' turf, 'cause if you don't run and hide, it's suicide\nI'ma stun yo' hide, and leave you - six feet underneath the earth\nSerial killer like Ted Bundy, on the mic I'm Adolf Hitler\nFar worse than Osama Bin Laden, plottin on hell\nWhen I get there I'ma kill the devil first, then put his head up for sale\nPut his head out for sale, put his head up for sale\n\n(Funeral Director)\n{*Laughing*}\nYes, we will, put his head up for sale\nHis heart, his liver\nHis whole, internal, organs\nWe don't play here\nWe Undatake, here\nSo remember\nIt's a Grave, Undataking\n{*Laughing to end*}\n\n", "album": {"title": "Kool_Keith_Presents_Thee_Undatakerz_(2004)&&2279", "genre": "Hip Hop", "year": 2004}}, {"title": "Dark Road", "href": "Dark_Road&&3544", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Reverand Tom)\nNew Line Cinema, presents the Dark Road\nStarring, Jean Claude Van Damme\nWith Wesley Snipes, Morgan Freeman, Kool Keith\nRobin Williams, with special guests\nNo Name and Knobody, from Thee Undatakerz\nDark Road, coming February 22nd at a theater near you\n\n(Verse One: Kool Keith - Reverand Tom)\nI'm tired of rap, I don't even like makin' records no more\nI quit, y'all don't know, a long time ago\nI'd rather hang in strip clubs in Detroit and Chicago\nI hate lookin' at rappers who freestyle\nWalkin' around the same block, they still gonna be there tomorrow\nBattle back and forth, East South West and North\nWith 40 thousand records I don't need to record no more\nTwo million or better, three {?} on tour\nNothin' to prove, live in the Bronx, y'all show me hardcore\nBeen around Europe, all over the United States\nJay-Z, Rakim, KRS, you ask Big Daddy Kane\nI'm Artis Gilmore, block shots everybody comin' down the middle lane\nPromoters don't call me no more\nGun toters will call you when I'm poor\nWalk up to your Bentley, get out, everybody get on the floor\nWhether actor or singer, you could be extra\nAnd feel the tec-9 texture\nWith ups on skinny legs, baldhead like Patterson Projects\nNate Archibald, y'all think I'm Clyde Drexler\nWalk up to your radio station with sawed-offs, speak with the Winchester\n\n(Chorus: Reverand Tom)\nWe about gainin, reignin\nPuttin' in pain in, tamin\nWho's rappin' lame and, playin'\nWe about gainin, reignin\nPuttin' in pain in, tamin\nWho's rappin' lame and, playin'\n\n(Verse Two: M-Balmer)\nNow, let's let the session, keep verbally manifestin\nAin't no question, how many niggaz we nut testin\nBurn Krush Groove, wettest loop, don't know why you mask too\nNobody and ain't nobody comin' with it so keep second guessin\n110 let the games begin\nAnother rhyme leave 'em all behind\nLive on stage or any other time\nYou can not affect me\nMessed you up when you found out that nobody was carin\nNow feel me, kill 'em though, Ms. Ghetto Phenomenal\nBangin' on those that oppose this\nVocally chose, who got the flows, can you handle those?\nBringin' heat from the streets of S.C., that's me\nNiggaz be tryin' to see me, but they can't get with me\nNow what?\nWell it's the Mistress, blowin' in like El Nino\nThrowin' blows to yo' cerebral\nMs. Kill 'Em Though, Ms. Ghetto Phenomenal\nBangin' on those that oppose this\nVocally chose, who got the flows, can you handle those?\nBringin' heat from the streets of S.C., that's me\nNiggaz be tryin' to see me, but they can't get with me\n\n(Verse Three: Thee Undatakerz)\nStop all the silly games, suck my gat if you hatin'\nI don't care if you rich famous, I'll still send you down to Satan\nBreakin all public laws just to get my paws on a grip\nI'm a dog from L.A. streets, but I still love runnin' with crips\nRunnin' with clips, fully loaded, automatic, without no tips\nThem hollow point silver bullets, that'll bust yo' head if you trip\nI'm on a West coast mission, we throw my set up in yo' face\nGot a problem let me know right now and we can go settle it Ace\nI move with Manny Green, B-Stro Brown, Thug Life Mopreme\nRazor Blade, Major Seven, Mean Yo and Big Chachi\nFuture Free from the pen, we hit the streets like gorillas\nKnuckles scrape across the concrete, we on the hunt to get mo' scrilla\nWith Thee Undatakerz, monster like Godzillas on the mic\nYou wanna see us, you might die, whether day or night\nNow scatter the light, but we still come out when it's dark\nVampires stalk the streets, alleys of L.A. to New York\n(Central Park, what?)\n\n", "album": {"title": "Kool_Keith_Presents_Thee_Undatakerz_(2004)&&2279", "genre": "Hip Hop", "year": 2004}}, {"title": "Freaks", "href": "Freaks&&4415", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Freaks get naked, freaks get naked\nFreaks get naked baby, freaks get naked baby\n\nGirl I feel the way you love me, hold me at night and hug me\nYou got the phone from my pocket to beep me and bug me\nForget the do rag, I ain't no thug, gee, I'm more bugged gee\nSleep in the bathtub, get rid of the waterbed\nMove your thongs out to the side\nForget the the room, hotel lobby, I bone on the rug, gee\nReset the tripod, filming women like Rocco\nPutting their hands between their legs, with ecstasy\nI feed the girls like cats, Purina to go\nHere's your bowl, they always jump out the shower\nDoggystyle on the couch, with their heads shedding on my pants\nRubbing next to me, you pay me, I'll pull out a ??? gee\nYou changed up on me, now you gotta pee\n\nFreaks get naked, freaks get naked\nFreaks get naked baby, freaks get naked baby\n\nTrojans in the green pack, you lay on the kitchen table\nAnd lean back, fruit cocktail and pancakes syrup\nFlow down your butt crack, ice-cream around your pelvis\nYou're a star, baby, buy a ticket from New York\nYou wanna meet guys like me, directors in Hollywood, you wanna sell this\nWin awards in Vegas, slide your g-strings off\nYou're wit' the top film makers, mid-town traffic\nI'm meeting with Black Tail, you're talking to fakers\nI own a factory, my workers are thong makers\nBlack woman with Caribbean shakers\nI've been doin' this since Time Square Arcades had Space Invaders\nRemoving your panties off slow on Penn Station escalators\nI love lesbians, they're not haters\nHunny, you graduated to booty shorts\nHands around the missal, you made it to the majors\nPick a condom, cherry, strawberry, blue-berry\nI got all flavors (I got all the flavors...)\n\nFreaks get naked, freaks get naked\nFreaks get naked baby, freaks get naked baby\n\nYou make the appetizers, I'ma re-connect the DVDs\nThe television is clear, Ghetto Booty in progress\nAdjust the atennas, hunny, no need for cable\nI fix the triple X wires, don't lie if you're on your time of the month\nYou don't have to rush, cause internal problems can hold\nI don't want the room to smell like car tires, I'm sipping Stolichnayas\nButterscotch, soaking your g-spot area from Breyer's\nDon't fool yourself with the toys under your bed - you're deniers\nNo time to hurt you, they're looking for screamers, I'm looking for cryers\nAdmire your bed sheet you're on\nCareful planning, the one I need to teach you on\nNo regular movie, I rather watch porn\n\nFreaks get naked, freaks get naked\nFreaks get naked baby, freaks get naked baby\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "The Set Up", "href": "The_Set_Up_(Skit)&&1883", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "<span style=\"padding:1em\"><a href=\"/wiki/Category:Instrumental\" class=\"image image-thumbnail link-internal\" title=\"Instrumental\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D\" alt=\"TrebleClef\" class=\"lzy lzyPlcHld \" data-image-key=\"TrebleClef.png\" data-image-name=\"TrebleClef.png\" data-src=\"https://vignette.wikia.nocookie.net/lyricwiki/images/1/1e/TrebleClef.png/revision/latest/scale-to-width-down/30?cb=20090423154754\" width=\"30\" height=\"68\" onload=\"if(typeof ImgLzy==='object'){ImgLzy.load(this)}\"><noscript><img src=\"https://vignette.wikia.nocookie.net/lyricwiki/images/1/1e/TrebleClef.png/revision/latest/scale-to-width-down/30?cb=20090423154754\" alt=\"TrebleClef\" class=\"\" data-image-key=\"TrebleClef.png\" data-image-name=\"TrebleClef.png\" width=\"30\" height=\"68\"></noscript></a></span> <b>Instrumental</b>\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "The Funeral Director", "href": "The_Funeral_Director&&4417", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "[Rev. Tom] I'm here with the Funeral Director\n[Fun. Dir] Mmmm-hmm\n[Rev. Tom] He wants to tell people about, a lot of his records\n[Fun. Dir] Mmmm-hmm!\n[Rev. Tom] And the way he conducts his, churches and stuff like that\n\n(The Funeral Director)\nI bury bodies\nI stick catheters, in their chest cavities\nI keep things moving\nI don't mind burying, I don't mind undertaking\nYes I will be your Funeral, Director\nThe Funeral Director\nThe Funeral Director\n\n(Thee Undatakerz)\nSee I walk the urban streets\nBloodthirsty with spit drippin from my teeth\nBlack werewolf on the loose chewin ligaments\nOnly human without no beef\nMy next victim just might be you\nThe Undatakerz, East West coast bodybaggers\nDraggin bodies up and down the block around the clock\nBefore the doc, toe tag 'em\nFuneral Director slash bodies, leave 'em cut up in a blender\nWhether it's John or Brenda, Sal or Glenda\nAnybody corpse we dismember\nSee God made me this way, gave me this distemper\nI was born with the intent to kill\nFeelin' no emotion when the body drops\nActually the, sight of death, just might make me thrill\nI love to watch flesh peel\nTake the picture of you when you take yo' last breath\nTryin' to gasp for more air without no energy left\nOrderlies move for death\nLet your life go, let your life go, breathe slow\nLet your life go, breathe slow\nLet your life go, breathe slow\nJust let your life go and breathe slow\n\n(The Funeral Director)\nI will bury you\nI have no problem, with putting you in the ground\nPulling up my truck, putting your casket... inside, my hearse\nDriving it up, to the graveyard\n\n(M-Balmer)\nM-Balmer got a style that is versatile\nBlowin' up the room, make the crowd go wild\nSo have a smoke, not a cap\nNow who not not not not not now\nLet's see how many MC's jock my flow\nTwo thousand and ten, I'll be a legend though\nStill keepin' up the flow\nFluid runnin' through my soul, make me grow\n'Cause I'm instructable and I'm invincible\n\n(The Funeral Director)\nWe have, platinum coffins, to put you in\nYou can believe, you will not, be coming back\nHa, ha ha, hahahahaha\nAh-hahahahahahaha\nAh-ahahahahahahaha\nAh-ahahahahahahahahahahaha\nAh...\n\n", "album": {"title": "Kool_Keith_Presents_Thee_Undatakerz_(2004)&&2279", "genre": "Hip Hop", "year": 2004}}, {"title": "Captain Save 'Em", "href": "Captain_Save_%27Em&&323", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith: talking)\nYeah\nAll you ladies walkin' around in the club\nWith them fake engagement rings on\nActing like you married\nThe Captain is here\nWe shall report to the front\nAnd all you guys acting like you real players\nWho always talk behind peopla back\nI never see you with no girls!\nIt's gettin' kinda strange, funny style\nLet the Captain begin\n\n(Kool Keith)\nWhite Stesson hat, fur manicure, matchin' mink\nMakin' NBA players start to think, who's that standin' over there\nTakin' pictures for Rolling Stone magazine with a leash on a polar bear\nSky blue suit from Milan, girls posin their executive area\nActing like they don't see me, standin in front of me\nWalkin' by me three or four times\nShowin me views of they Victoria Secret thongs, tryin' to turn me on\nEyewitness news interrupt the Shane Mosley fight\nJust to pan in closer to my shoes\nTelevised, myself beyond cellular phones and business cards, I network\nMake the Billboard, number one singers and rappers\nPeople from RCA, Clive Davis net-hurt\n\nSave 'em (save 'em)\nCaptain save 'em all (save 'em all)\nSave 'em (save 'em)\nCaptain save 'em all (save 'em all)\n\n(Kool Keith)\nCover my face with Rayban glasses, from photographers I try to hide\nLadies with lingerie cry, 'cause I wear protection won't come inside\nPlaces get empty when I leave\nPay butlers 600 dollars a minute just to adjust my cufflinks, and my shirtsleave\nIn 2003, in the double R, I lean metallic green\nProfessional chauffeurs over my doors\nWomen lust over my lyrics like basketball players\nNFL teams walk up unbenouced\nExcuse me! I'm talkin' to Tristar Pictures right now\nKeyshawn Johnson I heard you a great football star\nI'm not plastic, but I'm on a conference call\nTalking to Michelle Phieffer and Ben Barene\nGo down stairs to the movie theaters\nMe and my old lady like the persuaders\nMorrie alligators, 800 combination flavors\nCountin' presidents, we stand with cash mil's, like the Miz\n\n(Kool Keith)\nJacuzzi bathtub, with a 24-second clock to take your panties down\nIf not most girls get replaced by a sub\nSent home, upscale in a limosine with a Subway sandwich and a dub\nErased from the system\nI move better, collared shirt made of leather\nWhy would you be walking around Beverley Hills wearin pleather?\nWith lights, camera, action\nA part of my MCing is a small fraction\nStrong machines coming on Greyhound from Memphis\nGirls screamin at the Captain, \"I wanna be saved!\"\nMe and Barbara Streisand walking down the corridor, with more\n(And so much to offer)\n\nSave 'em! (save 'em)\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "Errand Boy (Skit)", "href": "Errand_Boy_(Skit)&&9758", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "<span style=\"padding:1em\"><a href=\"/wiki/Category:Instrumental\" class=\"image image-thumbnail link-internal\" title=\"Instrumental\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D\" alt=\"TrebleClef\" class=\"lzy lzyPlcHld \" data-image-key=\"TrebleClef.png\" data-image-name=\"TrebleClef.png\" data-src=\"https://vignette.wikia.nocookie.net/lyricwiki/images/1/1e/TrebleClef.png/revision/latest/scale-to-width-down/30?cb=20090423154754\" width=\"30\" height=\"68\" onload=\"if(typeof ImgLzy==='object'){ImgLzy.load(this)}\"><noscript><img src=\"https://vignette.wikia.nocookie.net/lyricwiki/images/1/1e/TrebleClef.png/revision/latest/scale-to-width-down/30?cb=20090423154754\" alt=\"TrebleClef\" class=\"\" data-image-key=\"TrebleClef.png\" data-image-name=\"TrebleClef.png\" width=\"30\" height=\"68\"></noscript></a></span> <b>Instrumental</b>\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "Jocking My Style", "href": "Jocking_My_Style&&1245", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Mr. Whitefolks)\nHey y'all what's happenin' you understand me?\nYou know who the fuck this is\nThis is Mr. Motherfuckin Whitefolks, you understand me?\nAbout to hit you with some brand new intro type shit\nFor two thousand and fo', ya understand me?\nY'all ready, and it goes somethin' like this\nWhat you say, what you know, ho give me some dough\nDon't be slow, knee deep snow\nSocial security to Edgar Allen Poe\nNina Ross payin' the cost\nPussy without dick is pimpin' that's lost\nLike a cell that's tossed\nKris to the Kross, I'm a player that's boss\nDon't care what you say about me\n50 said I was a P-I-M-P\nIt's that way Snoop, fucked your bottom bitch, Betty Boop\nDowntown in the loop, a loss you can't recoup\nMany are called but few are chosen\nFrostbite, and toes got frozen\nIn here till closin\nWork keyhole, till I get in shape\n5th Avenue parade, ticker tape\nStraight laced, no chase\nPerry Mason took your place\nPerform plastic surgery, you got a new face\nLollipop suckers, ice cold motherfuckers\nHaven't paid enough dues to be in this club\nHad to get a six inch sub\nAll the whiteboys think they're cooler than me\nImpossibly impossibility\nWho would you rather be facin\nFreddie or Jason\nDo you like steak sauce on your steak?\nAre you real or fake? I'll pour the A-1\nAnd pimp on you, from day one\n\n(Chorus - female singers)\nGimme my money, my weed, my drank - bitch!\nWhat the fuck you thank?\nIt's, Mr. Whitefolks, and I keep it pimpin' man\nLa-da-da-deee, la-da-da-dah\nChilly Chill, 7th Vail\nKool Keith, and Mr. H\nYeah yeah...\n\n", "album": {"title": "Dr._Octagon_Part_II_(2008)&&1223", "genre": "Hip Hop", "year": 2008}}, {"title": "F-U M.F.", "href": "F-U_M.F.&&2275", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "So what you got your first deal?\nWho you signed with, nigga?\nEpic?\nDef Jam?\nI don't give a fuck if you're with Warner Bros.\nWho you signed with, nigga?\nMuthafuckin Loud?\nInterscope, Columbia, Sony, 550\nFuck it if you're with Dreamworks\nAnd if is, you're in-house commercial-ass producers\nCan suck out the interior out of my dick\nY'all still 75, that ain't no new shit\nFake-ass wanna-be hip-hop shit\nDon't worry about who the fuck I hang with\nJealous muthafuckas\n\nI'm tired of niggas fooling muthafuckas\nActin' like they drug dealers\nAll you rappers fantasizin that jewelry and car shit\nYou can pull the Speedos and suck my dick\nTell your corny fans who believe that shit\nLick the back of my ass quick\nI'ma shut faggots down\nEspecially muthafuckas with that gay-ass production\nNew millennium homo sound\nSmack the shit out of you for doin' that wack-ass shit you do\n50 bodyguards surround you\nKeepin' men that fuck you in the ass around you\nStandin like you runnin' shit, you ain't the fuckin' President\nPosin with ugly bitches in your video who take AIDS medicine\nYou don't wanna fuck with me or rock with me\nOr rhyme on any block with me\nFuck the rap museum\nI should be on the wall next to Run-D.M.C.\nBetween Public Enemy\nSome asshole is jealous of me\nI don't care no more about your lyrics\nThe average MC is bullshit, I don't hear it\nFuck you talkin' about you rap with a good spirit\nI make rappers intimidated\nOver wack-ass beats they get motivated, some have ministrated\nEven suburban kids copy your shit and duplicate it\nMy balls you now cherish\nBy some new-ass MC about to perish\nType of muthafucka to eat a lotta celery\nYour CD was butter-soft - what you tellin' me?\nA bunch of 'N Sync type of fans hyped you up like Bill Bellamy\nA bitch like you would rhyme with a curfew\nNiggas with real shit will hurt you\nThe girl scout club I refer you\nBastard you\nYour man rap, new nigga, he's wack, fuck you\nStay low, I'm above you\nErase your shit, I don't dub you\nFuck you\nFuck you\n\nMuthafucka\nFuck you\n\nMuthafucka\nFuck you\n\nYeah\nYou been rappin' for 20'000 years\nAnd you ain't got your fuckin' deal yet?\nWhat the fuck\nDon't take your problems out on me\nAnd the rest of you muthafuckas\nWalkin' around lookin' like some old alien niggas\n\nMuthafucka, I pull your face off\n'Bout to show you what the fuck you look like\nCause you keep it real\nToo real muthafuckin broke\n2001\nNobody was sayin' that shit when I was payin' for them fuckin' hot wings\nHope you burn your fuckin' lips\n\nFuck you\nMuthafucka\nFuck you\nMuthafucka\nFuck you\nMuthafucka\nFuck you\n\nAsshole\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "Stop Rappin", "href": "Stop_Rappin&&6824", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nThere's more whack shit than a lil' bit\nMotherfuckin football players tryin' to rhyme\nBasketball niggaz, fuck the rap game, don't waste your time\nStay off the court, get off the fuckin' football field\nMy rap shit is real, ABC News got you gassed up\nFucked up from the mouth up\nPushin assets, Bentleys and houses\nTake off your jerseys, grab the mics\nShut the fuck up, flow for flow\nShow for show, bitch go for go\nThem everyday motherfuckers you listen to, won't help you\nWhen motherfuckers rippin you, from asscrack to ankles\nWhen I'm dissin you, hold the toilet bowl I'm pissin too\nMake your white Persian rugs turn yellow - HELLO!\nYou fucked up with a commercial-ass nigga, soft as Jello\nYou motherfuckers head back to gas, somethin' more mellow\nShit on your telephones and change your zip code zones\nReptile alien motherfuckers, gorillas comin' toward me\nI shit on you clones, and defecate twice in your ice cream cones\nLet a Mexican tell you\nWhy did you try to embarrass yourself and rap against, Kool Keith homes?\nTake your basketballs and stick it up your ASS\nTake your footballs and stick it up yo' ASS\nI battle 27 teams, all the way to New York for 5 hours first class\nGive your whack-ass friends a enema\nYour girlfriends witness my shit, with a buddy pass\nI concentrate, break down motherfuckers fast\nG-string niggaz, cover your ass\nDumb ass bitches be quiet - my boyfriend's all that\nHe's 245 pounds worth of muscle, he can rap fast\nHappy New Year bitch! Kiss my ASS\nYou know the kid, I'm Bill BLASS\nFuck around, you got the GAS\nAll you motherfuckers comin' out here for the awards and shit\nFuckin' go back home\n\n", "album": {"title": "Dr._Octagon_Part_II_(2008)&&1223", "genre": "Hip Hop", "year": 2008}}, {"title": "New York City", "href": "New_York_City&&640", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Chorus: repeat 2X)\nNew York City, we piss in it, we live in it\nWe die, we all take shits in it\n\n(Kool Keith)\nThere's a million albums out there with that opera and Shakespeare shit\nI stuff my ears with cotton when you rap\nI don't hear shit, you niggaz are excess waste\nA hundred percent of the mainstream crowd, receive pure shit\nThe hottest DJ's in New York spin it from the wheelchairs\nWith cancer, my voodoo ready to roll\nAsk Harlem Hospital, you can't cure shit\nHMV at the cash register, girls tryin' to make me buy CD's\nSoft jazz and homo R&amp;B\nI ain't payin' for that Allure shit\nWalkin' by Bloomingdales before you see me put the pep in it\nI guarantee you get bad karma\nFly leather coat with the Coach bag\nYou step in shit, choose the Daily News\nThe newspaper's gonna take off a little off your soles\nYou got a lot around your feet motherfuckers not a little bit\n(Wipe that shit off your soles)\n\n(Kool Keith)\nI'm straight up on the butt-ass transit\nI don't give a fuck, I smell the piss in the subway\nMy Boss cologne suits me well on the New York City mass transit\nWomen lookin' scared, borin-ass statues\nBitch you need to get out the boroughs\nAnd move to Kansas or Pittsburgh or somethin'\nSittin' up with braids in your hair like a fuckin' Halloween pumpkin\nSmile motherfucker, put on some lipstick or do somethin'\nEat your breakfast muffin\nMy appearance shock your brand new motherfuckin leather\nI ain't say nothin'\nCause in your panties secretly, I know you readin the magazine comin'\nThe freak on the train is bustin'\nI was sittin' here first, you wasn't\nI know you goin' home to masturbate\nYour girlfriend is messed up, datin her own fuckin' cousin\n\n(Kool Keith)\nY'all just reachin' your damn horizons, so what?\nYou got your cellular phone, motherfucker you pre-paid\nGirls and guys I'm not frontin\nY'all bullshittin talkin' to nobody lookin' good at the dinner table\nRunnin' your fuckin' bill up on Verizon\nYou ain't shoppin' with a lot of Victoria's Secret bags\nMonkeys treat you to Unos, retarded-ass herb niggaz are thin\nGirls are more insecure, I'm realizin\nThe datin and courtin shit got everybody hyped up and sportin shit\nThe Bell system fraud\nDial on the spot or stand trial on the spot\nLadies don't invite me over\nJust cover the mattress with the piss, and the cum spot\nDon't blast the same lame-ass singin' MC a lot\nNow move the ticket off your window, Manhattan traffic cop\nYou shoulda dipped, your shit in the parking lot\n\n", "album": {"title": "Dr._Octagon_Part_II_(2008)&&1223", "genre": "Hip Hop", "year": 2008}}, {"title": "27 Shots", "href": "27_Shots&&2925", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nThey try to say California is plastic\nI think New York got the most plastic niggaz too\nFuck all you niggaz comin' out to the Soul Train Awards\nWith them pop ass headsets - around your ears like Britney Spears\nThat's some old Bobby Brown and New Edition shit\nThat's some old REAL Michael Jackson shit\nI'm comin' with Crazy Vic\nLet me hear you tryin' to copy my shit\n\nFuck the impact eventually\nCause there's a lot of corny niggaz performin out there\nFat stomachs, make-up and eye glare\nWhat the fuck do I care?\nNiggaz with they ass out\nGroupies in cheap motels tryin' to fuck and crash out\nMotherfuckers ain't networkin\nStrippers checkin' in - motherfuckers on motorcycles\nPickup trucks with license plates on 'em\nBringin' mad shit from down South\nBig after-parties I'ma turn my phone off\nI don't wanna shake hands, meet no-fuckin-body, arrogant bastard\nNo commercial shit, break your neck, suck my dick in the world\nFuck the critics everything I make is a hit\nFuck you applehead motherfuckers tryin' to make some old\nCaribbean mixed with that Trinity keyboard shit\nHip-Hop shit, that's some old Broadway musical shit\nI don't even listen to that cartoon shit\nTell your A&amp;R and his wife to get out my fuckin' life\n\n27 shots! {*BLAM BLAM BLAM*}\n27 shots! {*BLAM BLAM BLAM*}\n27 shots! {*BLAM*}\n\nShut up; listen to my shit cause yo' cassette single is gay\nWritin that bullshit I hear on the radio by these homo niggaz everyday\nButter soft sissy shit\nI got the real tell it like it is pissy shit\nYo' shit is some fake-ass gorilla code shit\nWhite suits mansion yachts scared-ass nigga\nDoin' videos buyin models on some boat shit\nI tell you straight G I can't fuck with it\nGirls still messin with you; your shit is wack\nAny bitch in they right mind shouldn't have sex wit you\nRusty nigga that don't use soap\nI fuck around, and piss all over your leather faggot-ass trenchcoat\nDon't ever act hardcore\nYouse a suburban nigga, you get serviced nigga\nYou never even been in a fuckin' street fight\nLook at your old photo album pictures - youse a bunch of hype\nKiss my ass, nobody picked up the fuckin' mic\nUntalented bitch like you some wild ass\nInner-city kid from the projects - who's next?\n\n27 shots! {*BLAM BLAM BLAM*}\n27 shots! {*BLAM BLAM BLAM*}\n27 shots! {*BLAM*}\n\nThen I really disrespect all production out there\nThat bullshit niggaz programmin, fuck Johnny Hammond\nSonny Stitch, that shit ain't gettin' you rich\nJust a packed crowd, low bitches, a bunch of fuckin' dicks\nI'd rather see some ass, a nice club with a fat ass\nAnd all you motherfuckers actin' like you Jamaican\nAmerican to the core, copyin that shit on tour\nY'all niggaz be against speakers with your ears sore\nStank ass boots with no socks on, fuckin' up the dancefloor\nSince when you ate codfish and meat patties?\nI got cousins with jheri curls in caddies\n\n27 shots! {*BLAM BLAM BLAM*}\n27 shots! {*BLAM BLAM BLAM*}\n27 shots! {*BLAM BLAM BLAM*}\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "Help Me - Praise The Lord", "href": "Help_Me_-_Praise_The_Lord&&9970", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Ah... Undatakerz\n\n(Verse One: Thee Undatakerz)\nMan I got my wet stick ready, machete and devil mask\nMovin through yo' neighborhood I snatch up your ghetto pass\nA true to life Ghost Rider, don't try to come block my lane\nI'm Adolf Hitler in the flesh and I'm back, to kill again\nKillin' this game, I never show no remorse, feelin' no pain\nStill in this club with manic thoughts that I still kill in my brain\nFeelin' insane I'm goin' crazy Manson blood in my veins\nNo matter what'll happen to me where I'm goin' won't change\nThe stranger lookin' through your window, drinkin' blood in the rain\nI can't explain these evil thoughts, I guess I'm goin' to flame\nBut still I'm searchin for redemption like it's money and fame\nWe only got one life to live, a shame we live it this way\n\n(Chorus: Undatakerz)\nPraise the Lord, help me Jesus! (Jesus)\nPraise the Lord, change the game (change the game)\nPraise the Lord, help me Jesus! (Jesus)\nPraise the Lord, change the game\n\n(Verse Two: M-Balmer)\nFather forgive me, I'm full of sin\nBut you said if I knocked, you'd let me in again\nSince I was doomed from the womb\nThat's why I'm blessed I guess\nThroughout the years, I done test the test\nBut still left 'em somethin' left\nAfter so many tears with this hard liquor, cigarettes by the ounce\nLeft with a wet one, ready to bounce\nSo amazin, everlastin love, bust a dub\nUp in the club - what? Nigga what?!\nI thought I told you where I'm at with mine\nMomma born into this life of crime\nMoney murder and mayhem go hand in hand, you better feel me\nThese niggas real G (these niggas REAL G)\nContractions is yo' reaction, when I'm blastin\nLaughin', shit you know these busters like plastic\nClock's about to strike 12, you better save yo'self\nMidnight pass and last days, movin fast\nCheck yo' periphreal, y'all don't trust 'em though\nDon't waste yo' breath, if y'all ain't got no flow\nDon't waste yo' breath, if y'all ain't got no flow\nDon't waste yo' breath, if y'all ain't got no flow\n\n(Verse Three: Reverand Tom - Kool Keith)\nComin' up the 101 freeway\nI seen a ghost lookin' through the window at me\nIt coulda been the smoke from the dank laced with PCP\nAmbulance in the red light, stole these vanilla Coogi sweaters\nWalkin' into emergency\nSweat by the pound, heat off my side, I let off 30 rounds\nTwo girls in the car waitin signed\nIn the fake name registered under Don {?}\nNo Medicaid card, you can't see the doctor was hatin'\nThree hours in {?} room\nI seen the mic on the floor; kids walkin' by with some guy\nThat looked like a dentist with balloons\nLied on the application about the dust and mushrooms\nFour cans of {?}, walkin' out around supermarket lookin' meaner\nEmbalmin fluid, 7-Up bottled, one liter\nAir condition off, goosebumps I left on the heater\nEmpty rollin' out 400 miles with no gas on the meter\nBig Moe tryin' to poison the hydro\nNow y'all sound like diss\nTryin' to shoot the dang\nAnd yo I'm comin' around here sniffin blow with Uncle Chris\nJacked Noel Christmas, I couldn't buy them gifts\nReal twist, I was about to slice my wrists\nWith your tinsels and number two pencils\n\n(Verse Four: Thee Undatakerz)\nResigned, design, remade buildings on shrines\nInclined to decline, pull your ass bone out your spine\nFlaunt - these aftermaths don't procrastinate\nA Jacky Jasper much faster, four pound blaster\nDuct tape what raster, but just come from Bronx\nChild you want somethin', nickel bags of dust, hush\nWeak niggaz I don't trust, plus\nI left the bathroom left somethin' dere for you to flush, lush\nDrink up quick, think up schemes, linger\nFour carats in the crossfinger, ocean liner sinks so what nigga?\nGovernment deluxe pine box rigormortis in a tux\nAnthrax and chicken pox, my nickname's Fox\nStolen cars and dealing with rocks\nWhen lightning strikes, suction cups, high voltage shocks\nYou look like Spock, dead, from imitating Biggie and Tupac\n\n", "album": {"title": "Kool_Keith_Presents_Thee_Undatakerz_(2004)&&2279", "genre": "Hip Hop", "year": 2004}}, {"title": "Spank-Master (Take Off Your Clothes)", "href": "Spank-Master_(Take_Off_Your_Clothes)&&1756", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Remove your clothes\nTake off your clothes (Strip!) [3x]\n\n(Kool Keith)\nOut the shower, we butt-naked\nCash and ass, we don't fake it\nMeasuring tape, by four she'd take it\nMouth is open, nuts you ate it\nPlayer on the side, I know he hate it\nAlligator shoes, I'm tailor made it\nFuck high-class, we move low-graded\nLast night what, she masturbated\nHit the club, my last dance got rated\nSwitched girls, every time we traded\nCall girls, we always date it\nMascale, we always state it\nNo weave, we like it braided\nGirl, you don't know me\n\nMaxin' hoes\nRollin' Vogues\nOn limosine Cadillac's\nGet in and get ya booty smacked\n\nCome in cowboy like we western\nNaughty girls you learn your lesson\nSpanked, whipped, or Smith and Wessoned\nFeel your breats, bite your chest and\nShit on ya shirt, pee on ya dress and\nTossin' salad, face all mess and\nSuperman, big shirts with the S and\nEvery eastern, Charleston Heston\nGo to church, Bible blessin'\nHere for ya talk, and tell a confession\nAudience clap, we still guessin'\nTripost camera, back to the session\nMove all panties, we progression\nPromised sex, so we protestin'\nFilthy sheets, ice cream made a messin\nCome upstairs, ring the bell keep pressin'\n\nRemove your clothes\nTake off your clothes (Strip!) [2x]\nRemove your clothes\nTake off your clothes\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "Taking Pictures", "href": "Taking_Pictures&&2584", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Whassup baby?\nC'mere let me feel your pussy a lil' bit\nTurn around, that's right\nLet me see that pretty ass\nLean over\nLet me put a little grease in your ass\nKnahmsayin baby?\nFine-ass bitch\n\nBitch let me see one of the titties\nHit you in the face with one of these fitties\nWatch pictures, pass out\nIn the leather sofa with the ass out\nPiss in your pocketbook\nWith a patch over my eye like Captain Hook\nFuck all the romance and love books\nStill they help your pussy like a crook\nBreak you down to the name of your asshole\nConnected to the Chevron station and the gas cable\nMotherfuckers cooperate, don't be hateful\nLotion your ass up, you're ungrateful\nTake a shit in the underground picture\nMake it commercial\nMore tasteful, parental advisory\nClean your vagina with ammonia and ivory\n\nPiss in your face\nPiss in the right place\nPiss in your face\nPiss in the right place\n\nRaisin mutilation\nReynolds and Wrap, Tupperware\nNew Jersey sexy shit\nHype nipples, eatin your own defecation\nVicks in my nose\nSniffin glue while you smell ass\nI specialize in bitches who communicate - and sell ass\nIf I'm upset, I get a ride and tell ass\nPut your ass in a butt-cast\nFingerpop you with my Jason mask\nYou can't sleepover and crash\nGinseng up yo that's right\nEverybody's gettin' pissy, with chronic and hash\nWaterbed and the table\nLeave urine in the back of your Taurus Sable\nTie my underwear to the back of your car\nSpray your ass with {?}\nDress you up and grab the Vaseline jar\n\nPiss in your face, girl you know\nPissin in your face, pissin in your face\nPissin\n\nYour eyes feel my dick in the dark\nPart of your bathroom, you think I'm sick\nI fill the soggy shit and you split\nOver 40 to 50 plus\nOld bitches who smoke PCP and dust\nFuck the lust, pour milk on your Bally with Orange Crush\nCover your asshole with a Slurpy slush\nOrgy over here, that's right they doin' it over there\nBut I'm the director with a camera, everywhere\nI'm the photographer, Jim take pictures\nYo, y'all be first, cause there's seven of us\nAnd I'm not gonna do this\nI'm gonna get through this, and do this like Brutus\nTaking pictures\nPhotographers, Nikon and Pentax\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "Everybody Playin' Here", "href": "Everybody_Playin%27_Here&&4413", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Yo I ain't hearin nothin', Kool Keith in the place\nI'ma be all up in your face\nYo, I'ma tell you, I don't wanna hear what you got to say\n\n(Kool Keith)\n'Gwan from here, forget the all-star game\nLight your ass man with flame, urinate in the brain\nLadies react move with panties off with the prawns\nImposter from the Barbados\nPrivate jets shock your island\n40 oz. undercover with a cashmere\nYour fake Gucci glasses, your jacket's made out of reindeer\nJealous, I know you act like you don't hear\nTop controller, winey waste\nI'm not impressed, beyond your fat stomach\nTwist your tiny waist\nJacket and juice leave your bad mouth with a bad taste\nWe keep it clean, no passin gas or sardines in here\nNo girls with a lack of hygiene with sardines in here\nYo, you know Garland, open the roof, crack the beer\n\nIt's apparent, tell no shame in here\nEverybody know the game in here\nKnow you playin' in here, what you sayin' in here\nYou're playin' here\n\n(Kool Keith)\nLike Free and Mary J. Blige, AJ look like the Predator\n#1 with the tec-9 in the duffel bag, I'm your competitor\nBounty catcher master, you face me in America\nYou know you guys rhymin little gay for commercial\nDeep in the industry, the anal crevices\nY'all date men, your bodyguards too busy datin trends\nThe kid on the mic, your hype man goes the other way\nSanta Monica butt boys\nFly your girls in from Chicago, Illanois\nAsk the judge right here, don't budge right here\nY'all light in the ass, featherweight, fly your kite here\nBird figures, y'all ain't all that, don't let me reveal you\nCap peel you, top of the mansion butt boys\nEarnin for girls, y'all strut boys\nPlay your right hand side with Tonka toys\nWalkin' back and forth like Enoch against your crew\nSayin' \"crush, kill, destroy\"\nAsian girls relax on Soul Train, you're stiff\nEat your bok choi\n\n(Kool Keith)\nSpecial effects make most of your average rappers with pastel colors\nWallpaper in your background, I P-I-S-S on you\nGame benefits, collect C-I-S-S on you\nDon't need one mic there, I'd rather vomit on two\nPeople suck! Are you down? I'm in your area\nYou bad, the more the merrier\nSanta Claus, put flammable fluid to your claws\nI break all sissy laws\nTreat you like a prosti' on Sunset, you bet\nI know you're in the back of the aisle, your girdle's wet\nYou got the nerve to move and listen to Keitho Sweat\nLook around yo\nYou're like the girl who used to sing a long time in Florida\nI call you Anquette\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "Drugs", "href": "Drugs&&1422", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Back in the 70's, it was all about drugs..)\n\nTie my arm up at night between shows\nTakin' soda tops off of soda pops\nI used to be up all night in the living room\nSmokin' a lot of weed with the Four Tops\nMakin' collect calls back home to my pops\nMy little brother said, \"Keith - you need to stop!\"\nI knew something was wrong\nWhen I gave away my VHS and sold a pair of my socks\nThe IRS callin me, gettin' on my nerve, I was warned by Redd Foxx\nMy girl, \"Keith you seen my diamond rings in the jewelry box?\"\nI don't know; last night you and Chaka Khan was in here sniffin blow\nI was in the room sweatin thinkin' about the rent playin' bingo\nThe landlord said the first of the month, we gotta go\nPacked up my bag and met Darryl Strawberry in the mall\nI told James Brown stop smokin' angel dust and the pis-tal\nHe wanted to go up to the Olive Garden and start a restaurant brawl\n\"Mary J. Blige, my son don't accept them type of phone calls\"\nI can't come out tonight, my Bic lighter don't light\nI heard you and K-Ci in the background\nI'm screamin did the cops come and break up the fight?\n\nAll the crack and the drugs, make me feel, the way I feel\nAll the crack and the drugs... drugs...\nAll the crack and the drugs, make me feel, the way I feel\nAll the crack and the drugs...\n\nFreebasin eighteen pounds of coke with Marvin Gaye\nPut that on the table, let's parlay\nWith Smokey Robinson and Bootsy, lightin aluminum foil\nWatch that crack pipe boil\nWith Richard Pryor we burned the house down gettin' higher\nDon't think I'm bluffin\nMeet Tommy Lee Curtis, Keith Richards, Eddie Kingwards and David Ruffin\nRick James was in the kitchen lightin the flame\nAnd Mousey's trapped with Cuba Gooding Sr.\nI don't want nobody to know my name\nI kept glasses on it was a damn shame\nLosin weight, fallin' out in big arenas\nThe same guy who used to deal to me\nDeals to Whitney and Bobby, meet Ike and Tina\nEvery Saturday mansions was packed, \"Hey Jimmy you got the smack?\"\nShut up! You don't know how to act\n\nAll the crack and the drugs, make me feel, the way I feel\nAll the crack and the drugs... drugs...\nAll the crack and the drugs, make me feel, the way I feel\nAll the crack and the drugs...\n\nCrystal methane... and heroin and quaaludes...\nA relapse, of your mind\nAngel dust, ecstasy, sniffin coke baby...\nGot the best of me-heee-heeeee...\nI got rits, withdrawals, my symptoms of pain\nRush me to the hosss-pi-tallll...\nOoh, ooh baby\nGet this monkey off of MY MY MY BACK!\nAnd get him off of me\nGet the monkey off my BACK! Baby!\nGet the monkey\nAnd get the monkey off my back now...\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "Jealous", "href": "Jealous&&6979", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "I used to be at Mars with Flex; now everything changed\nHe was the only one in the room DJing - empty room\nHe was cool back then, used to talk to niggaz\nNow he can't say hi on the street, big boy\nI knew Angie Martinez - 12 o'clock midnight nobody listened to her show\nNow she wanna rap\n\n(Kool Keith)\nYeah, all the motherfuckers are jealous of each other\nAll that click shit is bullshit\nEverybody mad, cause this guy got the record before this guy\nThis guy don't play this guy\nBecause this guy got the record before that guy\nDJ, This is bigger than DJ That - and all that bullshit\nNiggaz - actin' like they don't see a motherfucker\nTurnin' they heads the other way, that's some ol' bitch-ass shit\n\nI can't fuck with them mixtape niggaz\nA lot of them New York DJ's are jealous\nI don't give a FUCK about Funkmaster Flex\nHe don't give a FUCK about me\nThey ain't playin' my shit on MTV, a bunch of wack niggaz kissin' ass\nSame commercial MC's, you ever notice niggaz look at your feet first?\nEnvious faggots are worse - fuck the 106 Park shit\nI'm on some dark shit, niggaz are plastic\nTec-9 blast through your Avirex fabric\nWhat's the fuck up with Mister Cee and Mr. Magic?\nSteve Smith, gon' STILL act like bastard\nA lot of niggaz need to see some cables and rope\nTied in basement with New York police department smellin gunsmoke\nAct like you don't see me, turn your fuckin' face backwards\nA decade of jealousy\nWhat the fuck y'all tellin' me?\nDon't act like you don't remember me\nYou used to bump my shit in Mars\nNow you on some trim goatee shit like El DeBarge\nFuck the Tunnel tonight and that petty shit at the Garage\nAnd Jimmy's Cafe shit, I ain't on nobody's dick\nI remember when BET wasn't shit!\nAfter a certain time on that channel, owned by white people\nFuck y'all night people\nSuckin ass ain't my forte, you fuckin' with the right people\nIs Stretch bumpin my shit?\nDo I have to pay niggaz with envelopes and a bottle of Cris'?\nFuck a Rolex, I got the same shit you got on my wrist\nAll that jealousy shit is mayonnaise and celery shit\nY'all hated down South and West coast rappers one time\nNow everybody that was frontin is now slurpin they dick\nInhalin like Menthols and Vicks\nMost of y'all can't stand to see a nigga shine with jewelry and kicks\nBad bitches and chicks, stop hatin' each other\nMotherfuckers this is the \"Jealousy\" remix (Hot 97, remix!)\n\nJealousy, jealous motherfuckers\nJealous...\nJealous motherfuckers (W-B-L-S)\nY'all jealous of each other, jealous of each other\nJealous...\nJealous of each other (92.3 the Beat)\nJealous motherfuckers\nJealous motherfuckers! Y'all some jealous motherfuckers\nJealous motherfuckers\n\nYeah\nNow I used to know, Bambaataa used to play everybody's shit\nI ain't think even Kool Herc came out with some ol' bullshit like that\nWhen all the DJ's, back in the days, them niggaz stuck to-fuckin-gether\nYou see, Theodore, didn't mind, Mean Gene, on his set\nNow these new motherfuckers, are like, on some new futuristic shit\nBut I'ma give y'all some 2003 shit to work with, for a little bit\n\nJealous motherfuckers - jealous of each other\nJealous... motherfuckers\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "The Hearse", "href": "The_Hearse&&3409", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Chorus: Reverand Tom singing)\nOoh\nI see the night, the moment, for the reason of the crying\nFor the dying I feel belief in what we all be trying\nI see the night, the moment for the reason of the cryin\nOf dyin', I feel that we be all tryin' (tryin', tryin', tryin')\n\n(Verse One: Al Bury-U)\nMy 454 engine, war suspension, immaculate\nBlack hearse Undatakerz dead corpse in the back of it\nAttackin rappers with cake, flossy niggaz in clubs\nMoet bottles and Cristal but they ain't showin no love\nReverand Tom'll buy me a eulogy, I spit in your face\nDrive you to the cemetery, make you sit in the grave\nI'll bury you, not just my alias name, but the truth\nSmashin all your favorite rappers, whether woman or dude\nShiny suits and pretty makeup, homo rappers in trucks\nLeave you six feet under, all covered up in the dump\nFrom the jump it's on and poppin' one-eight-seven on sight\nThe homicidal Undatakerz takin' over the mic\nDrivin' a black hearse\n\n(Chorus: Reverand Tom singing)\nOoh\nI see the night, the moment, for the reason of the crying\nFor the dying I feel belief in what I'm feel-in (feelin')\nI see the night, the moment for the reason of the cryin\nFor the dyin', I feel belief in what I feel (what I feel)\n\n(Verse Two: M-Balmer)\nI'm rollin' pimpin' through these grey clouds\nPickin' up bodies 'cause I'm a wild child, I love my lifestyle\nCheck the repertoire, if you read between the fine lines\nOf life and death, niggaz dyin', strugglin for they last breath\nYou hear the sound of the trumpet blow!\nYour body's cold cause caps be gettin' peeled\nAnd blood be gettin' spilled\nPimpin' out headlights and creepin' through the night, will they blast\nDo they wanna smoke me? Or provoke me? I'm workin with a fifth\nAnd five freshly dipped sticks, embalmed it's the M-Balmer\nFuck all y'all niggaz and y'all baby mommas\nSpit shit by the bound, M-Balmer finish every round\nWatchin dollars multiply into six figures\nGot no time for skanless-ass hoes and bitch niggaz\nWonder where I get my lye, no-ass hoes abbreviated\nThey contemplated the playerhatian caught me up in situations\nBest believe, now they assassination\nSo let it bang, and I'ma swing this thang\nItty bitty knockin' busters off my titty\nSo saditty with the Thee Undatakerz with me\nNow really...\n\n(Chorus: Reverand Tom singing)\nI see the night, the moment, for the reason of the crying (the crying)\nFor the dying I feel belief in what I feel (what I feel)\nI see the night, the moment for the reason of the crying (crying)\nFor the dying, I feel belief in what I feel (what I feel)\n\n(Verse Three: Reverand Tom - Kool Keith)\nEnergetic, kinetic, fuck a {?} free\nCatastrophe, passive leaded with embroidery\nRotary, dope from me, loadin me, tortin me\nClose aphobia, with the knee jack, with the knee pack\nComin' to attack with LoJack\nNigga whether you white or you black, I rack, you lack\nCount attack the track, and carry load my back\nAction sacks, power jets, burn to the max\nSocialism with cannibal vocalism\nHopin ism, diplo manalism, smokin' ism\nJerkin with the jism and wisdom, hip-a-pot-a-mo-pism\nMaterial on grism lyricalism\nThe tiger and bear-a-lism, monkey and animalism\nOh, oh\n\n(Chorus 1.5X: Reverand Tom singing)\nI see the night, the moment, for the reason of the crying (the crying)\nFor the dying I feel belief in what I feel (what I feel)\nI see the night, the moment for the reason of the crying (crying)\nFor the dying, I feel belief in what I feel (what I feel)\n\nFor what I feel, for what I feel\nBelief in what you're dying, the crying\nOoh ooh ooh, oh oh ooh\n\n", "album": {"title": "Kool_Keith_Presents_Thee_Undatakerz_(2004)&&2279", "genre": "Hip Hop", "year": 2004}}, {"title": "Stoney Jackson", "href": "Stoney_Jackson&&9558", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nThis is a message - yeah\nTo all you jheri curl, cats - SOLAR - yknahmsayin?\nYou Chic kids, seventy-four niggaz, SEVENTY-FOUR niggaz\nFuck that I remember them niggaz with jheri curls\nNobody's hardcore niggaz who souped up ready for the world\nBabyface in the deal, I keep shit real\nActivator spray, you know how that shit feel\nOnly SOLAR Records was signin niggaz with curls\nAnd givin' Afro Sheen niggaz a deal\nAluminum foil suits, you niggaz know your roots\nLike undisputed truth, lakeside, music niggaz, Zapp clap niggaz\nI referee, watch them fight backpack niggaz\nBig groups like Heatwave and War, carryin all that shit\nAmp and costume shits on tour\n\nWake up! ... The sun's in your face\nThe sun in your face\nWake up! ... The sun's in your face\nThe sun's in your face face face face...\nWake up! ... The sun's in your face\nThe sun's in your face\nStoney Jackson!\n\n(Kool Keith)\nFuck you liar, tryin' to come like you Earth Wind and Fire\nSly Stone picture with a DJ and a Numark mixer\nNiggaz on Julius Earving dick, use a 76er fake Sir Nose\nLarry Blackman was dissin rap with Cameo\nI had my Lee dungarees on, and my right arm pickin' my afro\nSlave was my niggaz, I bought ten cans of gel activator\nWhen Atlantic Starr was payin' no mind to me in the front row\nI wasn't FUCKIN' with the Isley Brothers, the Gap Band\nOn stage all them shiny motherfuckers like Clear and Pure Energy\nMore jheri curl niggaz flyin into LaGuardia and Kennedy\nI'm before rap, FUCK YOU, I'm the Public Enemy\nMadison Square Garden security can't get with me\nDon't bother me, motherfucker I'm busy!\n\n(Kool Keith)\nThis is my land, fuck K-Ci and the Sunshine Band\nWack-ass leather gear with them metal chemicals around your hand\nParliament/Funkadelic\nTwo niggaz comin' out with that same shit like Bootsy\nYou ain't a true nigga\nAlexander O'Neal perm type shit on your Ampex reel\nJimmy Jim and Terry Lewis production\nGot Morris Day on the SSL board\nWith fucked up beats that need reconstruction\nVest on the cover of Jet with liposuction\nJheri curl niggaz like The Time got fucked up on their publishin\nFrom TKO to Con-Funk-Shun, the Jet album was hot\nThe Family shit was bumpin\nFuck what you thought Stoney Jackson you was somethin'!\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "Reverand Tom", "href": "Reverand_Tom&&9734", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Reverand Tom - Kool Keith)\nReverand Tom! (Praise the Lord!)\nEverybody with the straw hats (yes amen)\nEverybody with the black tight suits on\nEverybody with the Stacy Adams shoes on (praise the Lord)\nWhat are you gonna do when this guy\nJump out this coffin and start breakdancin? (Hallelujah, woo!)\nDoin' the slip and slide (amen)\nLook at him, they buried him with a polka dot suit\nHe didn't have the loot\nBut he's gonna get up and do some dancin, look at him, slidin\nDoin' the electric slide, back and forth\nHoppin out his coffin... you didn't think so did ya?\nYou didn't think he was gon' come out the coffin\nSurprised ya! 'Cause he caught the Holy Ghost\nHe caught the Holy Ghost\n\nI'ma tell ya guess who's the guest star\nWith Howard Cosell\nThe rap game, since Kobe Bryant wasn't even an embryo\nMichael Jordan walked in, that's right his lil' son was 13\nI used to manage Marvin Hagler and Ken Norton\nLas Vegas had one hotel\nI had Angelo Dundee before Ali, done trained Mitch Greene\nTony {?} was heavyweight\nDon King was in Cleveland with John James\nMike Weaver couldn't handle the press\nThe tickets was ringside, me a preacher\nWith Don, Carol, Tom Jones, Lyndon B. Johnson\nHe wasn't even in front office\nMorgan Stanley gave the bank loans\nWith Rocky Marciano in the studio\nAnd that's right, Studio 54, no black suits\nI'ma wear a yellow suit as a preacher\nI'ma wear a yellow suit as a teacher\nYou get out my face!\n\nNow let this man walk outta his coffin\nStraight out the church and get in a cab\n(Roll on, roll baby) Yeah\nLook at him, you didn't think he was gonna catch the Holy Ghost\nNo nigga, you didn't think he was gonna catch the holy most\nLook at'cha, now everybody pass around the coin collector\nAnd give people a toast, I want butter please\n\nFirst Corinthians, chapter 10, was... that...\nMan... man ran over, woman\nSecond verse, Matthew said that (preach now preach now)\nHe, could cook a TV dinner, share with a lamb\nGive food, around the world, God said sure\nBut that's all love you know {*applause*}\nBrother Green, got a question back there\nUmm, yeah excuse me, umm\nMiss... Miss Johnson can you move your big hat out the way for a second?\nI'm sorry about that, okay?\nCan umm, two people come over and help her lift it up off her head?\nOoh you got a, bald head\n\nNow the last chapter, all right, can you read umm\nUncle Fe, umm, Uncle Fester\nYou got Uncle Fester in here from Addams Family y'all\nGive a hand for him in the back over there\nUncle Fester's in here, oh ho ho\nYo umm, y'all can read um, First Corinthians chapter 7 said\nAnd the dog ran, see Spot run\nSee Jane catch spot\nSpot ran, see Spot run\n(Tell 'em pastor, preach!)\nHopefully, we're gonna change the church tonight\n(Watch out now!) Mr. Softee's outside (yessir) (Hallelujah!)\nBring me back an ice cream sandwich, that's right\nThere's no turkey for today\nEverybody's going home their way\nNo... {*fades out*}\n\n", "album": {"title": "Kool_Keith_Presents_Thee_Undatakerz_(2004)&&2279", "genre": "Hip Hop", "year": 2004}}, {"title": "Can I Touch Ya Butt Girl?", "href": "Can_I_Touch_Ya_Butt_Girl%3F&&8997", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nClayborne Family\n\nCan I touch ya butt girl? Can I squeeze ya butt girl?\nCan I feel ya butt girl? Can I touch it?\nCan I touch ya butt girl? Can I squeeze ya butt girl?\nCan I feel ya butt girl?\n\n(Kool Keith)\nHoney with the gloss white diamonds, frosty lips\nMovin with hypnotic sips\nMovin the packer, I'm in the ride, leanin to the side\nTurnin' up the Bar-Kays\nFirecracker, the parking lot macker\nMaxi, Stacy, women sport the Stay Free\nLike Prince all the panties hit the floor in one room in Paisley\nWith Naughty By Nature, stippin Stoli\nPeach on the rocks with Vinnie, Treach and KayGee\nVolume up, the club is open, nothin' closin at 3\nV.I.P. comes reserved, with Ronnie B\nAre you blind out there, can Ronnie see?\nThe power of the Miramax picture\nHold up girl, wait a minute, players don't rush\nHold the cards, please, I'ma get wit'cha\nLadies ready for departure, show ID let me card ya\nI see the T-backs through your slacks\nI like it jiggly a little larger\n\n(Uncredited rapper)\nIn the club I enter the room\nIn the ladies room where the flows {?} soon\nHeartbeats cold sweats, game and jets\nLet's 5000, let's jet\nNo hon, I just came, I ain't done\nShe owes me cash, she paid up one\nNext chick, nitpick, dip necks\nLick we jacko man took his shit\nWe in the club, you slip we serve\nBack in the club gettin' clipped nuttin heard\nTwo-steppin, game lethal weapon\nChicks I'm checkin' every second\nBlood hit slide as you outsiders want what {?}\nNo outsiders, we all riders\nWe party hard, doin' the club\nGettin' no love from sharin the bub\n\n(Uncredited rapper)\nYo what'chu gonna do now (what?)\nIt's all messed up now (tell 'em)\nThe club rushed up, crunked up now\nChickens all fucked up on Bacardi now\nThe spot blown up, yo they wanna go nuts\nIt can go now, yeah\nWe out of control, we out of your mold\nWe broke it, 10 years ago (10 years)\nWe start to roll, I can go 50/50 (ooh)\nAiyyo you out of your goal (that's right)\nYou out of your reach, we comin' now it's the beast (peace)\nBig and brolic, we pass the chronic (yeah)\nFreaks jump on it... Yeah!\nAnd from the back nigga, I pumped on it\nTop finesse\nEast coast right back to West\nSnap your neck, EPMD style\nAiyyo we stackin them checks\nWe buy the bar out (yeah) beef cookout\nWe bring the mob out (where we at)\nTony Draper style, Suave House\n\nCan I touch ya butt girl? Can I squeeze ya butt girl?\nCan I feel ya butt girl? Can I touch it?\nCan I touch ya butt girl? Can I squeeze ya butt girl?\nCan I feel ya butt girl? Can I touch it?\n\n", "album": {"title": "Dr._Octagon_Part_II_(2008)&&1223", "genre": "Hip Hop", "year": 2008}}, {"title": "Operation Extortion", "href": "Operation_Extortion&&3034", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "I'ma cancel all the studios, I'ma find you in New York\nYou fucked it up for everybody\nWhen I see you I'ma punch you in your fuckin' face\nYou and that other faggot ass nigga that rap witchu\nI'ma catch you (?) Ensoniq or Platinum Factory\nI know you be in fuckin' Chung King\nI'ma search around motherfuckin D&amp;D\n\n(Kool Keith)\nFuck you nigga, criticizin my shit, talkin' behind my back\nYouse a weak nigga, don't speak nigga, face the trigger\nWhat you know about my shit?\nWhy you reviewin it, why you ratin it? You fuckin' hatin' it\nBackpack ass nigga, how you figure?\nFuck a cypher, I get live on your favorite ass corny ass niggaz\nI'm a survivor, no village ass shit\nMotherfuckers walkin' around tryin' to be Bob Marley and Lenny Kravitz\nThat scarf shit around everybody's head is for faggots\nGet on stage I throw lettuce and cabbage\nYou fuckin' with bad habits\nRun up on you like 10 Puerto Ricans gettin' out a fuckin' Chevrolet\nI don't play, fuck your bodyguard Big Rae\nI chop your hands off and throw your fuckin' fingers in the ashtray\nDead-end, no backup, comin' down to one-way\n\nChorus: Kool Keith\n\nOperation... extortion (4X)\n\n(Kool Keith)\nWhy you curse so much nigga? Fuck you, duck you\nLoadin this motherfuckin tec up, there's a lot of things I must do\nClick up, shut the fuck up, bukka, bukka, bukka\nFake-ass cast, counterfeit bitch-ass\nI'ma see how long that choreographer dance shit last\nMake you take the CD's out the shelf\nCome to your record release party, show you some shit\nAnd make you piss on yourself\nNo guest list, I better get past this\nType of motherfucker to wait outside the club\nFor your black dumb-asses, I'ma have a contest\nSee which bitch-ass nigga get in they car the fastest\nStrongarm your bodyguards with armed freebase smokers in a stolen Dodge\nPour gasoline down your shirt in the car garage\nYo black burn this nigga\nWatch how Kentucky Fried I turn this nigga\nWatch you sizzle like a well done (?) Frank\nThat's what you get for fuckin' with Hank\nGive all your fuckin' credit cards, niggaz with ski masks\nTook your mink coats at Chemical Bank\nVisa America take this shit fill up the gas tank\nI told y'all I was gon' slap that motherfucker\nAnd baseball bat that motherfucker\nYour man with his bullshit mixtape ran out Hot 97 like a sucker\nI'ma send a crackhead that needs money bad\nAt least to get one of you motherfuckers\nYou owe me for damage\nI know a Dominican that's ready to stab your fuckin' manager\nCatch a homicide and catch a Greyhound bus out to Canada\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "Octo Freestyle", "href": "Octo_Freestyle&&9880", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nKool Keith in the house...\nY'all on that Enquirer, Crispin Judd, Ben Affleck bling\nI don't care about all that new band on the Spin cover\nCan't sing, ukelele figures\nWatch it MTV, let's get funky\nWho added these ukelele niggaz?\nOverpromote me, spend a lot of money on me like Smilez and Southstar\nBefore I wet up your steering wheel\nMove on your Louis Vuitton decoration in your car\nDon't offer me a drink, I don't wanna go to the bar\n\n(Repeat 2X)\nI get in you, I continue, I boost up the menu\n\n(Kool Keith)\nPull over please, now look at your wannabe bleedin knees\nSunflower seeds all over your Bentley floor\nTrain monkeys to put the Huggies on\nDefecate on your El Dorado roof, that's hardcore\nPut salve on your face for the cold sore\nSame world with a cold war, wearin a facemask\nWhat's that disease comin' over from Japan and Singapore?\nFind feces on the floor, your dresser\nTurn your girl to open the drawer\nRewind and do it again, the enemy, I found it\nGo back and look in your car, serial shitter\nNot a killer, FedEx animal waste\nTo the record labels I'm more iller\nAdrenaline rush\n8 gallons of urine packed in Dolce Gabbana bags\nUnder the Greyhound bus\nReal alligators, movin in garment bags\nYou don't wanna ride with us\nYou wastin time talkin' jive with us\nYou better get on this baby, and get live with us\nMove it, I'm tellin' you\nBuick Skylark, beige convertible with a big dent on the side\nMovin through the streets, with crack smokers in a used ride\nThe OJ's bumpin on the passenger side\nTom Greeno, movin distribution deals out to Trenton, New Jersey\nHis man out West, Tommy S\nPressin up from El Camino\nUsin' the same masterin lab on the D.O.\nMoney D known as Tony Blaze, what he, went to see his P.O.\nUpper class, witty\nKool Keith stood on the Twin Towers before\nPeed a hundred stories off, my urine covered the rush hour\nEverybody had umbrellas walkin' around New York City\nLookin' gritty, the wet in the game\nI put the pet in the game\nI put the basketballs, you bought the net in the game\nThrew Pampers out the window curiously\nI poured acid in your face, furiously\n\nNow you got the toxic waste on your back window\nWho can see? Pull over at the service station\nYou in a nervous station with no discrimination\nBlacks skip the free lunch, Asian rappers sign in\nI don't care if you're caucausian, African with rhymes paid\nChinese with rhymes laid...\n\n", "album": {"title": "Dr._Octagon_Part_II_(2008)&&1223", "genre": "Hip Hop", "year": 2008}}, {"title": "Do You Masturbate? (Skit)", "href": "Do_You_Masturbate%3F_(Skit)&&8743", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "<span style=\"padding:1em\"><a href=\"/wiki/Category:Instrumental\" class=\"image image-thumbnail link-internal\" title=\"Instrumental\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D\" alt=\"TrebleClef\" class=\"lzy lzyPlcHld \" data-image-key=\"TrebleClef.png\" data-image-name=\"TrebleClef.png\" data-src=\"https://vignette.wikia.nocookie.net/lyricwiki/images/1/1e/TrebleClef.png/revision/latest/scale-to-width-down/30?cb=20090423154754\" width=\"30\" height=\"68\" onload=\"if(typeof ImgLzy==='object'){ImgLzy.load(this)}\"><noscript><img src=\"https://vignette.wikia.nocookie.net/lyricwiki/images/1/1e/TrebleClef.png/revision/latest/scale-to-width-down/30?cb=20090423154754\" alt=\"TrebleClef\" class=\"\" data-image-key=\"TrebleClef.png\" data-image-name=\"TrebleClef.png\" width=\"30\" height=\"68\"></noscript></a></span> <b>Instrumental</b>\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "Blackula", "href": "Blackula&&8843", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Funky, yeah baby! Blackula, spectacular\nBlackula, bust at ya, spectacular, Blackula\nBlackula, bust at ya\nBlackula, spectacular\n\n(Kool Keith)\nBust a rhyme kid bust that, nigga fuck that\nWe on the move in the girls and they love that\nMy shit is on tight, flowin with the gun rack\nComputer love it where you goin' what you sayin' brother?\nSkills to play tracks move and they ovulate\nLadies in suede, ducked down for the roach spray\nFirst class, high in flight on the coach way\nWe universe, stutter step, we doin' it first\nPause and spin now you sleep watch your head burst\nI'm divin in like a champ goin' head first\nFools reverse tragedy, gettin' worse\nNon-orthopedic got the medicine, when you need it\nMC's who need it in the meantime get defeated\nFoes competing on the website get deleted\nDon't get me heated grab your shield, you know you need it\n\nBlackula\nBlackula, spectacular\nI'm Blackula, bust at ya\nBlack-blackula, uh, spectacular\nBlackula, bust at ya\n\n(Jacky Jasper)\nI've seen it, bust it\nPromotin hit gunsmoke, toad (?) strass remote\nCutthroats scope, targets blast faggots\nHabits, iller tactics, homicidal practice\nMaggots and brains derail trains\nSustain, no remains bro plane strain\nThoughts snort support resort all sorts\nSnitch in court thought y'all niggaz bang slang\nWho rock, who bang hang?\nWith three hoes, a pimp thing ring\nBoys is dressed as coppers dope droppers\nJacky jackin, pushin shotguns\nHate knockers, star jockers\nWe street doctors, rockers\nCall girl clockers, chop business\nYou up rock stop, three up drop\nFifty ki's, block plot, past cops I'm hot\nYo Keith (Blackula)\nCheck it, I'm low in the spot\n\nBlackula, spectacular\nBlackula, bust at ya\nBlack-blackula - spectacular\nBlackula, bust at ya\n\n(Kool Keith)\nDump a few in the litter box, you in the bitter box\nBaby you lovin' me, stop it why you huggin me?\nSmack you lightly, brightly\nRammin rocks, ran the blocks\nCombat standard demands of my job is commandin\nYou're handin, standin\n\n(Jacky Jasper)\nWhat? Let's instigate eliminate\nMake pace five lates\nYou hate, Esham weight, out the L.A. smog\nMemory log, that's my dog\nPut six in the morgue\nJog and kill six more\nTherefore we score big sword hardcore\nSex flicks, she does chicks, pulls tricks\nFlips, pays chips, booty hits\nAnd does contraband trips\n\nBlackula, spectacular\nBlackula, bust at ya\nBlack-blackula - spectacular\nBlackula - bust at ya\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "You Can't Go Outside", "href": "You_Can%27t_Go_Outside&&7948", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Now you famous... but guess what?\nYou can't go outside\n\nYou can't walk outside... with your girl in the rain\nYou can't walk outside... with your girl in the rain\n\n(Kool Keith)\nI laugh now, I see a lot of jokes\nYou ain't comfortable, scared pink, hang around a lot of folks\nYou don't know gangs wanna kill you\nYou get shot by real locs\nFirst class always, you bring a busload\nYou neverous when you sit in coach\nI know your facade, hardcore\nYou hope a lot of people get scared with your approach\nYour whole steelo mice and roach\nWhen Marion comes in the industry, the parties get empty\nThe champagne bottles go down\nHotel lobbies get dimmed, your average hard rapper turned ghost\nHits his foxhole and go to his post\n\n(Kool Keith)\nA lot of you live through food and delivery\nI know the pain is the front in your misery\nCome outside your indoor studio, enjoy your life\nLay on your couch by your floor model Sony\nYou dream you got shot twice\nCome outside, don't be scared\nEven NBA players walk the streets with no bodyguards\nHow you gonna flex with Domino's pizza in your living room\nAnd sport your ice? You're paranoid\nCause the walked into the library, looked at you twice\nOrderin all you do is murder and kill, on vinyl and CD\nRequest to have the chicken and fried rice\nChinese cat at your door on the bike\nYou doin' the same thing you did last night (same thing)\n\n(Kool Keith)\nYou wear your glasses at night\nTinted windows, comin' through your block slow\nYou cancelled another show because the police department\nAnd the FBI told you not to go\nThe record company cover you\nOverweight bodyguards smother you\nWhen your wife ain't, what you think your lover do?\nPetrified of what happened to 2Pac and Biggie\nYou light up your ciggy\nGrab a cold beer out the refrigerator, bop your mickey\nYou was scared in the hired hotel\nDressed the janitor walkin' by with dickies\n\nYou can't walk outside... with your girl in the rain\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "Girls Want You", "href": "Girls_Want_You&&2500", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Oh yeah, Kool Keith baby)\n\nGirls want you to suck them clits, they want you\nGirl want you to suck them tits, they want you\n\nWomen wanna suck you\nThey don't tell you, they wanna fuck you\nSome move and duck you\nI sometime watch em, they curse me out I say fuck you\nI never pay for shit, breakfast take 'em to get eggs and girls talk around\nThe pussy\nStare at the tits, they kill a lot a niggaz money\nUgly and rich, you gotta fuck 'em in the ass, they like it a lot\nI piss on their hot spot\nShe'll be late, every movie shit in the hotel quick\nDip inside her heart she wanna suck your dick\nGet her ass licked\nPlay hopscotch, look at her look at your watch\nMake sure its late sucka, stick your hand in her ass motherfucker\nMove fast motherfucker\n\nLook at the stars, they wanna be naked, doggystyle with they ass out\nThey dream of naked photos, ready to pass out\nYou gotta pull your dick out at the restaurant in front of they aunt\nAnd jerk off with your balls smackin the windows of the Mitsubishi Galant\nWomen are hot, like motherfuckin bananas in they ass\nIs that what they want?\nNever say pussy or cunt, take 'em out to lunch\nPull the thong to the side, at brunch\nShow her your pubic hair, dress up ill\nDecorate your nuts with Captain Crunch\nTell her easy on the genitals, give her two minutes\nTell her Captain Munch\nPull your zipper up fast, bend over and look over her ass\nWear a baseball jersey, lick her asshole with a catcher's mask\nPerform with weed and liquor, some people prefer hash\nPut on a condom, stick your celery sticks in her gash\nAnally I stick it, marshmallows and lemonheads in they ass\nNothin' simple, Ginuwine slow with Dru Hill, the right tempo\nFuck goin' to dinner and shit, sittin' at a table, rent a porno movie\nYo with Rocco Siffredi, fuckin' top models cum on they navel\nLean your woman up against the sanitation truck\nFuck with 18 balls on the pool table\n(18 balls on the pool table)\n\nIncrease with the golden showers surprise there's nothing more than\nA pretty woman wantin sexy men to piss in her eyes\nFuck you standard gentleman nigga, you fuck it up for the real guys\nBig jeans don't matter, you gotta fuck in the bathroom with robes\nCum all between her ass cheeks\nWith the suits and ties, take a break for ginseng\nFeed the dimepiece, give her some TV dinners\nShare your French fries\nBe honest in your underwear, never tell her lies\n'Cause she's wet already, all freaks love to smell your scrotum\nIt's no surprise\nStrawberry cakes, cover the panties with milkshakes\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "You know You Want It", "href": "You_Know_You_Want_It&&1113", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nGirls, I'm slappin 'em up\nPimp smackin 'em up, anger management\nPresident, better than ediment{?}\nSweetness by slickness you with this\nYou witness the lonely the misfits\nOn them place and table servin' 'em biscuits\nBut kisses delicious\nMy swiftness fills statistics linguistics\nYou think I'm Bone Bone Bone Bone Bone Bone Bone\nHow many, comin' at me\nStartin G, ladies excuse me\nPlayer I beg your pardon G\nI'm harder G, astrology dodgin me when I'm rum pum pum pum...\nMake me the sergeant see\nFrom the coast, and pot roast, I load furs\nAnd them diamonds and them pearls on them coats, I will boast\nBe braggin, not draggin\nFlowin on the spoon like Daggen-Hanz\nThe Nova is comin' over, I'm Cas'\nSee the pimp of nature under the table\nWith broads by the side I will hate'cha\nFrom Singapore and Malaysia\nWhen the last time you pulled your fuck out\nThe other players claimin pimp that wanna trick off\nWhat they assssk, me, ask Whitefolk and Pimpin' Ken\nI bring it around and let you taste it\n\n(Chorus: repeat 2X)\nWe comin' up big doggy, we playin' it big homey\nNo niggaz just chicks around me all we want is ass and money\nWe combin the streets, droppin' our work all day and night\nThey know we pimps cause the chicks always play us tight\n\n(H-Bomb)\n'Bout comin' up pickin' up paper, it's the H you know it's me\nYou soakin up game, but you lame, shame on he not me\nPeepin on what we wear and, steppin on checks we clearin\nTryin' to look and act like us so his cash we start sharin\nYou movin too slow man, you fallin' in love man\nYou don't know pimpin' is the only thing to know man\nDouble back double up on the paper that I'm musclin\nPut it out doin' my dirt checkin' my work, paper keep comin' in\nDon't be so mad homey, you too uptight nigga\nI know the pimps and pushers strippin up pickin' up dollars\nI'm holdin' on to my dough, I'm plannin to stick yo' flow\nI'm lookin' to ho through pimpin' choose I'm keepin' up all her dough\nYou know the chicks go, out watch the chips fall\nThe money I bank it I don't give a fuck 'bout none of y'all\n\n", "album": {"title": "Dr._Octagon_Part_II_(2008)&&1223", "genre": "Hip Hop", "year": 2008}}, {"title": "Mack Trucks", "href": "Mack_Trucks&&8528", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Yeah, 2003\nBig Lou and company\nMacks, Peterbilts, GMC's, white freight liners\nVolvos, Marlins, Internationals\nEighteen wheels, we do deals\n\nMajor fake baller close your mouth, you rap about the same thing\nRecord company got you gassed\nNow you wanna hold champagne and bounce\nAnd act like you from Down South\nI \"Pimp Hard\" like MJG and Eightball\nCalled the crib that my girl Kate called\nOlde English aluminum can tall\nGirls smile when I walk with alligators through the mall\nShiny jeans and baseball cap, no time for rotation crap\nNo sleep, always up with heat, never take no N-A-P\nI.P.P. - International Player\nWherever you search there's no one greater\nBut you look at the back of the club walkin' around\nI see you, that's you, a HATER!\n\nMacks, trucks, big wheels roll\nMacks, trucks, big wheels roll\nMacks, trucks, big wheels roll\nMacks, trucks, big wheels roll\n\nGlobal W.V.C. who can step to me\nGot the belt over my head like Ernie Shavers\nY'all be talkin' behind my back, rhyme as sweet as Life Savers\nFrom New York, push records out from Detroit\nGreyhound bus will get me to the point\nFrom there, I don't care, pick me up in a pickup truck\nI roll wagons fly like blue shoes with big Chuck\nThinkin' I gives a fizzucka\nYouse a metropolitan plastic-ass, youse a sucka!\nTurn let me blast you in the face\nA guy like you I should slash in the face\nPick up the lampshade, knock your blunt out your hand\nSmear ash in your face!\n\nMacks, trucks, big wheels roll\nMacks, trucks, big wheels roll\nMacks, trucks, big wheels roll\nMacks, trucks, big wheels roll\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "I Wanna Play", "href": "I_Wanna_Play&&7079", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Yeah... two-thousand... three!\n(I wanna play with you baby) Brand new\n(Can you touch me? Won't you hold me?) K-double-O-L, Keith\n(Can you talk to me? 'Cause I'm lonely)\n(I wanna play with you baby) Yeah...\n\nI used to roll, with girls, down the road\nMack trucks caused country Peterbilts overload\nTurnpike in freak mode, kissin' at a highway patrol\nHaulin platinum and gold, takin' chicks to the superbowl\nBig freight with big weight\nEight thousand birds smuggled internate while you hate\nFour hundred miles, we just ate\nState trooper we super we dooper\nWatch it when we loop or make the left burn out\nAnd watch the club turn out\nI keep it raw on tour, feet stay on the floor\nUnited capital rounds, mega droppin' them pounds\nBig Hank I roll through with tanks, man droppin' them sound\nSuckers get played like referee, now you're out of your bounds\nI move in territories, areas with scary stories\n\n(I wanna play with you baby)\n(Can you touch me? Won't you hold me?)\n(Can you talk to me? 'Cause I'm lonely)\n(I wanna play with you baby)\n\nI roll with full tanks I'm ready Eddie Diesel we feel\nTexaco and pro go borders down to Mexico\nTech stashed with calico, Cancun trips we flip\nSnub-nosed to your lip, girls gyrate boots and hips\nWe blow down nuttin's here\nSlow down catch crews on the ups and lowdown\nBig controllin, money foldin\nNew twist nothin' old and comin' through custom bust 'em\nGreyhound bus ride rush 'em all midrange earthquakes\nBlow your backseat, amps pre-heat\nGirls giggle laugh, hee hee\nCops rollin' radars, trucks move with CB's\nSwitchin more gears, countin' G's, blastin CD's\nProduct on the market make a man behind\nThe drum machine freeze hear DAT you say please\nRaindeer cross the freeway, twenty-two degrees\n\n(I wanna play with you baby)\n(Can you touch me? Won't you hold me?)\n(Can you talk to me? 'Cause I'm lonely)\n(I wanna play with you baby)\n\nSeventeen the switch-up, sixteen the switch-down\nEngine hot, turnin' eighteen wheels in the block\nBackin up in yo' section, tight with rhyme perfection\nSmooth like Teddy Pendergrass, yeah...\n... Think I better let her go, for another T.K.O.\nSuper trashin tires bone, big rims and Firestone\nSpeed up and rev up two hundred miles up the turnpike\nComin' head up smokin' all pipes like big bongs that you like\nDon't step to me when I'm on the noiman (?) mike\nWatch the rowdy crowd in the mosh pit fight\n\n(I wanna play with you, I wanna lay with you)\n(I wanna stay with you, if it's okay with you)\n-- I wanna play with you baby\n(I want you to come over..)\n-- I wanna, play... with you\n(I wanna play with you, I wanna lay with you)\n(I wanna stay with you, if it's okay with you)\n-- Play, with, you\n(With some strawberries, and whip cream)\n-- I wanna play with you baby\n(I wanna play with you, I wanna lay with you)\n(I wanna stay with you, if it's okay with you)\n(Will you touch me baby?)\n-- Play, with, you ba-by\n(Would you lick me baby?)\n-- I wanna play with you baby\n(I want you up inside me)\n-- Oh baby, play with me\n(Come on baby, come on and give me what I'm waitin for)\n-- I wanna play, I wanna play\n(Ooh baby, UHHH)\n-- I wanna play, I wanna play\n(I need it, I want it)\n-- I wanna play, I wanna play...\n(Ooh baby, uh..)\n\n{*Dial tone*}\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "The Original", "href": "The_Original&&2527", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(22 seconds of overlapping samples)\n\n(Roscoe)\nI'm hot as Hades, I drive a Mercedes\nChromed out, leavin' niggaz in awe when it bone out\nBig dawg with his bone out\nI'ma put hands on a nigga 'fore I let him run his mouth\nRollin' up some bud, rollin' up to the club\nSunroof wide open, bumpin \"California Love\"\nI'm Philly to the heart but I'm a California thug\nI don't smoke nothin' but Phillies and California drugs\nWho all on the track? I ain't sayin' no names\nEverybody on the ground, I ain't playin' no games\nI'm a rider, and every show is like a robbery\nPut your hands, now everybody follow me\nThey call me Young Roscoe, I rob for gestapo\nThat's who I bleed and die fo', you need to stop ho\nThe Suave A young assassins, we bonafide\nRecognize by the way we mash that we roll and ride\n\n(Chorus - female singer)\nDon't be playin' with my money - don't be playin', playin' with my money\nI am serious 'bout my money - so serious, serious 'bout my money\nAnd don't be fuckin' with my money - don't be fuckin', fuckin' with my money\nCause you could die over my money - you could die, over my money\n\n(Uncredited rapper)\nI love this place, in California we chase\nPapes push bass, fuck the return of Ma$e\nLay down, fuck dap, it's a jack\nNiggaz attack for cash we clap, fuck a scrap nigga\nWe play thick figures nigga\nPull a strap you shiver, take yo' life motherfucker\nThe streets we roam, invade your home\nWhat you own, we take, we keep, it's not a loan\nStoned and determined to keep servin'\nYour papes I'm rollin', you're new in town now you're learnin\nThe game I'm takin', I'm {?} and pickin' up all the checks\nThe perks, the jetset lifestyle, the sex\nI crunch the calvary with the wild bunch\nMunch on ya brunch while y'all niggaz lunch\nFuckin' cowards, talk to 'em on records\n\"Gone in 60 Seconds\" this song ya weapon\nGive up ya snaps, lay flat, chicks attract\nFor the jack, my paper stacks\nYou're doin' it wrong, I'm doin' it right, uh\nThe street's my life, my money, my wife\n\n(Female singer)\nDon't be playin', with my money, no\nSo serious 'bout my money, hey\nDon't be fuckin' with my money, oh oh oh\nYou can die, over my money, ahey hey\nDon't, uh-huh, uh-huh, hey\nDon't play, with my money, no\n\n", "album": {"title": "Dr._Octagon_Part_II_(2008)&&1223", "genre": "Hip Hop", "year": 2008}}, {"title": "Concert Intro", "href": "Concert_Intro&&8723", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "<span style=\"padding:1em\"><a href=\"/wiki/Category:Instrumental\" class=\"image image-thumbnail link-internal\" title=\"Instrumental\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D\" alt=\"TrebleClef\" class=\"lzy lzyPlcHld \" data-image-key=\"TrebleClef.png\" data-image-name=\"TrebleClef.png\" data-src=\"https://vignette.wikia.nocookie.net/lyricwiki/images/1/1e/TrebleClef.png/revision/latest/scale-to-width-down/30?cb=20090423154754\" width=\"30\" height=\"68\" onload=\"if(typeof ImgLzy==='object'){ImgLzy.load(this)}\"><noscript><img src=\"https://vignette.wikia.nocookie.net/lyricwiki/images/1/1e/TrebleClef.png/revision/latest/scale-to-width-down/30?cb=20090423154754\" alt=\"TrebleClef\" class=\"\" data-image-key=\"TrebleClef.png\" data-image-name=\"TrebleClef.png\" width=\"30\" height=\"68\"></noscript></a></span> <b>Instrumental</b>\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "Star Wars", "href": "Star_Wars&&8869", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nYo, Kool Keith\nBronx in the house\nY'all know how to ill, I'ma take you to the real\nChallenge the ill, brother to God\nYou just a ancestor, you know the shit dyker\nYou ride around Manhattan as a gay biker\nNon-homo, you a gay hiker\nTrust funds one on your nose\nLethal injections, front row at the Source Awards\nMy public shocked, pee on publicity\nThe urine splash off the Billboards\nThe top MC to me is Traci Lords, get what I mean?\nMan, Traci Lords\nPlastic fake like your backup band with drum setup\nGuys blowin' horns\nWith light Twinkie sounds on your keyboards\nY'all mad at each other\n\nY'all want Star Wars\nY'all want Star Wars\nY'all want publicity, y'all want Star Wars\nY'all want them Star Wars\n\n(Kool Keith)\nMy job is to utilize beats like this\nRap on beats like this, you know the amplitude, is rude\nMad planet at Sizzler\nBallers love the open bar but they're secrets with the seasoning\nType of hyper king to defecate in your food\nAsk Tommy King from the health department\nI put the urine stains in the mansion\nThat's $75 a apartment\nAll secret toilets well\nNumber one rapper, go in the public bathroom\nDon't even stop at Shell, around Puerto Rican Day parade\nBlacks feel it, relax under my {?}\nYour family is Frankie Beverly, cats spit out the Maze\n\nY'all want them Star Wars\nY'all want that publicity\nY'all want them Star Wars\nY'all want that publicity\n\n(Kool Keith)\nTeachers from Del Monte used to Bath and Bodyworks\nFamiliar, when I'm layin in the cut\nWatch me front in a 310 car blastin Ashanti\nOr Maury Santana, scatter takin' the honies out to Panda Express\nFor the Panda's best, girl the exttravagance is lovely\nThough the business is about to go down\nTake you down to the alley, where you think the top models buy the dress\nEasy on the hot wings, baby you got 2 real players\nYou better share them things\nI wear the real, you flaunt the costume\nFlash your bubblegum rings, like they new\nTomorrow watch the Japanese dress, y'all follow\nThat's right\n\nY'all want the Star Wars\nY'all want the publicity\nY'all want them Star Wars\nPublicity in action\nY'all want the Star Wars (y'all want the Star Wars)\n\n", "album": {"title": "Dr._Octagon_Part_II_(2008)&&1223", "genre": "Hip Hop", "year": 2008}}, {"title": "Dark Vadar", "href": "Dark_Vadar&&1984", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Yes\nI have two tickets to the NAACP Awards\nThe Image Awards\nSecret Servicemen, you can sit down\nMy seats are in the front row, I hate to be so arrogant\nBut I am...\nI have two tickets, Keith, and Esham\nAnd also, backstage passes\nFor the afterparty, thank you\n\n(Kool Keith)\nBlack starship control, walk like I'm Darth Vader\nMy green limousine, purple Maury alligators\nGlow in the dark Pele jacket\nShoes shine in your face accurate\nNever seen a leather jacket with lights in the back of it\nCustom made by the kids who sew and makes clothes for Prince and Sisqo\nI'm 2004 beyond the average club music and disco\nI take cities by storm\nDrop deep like hills in San Francisco\nCookout with hoodrats and fried chicken and Crisco\nAfter dinner, girls come over in lingerie\nBake sugar cookies and ginger snaps from Nabisco\nEven nighttime, we bust a night rhyme\nRidin' fluently into the mountains with briefcases countin'\nMillions and billions and zillions\nAnd quintrillions, in mansions talkin' to chameleons\nDark Vadar\n\n(Chorus - repeat 4X)\nDark Vadar, watchin DVD's with his new fader\nAnd may the, force be witchu\n\n(Esham)\nBack on the scene with a pocket full of green\nAnd I'm speedin like I'm caffeine\nIntergalactic, super tactics, sultan with this rapping\nPull up, tinted out limousines, in Detroit I am never seen\nPlus I keep a motherfuckin laser beam\nTo blow away your motherfuckin pale team\nCrazy as this shit might seem\nLivin' in a nightmare, not a dream\nAll my life I been a microphone fiend\nYou want the title? Step in the ring\nYou ain't tryin' to hear me, get your ear bit off\nMay the force be witchu when I turn your shit off\nStar Wars, me and Keith in the bar with scores of whores\nAnd the tours for whores\nPimps push Cadillacs\nGorilla macks swingin' the battle-axe\nSince I was sippin Similak\nBut I wanna be breastfed by Princess Leia, playa\nMe and Keith new millennium rhyme sayers\nToo futuristic, for you to miss this shit\nAnd if you do, may the force be witchu\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "Morgue", "href": "Morgue&&4197", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Party at the morgue\nParty at the morgue\nParty over there!\n\n(Verse One: Reverand Tom - Kool Keith)\nWomen know the flame, I can't shame your fame\nWe bought the bottles, club bring in the reign\nDon Don of Pino, bottle up first\nCall Vegas casino, the top cat with the dark blue Cadillac\nUp to Reno from there\nHit the Filipino, let her roll, get bold, reload\nFirst name Gino, Valentino\nTake her to the patio, park the spot, buck you're hot\nYou're nothin' you're not, breezin the spot, you get the lot\nParking lot, parking hot\nYou hit the door, the door barkin a lot (yo)\nWith Johnny Donny in a Mazeratti\nSlick Rick playin' \"La-Di-Da-Di\"\nYeah...\nI bowled 'em and bake 'em and shake 'em and make 'em and take 'em\nAnd fake 'em we make 'em, bread yo mixed with Steak-Um\nDressed like sheep, asalaam alaikum\n\n(Verse Two: Thee Undatakerz)\nYeah! There's a party in the morgue, Bronx Brooklyn style!\nHookers in fishnets, ladies do the wild\nRrrrah! Who got the PCP?\nForty ounce Olde English, fresh D.M.C.\nDominate beat breaks, hopped on the queen\nEastside Long Beach niggaz look at me\n\n(Verse Three: Thee Undatakerz)\nNew Jersey in the house, Philly cats on me\nThe {?} high rock, smokin' blunts of green\nMiami hoes in the house, G-strings and thongs\nChicago pimps get paid when the record's on\nRough - see me do my thing\nWe're Detroit boss players with them pinky ringers\nRinky-dink cheap whores without chips ain't jack\nSee the roof is on fire and the party is packed\nShake and bake and take the time to make a rhyme\nThat penetrate straight through your mind\nThe whack, the flake, don't test the great, debate\nThe broke I break you fake, like Greek plates\nRrrah!\n\nParty in the morgue {*repeat 4X*}\n\n(Verse Four: M-Balmer)\nBum-bum-bum-bummm, mistress\nUp in the morgue, jump in the hottub and get a backrub\nSurrounded by some bad niggaz and a pound of bombudd\nThey like my love, that's all I'm thinkin' of\nGive it to me now, here we go, now here to plunder\nWe can flow with it now\nAnd I take it dowwwwwwwwwwntown\nI put 'em under somehow I make it thunder\nI shake my back and then they wonder\nSippin on Cristal, slidin through the morgue\nThey hear me cumin... I'll be makin' all the noise\nNow follow me boys!\nWho be the richest, the gist is\nM-Balmer the {?} mistress\nY'all know y'all wanna hit this!\n\nParty in the morgue {*repeat 12X*} (with ad libs)\n\nYeah yeah y'all, put your hands up\nI wanna see everybody, put one finger in the air\nIf you got more than two dollars in yo' pocket\nLet me see ya say hoo, hoo\nYeah y'all, you partyin right now in the morgue\nWith Thee Undertakerz, and we about to take you under\nSo if you think you fly, and you think you the best\nWe better than you, we hot knahmsayin?\nIt's a platinum album and this how we doin' it\nWe doin' this for the year 2005, up in here\nWe outta here, like that y'all, c'mon!\n\n", "album": {"title": "Kool_Keith_Presents_Thee_Undatakerz_(2004)&&2279", "genre": "Hip Hop", "year": 2004}}, {"title": "Tess Shit", "href": "Tess_Shit&&8980", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Motherfucker I'm Kool Keith, motherfucker I'm cursin\nYou know I'm the type of guy to piss\nAnd throw shit in your face if you're the right person\nI don't give a fuck if your name is Tony Gerson\n\nUltimately figure the champion\nFigure express shit, the best shit\nYou tess shit, caress shit\nTalk more higher, then less shit\nYou aware, address shit\nImpress shit, you confess shit\nIvory wash with the Zest shit\nFuck the weed and the sess shit\nDon't bother with the pest shit\nCheck cash, you guess shit\nFuck the Coupe and the S shit\nThe talkin' behind my back shit\nThe skirt and the dress shit\nYou really workin that East and West with the juice\nIt's some death shit, whack niggaz you sign\nGet witcha girl, run your mouth with the Celeste shit\nNo worry, I get more, I fight and scuffle, at the Greek\nI ain't down with that 'fess shit\nYou gonna rooter yourself and get your motherfuckin ass killed\nWith that bulletproof vest shit\nCopy assholes, let the public hype you up on some wild West shit\nFightin ugly bitches on that obsessed shit\nOld slang, I wouldn't say fresh shit\nSoak shirts, take no shit\nPut on your coat shit\nGet out of here you smell like goat shit\nWheats and oats shit\nYou see you still on that flossin and that yacht and that boat shit\nDon't say a word when I quote shit\nIf you real fuck your card, and go promote shit\nFuck the Virgin Islands, powder and float shit\nGet your girl, fuckin' run, you better fuckin' go quick\nFertilizer, you better try to grow shit\nYou ain't no Don Juan on that stroll shit\nYou sniffin blow shit\nYou sit on the toilet, and go shit!\nTell motherfuckers everywhere, this is pro shit\nNo G.I., I'm like my pops - I'm on some Joe shit!\nSome Grover mixin a little, mo' shit\nYou say OH SHIT!\nYou can't get a slice of my pizza? No shit\nGet off my stage, you ain't on my show, shit\nTrumpets, you got some musical notes? You can't blow shit\nYou need to step back, go to shit\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "For Whom The Bells Toll", "href": "For_Whom_The_Bells_Toll&&2244", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Reverand Tom - Kool Keith)\nI stay in Office Depot and Staples\nPack up my pens and paper, keep rollin' more yellow pad\nI get mega sonic on you niggaz, beta sonic on your niggaz\nYou keep power supply, I'm Teknotronix\nBetter than Mantronix\nArrangements get ridiculous, ask anybody out there\nI'll shock ya - you're like a backup\nTo Goldstar TV set, too advance for the U.S.\nLeave New York, pee on Europeans\nYour hot producers, your coffee and all that stuff\nThat's right, look around, you're like H.R. Puffinstuff\nNothing's about you rough\nYou done it, you did that, and you get back\nYou sit back, look around, you get licked back\nYo...\n\n(The Funeral Director)\nWe have, coffins, by the millions\nWe can, put you, in the ground\n\n(Al Bury-U)\nYour body is stiff, the coffin closed, your family close by\nCemetery plots, a black rose, I heard a crow cry\nAs bells ring, for your spirit angels in Hell sing\nYour tunnel starts to darken, you're slippin into a long dream\nEternity, eternally until {?}\nSoul banished, back to where the heathen {?} laid to rest\nIt ain't no peace to be havin'\nLet it happen, ain't no fightin your fate, it's Armageddeon\nPermanently {?} no way in Hell to see heaven\nLet your spirit float way {?}\nYou see a new beginning, fire flesh for all your sinning\nBlack tinted limousines, black hearse and crying women\nSing of death blade, and sing a song called die\nWhile The Funeral Director spill your blood like wine\nReverand Tom at the altar, M-Balmer light that fire\nTime to cremate the whole world, wicked souls must die\n\n(The Funeral Director)\nThat's right... we are, Thee Undatakerz\nAnd we will, bury you\nBury you so deep... so deep you would think you were in Hell\n\n(M-Balmer)\nFrom whom the bells toll, or whom will be doomed\nDarker liquor I consume, gettin' {?} in the embalming room\nNo pulse are detected, send him over to The Funeral Director\nAnd Al Bury-U and Reverand Tom did what he came to do\nM-Balmer, holdin' down the morgue\nPull yo' body out the drawer\nGot these fools from the Eastside, the fluid's what they came here for\nPut the rest in my lab coat and serve them fools a part\nNow I'ma keep rock to chop, stirrin up to the pulpit\nAnd deliver it, I spit sparks like gunfire straight to they head\nWhat's the purpose of the strap if he's already dead?\nStretched out, because of somethin' that nobody said\nWarning, gee williker cause that Tec-9 be killin' ya\nHit the main artery, he's lookin' real saucy\nChrome to yo' dome and lookin' like Top Ramen\n\n(The Funeral Director)\nYeah, that's right\nYou thought you motherfuckers was gonna get away\nYou thought she wouldn't be able to embalm you\nShe's actually gonna, put, your head, up, your ass\nTo see if it fits!\nThat's right, we are Thee Undatakerz\nAnd we're not here to fuckin' play with you\nWe're gonna show you, where things go\nHow far deep they will be\nAnd how far in you will go\nHa, hahahahaha! Ohahahahahaha {*fades*}\n\n", "album": {"title": "Kool_Keith_Presents_Thee_Undatakerz_(2004)&&2279", "genre": "Hip Hop", "year": 2004}}, {"title": "Trying To Talk To You", "href": "Trying_To_Talk_To_You&&1186", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nWhassup?\nWhassup why don'tcha get your feet off my couch\nHave some respect when you come in my house\n(I'm trying to talk to you lady) Y'knahmsayin?\nHave some respect - did your mother teach you anything?\n(I'm trying to talk to you lady) That's right\nKool Keith, yeah\n\nYo, I blow them girls back like power jets off my dick\nYou think you quick vic, then come display your whackest shift\nTrickmaster, faster, asscrack, rectum zapper\nPussy stinkin, who brought these freaks yo, what you thinkin'\nThat's on my downplay, your husband rhyme, kid sound gay\nWith that fast talk, fast walk, ass is flat on sidewalk\nBig hoochie intakes, digest shrimp, stomach pork\nYour feedback, smoke weed back, butt naked we don't need that\nShut down yo' circuit, watch me kid, fuckin' work it\nOvertime rhymer, don't bite my shit, bite pirahna\nFuck rock'n'roll, never catch me marryin Cher and Nirvana\nSee-through skirts, burnin rubber sticks like fireworks\nNew York in 10-B, apartment house, where her friends be\nDykes with mics get played like Cameo the fuckin' Chi-Lites\nProblems I have 'em, that's right you motherfuckers grab 'em\nPiss on yo' fish lens, disrespectin all yo' friends\nTake my food back, your weave out, your fuckin' glue back\nYour hair in pieces, with just enough for chocolate Reese's\nBeauty parlor, rings around, check your fuckin' collar\nYou on some new shit, so game, I'm movin quick\n\n(I'm trying to talk to you lady) oh yeah\n(I'm trying to talk to you lady) can I talk to you?\n(I'm trying to talk to you lady) tryin' to talk to you\n(I'm trying to talk to you lady) can I talk to you?\n\n(Kool Keith)\nPsycho, still klepto, destroy them girls with reps though\nNiggaz pause backstep though, I'm classical, bust asshole\nRemember 'bout that last hole, you fucked up, you switched up\nRan up out the club, took that little cash you bitched up\nPower strong, my gators long, feel cats, them pussies warm\nOn steam like dream team, peep game with face schemes\nYou make a right I make a left, sound def, my arts and craft\nFuck y'all, y'all make me laugh, raw skill with paragraphs\nCut ass so fast and have, express rock East and West\nYou fucked up, yo' rap is weak, that shit you talk and how you speak\nYou suck dick I pull yo' tits you wash where, I like yo' clits\nTop to bottom got 'em movin, hittin screamin stop it man\nNasty with - game plan, new style - same man\nSwitch yo with swift flow, Bronx kid, I let you know\nAlternatin bass and pipes the crowds in this fuckin' place\nGirls get glassed at mad, problems on they fuckin' rag\nPlay tags with doo rags, I flame broil, light up fast\nGirls look, jockin me, there's no time, stoppin' me\nGroupin me, hatin' me, swingin' G yo fuck it B\nTechnique that run street, like Celly Cel, I got heat\nUpbeat, and offbeat, suck my dick, take yo' pick\n\n(I'm trying to talk to you lady) tryin' to talk to you\n(I'm trying to talk to you lady) I'm tryin' to talk, tryin' to talk\n(I'm trying to talk to you lady) I'm really tryin' to talk to you\n(I'm trying to talk to you lady) I'm tryin' to talk, tryin' to talk\n\n(Kool Keith)\nStyles rep from Northwest, shiftin, affectin wreckin\nMovin on the channel panel, stupid bitch, can you handle\nObserve words, niggaz got you cryin on the curb\nEnjoy my tempo, rap style, fuckin' simple\nI heard your demo kid, ridin' in the fuckin' limo\nSkippin your pause button, ladies melt, press rewind\nYou must be crazy, runnin' game out your fuckin' mind\nStylistic weaves, dirty spot stains on your sleeves\nLike Beenie Man, turn the track up, girl shut the fuck up\nMy style is dope kid, wind it up, yes I'm open\nMasquerade, Bacardi flip wigs, turn the party\nUnique and speakin', shoes shined for the weekend\nMy style is pumped up, in time watch you fuckin' jump up\nTurn up yo' bump up, on stage bring the fuckin' punk up\nOpen up hairpiece, music bass, turn the trunk up\nPrepare for blasthole, up close, I'm in yo' asshole\nAutomatically, you stand there, you fuckin' mad at me\nWhippin yo' lip up, with verbal hits from yo' hip up\nStand back and guard crack, P watch yo' fuckin' back\nThat girl is crazy\n\n(I'm trying to talk to you lady) I'm still tryin' to talk to you\n(I'm trying to talk to you lady) I'm tryin' to talk, tryin' to talk\n(I'm trying to talk to you lady) I'm tryin' to talk to you baby\n(I'm trying to talk to you lady) I'm tryin' to talk, tryin' to talk\n(I'm trying to talk to you lady) I'm really tryin' to talk to you\n(I'm trying to talk to you)\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "Lived in the Projects", "href": "Lived_In_The_Projects&&5011", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nYeah motherfucker... that's right...\nThe motherfucker in the house... Kool Keith...\nFuck all the bullshit, let's get to the real shit...\nYeah...\n\nYour rhyme touch is soft kid\nLike a stripper's ass with a touch of plastic\nWritin with a local style\nTalkin' about competitive shit you never mastered\nYouse a wannabe thug nigga, you ain't bugged nigga\nI cut your bitch-ass up, leave your legs under the rug nigga\nWho want the whiplash?\nCigarette burns, broken face hair pinned up in a cast\nMe standin on the top of your tour bus\nButt-naked with a fuckin' hockey mask\nSlicin your cashmere with a sharp 7-Up glass\nDon't you know I'm sick nigga? Lick my dick nigga!\nForty-four caliber killer gun-toter\nHide your kneecaps in a Lexus motor\nPack your stomach in a compartment\nOld dingy fucked up Bronx apartment\nDon't piss me off with a tec-9 loaded in a bullshit street argument\nI don't care how hard you get\nYou just another man that never lived in the projects poppin' shit\nYou ain't stoppin' shit, fuck that Batman and Robin shit\nAnd what block you with\nKneel down, make a nigga like you call me Big Ernest\nBake your intestines, throw your stomach in the furnace\nWatch the thermostat, you ain't no fuckin' fat cat\n\nChorus: Kool Keith\n\n[Sung] You never lived in the projects!\nYou ain't no drug dealer\n\n(Kool Keith)\nRude bwoy with a temper like a Jamaican off a Haitian boat\nCaribbean ruckus - with an Elvis wig\nSlap the piss out of one of you untalented rap motherfuckers\nBodyguards won't work\nWith a 30-shot car bomb under my Dominican shirt\nSubmachine in the duffle bag\nWatchin Sesame Street with my daughter, peepin Ernie and Bert\nWith backstage passes, wearin a long trenchcoat\nGet Morris in your projects\nAnd Jackson in a Madison Square Garden concert\nReady for CBS and NBC, to do a big network\nThe average guy, havin' a product manager\nAnd a female publicist wearin a fuckin' bulletproof vest\nI got time for motherfuckers actin' like Elliot Ness\nWinchester sawed off blow your Rolex through your fuckin' chest\nSplatted body pieces while blood drips off your girl's dress\nI'm ready for more progress\nHave your head sent home\nAnd a piece of your leg sittin' on the record company desk\nExtort like a mad nigga Western Union\nYou don't have a clue men how I get through men\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "Robert Perry", "href": "Robert_Perry&&968", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Robert Perry (Robert Perry)\nBronx! (Bronx!) Manhattan (Manhattan) Queens (Queens)\nStaten Island (Staten Island) Brooklyn! (Brooklyn!)\nAcross the George Washington Bridge from New Jersey (Jersey)\nYou know about the Robert Perry (Robert Perry)\nA.K.A., the Double K\n\nMan get off my back\nY'all sound whack like the \"Brown Sugar\" soundtrack\nYou know the office decomposer\nCommercial cleaner, garbage disposer\nHang my underwear in New York on top of your Times Square poster\nPullin your snipes down\nSample you, and your girl bring the Vaseline lotion\nBabywipes down, nobody can handle me\nOvercrowd 20th to 50th Street\nThe top ten rappers in the Big Apple work janitor\nClean my defecation off the concrete\nMy pee stains shock your family, piss on your man's hand\n... While your girl make the beats\nY'all nothin' but packs of candy and sweets\n\n125th Street (125th Street)\n125th Street, Robert Perry (Robert Perry)\n\nThe national dominator, urinate on your best hater\nThe mad people love the vanilla flavor\nTake your rap unserious like your movie roles\nDon't smile when the Doberman Pinscher\nFinishes bad work on your sneaker soles, all V.I.P. material\nDon't play me, to hype your lyrics\nTear you a new ass, go pay Jay-Z to write your lyrics\nSend your girl to dance out of state on spirit\nDon't get jealous cause the Avirex DJ usually act like he don't hear it\n(I don't hear it) A lot of guys at the station can't play they mother's record\nLet alone, their little brother's record\nNew York is Hollywood, downtown Manhattan is Los Angeles\nThe truth hurts, everybody in America is sportin them shirts\n\n125th Street (125th Street)\n125th Street, Robert Perry (Robert Perry)\n125th Street (125th Street)\n\nY'all still sportin them jerseys, I got Tom laundry gear\nMan bring the Stoli's Vanilla over here, girls floss the beer bellies\nIt ain't sexy drinkin' beer\nTalk under the Cerwin Vegas\nI'ma act like I can't understand your rap, man it's too loud\nFoes are whack, I can't hear, watch the cops escort you out the club\nEnjoy yourself, man you scared\nAin't nobody thinkin' about you let your shoulders rub\nYouse a paranoid studio killer\nStayin home by the fireplace and drinkin' Miller\nWomen with fat ugly men sayin' \"Girl he is fine!\"\nLookin' at his fake jewelry shine\n\n125th Street... yeah\n125th Street (125th Street)\n125th Street, Robert Perry (Robert Perry)\n125th Street... (125th Street)\nYeah you'll see me walkin' down - 125th Street\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "The Flesh - Feed Me", "href": "The_Flesh_-_Feed_Me&&5104", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Feed me... feed me...\n\n(Verse One: Thee Undatakerz)\nGot bloody bodies all around me, I'm chewin out on somebody's flesh\nI love the smell of rotten corpse like maggots diggin all through your chest\nA gravedigger, tomb raider, quick to get in yo' spot and make a mess\nRip the head off your body, sip the blood straight out yo' neck\nBlack Nosferatu walkin' the streets feelin' the city not as a threat\nLook at the public and that, panicked manic man straight on yo' set\nBlack mask, long machete and the blade is covered with blood\nDirty suit, guerilla boots, and the whole body's still covered in mud\nWalk the cemetery at night, 12 midnight with a shovel\nSpeakin' to the spirits talkin' to me, thinkin' is that God or is it the Devil?\n\nFeed me, I'm hungry, I'ma chew on your face\nFeed me, I'm hungry, I'ma chew on your flesh\nFeed me, I'm hungry, I'ma chew on your face\nFeed me, I'm hungry, I'ma dig in yo' chest\n\n(Verse Two: M-Balmer)\nY'all niggaz just be killin' me\nDon't like my style, just don't deal with me\nY'all niggaz just be killin' me\nEven worser than them bitches that envy me\nY'all niggaz done done all that there talkin', now you bleedin\nPlease believe it... believe it\nThe blood streamin from your vein, two and two, the M-Balmer\nI'm true to you, you know I got you boo! (boo)\nCreep through the streets of Los Skandelous\nBusiness really boomin up and down the list\nNiggaz can't handle it\nDirectin funerals of nothin' but love\nWhat about it nigga? Criminals and drug dealin' {?}\nOr that bitch nigga strictly bout his skrilla\nOr fucked with me and I peeled yo' cap nigga\nAlways expectin the unexpected\nUndatakerz, they detect it\nDon't be trippin' off me... just need to sweat it\nGravediggers, strictly fo' they cheddar\nYou said it's eerie, it's dreary, you weary\nBut none of mines is leary, y'all niggaz can't feel me\n\n(Verse Three: Reverand Tom - Kool Keith)\nThere's more red beans in the back\nWho cares who know who in the spotlight\nI'd rather listen to Beelow comin' tthrough New Orleans with Project Pat\nWith Skull Duggery, Hollow Tip, and Tre-8\nNew York should be lovin' me, word and I'm fatal\nI'm comin' out of nowhere\nYou see me comin' out the under, the master of distribution\nOut of nowhere like Kane and Abel, in magazines like Big Bear\nI move units over there, like Pistol and Mac Dre\nI cuts up and put it out anyway\nY'all work for the company and release date\nWhen I send all masters to city hall in Bayside it's gon' be too late\n300,000 rappers sittin' out on milk crates\nSkinny Pimp and Three 6, y'all hit them big licks\nLil' Jon and the Eastside Boyz\nRumble speaker down South with noise, make money mayne\nNo time for F.O. and G.I. Joe\nCommercial boobs in Belvedere videos\nFake chairs and toys, incense on the corner, your rap get destroyed\nBaton Rouge, you should call me Mr. Scrooge\nAnd when girls y'all ridin' around with transexuals and dudes\nComin' to rich men drinkin' booze\nWith gators on, fly and shine they shoes\nI gotta get gas, pick up the girls, change clothes\nDrop Frank off and Hank off\n\n", "album": {"title": "Kool_Keith_Presents_Thee_Undatakerz_(2004)&&2279", "genre": "Hip Hop", "year": 2004}}, {"title": "Baddest M.C.", "href": "Baddest_M.C.&&2382", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "New! Two-thousand-one...\n\n{*DJ scratches: \"Kool Keith\"*}\nBaddest, MC! {*\"Kool Keith\"*}\nKeith...\nBaddest, MC! {*\"Kool Keith\"*}\nKeith Keith...\nBaddest, MC! {*\"Kool Keith\"*}\nKeith Keith...\nBaddest, MC!\n\n(Kool Keith)\nVelvet robe, body like Hector Comacho\nKissin' Puerto Rican girls on they earlobes\nVictor Ramosa standin on Fermosa\nBig whip, fat you own a orange Rolls Royce\nComin' down Pico, up North Lenox\nHeads with backpacks\nMove like they try to act like they don't hear it\nSystem bust, I don't rap freestyle no more\nStopped smokin' angel dust\nI bring drama to your tour bus, we comin' all 800 of us\nProject one, project two, project three\nMy Recena Houses, Jackson Houses, Webster Houses\nHow that sound to you mouses?\nJamaicans from ??, and Patterson Houses\n\"Lift up Star, Keith mon, let me know I'll cut 'is t'roat\"\nOther rappers standin around, jealous lookin' broke\nNeed to be in double dutch, jumpin' rope\nY'all Northtown folks - comin' down to Manhattan World\nSerious soul food made by black girls\nCornbread and beepers above your head\nI'ma stop at the red light 'cause it's red\n\n{*DJ scratches: \"Kool Keith\"*}\nBaddest, MC! {*\"Kool Keith\"*}\nKeith Keith...\nBaddest, MC! {*\"Kool Keith\"*}\nKool...\nBaddest, MC! {*\"Kool Keith\"*}\nKeith Keith...\nBaddest, MC!\n\n(Kool Keith)\nFascinatin with the quickness\nI make models come to public housing and visit\nThat's how technical I get exquisite\nBangin' on pipes\nLookin' at cops walkin' up the stairs with flashlights\nMost MC's wearin leg-warmers and tights\nI come with Dominican girls with bodies like Jennifer Lopez\nWearin tight shorts from Washington Heights\nRide first class with flights to Santo Domingo\nWith sombrero performin my single\nWith my hype-man Al Gringo\nI'll watch you in the front cat don't let your face get wrinkled\nSide effects miss you\nJump around you gonna need a napkin and a tissue\nWhen I gross up the max you count the issue\nBuy The Source cover for twelve months\nAnd send other rappers over to pose\nAnd take pictures for some potato chips and Cap'n Crunch\nThat's how I take suckers out to lunch\nForget the internet, the website, that's no way to step right\nI ain't sittin' by no computer, I'm goin' to Bermuda\n\nBaddest, MC! {*\"Kool Keith\"*}\nKeith...\nBaddest, MC! {*\"Kool Keith\"*}\nKool...\nBaddest, MC! {*\"Kool Keith\"*}\nYeah...\nBaddest, MC! {*\"Kool Keith\"*}\nYeah...\nBaddest, MC! {*\"Kool Keith\"*}\nKeith...\nBaddest, MC! {*\"Kool Keith\"*}\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "Shit Expands", "href": "Shit_Expands&&7124", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Bronx, Brooklyn, Queens Manhattan, Staten Island\nKeith! In the house\n\n(Kool Keith)\nIt ain't about the bitch with a wig like she comin' from China\nY'all fronted in rented Benzes with Avis on 'em\nNo breakfast, I'm goin' home, fuck Chelsea or diner\nLet the guys with the chrome buckets expose the cuffs, be a co-signer\nI'm in your ass man, close like your Starter jacket liner\nDr. J sharper, plug your asshole up with a tub stopper\nYour wife's a New York City Breaker\nYour baby's mom is a pop-locker, know the metropolitan area\nCustodian nigga, you sanitation worker shit cleaner\nFloor mopper, look down on the city with binoculars\nPiss out at choppers\nDefecate 80 thousand feet in the air\nI flip your small game, take your small urban territory\nPut the street in the air\nMy shit rise, increase like subway fare\nScuffle your dinner wear\nYour sneaker line ain't makin' it, I piss on four pair\nYou know the big-head boy from the projects, retarded motherfucker\nYou know you be in child care, you better stay there\nYour crew get picked up with shitty diapers from daycare\nYour foe be his crib death\nThe top rappers receive hot dogs up they ass, they get F\nMark flush the toilet, you shit next\nExpand your stomach range with tummy pains\nShit in the back of your Bentley when it rains\nLeave your wooden panels with shit stains\nThrow the turds out the windows\nWatch them bounce in the carpool lanes\nHot 97\n\n(Chorus: repeat 4X)\nThe shit expand, over your Jacob the diamond watch\nThe penis is loose, we piss in your hand\n\n(Mark Live)\nYo... yo where's the block at? Uh\nThey say 106th and Park is on, I'm mad, fuck it it's on\nI haven't heard a hard record in years, uh\nEverybody dancin, Harlem Shakin, strip Free naked\nAnd put a pole up, and watch the ratings go up\nAnd if AJ steps, take his Jacob and slap off the makeup\nI'm in the crowd like Lee Malvo, with a sniper rifle\nA hockey mask, a butcher knife\nYo who knows what I'll do\nThey sellin dreams with a rap battle - uh-huh\nLook - yeah - you rappers are kids, and rappin' with a rap rattle\n... Nobody ever comes out - that's right\nNo twelve inches, no fires, no jets\nEarly retired, no links\nNo chains, no videos, no baguettes - uh\n\"Don't Speak,\" uh-huh - I'm gettin' Gwen Stefani\nShe's tossed up, sellin pussy like every week\nSo don't fight me - uh, you can hype me - that's right\nI'm liable to go out with a terrorist style\nI'm liable to flow out with a terrible style\nViacom bought you (suckers)\nI'm outta here nigga I'm changin the dial\n\n(Kool Keith)\nHot 97\n\n(Kool Keith)\nNo more cars and shit, we suicide bombers\nNigga, walk up in your radio station\nWe get gas from the gas station nigga\nYou better ask public relations, blow out your DJ booth\nWith hats off, like motherfuckin Dr. Seuss\nNo buckets, strictly bombs under the North Face goose\nCaught you with acid baby\nWe put it in your motherfuckin orange juice\nFuck a turned up cap\nHow 'bout a burnt up motherfuckin baseball cap\nWith a whack-ass rap\nWe detonate with three sticks of dynamite through your turntables\nBlow out your ass crack\nYou ain't the motherfuckin pimp, you ain't the motherfuckin mack\nReview this right, you gon' drink a daquiri\nAre you gon' come back to me\nAre you gon' get smacked from me\nFuck around look how you act to me... bitch... Hot 97\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "Girls in Jail", "href": "Girls_In_Jail&&7240", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nThe date - summer, August 25th\nYou was transferred from Riker's Island to Attica State Prison\nGina, Thompson\n\nI told you you shouldn'ta went out there with those other girls\nAnd stole a coach bag out of Macy's\nArguin with me every night, you was crazy\nCallin your grandmother sayin' I beat you, you think I'm mental and crazy\nThat Benz you pulled up you stole you didn't faze me\nYou had a nice body with bikers\nInmates and female C.O.'s was lookin' at your body at Riker's\nI took time to write you a letter\nBut you wanted me to put dope in your sweater\nI thought you was sick, with the flu, did you get any better?\nDid you write back your Auntie Trineta? Floss and don't pay\nJack say he seen you with a drug dealer that day\nYou woulda been better off takin' the subway\n\nMy girl's in jail for life, never comin' home - never comin' home\nShe got to pay the price\n\n(Kool Keith)\nYou got too big in New York\nYou needed big hustlers around everywhere you walk\nA lot of Cristal, fake ballers poppin' corks\nNow you in a two-inch cell, eatin eggs and pork\nFriday the 13th, your birthday, the worst day\nI still had love for your dumb ass anyway\nBentleys and Rolls Royces\nThe answering machine filled up with mysterious voices\nYour moms Ms. Jones called, I was in the mall, she said,\n\"Keith - Tina and Terry got them fake credit cards.\nThey got my daughter out there - I ain't seen Gina in two weeks.\"\nI hung up the phone\nI knew you was workin with some bronze pimp in the streets\n(Pimp in the streets... pimp in the streets)\n\nMy girl's in jail for life, never comin' home - never comin' home\nShe got to pay the price\n\n(Kool Keith)\nI called the operator to block the calls and stop the calls\nThe ceiling in my apartment was leakin like Niagara Falls\nSendin you a bunch of money, clothes and munchin money\nYou got a lot of phone call threats from a girl named Sunny\nI seen the chick from the back\nPuerto Rican girl with a nice ass drivin' a black Cadillac\nWith a guy with long sideburns, is that your mack?\n(Is that your mack... is that your mack)\n\nMy girl's in jail for life - you're a bad girl - never comin' home\nShe got to pay the price - you're a bad girl...\nMy girl's in jail for life - you're a bad bad girl - never comin' home\nShe got to pay the price - you're a bad girl...\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "Haters", "href": "Haters&&4047", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Two-thousand-three baby, Kool Keith, I'm up in here\nVery different - and he wants to talk to you\nAdmire his immaturity\n\nTook you away to better places\nBrazil, Costa Rica you seen new faces\nCovered the bills you struggled to pay - gave you life\nNo more kid with a scarf around his beatin' you up every day\nPlastic surgery breast implants the small hustler made you cry\nBecause he was confused, you lay while he play\nCleanin my house, you look gorgeous in lingerie\nIs that the kid on the phone? Hardcore\nHawkin you in front of the building everyday\nWhen is he gonna learn? It's over, it's my turn\nYou're pregnant with my kid\nBy the fireplace, we watch his doo-rags burn\nI remodeled you, gave you the diamonds he couldn't wisely concern\nAlways talkin' 'bout the cash he got\nThe little pesos for shows\nAnd God knows his materialistic raps and wack flows\nAre like Stay Free pads, fake V.I.P. rappers get garbage disposed\nUnrecouped for his flamboyance and reflection\nHe's leasin rentin and frontin - yeah, yeah...\n\nHaters come around from downtown\nI get surround sound - I get big!\nHaters come around from downtown\nI get surround sound - I get big!\nHaters come around from downtown\nI get surround sound - I get big!\n\nStop the chorus back to your Bentley\nYour wife is gone, she's with me\nOn a first class flight in the Bahamas, grab your bags quickly\nSorry top ten rapper on the answering machine\nYou're over like Al Green\nThis song is written for the 2003 team\nV.I.P. with Ben Vareen\nCancel your A&amp;R meeting light you up like Heatwave - central heating\nEject your premature CD in the whirlpool while we're eating\nShut down all material, new tracks fall on your head like a crane\nAll you offered to women is sound of weak drums\nFill they hearts with pain\nI'm in your dungaree jacket like a bleach stain\nGirls cry on my arm, he was cheap and silly don't complain\nHe's a nerd with a hardcore twist, playin' with racing cars\nWe look out the window and count the rain on the window pane\n(Count the rain on the window pane)\n\nHaters come around from downtown\nI get surround sound - I get big!\nHaters come around from downtown\nI get surround sound - I get big!\nHaters come around from downtown\nI get surround sound - I get big!\nHaters come around from downtown\nI get surround sound - I get big!\n\nHere's a tissue for the tears\nHe gave you hard times over hard rhymes for years\nShattered your career\nLike an uncomfortable thong twisted in your rear\nHe was eight years behind, I was already advanced, I've been here\nDenim suits with alligators\nYour man sports black all the time with no flavors\nFrom castle to castle, hassle to hassle\nHouse to house, man to mouse (man to mouse)\n\nHaters come around from downtown\nI get surround sound - I get big!\nHaters come around from downtown\nI get surround sound - I get big!\nHaters come around from downtown\nI get surround sound - I get big!\nHaters come around from downtown\nI get surround sound - I get big!\nHaters come around from downtown\nI get surround sound - I get big!\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "Baby Baby", "href": "Baby_Baby&&8398", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Baby bab-ay, you feel it la-day\nCan you feel it?\n\nBuilt to last, I'ma reduce competition\nStretched like a G-string stay in that ass\nEliminate your words you think are tough\nBy movin herbs, you think you're rough\nSpice Girl figures, you're hype man sucks, y'all powderpuff\nStop thumpin stuffin\nEverything your producer make is cuddly and fluffy\nSoft as Kleenex tissue\nYou with the coalition pushin the vinyl\nFunny style, movin the feminine issue\nAttack you mentally, you know I would get you\nGorilla shots, you figure out what animal bit you\nTractor trailer from the side hit you\nTryin' to figure what animal hit you\n\nTryin' to figure out...\n\nYou tryin' to play me like I'm from Montreal, Calgary\nYou never noticed G\nHow the thirty-eight weighs a lot of pounds and what it be\nIf you knew, you wouldn't be standin in front of me\n100% of you is imitation, take off that baseball cap\nIn Jersey ask your mother, youse a wannabe\nA 46 dollar, 3 color face watch\nYellow band, don't step to me, I know your estimate B\nDon't question me\nYou met the rude awakening, find the best of me\nI don't care about your favorite rapper they're less than me\nUrinate on your V.I.P. area\nWhere girls roam, piss on your dome\nBodyguard, face the C-I-P area\n\nYou know what's coming nigga...\n\nI knew I had to make a record soon\nDestroy your whole mechanism\nCompilate on your Meoshe jeans, in fake records soon\nYou blew up all right, youse a blip\nUp in the air homo, your crew is a helium balloon\nYou guys with thug mentality\nWearin them tight ass black thongs with black Sassoons\nSmooth on your anus\nYour girl defecate my diamonds out with brooms, and mushrooms\nYou cats face the public here, you know the rules\nFrom MC Hammer down to Lil' Romeo\nOut of 2 million rappers you pick a name and lose\nI penetrate news, my Tomahawk missles piss on Cruise\n\nYou know me baby, can you tell I'm bad?\nYou know lady, hey hey hey hey hey hey hey hey\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "Big Frank", "href": "Big_Frank&&52", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Yeah, two-thousand-two\nI don't hear you no more\nThe K-double-O-L, the K-E-I-T-H\nCheck it out\n\nI trust talent, whattup Flex, JoJo and K-Ci put me on next\nEighteen times let my record play like Dr. Dre and Jay-Z\nAll man headline like Beenie Man; work it out this time - don't bother\nMake hits like \"Planet Rock\" Bambataa\nDance floor stiff beat break your jaw\nI cancelled the Limp Bizkit tour\nLet your braids and afro grow more\nOne year I hear about you, next year I don't hear about you no more\nGot people in Oakland, Bronx Lebanon to Fillmore\nCarry updated trunk funk\nThat stuff you program is for punks\nI can't lay up big shots gotta pay up move in the penthouse way up\n(Way up, way up..)\n\nBig Frank drivin' - leanin to the side\nSide, side, sa-sa-side, side\nBig Frank drivin' - leanin to the side\nSide, side, sa-sa-side, side\nBig Frank drivin' - leanin to the side\nSide, side, sa-sa-side, side\nBig Frank drivin' - leanin to the side\nSide, side\n\nBrother move your feet, don't front on my funk shit\nJealous cats like you should jump ship\nRight from my left nut like a vice grip\nCognac take a sip you look burnt out\nI don't like the two-way pager stickin out my hip\nNo time for voicemail\nI bring heat in the city on Amtrak and monorail\nWhy you makin' tracks like L.A. Reid and Babyface?\nHow that gin and tonic taste?\nKorg adapter, Yamaha in the suitcase\nJust dance, don't look and nobody two-faced\nBrown man, all head like Tupac\nCadillac frost blue, yellow convertible rag top\nGirls enter the club with Lonnie Rich\nChevrolet Impala green SS on dubs\nDon't front on me one bit I pull ladies out of fly cars with love\n\nBig Frank drivin' - leanin to the side\nSide, side, sa-sa-side, side\nBig Frank drivin' - leanin to the side\nSide, side, sa-sa-side, side\nBig Frank drivin' - leanin to the side\nSide, side, sa-sa-side, side\nBig Frank drivin' - leanin to the side\nSide, side\n\nWalk around for the playin' captain of rap skills\nEatin, big smoke comin' out of my Ampex reels\nSit in the back of your Escalade, tell me how my bass feels\nFrom Big Nixons down to the beta\nGeorge in New Orleans rattle your dashboards\nBounce strippers around sounds echo from New York to Decatur\nExhaust pipes, white kid drivin' a limo I'll see you later\nLeather boots or gator\nTurn your head hater\nLockerroom packed like the Los Angeles Raiders\nWe the real eliminators, we come down on diamond elevators\n\nBig Frank drivin' - leanin to the side\nSide, side, sa-sa-side, side\nBig Frank drivin' - leanin to the side\nSide, side, sa-sa-side, side\nBig Frank drivin' - leanin to the side\nSide, side, sa-sa-side, side\nBig Frank drivin' - leanin to the side\nSide, side, sa-sa-side, side\nBig Frank drivin'\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "White Label Test Press", "href": "White_Label_Test_Press&&5015", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Record company flunkie)\nYeah I don't think Keith's gonna show up to the meeting y'all\nSee Keith's the type of artist to do his own thing\nThere's no A&amp;R out there that can tell him how to make a record\nYou can't tell him he needs to make something like everyone else\nCause everyone else is just stealing his originality and ideas\nANYWAY ... I think we should cancel the marketing meeting\n\n(Kool Keith)\nAs a big secret, Kevin Glickman chill with Chris\nDon't like Jeremy Lawner\nSo Ruffhouse politically had to freeze my album\nRegular Columbia don't know what the hell is goin' on\nWith a sheisty distribution switch behind my back\nI worked on my album February last year\n13 months, passed by, all I heard was a bunch of lies\nSix weeks in ?? hawkin with a so-called manager\nUnivested, livin' off my budget\nMy LP was completed before John Forte, Sporty Thievz and Pras\nBut too many secret fans had they hands in the pan\nWhen I got to Philadelphia, everybody was waitin for me\nWith tracks with a bag full of unconceptual DAT's\nThrowin' me off, distractin me\n?? ?? Came out with programmin\nMe on the basslines, all my beats were slammin'\nNothin' they could tell us\nWhile everybody except Tim Devine was jealous\nWith my album leakin out to a bunch of critics\nIt was somethin' stupid the record company\nAnd the scam bookin agent, slash manager did\nDubbin my cassette for the industry, it got silly\nOpinions from people who don't know jack about music\nIn the industry, know what?\nHad to do the album practically over\n\nChorus: Kool Keith (repeat 4X)\n\nThis is a test press\nWhite label test press\n\n(Kool Keith)\nBack like \"Return of the Jedi\"\nWhile the average person critiquin my album\nMost MC's look at me with red eyes\nDJ's don't understand my sound is too new\nHe can't feel it on the felt; he say he'll make it a hit\nIf I give him a Rolls Royce and a Versace belt\nTake care of program directors\nYeah gonna call Billboard when y'all send them a Mustang Ford\nThen buy a 20-page ad about Kool Keith headbands\nSoap powder's in The Source, that'll get me the cover boss\nEverybody's small\nYou're gonna have to buy video shows with washing machines\nI got to step up to bat in 3 Rivers Stadium like the Yankees\nIn the World Series against the Big Red Machine\nY'all gotta make it work, every video producer\nY'all gotta send 'em a V-12\nCause nobody wants the t-shirt at Urban Network\nBig Truck productions need to hire 20 people on the phones\nCallin retail; 90 foot pictures of me and my daughter\nLifts on the side of the building\nHalf of these records are wack cause street teams get paid\nTo pull out wack snippet tapes out their wack backpacks\nGet off early with a crew pile up in a suburban\nGo to the clubs and get the flats and posters and start servin'\nYeah\n\n(Kool Keith)\nYeah...\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "Take It Off", "href": "Take_It_Off&&932", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith) New Nancy Des Rose\n(Nancy Rose) Keith you gon' hold this track down for me?\nI'm goin' upstairs to change, I gotta get on stage\nAight? I'll be back later\n\n(Kool Keith)\nMy commodes are larger\nI call rappers to look at the feces\n800 pounds, my pet tiger feed\nYou whack niggaz a bowl of doo-doo\nAnything you play my pee will stain\nYellow spots from the pilgrims cause pain\nGeorge Westinghouse started to like that beam on the mouse\nImagine a apartment in Riverdale\nWith 5 Belve' bottles with defecation on the couch\nSoiled clothes in the hampers\nWarned everybody, including your hype men\nGlobal maximum urine, piss on the core of the city\nLeavin' New York police department with Pampers\nWith KF's chicken baby, my uncle's Colonel Sanders\nWatch the mixtape, niggaz don't even know yet\nPressin up homosexuals that ain't even pro yet\nI vomit on most rappers gettin' off a private jet\nAustralian orangu' tango\nA key to dog Asian that's my private pet\nTighten up in Jersey kid writin some ol' cow shit\nWhile you watchin the Nets\nYour top performance is low to me\nYour chihuahua, that's your apex\nI respect the Taco Bell dog better than you\n'Cause he's cleverer than you\n\n(Chorus: Kool Keith)\nShorty, just take off your clothes\nTake them off (I wanna take it off)\nShorty, take off your clothes\nTake them off (I wanna take it off)\n\n(Nancy Des Rose)\nPalm trees, blue seas, ships to outfits\nI dip right into some jumpin' mix\nTwist and flip it over to the other side\nThe people say, \"Hola, chula\"\nI'm hot to trot, Hollywood can't stop what I got\nLike special stew in a pot, a remix recipe\nGo back to your shop, inspect your beats\nI'm recreating the streets, hits that fit\nYou gotta go home to take that Prozac\nCause your shit is whack, you lack the act\nI come with what attacks, don't counter contracts\nI stay packed with fly tracks\nFlavors everywhere, I dare you to try and fly with me\nFull speed ahead, you got no deal\nI'm the real, down Melrose on a shopping spree\nSomething for me, usually some fly shit\nMade just for me on an island in the highlands\nYou can't reach me, you can't teach me\nI'm way out in the Pacific, Atlantic, the Red Sea\nIt's all just a breeze\nA real, a meal, I heal, open all the seals\n\n(Uncredited rapper)\nYo... yo, yo, yo\nLet me take you there, UHH, UHH\nC'mon, bash the club, we don't care\nStrippers lapdance, shakin they tail, it's a crazy night\nWe take 'em out like every night\nLet's go, that's how we do, back to the city\nCrack backs real fast in the quickie\nI know you like that, G-strings come off\nWith your black tights, we can go nuts\nSlap that ass... UHH\nWe can get drunk, smack that ass\nThose high boots\nFull length fishnet black body suits\nA sexy tan (yeah)\nI'm a big fan, big fan baby\nChicks love me, call me a big man\nA freak by nature, don't be a hater\nDrink it up right out of the alligators\nYo, we in the elevator\nGettin' naked, Bonaventure\nThey can see us, baby don't fake it\n\n", "album": {"title": "Dr._Octagon_Part_II_(2008)&&1223", "genre": "Hip Hop", "year": 2008}}, {"title": "Diamonds", "href": "Diamonds&&5297", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Man it's been quiet in the Bronx since Kate Rich got killed\nI heard some kid wearin a mink\nFakin like he live in Brooklyn squealed\nWe gon' need Johnny Cochran man, I'm tellin' you\nGotta get everybody out...\n\n(Kool Keith)\nChill at home watchin the Mets\nI'ma tell Suge Knight to call Big Kap and Funkmaster Flex\nTony Green is out of jail with a five billion dollar bail\nI'ma hire two men with machine guns to do retail\nIndependent promotion, a couple of people got they legs broken\nRecord exec found dead, body in Hoboken\nAutopsy explainin what parts remainin\nNew York police department, the F.B.I.\nSaid this guy wasn't playin'\nTape around this punk's mouth, what is he sayin'?\nTurned the radio up and cut his arms off\nAnd throw him off the top of the Waldorf\nCall Fat Kat in prison\nTell him his right hand mand already did that\nTen cars, meet me at the Lincoln Tunnel with stockin cops\nWe're gonna count to the one-oh, put butter on the bun-oh\nBlack killed the program director but first let him sniff some blow\nSee the man with the suit?\nLight up the kid with the bomber jacket and Timberland boots\nComin' at you like Tupac in \"Juice\", I'ma get loose\n\nChorus: Kool Keith (repeat 3X)\n\nWe work nine to nine, we never sleep full time...\nDiamonds, we bring violence!\n\n(Kool Keith)\nSend a coffin up to Billboard with flowers in the lobby\nA picture of me with Gene Griffin holdin' a hand-grenade\nI'ma fax you a copy - and let you know my job ain't sloppy\nExtort the industry cause Nicky Barnes is gonna be\nIn charge of every label's distribution\nMy street team is gonna be eight men with loaded tecs\nRidin' around with Chrysler PT cruisers from a mental institution\nWhip mob style, Tone Capone AZ in charge of publicity on the phone\nCrazy Joe outside to meet the mixtape DJ's with carbombs\nIn the parkin zone - purple Cadillac lavender two-tone\nA box packed up with a chopped off human head\nWith a murdered pitbull with a knife in his stomach\nFederal Express to your secret home\nSonny D handle the Wherehouse and Tower\nTake Coconuts and Sam Goody\nAnd hire David Berkowitz as a receptionist for more power\nExtreme impact when Uniter Parcel\nBring bazookas and bombs in from Iraq\nClose the George Washington Bridge when we attack\nCarryin duffle bag sacks\nLarry Davis is workin with a thirty-eight magnum\nBig stations won't have any problem hearin the wax\n(I'll play it!) With Kingston, Jamaica\nSendin the video to HBO and Cinemax\n\n(Kool Keith)\nLook at the bottom of your car, now start it\nWire on your doorknob\nThat's me across the street, wearin a pinstripe suit\nWith a (???), with black glasses talkin' to Grandmaster Flash\nLookin' at your black asses\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "Telephone Girlfriend", "href": "Telephone_Girlfriend&&3401", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "{*Phone rings*} Hello?\nThis Keith, you're all by yourself? {*out of service tone*}\n\n(Kool Keith)\nGirl you're about to take a shower\nGet in the bathtub, get your back scrubbed\nMassagin your neck, feet rubbed\nBaby oil on your toes while you get wet to my flows\nI get turned on by the belly piercing\nYour little ring in your nose\nDecision makin' you chose\nSmell my cologne, fluctuatin your clothes\nMe and McBenson\nProject chicks in the green S-500 with extensions\nFrom New York to Virginia to the Pocanos\nIn Cancun I send you to Rio De Janeiro, Brazil\n{*Out of service*} Keith ill\nFirst man from New York City housin to have his face on a $30 bill\nChauffeur impressed, with sneakers on, dressed to kill\n{*Phone rings*}\n\n[Chorus] + {*miscellaneous phone sounds*}\nTelephone girlfriend (dressed to kill)\nTelephone girlfriend (dressed to kill, dressed to kill)\nTelephone girlfriend\n\n(Kool Keith)\nAnswer the phone honey\nYou lay on my chest like Max Julien, Cleopatra status\nCoke bottle shape, Miss Nubian\nWatch your sheer nightgown in the bathroom light\nWith cameltoe showin, I can tell you tight\nLoose jeans don't work, my job is to convert\nAct like I don't know the bottles are there\nI can see through your shirt\nWhile you listen to some wack MC's turned Smokey Robinson on\nNo time for incoming calls, b-boys stay mad\nActin' buddy and funny, walkin' around for beats won't work\nShut your status and timin\nI don't wanna have a career too extreme\nBut ladies think I'm Frankie Lymon\n{*Out of service*} They think I'm Frankie\n\n(Kool Keith)\nIn the living room, on the couch and sofa\nMature female, you act older\nNo problem at all when I walk witchu to the mall\nCircle the parking lot, you park and hot\nAt night you booty call, we order things from Pink Dot\nBlockbuster movies, Maxim, Hustler, got you in Spike leather jackets\nWith tats on your stomach like a wrestler\nYou challenge the taste tester\nLike Gomez used to kiss on Morticia, in front of Uncle Fester\nCharming my dear, kissin' you around your ear\nArms and palms, legs and thighs\nDon't be surprised (don't be surprised)\n{*Out of service*}\n\n(Dressed to kill, dressed to kill, dressed)\nTelephone girlfriend\n{*\"If you'd like to make a call, please hang up and try again\"*}\n{*\"If you need help, hang up and then dial your operator\"*}\n{*Out of service*} {\"We're sorry, your call cannot be completed as dialed\")\n\n{*Phone rings and tones to fade*}\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "Dark Space", "href": "Dark_Space&&5119", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Reverand Tom - Kool Keith)\nTalk digital, all galactic iMax, start space\nDemon of three dimension intro-respection\nShake the one...\nThe rap flow since the Scoob paid dues to G.O.\nCapture the picture all out the end\nWatch the cheap pendant bend\nYou face me like you've hittin the dead end\nI listen to heater, talkin' to probably my best friend\nSmack your face like Tony Gwynn\nThe screenplay will never end\nWith {?}, Stoli, OJ and gin\nRocketship goin' up to, count to ten\nAll galaxies will pay me salaries\nAluminum shirts and die cast shoes\nMercury, Pluto, Mars\nJupiter Saturn is on the news, NASA black hole\nYou face, the mantaur\nThe explorer, world controller\nAdjusting levels, you can't face us\nThat's right you can't replace us\nUndatakerz, no fakers\n...\nI think we're stuck out here, umm\n\n[M-Balmer] Stuck?! What you mean stuck!\n[Rev. Tom] There's aliens on the ship\n[M-Balmer] What's goin' on Reverand Tom?\n\n(Rev. Tom)\nWe gotta do somethin' about it, umm - where are you located right now?\nI've been walkin' around for a long time\nI can't find out anybody, where is anybody located\nCome in, do you read me? Come in... anybody come in\nRed code one\n\n(Thee Undatakerz)\nI'm coming, closer\nThere is something wrong here\n\n(Thee Undatakerz)\nThis is Mission Control\nReverand Tom! Reverand Tom, what's going on up there?\nM-Balmer, are you still at the controls?\nHey anybody! Al Bury-U?\nAl Bury-U are you in the engineering room?\nI'm getting no kind of feedback here\n\n(M-Balmer)\nTakin' flight, is M-Balmer, the vicious, funk mistress\nWarpin through yo' zone, zappin Amazon figures\nThe unidentified femme like that Big Bang Theory\nI'm blowin' up like the beginnin of time when I drop one line\nHeadacysm, mechaic-nism\nI flow from A.C. to B.C., my enemies can't touch me\nIf there's a penalty like Space Gozer\nI'm creepin' quicker than a roller coaster, dumpin out the space Rover\nCosmo cosmic galaxy 'n' all\nBut I'ma roll through 'cause he ain't with my black in the zone\n\n(Thee Undatakerz)\nI'm gonna stop, all the aliens\nThey're taking over the ship\nI must get my weapons, ready\nThey will not, take over this ship\nI gotta let the dogs loose\nThey've got the alien, cornered\nIt's a lot of them! I need help\nPlease, we're in mortal danger!\n...\nWe're all gonna die\nI think this is our last, mission\n\n\"That's one small step for man, one giant leap for mankind.\"\n\n", "album": {"title": "Kool_Keith_Presents_Thee_Undatakerz_(2004)&&2279", "genre": "Hip Hop", "year": 2004}}, {"title": "Yes Yes Y'All", "href": "Yes_Yes_Y%27All&&8731", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Esham)\n3-1-3, D-E-T, N.Y.C.\nDetroit up in this motherfucker!\nEsham and Kool Keith\n\nAss, and titties, hundreds and fiddies\nMe and Kool Keith macked them hoes from L.A., to New York City\nI take 'em blind crippled and crazy, ugly or pretty\nI beat it up, make the pussy meow like a kitty\nSo slow your roll, slide upside down on the pole\nBounce that ass, bounce that ass, let your knees touch your elbows\nIn Detroit, Michigan cruisin spaceships of Daddyville\nJust got back from Bootyville, spending big face bills\nOn some exotic body hottie erotic\nVision blurry from the narcotics, keep pushin CRAZY products\nParlay, parlay, twenty-fo' seven all day\nSpendin like Michael Jackson the \"Off the Wall\" way\nMake your booty clap, chickenheads flap chicken wings\nPadussy juice on my diamond rings, from the fast finger-ing\nAnd the smell's linger-ing\n\nYes yes y'all, you know we rock y'all\n[E] We freak them hoes twenty-fo' seven around the clock y'all\nYes yes y'all, that booty tight y'all\n[E] We drinkin' and spendin money with these hoes all night y'all\nYes yes y'all, you know we rock y'all\n[E] We freak them hoes twenty-fo' seven around the clock y'all\nYes yes y'all, that booty tight y'all\n[E] And we come get up in some ass, tonight y'all\n\n(Kool Keith)\nTitties and booty; she got them silk thongs on\nYo my song's on, here's your T-I-P\nMove in V.I.P., G-strings of energy, Esham and me\nRack up control and move when the butts stack up\nPanties get touched when the butt back up\nIt's all RODEO, for a cup, like Romeo\nMove in your area, girl what? We ain't scared of ya\nTwo drinks minimum - don't worry, we maximum\nWhen assed up to the pole, now we taxin 'em\nDetroit Los Angeles Miami can you handle this?\nMy shit gets frisked while you stare and sweat, weave twist\nGo knock the drink off the table, please watch it miss\nWe like to watch the girls kneel down when they piss\nOur style is right y'all, we rock tonight y'all\n\n[E] Yeah, yo Keith\n[K] Yeah\n[E] The fuck you gon' do in this bitch tonight?\n[K] That's right we takin' somethin' out of here\n[E] Yuh\n[K] Go hit the hotel\n[E] Smackmaster up in this, knowhatI'msayin?\n[K] Motel 6\n[E] Smack some, smack some, smack some ass\n[K] What's that highway run through your house?\n[E] Uh, I-94 - Detroit baby\n[K] Right, we gon' take 'em through there\n[K] You know where, you know where the uh, Howard Johnson rest?\n[E] Yeah Howard Johnsons, Motel 6, anywhere\n[E] We can freak them hoes in the car Keith, yeah\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "6 Feet Unda", "href": "6_Feet_Unda&&4740", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Reverand Tom - Kool Keith)\nCarole Lewis, may you rest in peace\nHere today, we are giving a wake\nReverand Tom, and a lot of you other people out there\nIn the so-called industry, executives\nMajor promotional people that have died\nAnd lost their lives\nI will throw a little sand as the Reverand\nAnd let's pray everybody, gather around\nLet's close our eyes for one second with a moment of silence\n\nI'm tired of you watered down figures\nY'all major record company watered down minions\nTake what I create\nMassive audience bite my innovative stuff and duplicate\nCasium trinity...\nCats are bitin me, all the hype and, big companies\nSpend 8 million, videos recouped\nYour street team, retail hype and MTV and BET\nRotation radio, you know you barely sold 100,000\nDon't open your mouth, turn in your masters\nYour marketing plans, commercials and billboards\nBig ads the cover of Vibe\nActin' like you get paid, you haven't seen a check in YEARS\nDon't front, you face disaster deduction from your royalties\nZero ratings, you lease Bentleys with no insurance\nYour contract is up it's time to check Mase\nYou got the lawyer lookin' at you on the next deal\nYou're unsuccessful, Ampex reels\nI know how you fake niggaz feel\n\nWe will pray in church\nWe will drop sand, we will burn you\nAshes to ashes, dust to dust\n\n(Thee Undatakerz)\nYeah, that's right\nWe're gonna bury you six feet deep\nSix feet deep\nHa ha, hahahahahaha!\n\n(Thee Undatakerz)\nTerminatin rappers contracts, careers are done\nNo funds, obsolote, your bank statement read none\nTriple zero you dare, when freestyles get done\nSmokin' sherm in cemeteries with Makaveli's son\nDeep conversations, got me watchin for hate\nThis industry is full of jealous fake envious snakes\n\nI squash pretty flowers, take cash, take candy from children\nRun inside a bank broke and come out with a million\nFuck hangin' out with niggaz runnin' with problems come up\nBorn in killer California where niggaz ride to come up\nAnd stay with real hustlers, livin' phonies die to come up\nLook at these fake thug niggaz tryin' to imitate 'Pac\nYou ain't a gangster cause you bounce in the trey with hood flags on\nDisrespect the city I'm from and get blast on\nI drag niggaz names through the mud and the dirt\nUndatakerz love to cut a nigga in front of his mother\nWe smother motherfuckers, no matter white or a brother\nFamous rappers found dead, nobody gotta discover\nANYTHANG, we did it, don't gotta wonder\nYou don't gotta discover no evidence, we did it!\nIt's in your face (he's gone bury you) ha ha, y'knamsayin?\nUndatakerz (he's gonna dig your grave)\n\n(M-Balmer)\nI, I-I-I\nI heard it's like a jungle so I decided to send you under\nTwo + three and one more that be me\nMake yo' head split - now that equals six!\nGot yo' number picked\nGot a few more stops to make before your final restin place\nStretched out on a board, body cold in the morgue\nCoroner pullin off the duct tape\nMortician tryin' to fix the expression on your face\nBut wait, Funeral Director, burial packets in his case\nEmbalm the room, filled with tombs\nFluid this I'm bout to lay down fools\nMake a call to the rear, Tommy get their walkin' pass\nHoldin' his nose, put some chronic in the air\nQuotin scriptures (Undatakerz)\nAnd the last prayer\n(Undatakerz)\n\n", "album": {"title": "Kool_Keith_Presents_Thee_Undatakerz_(2004)&&2279", "genre": "Hip Hop", "year": 2004}}, {"title": "N.B.A.", "href": "N.B.A.&&8611", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Yeah... a message to the N.B.A. (\"well that's all right\")\nThe National, Basketball, Association\nWe begin (\"well that's all right\")\n\nYour man is a tourin nigga, six-foot-eight floss nigga\nWho carries champagne in the club with Coogi sweaters\nBorin nigga, no game havin'\nLess rap skill, N.B.A. nigga with a studio you ill\nDon't you know my game terrorize\nSix-foot-three guards on the microphone, my lyrics kill\nWhy don't you awkward niggaz stop rhymin and take a birth control pill\nJackson got you gassed, ask Phil\nI'm not impressed with your full court press\nGirls with Tyra Banks weaves, and Lisa Raye's complexion\nCan step up to the foul line for an AIDS test\nMy jewelry like big trucks\nI don't care if you flash your Milwaukee Bucks\nEven bodyguards couldn't protect you ducks\nI care less if you a Trailblazer\nMy cris-cross on girls is sharp, y'all get cut off with a razor\nEven if you have braids like Latrell\nI got more numbers in my system than Pacific Bell\nPass the basketball around and go tell\nSmoother than Rick Fox puttin' on his hair gel\nGroupies don't have to know me, just swallow my sperm when you blow me\nKeith look in the club for your celebrity jump shooters\nTall lean men who can't read books to they kids need tutors\nYou cats got the nerve to try to stop my tomahawk dunks\nBy e-mailing, golddiggers on computers\nLeap over y'all with color and fashion\nLame assholes in black pinstripe suits, keep steppin and passin\nBeyond the youse-a-baby, you broke finished payin' for them car notes\nI'm the championship nigga youse a loser (\"well that's all right\")\n\nP.I.S.S., on the N.B.A. (\"well that's all right\")\nN.B.A. niggaz!\nNational Basketball Association\nN.B.A. bitches! (N.B.A. play)\nNational Basketball Association\n(The N.B.A. Association..)\n\n{*Singer ad libs*}\n\n(N.B.A. niggaz, house niggaz, slave owner niggaz..)\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "Cleavage", "href": "Cleavage&&1275", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "New York City\nWant me tell you the style that's goin' on right now?\nGirl I caught you last night\nYou're only 19 or 20, tryin' to hide\nSittin' in the back of a restaurant, with a 99 year-old man\nI'm startin to see that a lot\nHey fellas!\nShe's feisty feisty, just lettin it all hang out\n\n(Chorus: repeat 2X)\nMan I know, they're out there cheatin'\nEvery girl in the club, exposin cleavage\n\n(Kool Keith)\nMan I know... I'm on the couch yo, I'm feelin' laid back\nI play my records over and over, my name is K-Mack\nI'm over here on the chair, girls stop and stare\n200 million pounds, you bring a box or 7\nI'm on the news, girls you turn to Fox 11\nYou try to network, that watch and neck hurt\nI give you irons, don't take so long to press my shirt\nWith the steam that's clean, you start to dream extreme\nYou chose one, you're on the creamer team\nYou move with men that beat 'em, they on the screamer team\n\n(Kool Keith)\nMan I know... you know the kind of sound, grab your Metro card\nGet rid of your ego, meet me down in Chinatown\nThe classic Lincoln, respect the K when he speakin'\nI sleep in limos and headline shows at the Beacon\nBroadway players, the City Hall to the majors\nI'm on DVD, most cats still watchin Betas\nI write with two pens and two pads, two songs on papers\nGirls with FedEx sendin all thongs to me in all flavors\nUPS delivery B what you givin' me?\n\n(Kool Keith)\nMan I know... have you seen your girl tonight?\nCall the manager, turn on the light\nNo studio tape, 300 groups wanna be in the remix\nAnd bypass the need for fixin, loaded with chicks and\nWith the mic, rock icon, women like pops\nDon't fear eyedrops\nYou're frozen with teardrops, double peein\nThat's right you seein, the best to believe it you receive it\nNon-stop for the hip-hopp-in, that's right you stop man\nCause your records done flopped man\nA full length video, that's the girl in stereo\nI gotta see this, don't you believe this\n\n(Kool Keith)\nMan I know...\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "Mad Man Departure", "href": "Mad_Man_Departure&&4359", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nYeah... outro, Mad Man\nEverytime I see your motherfuckin ass\nYou always with some motherfuckers around you\nYou know why? 'Cause you're motherfuckin scared\nBut I'ma pick you out motherfucker\n\nI like to boost myself cause all you niggaz can kiss my ass\nCritics like my balls, bitches get jealous\nY'all on some old funny-ass shit, hang with a bunch of fellas\nYou can't fuck with me, shiny head like Telly Savales\nLook at your favorite rap star, corny as a MOTHERFUCKER\nScarecrow hardcore\nI flip your tour bus over, pull your plug on your stage show\nOn your fuckin' tour\nPut a piece of your fuckin' hand in the refrigerator\nBook your shit Monday\nYou'll see me with three niggaz with stockin caps\nWith sawed-off shotguns, waitin for your black asses\nThen come to Apollo to play, blow your session away\nYou don't wanna fuck around\nI don't give a fuck if you in the studio with bodyguards\nYou can hide behind fuckin' Big Ray\nBash you in the face with a fuckin' ashtray\nMove you out in a STRETCHER\nWalk you to the fuckin' ambulance\nWith blood all over my fuckin' pants\nThat's what you get for tryin' to do a b-boy stance\nNext I'ma step to all you homo ass niggaz that dance\nMove that glittery shit out my vision\nAnd face the fuckin' collision\nTreat you like the Lifers Group\n27 years, I'ma act like I'm in fuckin' prison\nSay somethin' now motherfucker, say somethin'!\nI bite your fuckin' nose, spit back in your fuckin' lap\nSee somethin' funny? See somethin' funny?!\nSEE SOMETHIN' FUNNY MOTHERFUCKER?! Amputate your face off\nFuck around cut your shoulder blade off\nDisconnect three of your fingers\nYou won't be able to point at shit\nOr wave a fuckin' cab down\nLook at you bleedin with that rap shit on the fuckin' ground\n\nThat's right motherfucker\nYou knew I was comin' to see you from the beginnin\nBut you was talkin' all that bullshit\nBut I'ma see you in, time\nThat's right, when I get to yo' motherfuckin ass\nI'ma work my way up there\n\nSee youse a faggot ass nigga\nYou moved to the suburbs\nYou think you safe, workin by phone\nYou can't go nowhere, and you hidin\nYou stay in hotels, and ??\nAnd smoke a bunch of fuckin' weed, that's right\nLookin' at each other\nFuckin' each other in the ass\nBullshittin and playin' with PlayStation\nI'ma tell you straight\nI ain't no kid, I'm a grown-ass fuckin' man\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "Recoupment (Skit)", "href": "Recoupment_(Skit)&&7149", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "<span style=\"padding:1em\"><a href=\"/wiki/Category:Instrumental\" class=\"image image-thumbnail link-internal\" title=\"Instrumental\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D\" alt=\"TrebleClef\" class=\"lzy lzyPlcHld \" data-image-key=\"TrebleClef.png\" data-image-name=\"TrebleClef.png\" data-src=\"https://vignette.wikia.nocookie.net/lyricwiki/images/1/1e/TrebleClef.png/revision/latest/scale-to-width-down/30?cb=20090423154754\" width=\"30\" height=\"68\" onload=\"if(typeof ImgLzy==='object'){ImgLzy.load(this)}\"><noscript><img src=\"https://vignette.wikia.nocookie.net/lyricwiki/images/1/1e/TrebleClef.png/revision/latest/scale-to-width-down/30?cb=20090423154754\" alt=\"TrebleClef\" class=\"\" data-image-key=\"TrebleClef.png\" data-image-name=\"TrebleClef.png\" width=\"30\" height=\"68\"></noscript></a></span> <b>Instrumental</b>\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "Gina Called", "href": "Gina_Called&&262", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "(Kool Keith)\nTina called, she naked over here\nAngie called, she naked over here\nMonica called, she naked over here\nEvelyn called, she naked over here\nTerry called, she naked over here\nTina called, she naked over here\nBarbara called, she naked over here\nCindy called, she naked over here\nEverybody called, they naked over here\n\n(Kool Keith)\nRated X, standin naked behind yo' couch\nS&amp;S gear men, put the fruit in your lady's mouth\nPull the thong to the side, butt-licker, take it down South\nShe won't be mad if you rub her hair, with a condom bag\n1-900 sex talker, cops can't stop the window peeker sex stalker\nBlack Chinese security have fire extinguisher\nBaby I'll hit yo' buttcrack\nWalk to the kitchen grab a Trojan pack, I'll be back\nDouble team, tag team\nYour wife want me and Jack dude, see dude, we come rude\nLeave the room smellin like seafood\n\n(Kool Keith)\nTowels in Bath and Beyond\nMy Aunt Jemimah pancake syrup is all gone\nFor the crushed cherry\nI get off when your hotbox is super wet, trimmed and a little hairier\nNo restaurants, stores are closed\nSuffocate me like Nelly said take off ALL YO' CLOTHES\nUnder the hood mechanics I check the engine when they sit on my nose\nWith the leather mask, I'm professional, starin' at thongs\nDark shades I see through them dresses real fast\nNew outfits make you dance under my strobelight and pay me cash\nGirls with the Escalades, pullin out them mall applications\nConceited with the perfect ass\n30 miles, the camera's ready put on your booty shorts\nYou need gas\n\n(Unknown - or Kool Keith in a different voice)\nLadies in the mirror, starin' at the butt it's gettin' big\nTrust I freak, hop in the rig\nYou sport the high heels with the red wig\nSexually I bet you be chargin up a dollar to holler\nA dog stuck in the booty, your face mad Rudy\nMr. Goonie with looney\nYou know you get down with Reggie, it's our duty\nI'll come down to sound\n\n", "album": {"title": "The_Lost_Masters_(2003)&&784", "genre": "Hip Hop", "year": 2003}}, {"title": "I'm A Tell-U", "href": "I%27m_A_Tell-U&&7495", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "People! You're stuck in nineteen seventy-four\nWitcha boring producers\nYour videos are boring, same girls singin'\nEverybody tryin' to be George Clinto and Jimi Hendrix wannabes\nI'm beyong that average cha cha, that trendy Southside music\nPeople don't hate, just motivate\n\nYou spent twenty years rappin' about diamonds and Dom P\nMoet and bubbly, while you front your wife and girlfriend hug me\nStudio gangsters lamp at Fort Lee\nWith transexuals tryin' to hide in secret spots in New Jersey\nCats pose in leased double-R's with two-way pagers\nFrontin like you like women I seen you on your Motorola\nTypin the best places to meet up with Richard Simmons and Jack Lemmon\nWhen you in Cali you hide in the Valley\nRentin the Sheraton suites\nCallin young boys that look like Johnny Versace\nTo meet you at Miami Beach\nYou wear black all the time, you look wack all the time\nGot the nerve to try to pose with a girl, then spit a hard rhyme\nLike you run the streets with thugs\nAnd move with brothers who do mad crime\n\nI'm a tell you how I feel\nI'm a tell you how I feel\nI'm a tell you how I feel\nI'm a tell you how I feel\n\nTake you out simple add a dim effect to your spotlight\nYou think you hot right\nSurround the tables got you kissin' your bodyguards, holdin' Cris'\nThe last time I heard a guy called you a dude\nWith a FUBU jacket said \"excuse you miss\"\nWith his hair like Lil' Kim, contact lenses\nDapper Dan gear with ice on his wrist\nYour hype man walk with a twist\nJust like the girls, you want a man that's rich\nYou want a guy to say come here BIZZITCH\nYo, you like the way celebrities fondle you and touch\nYou wanna look onstage and stare at the crotch\nI know a type of guy like you that try like you\nWear lipstick and cry like you\n\nI'm a tell you how I feel\nI'm a tell you how I feel\nI'm a tell you how I feel\nI'm a tell you how I feel\n\nTrendy guy like you with your man watchin Hendrix\nLook at the way your corny album was mixed\nThat feminine stuff y'all put out was marketing tricks\nClones with costumes step out of my dressin room\nDuplicators break down the reel\nYour DJ funny style that makes it a trio\nI don't care if you got a budget and per diem\nI saw you jockin Marilyn Manson in the Niko\nYour sound is outdated you network with a lot of people\n\nI'm a tell you how I feel\nI'm a tell you how I feel\nI'm a tell you how I feel\nI'm a tell you how I feel\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}, {"title": "I Don't Believe You", "href": "I_Don%27t_Believe_You&&6698", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Yo, you're lying\nHe's lying... and she's lying\nMy man over there he's lying\nYou know what? You're building up a bunch of lies\nStraight lies\n\nYou got mad guns? I DON'T BELIEVE YOU\nYou got eleven cars? I DON'T BELIEVE YOU\nYou got the block scared? I DON'T BELIEVE YOU\nYouse a bugged thug? I DON'T BELIEVE YOU\nYou doin' jail time? I DON'T BELIEVE YOU\nYou got the newest Benz? I DON'T BELIEVE YOU\nYou got the girls ready? I DON'T BELIEVE YOU\nYou movin big weight? I DON'T BELIEVE YOU\nYou cook in steel pots? I DON'T BELIEVE YOU\nYou goin' on Soul Train? I DON'T BELIEVE YOU\nYou cashin royalties? I DON'T BELIEVE YOU\nYou did a video? I DON'T BELIEVE YOU\nYou smackin everybody? I DON'T BELIEVE YOU\nYou closin all deals? I DON'T BELIEVE YOU\nYou say you manage people? I DON'T BELIEVE YOU\nYouse a movie star? I DON'T BELIEVE YOU\nYou work with Warner Brothers? I DON'T BELIEVE YOU\nYou down with Jamie Foxx? I DON'T BELIEVE YOU\nYouse a druglord? I DON'T BELIEVE YOU\nYou pay your mortgage? I DON'T BELIEVE YOU\nYou datin fine chicks? I DON'T BELIEVE YOU\nYou travel solo kid? I DON'T BELIEVE YOU\nYou smackin anybody? I DON'T BELIEVE YOU\nYou got your own label? I DON'T BELIEVE YOU\nYou say you never lease? I DON'T BELIEVE YOU\nYou say your record's hot? I DON'T BELIEVE YOU\nYou workin hard lady? I DON'T BELIEVE YOU\nYou like to clock work? I DON'T BELIEVE YOU\nYou at your brother's house? I DON'T BELIEVE YOU\nYou tour with Babyface? I DON'T BELIEVE YOU\nYou mix on Ni boards? I DON'T BELIEVE YOU\nYou talk to Aaron Hall? I DON'T BELIEVE YOU\nYou play for the Charlotte Hornets? I DON'T BELIEVE YOU\nYou buyin a Rolls Royce? I DON'T BELIEVE YOU\nYou got signin power? I DON'T BELIEVE YOU\nYou makin' hit records? I DON'T BELIEVE YOU\nYou say Shaq's your cousin? I DON'T BELIEVE YOU\nYou sellin Knicks tickets? I DON'T BELIEVE YOU\nYou givin' afterparties? I DON'T BELIEVE YOU\nYou at the Superbowl? I DON'T BELIEVE YOU\nYou bought a mansion? I DON'T BELIEVE YOU\nYou think you hype rappin'? I DON'T BELIEVE YOU\nYou say you are the man? I DON'T BELIEVE YOU\nYour mother thinks she's fly? I DON'T BELIEVE YOU\nYou say your pops is cool? I DON'T BELIEVE YOU\nYou got your aunt a diamond? I DON'T BELIEVE YOU\nYou got the kids a gift? I DON'T BELIEVE YOU\nYou movin out to Cali? I DON'T BELIEVE YOU\nYou say you doin' jacks? I DON'T BELIEVE YOU\nYou makin' millions kid? I DON'T BELIEVE YOU\nYou say you sellin furniture? I DON'T BELIEVE YOU\nYou work construction? I DON'T BELIEVE YOU\nYou got your hair done? I DON'T BELIEVE YOU\nYou mess with Lauryn Hill? I DON'T BELIEVE YOU\nYou danced with James Brown? I DON'T BELIEVE YOU\nYou own a Dodge truck? I DON'T BELIEVE YOU\nYou work at 7/11? ...\n\n", "album": {"title": "Matthew_(2000)&&391", "genre": "Hip Hop", "year": 2000}}, {"title": "Eldaradoe's", "href": "Eldaradoe%27s&&6906", "artist": {"unique_name": "Kool_Keith"}, "lyrics": "Two-thousand-two, worldwide! Everywhere...\nInternational...\n\nYeah, I used to come on the block, and many girls would jock\nTrojans and rubbers on dashboards, and lips that get hot\nDangle, brother sippin E&amp;J tango\nSuckers how you flex too, standin right next to\nFreaks takin' X too, nah nah nah\nBlast speakers in your car, roll down the street with Big Pete\nWith heat, four double-R's compete\nTracks behind you bass backin you, all girls down for you\nSuckers get clowned for you, I drop pounds for you\nSound for you, rock'n'roll around for you\n\nCadillac El Dorado's, pushin models\nBald head shine, leather jacket like Rollo's\nCadillac El Dorado's, pushin models\nBald head shine, leather jacket like Rollo's\nCadillac El Dorado's, pushin models\nBald head shine, leather jacket like Rollo's\nCadillac El Dorado's, pushin models\nBald head shine, leather jacket like Rollo's\n\nWalk through the door, Maury shoes on the floor\nAlligators for players, droppin' lines for sayers\nBrothers only see favors, transportin the fort\nThe biggest case in the court, counter-actin' butt-smackin\nGame plans you kinda lackin with Stetson hats, combats\nWe went with baseball bats, walk in studio with tapes and DATs\nLeave you standin on doormats, next to cats and dead rats\nTecs make you jump like acrobats\nAlphabetical order, A to Z clientele 3-D\nYou can't see me smokin' beadies sippin Riunite on ice\nI'm nice, that's right kid pay the price\nPay the price...\n\nCadillac El Dorado's, pushin models\nBald head shine, leather jacket like Rollo's\nCadillac El Dorado's, pushin models\nBald head shine, leather jacket like Rollo's\nCadillac El Dorado's, pushin models\nBald head shine, leather jacket like Rollo's\nCadillac El Dorado's, pushin models\nBald head shine, leather jacket like Rollo's\n\nLeather jacket like Rollo's\n\n", "album": {"title": "Spankmaster_(2001)&&9786", "genre": "Hip Hop", "year": 2001}}]