[{"title": "Home Sweet Home", "href": "Home_Sweet_Home&&5338", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "(Kool G. Rap)\nBrothers on the corner sellin junk\nGot held up by the hotties got the shotties in the trunk\nYou got the hardrocks wavin glocks at the punks\nPolice only harass you when they wanna get a chunk\nThey got so many corners and they got so many spots\nAnd I can't even bump up the block\nWithout the, \"Yo man, what you got?\"\nI'm walkin' past somebody lookin' strange\nHe's lookin' for a hit for veins\nOr he'll blow out somebody's brains\nEven the shorties livin' naughty lives\nWalkin' around, even drive around, with big forty-fives\nI just found out the candy store's a front\nThey walk in the candy store\nMan G, candy's far from what they want\nYou might see a pickle or a popsicle\nBut if you step to the back, you get dimes, twenties, and nickels\nHoney used to look like a winner\nNow she can't even get took to dinner\nCause so many dealers ran up in her\nSomebody's blood is on the tar\nLast night was a homicide from a fight inside the bar\nLoudmouth tryin' to show her ass, but somebody\nBroke a whiskey bottle and cut her butt up with the glass\nMoney got robbed for his bank\nThey broke in his house and took everything\nExcept the kitchen sink\nLittle man murdered on the scene\nHe tried to come off at the liquor store, he's only 17\nGranny's damn near pushin 80\nA couple of hoods grabbed her pocketbook, and stabbed up the lady\nCover your head, 'cause it's a dead zone, in the red zone\nYeah, this is my home sweet home\n\nThree card molly, another man to fool\nWhites will stop at the red lights, to look at us like animals\nI'm gettin' frisked by the cops\nThey only tryin' to get props, for blowin' off a black man's top\nUp in apartment 3G, this sweetie named DiDi wants to see me\nBut yo I heard she's givin' VD\nJust when you think the skies are gettin' blue\nBang bang -- another brother's split in two\nCan't sleep, cause the streets are filled with danger\nMiss, your little daughter's a swinger, you can't change her\nShe left with a stranger, inside a drug dealer's party\nNow off to the morgue, to go indentify her body\nSonny boy is goin' on the strip\nRobbin niggaz cracks, with a mac, without a clip\nSomebody gave a tip, so the next time he flipped\nAnd shorty got ragged, another bodybag is zipped\nA baby is born and needs lovin'\nBut instead, the mother smothered him and shoved him in a oven\nCops killin' our kids, but they bill us\nSo what's more worse, the killer cops or the Cop Killers\nEveryday's another risk\nI'm even mad to go to my pad, the hallways always smell like piss\nNo heat, just pots of hot water\nI'm walkin' eight flights up, the elevator's out of order\nMan that landlord is the lowest\nBecause I let my door slam and saw a damn eviction notice\nI felt like breakin all his bones, pssssh\nI'm gettin' kicked out of my home sweet home\n\n*Door shuts*\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "Letters", "href": "Letters&&7026", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "\"What are you going to do?\" (2X)\n\"Nigga!\"\n\"The K the double-O the L the G-R-A-P letters\"\n\"My mic sound nice, check one\"\n\"The K the double-O the L the G-R-A-P letters\"\n\"Sound nice\" (cut and scratched)\n\n(Kool G. Rap)\nRougher than Gotti, in tone\nGot a body harder than Flintstone\nYour girl got her skins boned\nI'm diggin her down with my skintone\nIt's Brown-er than Bobby cause humpin is my hobby\nDown in the end zone, with mens, that made her friends moan\nListen and learn and turn on your tuners if he looney\n? ? I break, bang zoom, like Honeymooners\nI don't want singers, but finger snappers, speaker slappers\nThe wickeder rapper the dapper rapper's when I flap my trapper\nGot that ass gassed by Amoco, you know you ain't man to go\nDead up, head up, so I set up to slam a hoe\nI don't give a heck, but I don't peck on a redneck\nYou wanna pull cards, you're a dead deck, bed check\nLead my from tec, come and step up and get your head red\nWait a sec, you comin' to see what's left?\nI gotta catch my breath, rappers slayed\nOr played like Jeff to the left\nAnd none of you nitwits can get with this hit shit\nYou dipstics, even Miss kiss, but no lipstick\nI don't run a style but a mile to bust a child\nBig ol snappy happy rappers smile like Gomer Pyle\nHell, I'm ringin' bells with a ding-dong\nI play you like ping-pong\nYou swingin' on my ding-a-long King Kong\nI pop bad cops, I got a pig a day habit\nBing bing BANG, just like the ricochet rapid\nGrab it, your sound is just like a lady baby, maybe\nYou're old as Grady, still in the 80's, metaphors born in Haiti\nI pop to the top, now the hip-hop glock pop rocks\nWhenever it drops, I run over rappers at the record shop\nYou name your best I'll say, who, like owls\nPass me a towel, and I'ma move my bowels all over his vowels\nBring ten men, then I'll send my venom in em\nYou ain't gonna win 'em 'cause he got a women's momentum\nAnd I don't wanna hear from this queer\nCause one of these niggaz just doesn't belong here\nMy rhymes are like the nine millimeter Beretta\nCause anything rappers could do yo I could do it better\n\n\"The K the double-O the L the G-R-A-P letters\"\n\"My mic sound nice, check two\"\n\"The K the double-O the L the G-R-A-P letters\"\n\"Sound nice\" (cut and scratched)\n\nYou no-frill slow toy, cheap thrills, no joy\nMy lyrical skills give me Pillsbury Doughboy\nBack, I'm packin 'em up like Jack the Ripper\nSome pally'll I'm pullin the zipper\nFinger popped, the better the batter or flipper\nYou're out of date, you must be the Late Show, I hate those\nPuttin' on the brakes slow, uh-oh, better get Maaco\nDead-on, head-on collision, bad decision\nYou wanna see me nigga you better check your vision\nIt ain't 20/20 money silly bunny your funny\nYour ass'll get smashed just like a crash test dummy\nRetire, an MC that Oscar Meyer could take\nSome of you wacky rappers just play anyway\nThat's B-O-L-O-G-N-A\nSo come and swing wild, mild child, and get your style hurt\nHEY HEY HEY! Should I say it's Fatter than Albert\nPlay at your own risk, if you diss, got a lotta hot groups\nTurnin' cold, better go and sip on some Swiss Miss\nInner city, actin' like bitties, you're pussy\nSo here kitty kitty, come get some milk from my hoe's titties\nCross at the green not in between or get hit G\nRed light, green light, one two three\nOut for the dash, but in the flash, you shoulda let me pass\n'Fore crash, now that ass is in a bodycast\nEverytime I put out my records and tapes\nMotherfuckers go bananas like this was Planet of the Apes\nGrapes I bust 'em like cherries and lay down, bitches purchase tickets\nTo ride the dick and sit down it like a Greyhound\nDown with the clowns actin' like killers, as good as wooden soldiers\nSee niggaz, you ain't even Magilla Guerillas\nBass in your face, stingin like mace\nI'm bringin' the right taste, hangin' like waist\nPick up the pace\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "Fuck U Man", "href": "Fuck_U_Man&&7206", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "(Chorus from \"Talk Like Sex\" begins) (\"Can ya dig it honey...?\")\n\nSince I made the record \"Talk Like Sex,\"\nBitches are comin' up with their friends for a nigga to hit the skins.\nHopin' the Kool G Rap was just makin' rhymes,\nBut I'm leavin' bitches' vaginas with more stitches than Frankenstein.\nSome even had the nerve to try to give me head,\nAnd swallow the whole jimmy to make a nigga fed.\nBut come on you bitches, don't make me laugh;\nYou couldn't deep throat G Rap if you was a motherfuckin' giraffe.\nDag, some even fled when they saw the head,\n'Cause G's dick would make you seasick fuckin' me in a waterbed.\nDon't try to paly me like no sucker,\n'Cause these bitches'll be callin' up Dial-a-Mattress like a motherfucker.\nYou heard the song before; you don't wanna see me,\n\"I'll fuck you on the A-train while I write graffiti.\"\nI'll even fuck you in a taxi cab,\nAnd after sex with a nigga you'll be buyin' a box of maxi-pads.\nSoon as you open your legs,\nNo need for no birth control, bitch, 'cause my dick is touchin' the eggs.\nKool G Rap, the pussy slammer;\nHell, I'd be talkin' fucked up grammar if you was Bad Mamma Jamma.\nI ain't small, I'll have you cummin' like waterfalls,\nAnd then turn them sugar walls into Carnegie Hall.\nLeavin' my mark on bitches like Zorro,\nPlus fuckin' bitches so def like there won't be no pussy left tomorrow.\nHittin' hoes like it ain't funny,\nI think about bowls of Cheerios because I want my nuts and honey.\nTalkin' to all the women that look fine,\nPretendin' my prick was Moby Dick and have a whale of a time.\nNow I'm not a deep-sea diver,\nBut I love it when my dick's covered and smothered with saliva.\nShit, might even straighten out your dentures,\nBecause it's not just a blow job, honey, it's an adventure.\nBut 69, and I ain't with that:\nI'll go to a Chinese restaurant, bitch, if I wanna eat cats.\nBecause you gotta be brave to eat the tuna, G.\nSo when it comes to pussy-lickin', I'm the chicken of the sea.\nI should be on the sex channel;\nNot a chump 'cause I'm givin' punk-bitches better humps than camels.\nIf you're a virgin, I'll make it fit,\nBecause my dick'll pop the cherry and spit out the fuckin' pit.\nAnd if you're concerned, my sperm don't burn,\nAnd if it did, I'd give that nappy-headed ass a fuckin' perm.\nShucks, I instruct a fuckin' lesson.\nYou think it's painless? I hit the anus and fuck up your large intestines.\nLeavin' you bitches stingin' from the bangin';\nMy man Jimmy got a hole in his head, but yo, that nigga's still hangin'.\nBitch, you'd rather hump a fuckin' whole army,\n'Cause even the Witness Protection Program couldn't hide this man's salami.\nYou fuck around and catch a seizure,\nBefore I fuck a hoe I gots ta put the hooker under anesthesia.\nLettin' saliva dribble on your nipple,\nOrgasms double and triple sit ripple and turn your ass into a gripple.\nThen I see you searchin' for the swellin',\n'Cause I'm-a leave a hole so big your gynecologist might fall the hell in.\nGot damn! I hit the ham right;\nHoneybuns, you can ask my Three Sons, I got the Dick right out the Van Dyke.\nI'm fuckin' naked girls with fly rhymes,\nBut don't push me, because that pussy will be runnin' for it's nine lives.\nI know you hookers can't refuse this,\nBut don't pick me to give no hickeys 'cause I'm givin' bitches bruises.\nYeah, I'll tear that pussy hole apart,\nFor fuckin' with G Rap after dark, you'd rather jog in Central Park.\nSo if you want kids before I fuck ya,\nLook at the size of my dick, and you'll let out the motherfuckers.\nShit, bitches get open like a can;\nJust leave it up to G Rap, 'cause I'm the neighborhood Fuck you Man...\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "Two To The Head", "href": "Two_To_The_Head&&330", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "(Scarface laughing in background)\n\"Ladies and gentlemen...\nLadies and gentlemen... let's get together\nAnd give a great big round of applause to\nTo a new group...\" (Scarface laughing so loud sample is obscured)\n\nAh shit\nScarface is on the mix\nSo yo, suck a nigga dick\nOr make a nigga rich, or somethin', BITCH\n\nSee I come from the place known as the South Park Zone\nTalkin' shit ain't into clickin take your punk ass home\n'Cause I'm the type of nigga that'll chuck\nHit you in the chest with a motherfuckin tec and watch you jump\nSo die motherfuckers die motherfuckers die\nLook deep into the eyes of a killer smokin', fry\nOne nigga you can't fuck wit\n'Cause I'm a born killer with the mind of a lunatic\nSo bring in bodybags when I start bangin'\n'Cause I'm leavin' motherfuckers laid out, with they brains hangin'\nStraight gettin' down for mine\nAnd I'll fuck up a bitch, 'cause I don't mind dyin'\nSo feel me drill me, put a bullet in my head, but yo\nYou can't kill me, 'cause I'm already dead\nScarface goin' psycho, yeah\nPlay pussy get fucked and take two to your head\n\n(Bushwick Bill)\nI'm Bushwick Bill, but call me Chuckie\n5th Ward hard bitch, play hero and buck me\n'Cause I'm known to pull your skull out\nGrip a motherfucker by his neck and gouge his fuckin' eyes out\nI'm insane by a longshot, hey\nChuckwick Bill, a.k.a. Charles Libre\nA short nigga with some lonnnnng nuts\nDrop you dead in your bed now I'm ready for a long fuck\nNecromance that ass for a minute\nAnd split that motherfuckin click when I'm finished\nYou punk bitches be retreatin\nFreddy and Jason runnin' home with their mouths bleedin\nSo welcome to the Slaughterhouse trance\n5th Ward Texas Chuckie's Concentration Camp\nYou punk motherfuckers fled\nAnd those who didn't make it got two to the fuckin' head\n\n(Ice Cube)\nBuck him down, buck him down, come again\nTwo to the chin, Ice Cube'll blast they ass till the end\nWith my pistol, runnin' from Da Lench Mob\nIs How You Survive in South Central\nKick the instrumental, run and get your bigger crew\n'Cause it's Judgment Day, and Ice Cube is Terminigga 2\nPow pow buck buck pow buck\nYour name is Stucky Mack, now you realize that you're fucked\nTwo to the brain I leave a migraine\nHave you coolin like a vegetable, but you're not edible\nIt's the incredible, buck your ass from head to toe\nAudi 5000, don't wait for the Feds to show\n'Cause they'll have me go up up the river\nWhere the white boys'll try to make a nigga\nWalk, walk the plank, got the shank, hide the tape\nAround the handle, gotta let 'em know what I stand for\nIn the chow line, now is the time\nSee the trustee, walk up from behind\nReal quick shank shank, leave his ass red\nMotherfucker dead, from two to the head\n\n(Kool G Rap)\nSee where I come from the crime rate only rises\nThe murderers disguise in all ages shapes and sizes\nBitches picked up and dicked up, niggaz they gettin' stuck up\nGive up what you got, or get your ass shut the fuck up\nRun 'em down and gun 'em down yeah that's how we do it\nNiggaz get killed, and then filled with embalmin fluid\nStep to the niggaz that I'm checkin'\nPull out the tec and I reckon you'll get murdered in a second\nBang with the nine, boom with the pow\nMotherfuckers are fallin' and crawlin on the ground\nSnitches get stitches, bitches that act snotty\nInside the parties even the hotties get turned to bodies\nNow I heard, they got other places that's similar\nBut I represent, New York you fuck around I'm killin' ya\nA whole block of cops patrollin when I'm rollin'\nAnd if my pockets are swollen you know somebody sick I've stolen\nYeah you niggaz get ripped, when my clip, goes in the\nS-M-I-T-H W-E-Double-S-O-N\nOr the reliable revolver\nAnd like I said before, it's the motherfuckin problem solver\nSo bring it on nigga, get brave\nIt's plenty motherfuckers gettin' sent to early graves\n'Cause when a nigga gets fed\nThen all you motherfuckers get two to the fuckin' head\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "Crime Pays", "href": "Crime_Pays&&2664", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "The umm, security we have here today\nNot the OPEN security\nThe ones, that that really sittin' there\nAnd really think, we don't know who they are!\n\n\"Now that's funky\" (4X)\n\n(Kool G. Rap)\nCrime don't pay, that's what they tell us\nBut that's because the other motherfuckers gettin' jealous\nBut I'ma tell you this, they neighborhood got the Goodfellas\nBut they come arrest us for the same shit they sell us\n'Cause they don't want to see a young black nigga rollin'\nInside a nice car, nice kit, without the shit bein stolen\nSo they come and lock a nigga up\nMeanwhile some corrupt, politician nigga is makin' bigger bucks\nNiggaz gettin' blamed for the crystals; but we don't grow\nThe motherfuckin coke or weed or make the fuckin' pistols\nNiggaz ain't tryin' to live in poverty\nAnd a black man's lottery's a motherfuckin robbery\nSo yo you gotta make your best\nMake a small investment and then put it to the test (\"I know!\")\nYes, cause the other motherfuckers gettin' over\nPolice don't look at a WHITE MAN strange drivin' a Range Rover\nCarrying shit like it's minerals\nThe big dollar white dollar suit and tie criminals\nEven the government figures\nSellin shit to the motherfuckin Columbians and rich niggaz\nCrime isn't time from the brothers\nHey you say it don't pay, it's payin' white motherfuckers\nIt all depends on how you do your shit\nCause either learn it quick intelligent and that's it\n(\"I beg your pardon?\") You're well fittin\nFUCK workin for a bastard\nI gotta see that money before my ass sees a casket\nGet paid, motherfuck a raise\nCause to all them improper crooked coppers, crime pays\n\n\"Jack you motherfuckers\" (2X)\n\"Wake up and go for what you know..\"\n\"Everybody's got to make a living\"\n\"Boy I'm trying to make me some... MONEY!\"\n\n(Kool G. Rap)\nStop, nigga stop, nigga freeze\nBut at the same time, some old rich fuck, is drivin' by with twenty ki's\nBecause they came up with a law\nTo keep the rich motherfuckers rich and the poor motherfuckers poor\nWe take the cake you get the crumbs\nStackin up a package of cracks, to sell to blacks in the slums\nGuns are bein sold over the counter\nAnd you wonder why your daughter's head was slaughtered when they found her\nWhy did he have to shoot the bitch\nBut the bitch I mean the witch just had to switch\nTo make the nigga Richie Rich\nYeah, so I'm throwin' you the phrase\nBelieve me when I tell you motherfuckin crime pays\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "Live and Let Die", "href": "Live_And_Let_Die&&9958", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "\"Late last night, two undercover police officers\nWere found, brutally murdered in a Fort Greene\nApartment building in Brooklyn, New York.\nAt this time, police have no suspects.\nNow to the weather, but first...\nG tell 'em what time it is!\"\n\n(Kool G. Rap)\nI got a chance to get some money so I'm takin' it\nNo joke, because this bein broke shit just ain't makin' it\n'Cause I grew up in the fast line\nSee my pops ran the numbers and my moms held the blackjack games\nNow I'm able to leave the cradle\nI don't remember the dinners, only the kilos on my kitchen table\nSittin' right beside a pistol\nAnd I'm watchin my pops, pick up bricks made out of crystal\nWhile he was countin' the green\nI seen nothin' but strainers, containers, scales and rocks on a triple beam\nPeople was too afraid to stick him up\nBecause he had the most notorious brothers to come and pick him up\nWhen I reached ten years old\nI never recalled seein any more money and drugs in the household\nCause now pops was on his feet\nAnd to keep us from gettin' hurt he kept his dirt in the street\nAnd if he tried to attack, your family's wearin black\nBecause he just got your death, put on a contract\nAnother sucker to rub\nEven my mother's walkin' around packin a .357 snub\nAnd many cops dropped dead\nI seen a man pull out a pistol and blow off an undercover's head\n'Cause it's hard to get by\nAnd that's why, when you're young in the streets\nYou gotta live and let die\n\nSome say this ain't the life to choose\nRage is snapped away you get a page in the Daily News\nBut I just wanna get paid off\n'Cause if I was workin a regular nine to five I'd get laid off\nSome people say, sellin weight, is a death date\nBut I can't wait, to set up shop, in the next state\nI ain't worried 'bout a brother tryin' to take mines\nCause my plot comes with a hundred shot nine\nPolice are right on my heels\nBut I'm always one step ahead of the punks makin' dope deals\nThey can't stop me 'cause I'm proper\nAnd if they ever try to raid they better bring choppers or helicopters\nI broke a lot of punks ribs\nDumpin they bodies in lots, then I ran and shot up the cribs\nBecause a brother ain't fakin it\nIf there's a record for killin' the most niggaz then yo I'm breakin it\nI wish a brother would flex\nI spray him up and then take all of his money and give his girl sex\nThat's how I'm livin' in the street\nYou either give a sucker two in the head, or you'll be dead meat\nI'm sendin punks six feet deep\nAnd gettin' money in lumps, cause this ain't Twenty-One Jump Street\nYou wanna stop what I supply\nAiyyo, the hell with that, I gotta live and let die\n\nPolice, police! Everybody down, everybody down!\nDon't fucking move, get down! *beep beep*\nHey, where is everybody? *Beep Beep*\nLook, there's nobody here *BEEP BEEP BEEP*\nWhat's that fucking noise? *BEEP BEEP BEEP!*\nIt's a bomb, it's a bomb, let's go\nGet the fuck out of here! *flatline sound*\n\nYou gotta live and let die *explosion*\nForget all that bullshit about savin' the soul\nSome chump'll pump your ass full of bulletholes\nSo I'm out to make a killin'\nAnd all you suckers are chillin' 'cause I ain't just an ordinary villain\nI got a rep for mass murder\nIf you look bigger, I just pull the trigger, a female I just hurt her\nI got the .38 long\nBut a dame can get the same if she's comin' out of her mouth wrong\nAnd if you try to oppose this\nNext time you see your mother she'll be covered with roses\nIt ain't about a fair fight\nBecause I only get open for smokin' suckers in daylight\nAnother punk bites the dust\n'Cause I just bust blood out your butt like pus\nThe broke life I ain't missin'\nBecause now I got a lot, and that's more than a pot to piss in\nAnd if I'm sellin you ki's\nJust put the G's on the bed, and then go head and take a freeze\nAnd while you're numbin your tongue with the yum yum\nI pull out a gun, 'cause I want every last crumb\nI put a slug in your face\nThen I waits to start packin the trap back in the suitcase\nAnother punk had to fry\nI don't want to do it but yo I gotta live and let die\n\n\"Earlier this morning, five cops were killed\nAnd six were wounded in a raid gone bad.\nPolice have no leads. For any information,\nPlease call, 1-800-Stool-Pigeon.\nNow back to you Rob.\"\n\n\"A forty-nine year old unidentified male\nWent berzerk last night, openly firing\nWith a twelve gauge shotgun in a crowded\nDowntown restaurant. 14 people are dead\nIncluding three children and four others\nSuffered serious injuries. Police have\nA suspect in custody but are not releasing\nAny information until they complete their\nInvestigation..\"\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "Nuff Said", "href": "Nuff_Said&&6204", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "(Kool G. Rap)\nHere's the motherfuckin magnificent\nI'll even bag innocent motherfuckers\nSee suckers like there was ten I sent\nSo if you come in my way - great, I pull out the trey - eight\nKool G. Rap's your fate, and not your playmate\nSo all you niggaz on the floor, bitchin that shit is dead\nTell it to the motherfuckin mortician\nSo get ready to let the led out, I'm knockin' niggaz dead out\nAnd blowin' the back of your fuckin' head out\nCookin niggaz better than mama's dinner\nSo let the drama enter, I'm sendin niggaz to the trauma center\nBecause I'm rollin' with force, tearin niggaz out the frame\nLike they was pictures of a bitch that I divorced\nBoss, so come on nigga, get wild and loose\nI whoop your motherfuckin ass and get arrested for child abuse\nEven your bitch can get it nigga\nI shove the barrel of a nine up her behind\nAnd pull the fuckin' trigger\nGoin' Psycho like Norman Bates, G. you better sedate\nBecause lately niggaz ain't able to take me\nIt ain't a man in the land that can stand G. Rap\nSave that candy-rap, shit for the handicapped\nNiggaz'll get slayed like a bunch of play pirates\nFuckin' with me, y'alld rather fuck with the AIDS virus\n'Cause I set 'em up wet 'em up like sprinkles\nAnd put niggaz to sleep longer than Rip Van Winkle\nThe quicker the shit, the quicker the hit, I'm peakin a fit\nLeavin' niggaz sicker than Liberace's dick\nGood luck, another hood bucked\nI kick you so far up your ass I get my motherfuckin foot stuck\nSee I manage to give niggaz more than a bandage\nBlue Cross and Blue Shield, couldn't cover the motherfuckin damage\n'Cause I'm bold and bigger, puttin' manholes in niggaz\nAnd holdin' triggers up, to them golddiggers\nSo if you all over my dick just like a rubber\nMy rap is so fat, I make ? and ? ? blubber\nYou better duck, I'm like a volcano when I erupt\nYou bitch-ass rappers'll get fucked\nAnd you'll be one hoe, like Marilyn Monroe\nLeft on death row, because I let the gun go\nBang blow your motherfuckin brains out\nBut you need more than detergent to get that motherfuckin stain out\n'Cause I serve more crabs than Red Lobster's\nWhen I pop shots, I leave lotsa dead mobsters\nPut down the microphone whether unknown or famous\nYou're out of luck and I don't give a FUCK what your name is\nBoy you better split, 'cause I'ma house shit\nMy dick'll be rich if you niggaz\nWants to put your money where your mouth is\nGassed up ass nigga, come set it\n'Cause when I pick up the gun, that be the end of the unleaded\nNow you could be a gold or a platinum artist\nBut deep down, you fuckin' silly clowns know who's the hardest\nNiggaz I watered down with the quarter pound\nCause my slaughter sound can be caught around\nAnd found the slaughter town\nFor the clowns got eighty rounds worth of ammo\nPlay it again Sam, put on my jams, fuck a piano\nI'm leavin' lame niggaz brain dead\nAww fuck it, nuff said\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "Ill Street Blues", "href": "Ill_Street_Blues&&9871", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "Aw yeah, word up, word to mother. Here comes G. Rap with another one y'all.\nWe going to swing it like this...\n\nI'm right in front of my front steps thinking of a plan\nLooking like Raggedy Ann, no dough in hand kicking a can\nThinking of a plot to pull some bank in\nBecause I'm dead and stinking\nSoles on my shoes winking, t-shirt is shrinking\nSoon I see some ties and my eyes open wide quick\nWho's that with you, chick? Bill Blass my sidekick\nWhat's up, black? Give his hand a smack\nUp pulls a Cadillac, yo baby we'll be back\nJumped right on inside, not too many people saw us\nThinking about who gotta get robbed because the mob got a job for us\nThe drove us down to the sober section\nOf town where the clowns don't be paying for protection\nThe want us to send a message to Jimmy the bartender\nLend a friend the money next you're ripping off his car fenders\nHe's coming up short 'cause he snorts\nCoke, dope, nope, and hope he don't get caught\nHe owes some Benjamin Franklins, every last bit of em\nBut Jimmy's pockets are empty, so now we gotta get rid of him\nBut Jimmy's wife is with him and they don't want to involve her\nHopped out the back seat they gave me a revolver\nBlass, you distract him while I go and whack him\nEntered through the back side of the bar and then attacked him\nHe's screaming for his life, reaching for his wife\nShot him in the back of the head and shanked him with a knife\nAnd that goes for anybody who's gotta pay they dues\nYou lose, 'cause I got the Ill Street Blues\n\nYou lose, 'cause I got the Ill Street Blues (repeat 4x)\n\nSuckers I clobber, because my town is full of cops and robbers\nYou're not promised tomorrow in this Little Shop of Horrors\nSo I got to get with the business of hit quick\nMoneygrip's pocket's looking thick so I stick Slick\nHold it right here, hands in the air, I know you got the loot\nOr better yet, face down on the ground, empty your pockets troop\nHit the deck I got the Tech right on your neck\nAnd I expect to make a buck to heck with a traveller's check\nBut if a vic' tries to choke me\nI'll have to smoke him like I'm Smokey the Bear, so okie dokie\nGoodbye, or bon voyage, have a good journey\nDon't even try begging for your life, that don't concern me\nSo to the next weasel that freezes\nYour begging and your pleases only getting your closer to meeting Jesus\nYeah, I shake a schmuck just to make a buck\nThen I break a duck and if the duck gotta get bucked then I don't give a fuck\nHyper as a sniper piping niggas like a plumber\nCold vicking and sticking up the ones that run the numbers\nOr even a bigger score, the lady in the liquor store\nGo inside and kick in the door, pull her then I'm stickin her for\nMoney or your life, honey hurry and choose\nYou lose, because I got the Ill Street Blues\n\nExtra extra read all about it in the papers\nThe boss tried to rape us, so we tossed him off the skyscraper\nBecause he pulled some other people to try and hit us\nGet us, but none of them did us, he must be trying to kid us\nBut that's dead, I'll thank God in the red, 'cross the bread borders\nSo nobody can short us, he fled down to headquarters\nReady to put some work in, we're not a lazy crew, we'll do a job or two\nBut yo, the man can't even stick me with some Crazy Glue\nReady to tore him even more because she saw him\nWe took out all the lookouts in the front and kicked his door in\nWhat's up snake, why'd you violate?\nBecause I'm a hossa (What's that?)\nYo, that's a pig that don't fly straight\nGetting ready to jab him, I grabbed him by the necktie\nHomie tried to get fly, and swing I gave him a decked eye\nYou know the evil that men do, hell is where the men go\nWe snatched him by his hands and feet and threw him out the window\nUp, up, and away 'cause I don't play, clown\nBuck, buck, buck, take that with you on the way down\nI'm hoping you got springs and wings on your shoes\nBut you lose, because I got the Ill Street Blues\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "Train Robbery", "href": "Train_Robbery&&2633", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "(Kool G. Rap)\nDown the subway stairs, straight through the turnstyle\nNo smile, but I'm waitin in the station for the 7 to turn it wild\nMe and my three shorties, guzzlin forties\nWe're bout to rob and steal and get real fuckin' naughty\nOne carries a three pound, the other a four-fifth\nBoth ready to buck and ain't nuttin to be fucked with\nIt's dark and it's midnight, the police in dead sight\nLook through the fuckin' tunnel and I see movin headlights\nFuck it I cock the baretta back and put my hood on\nMy shorties are game, I got the same shit they put on\nImpatiently we're waitin for the doors to open\nGot on the train we're car from car but not too far I started scopin\nStarin' at this bitch for a minute\nMy man pulled out the mag, opened the bag and said,\n\"Put all your fuckin' money in it!\"\nEven the jewelry on the hands\nHe slapped the bitch up, and she cried,\nAnd begged him not to take her wedding band\nNow everybody's in shock, and I'm walking past\nThe scared ass passengers with the nine millimeter cocked\nLookin' for who was next\nAnd sittin' by the pole was a old ass man wearin a Rolex\nI took the shit and hit the bastard hard\nRipped his pants clean off his ass and got the Visa and the MasterCard\nMy little man said, \"A-yo check this,\"\nHe pointed at this bitch who looked rich, wearin a long pearl necklace\nWord to God, she got my dick hard, and that was the truth\nSo I drug her ass inside the conductor's booth\nAs the hoe started to shout, I threw her on her knees\nAnd made her freeze and put my dick inside her pretty mouth\nAll of the sudden I just, nutted\nPulled up my pants and zipped up\nShe's on the floor with her mouth flooded\nCame back out with the iron *gun shot*\nThe next motherfucker to move, is dyin'!\nThe train came to a stop, and who gets on it\nTo ruin the whole plot, was a motherfuckin cop\nHe fired at me -- I fired back at him\nGod damn, I almost had him\nIn a flash, my little shorty's on his ass\nGot down on the ground, and let the three pound blast\nLead went dead in his chest\nTore him a new asshole, right through his bullshit vest\nBut the pig was still breathin\nI wanted to finish him off, but I said, \"Fukkit, I'm leavin\"\nGrabbed the sack hit the track and started runnin'\n\"Oh shit! More fuckin' cops comin'!\"\nSo I stopped and took a shot\nHopin the cop got popped but yo I didn't see nobody drop\nHeaded straight into the exit, and out in the street\nPolice outside like fifty deep\nSo I started to creep but I didn't sleep\nSpotted this bitch pullin up in a Jeep\nHow sweet! \"Now get the fuck out the car!\"\nSlammed the bitch down on the tar, now she needs CPR\nBut I don't give a fuck, I just jetted\nMy man said set it, two more detectives got wetted\nAs we raced down the block\nLettin off a whole lot of shots and didn't stop\nPolice gave us a chase, a blue and white rage\nMy shorty got grazed in the face\nAnother cop tried to let off, I put another clip in my shit\nAnd blew his motherfuckin head off\nStomped my foot on the gas pedal\nSparks are flyin and shit, from the bullets hittin the car metal\nSo now we just runnin'\nThe shorties and me G, one of the three gunmen\nSide by side we're on the highway, and lettin off shots\nThe three outlaws, against the cops\nIt's like a fuckin' adventure\nAbout four cops got dropped, three motherfuckers got injured\nThe last of the cop cars pressed up\nMy man aimed the joint, the hollow points tore his fuckin' vest up\nI put a slug inside the tire\nThey ran into a tall-ass wall, now it's great balls of fire\nSo now we got away clean, yeah\nSmilin' like a motherfucker countin' the green\nYou can't fuck with the kid\nMy boy started thinkin' back on the train\nBout all that shit we did\nLeavin' niggaz in poverty\nThree black motherfuckers pulled off a great train robbery\nTook all those motherfuckers ducats\nBut hey, what I can say, life is a bitch so FUCK IT\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "Go for Your Guns", "href": "Go_For_Your_Guns&&6176", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "\"Get down let's see your hands, see your hands!\nLet's see your hands, everybody, hands!\nEverybody let's see some hands! Huh?\nDon't nobody move!\nDon't get out of the car, stay where you're at\"\n\nVerse One:\n\nNiggaz in the street that I dislike\nYou better get this right\nThese days what the fuck is a fist fight\nPicture me puttin' niggaz in headlocks\nWhen I can lick off shots, and put they ass in a box\n'Cause if you steppin to me tryin' to throw a right hook\nYou're just lookin' to get your motherfuckin life took\n'Cause I can't wait to be a niggaz fate\nSo while you lift weights, I'm liftin light-ass nickel plates\nSo if you wanna misbehave nigga\nI'll have to kick it to the motherfuckin grave digger\nYeah motherfucker you heard it\nDoin' all that rope-a-dope shit, nope, your dopey-ass murdered\nNiggaz'll be the Karate Kid\nBut I'll be in prison doin' a motherfuckin body-bid\nSo you can take all that Rocky shit home\nSylvester Stallone ain't shit against Al Capone\n'Cause I ain't got no patience or energy\nFor motherfuckers and punk-ass suckers that wanna injure me\nStep up and play me like I'm soft\nBitch I don't knock motherfuckers out, I'm knockin' motherfuckers off\nLeavin' the scene like Machine Gun Kelly\nTwo to the head about four cross the belly\nSteady givin' niggaz the runs\nFuckin' clam put your fists down and go for your guns\n\n\"All right, on the ground, face down face down on the ground\nGet on the ground\nHands behind your head\"\n\n\"So, so what are you gonna do?\nBeat-beat the crap out of me?\" NO!\n\nVerse Two:\n\nYou punk-ass niggaz better hop or chill\nCause my glock can kill twenty motherfuckers with boxer skills\nThat's how I put a niggaz head out\nThe murder scene needs more than Visine to get the red out\nAnd I don't give a fuck if you know Judo\n'Cause I'ma blow your motherfuckin ass to Pluto\nAnd when I blast the trey niggaz pass away\nPut in the ground till your silly clown ass decay\nSo all you niggaz with the jokes\n(Is everybody ready?) Well dibbida-dat's all folks\nCause nigga you don't want the nine to go (boom)\nNiggaz like Tyson woulda died a long time ago\nRan outta luck when I struck on you sucker ducks\nNo uppercuts you'll be another motherfucker bucked\nGettin' all rumps in stuffed up boots\nHell no, I'm givin' motherfuckers burial suits\nYour little T.K.O was A.O.K.\nMy way is R.I.P., niggaz are D.O.A.\nDead on Arrival\nSo nigga you better come with your gun if you want survival\nFrom the Mak-11\nAnd those are real shots on the motherfuckin track 7\nI ain't kickin niggaz buns\nIf it's a bitch I'ma wetta you better go for your guns\n\n\"Yo wassup, what the fuck is up now man?\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "On the Run", "href": "On_The_Run&&9101", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "I got a job with the mob, makin' G's\nDoin' some pickups, deliveries and transportin keys\nYeah they got me like a flunkie\nI'm ridin' around with ten kilos inside my trunk G\nAnd I'm holdin' the suitcase\nWith a half a million dollars right in my motherfuckin face\nAnd I'm tryin' to ignore it\nBut sometimes I get tempted to make a motherfuckin run for it\nThe thought alone makes me shiver, damn\nWhat if I get caught? They'll find me floatin in the Hudson river\nBut if I escape, I'll be in shape for my life\nBut they might, get my kid and my wife\nSee I'm supposed to make a stop\nTo an Uptown spot, run up the block and make another drop\nBut I got somethin' else in mind\n'Cause I'm sick of puttin' my motherfuckin ass on the line\nI got the money and the hit\nWent through the Brook nonstop 'cause I ain't droppin' off shit\nThen I thought of a plan\nSo I droves to my house and got my girl and my little man\nC'mon bitch, pack the shit, get ready\n\"God damn why your face all sweaty?\"\nJust hurry up and get the shit\nI'm a dead man bitch, understand, we gotta split\nI switched the locks on the door\nStarted packin like I was goin' on a motherfuckin world tour\nGrabbed my bags and my gun\nC'mon we gotta go... I'm on the motherfuckin run\n\nNow I'm drivin' and I'm lookin' at my passport\nI'm outta here soon as my ass hit the airport\nI loaded up the automatic\nI don't believe this shit, I'm stuck in motherfuckin traffic\nI'm gettin' nervous as a fuck see\nA Lincoln Continental pullin right up beside me\nPuts down my bitch and then I bent low\n*Gunfire, breaking glass* Bullets are flying through my window\nThe enemy is on attack\nDrew the nine and cocked the hammer and I fired at the bitches back\nI gotta take my respect\nMy bullets hittin Italian motherfuckers in the neck\nLooked at my bitch a bullet struck her\nPut in another clip, 'cause I ain't givin' up a motherfucker\nNiggaz runnin' up in trenches\nSprayin at my car, only missin' me by fuckin' inches\nStepped on the gas pedal, how bad my bitch is harmed?\nShit they only hit her in the fuckin' arm\nNow I'm drivin' off sidewalks, makin' sharp turns\nMy son is catchin motherfuckin heartburns\nI got the car shakin wildly\nI made a turn, and then I dipped my shit into a dark alley\nThey drove right past, now all this chasin shit is done\nI'm on the motherfuckin run\n\nThe next thing I know, it was daylight\nAnd I been sleepin' in this motherfucker all night\nI started pullin on my hoe\n\"C'mon man what?\" Wake up bitch, we gotta go!\nPulled out the alley, then I dipped\nLooked down and picked up the nine and put more rounds in the clip\nYou know I'm headin South no doubt\nAnd I don't give a fuck where, as long it's a hideout\nFinally we crossed the border, I pulled into a station\nTo fill up the tank, and get a drink of water\nPullin over to park my ride\nThat's when I noticed this limousine comin' up on my left side\nThen the sucker started rammin me\nThen I looked, it was the Luciano family\nLooked at my bitch she started cryin, my finger on the trigger\nI pulled it -- bullets started flyin\nNow I'm hittin all them bastards\nI'm droppin' 'em fast, splashin blood out niggaz asses\nThen I'm finally done and\nI took 'em all out, but I caught one in the stomach\nNow I'm lookin' for survivors\nSo I ran up on the side of the car, and hit the driver\nAnd then I laid low\nThe only motherfucker left was Don Luciano\nSo I snuck up the sucker\nPut my gun to his head, \"Whassup now motherfucker?\"\nHe said, \"Wait, I want to talk\"\n*Five gunshots* I put his brains on the sidewalk\nAnother life I had to waste\nHe fell on his back, and then I spit right in his guinea face\nHe saw the barrel of the devil's gun\nNow I'm no longer on the motherfuckin run\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "Operation CB", "href": "Operation_CB&&9187", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "Every eleven minutes, across the USA\nA man is a victim of Cock Blocking\nThis action usually results in broken friendships\nThe following, is an example...\n\n(Kool) Aiyyo Jinx\n(Jinx) Hey whassup G?\n(Kool) This girl'll be here in a minute\n(Jinx) Uh-huh\n(Kool) The bitch got a nice ass, and I'm tryin' to get in it\n(Jinx) Cool, that's all right, but why you tellin' me this shit?\n(Kool) To make sure you don't mind\n(Jinx) Uh-huh\n(Kool) chillin' out while I hit it\n(Jinx) Naww nigga, I'll just turn on the TV set\n(Jinx) Get paid, hit the skins, get some pussy, get your dick wet\n(Kool) All right bet, because my dick is hard as hell\n*Ding dong ding dong*\n(Kool) The bitch is ringin' on my bell\n\nOpened the door, \"Whassup baby? Yo come on in\nHere, take a seat, I'll introduce you to my friend\"\nNow everything is going according to plan\n\"Yo Jinx this is Debbie, Debbie this is Jinx my man\" (Whassup baby?)\nI went to the closet, hung up her coat, put up her hat\n\"Yo Jinx,\" \"Whassup?\"\n\"Later nigga, I'm goin' to the back\" \"See ya!\"\nI took her to the back, closed the doors and I paused...\n... I'm gonna get some drawers\nSo we laid on the bed and I just smiled\nBecause I'm dreamin' about fuckin' her doggystyle\nSo I'm thinkin' bout some hits that I can slip her\n*Zipper sound* Fuck it, I'll just pull down her zipper\nFeelin' her ass, and damn the shit is soft\n\"Aiyyo baby, why don't you take your shirt and pants off?\"\nI got the whore ready to let a nigga score\n*Knocking* Yo who the FUCK is at my door?\n*Knocking* Now she's annoyed, and boy I got some luck\nI cracked the door, \"Yo Jinx, what the FUCK is up?\"\n\n\"Aiyyo G man, I just, y'know, I wanna get some water and shit\nYou know I'm kind of thirsty knahmsayin homey? Heh heh\"\n\n\"What water nigga? Go 'head, go and get it\" \"Aight\"\n\"Now leave me the fuck alone so I can hit it\" \"Aight thanks man\"\nSo then I slammed the door shut *door slams*\nI turned around this bitch is pullin her pants back on her butt\nNah chill, yo he ain't comin' back no more\nI pulled her pants back down and threw 'em on the floor *whoosh*\nI'm tryin' to convince her but the shit didn't work\nSo now I'm here playin' tug-of-war with her shirt *rips* (oops)\nYeah don't worry, that same shit won't happen twice\n*Knocking* \"Aiyyo G man, where's the ice??\"\nShit, didn't even get my jock in\n*Knocking* Cause niggaz like Jinx is Cock Blocking\n\n\"Now you know this just don't make NO kind of sense\"\n\"Blockin my cock, like a god damn ??\"\n\"And for the life of me, I didn't know why..\"\n\"Blockin my cock, like a god damn ??\"\n\n(Kool G. Rap)\nThinkin' of a bitch I could be hittin, for no salary\nSo I called Valerie, found out the bitch was babysittin\nThe baby's parents went to Europe; and I could see her now\nSuckin my dick and lickin' my nut like it was maple syrup\nShe said, \"Come over I'm alone\"\nAnd I was knockin' at the door before the bitch hung up the phone\n\"Hey whassup baby? You know I miss you\" \"Whassup?\"\nYeah that's some shit you gotta say to get your dick into the pussy tissue\nWent in the house and had a seat\nThe little boy put fifty motherfuckin toys by my feet\nSmashin up my ankles with Tonka jeeps\nI wish this little motherfucker'd take his ass to sleep\nNow my leg got crazy scratches\nI said, \"Here, you wanna play?\" I gave his ass a book of matches (Hey!)\nI couldn't even get a rap\nWithout this little motherfucker jumpin' his ass into my bitch's lap\nI started rubbin on her curves\nBut I'm mad because this little brat is gettin' on my nerves\nI pulled the bitch up by her hair \"What's the matter baby?\"\n\"Aiyyo, whydon'tcha get rid of little man?\" \"All right baby\"\nShe took me to a room that was dark \"Hey, come in here\"\nI was undressin on the way to get a head start\nAnd then I let the door shut\nLifted up her skirt and started feelin' on the whore's butt\nSuckin on her titties like candy\nFive minutes later had her comin' in her panties\nNow she's ready for the dick\n\"Yo you ready bitch?\" (mmm-hmm) \"Well first, take a lick!\"\nDown on her knees is where she dropped\nSuckin on and suckin on and suckin on my cock\nBust that nut, that's what I'm hopin\nThen yo, all of a sudden, the door flew wide open\nWhat the hell is this about? *child crying*\nShe jumped up in a flash and took my dick out of her mouth\nYeah, the little nigga's throwin' a fit\nTalkin' about he's hungry and shit\n\"Wait a minute baby, let me get up so I can feed him\"\nBut I felt like takin' off my belt and beat him\nHe already gave my leg a cut\nNow the little bastard is fuckin' up my nut\nShe, didn't even get the lead off\nSo I picked up one of his Ninja Turtle dolls and pulled the head off\n(Hey whatchu doin'?) Yeah motherfucker now we even\nForty-five minute passed, the bitch ain't back, fuckit I'm leavin'\nI got dressed, and put my hat back on my head (Hey!)\n\"Later bitch,\" \"No wait baby\"\n\"Drop dead!\" \"What??\"\n\"And by the way, thanks a lot and uh...\nFuck you and that little nigga for Cock Blockin!\"\n\n\"Now you know this just don't make NO kind of sense\"\n\"Blockin my cock, like a god damn ??\"\n\"And for the life of me, I didn't know why..\"\n\"Blockin my cock, like a god damn ??\"\n\n(Kool G. Rap)\nSo all you niggaz with the helmets and shoulderpads\nStay the FUCK away from me, word up\nThe next time you wanna block nigga\nTry out for the Jets baby, word up\nYo, that nigga Polo's Cock Blockin like a motherfucker\nThat nigga Jinx is Cock Blockin\nMy dancers are straight up roadblocks 'n' shit\nThat nigga Bill Blass has been Cock Blockin all his life\nAnd that nigga Eric B.'s Cock Blockin\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "Edge of Sanity", "href": "Edge_Of_Sanity&&1198", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "I'm on the verge of committin murder\nMy girl is gettin' on my last nerve and I don't wanna hurt her\nShe wants me to get a job\nI get harassed 'cause I'm laying on my ass like a big slob\nBut everywhere I go, I get rejected\nThey won't hire a motherfucker with a jail record\nSo the least I could do, is look presentable\nBut I'm labelled by the city as a criminal\nThey won't give me no slack Jack\nAnd I got one strike against me already because my skin is black\nSee I'm irrelevant to Help Wanted signs\nAnd they wonder why niggaz commit crimes\nMy girl pays the rent gas and light\nGoes to class at days and works at night\nI'm trying to get some money I can hand to her\nBut I ain't with bein a motherfuckin janitor\nPlus I got my little nigga\nAnd I'm tryin' my best to be the right kind of father figure\nBut my hands is startin to shake\nI'm tryin' to hold my head because I'm reachin' for the thirty-eight\nI pick it up, man fuckit\nI gotta go out and hit the street and get some ducats\nLookin' for somethin' to hit\nI throw on my hood, 'cause I'm about to do some stupid shit\nI step in the Seven-Eleven\nCome fast with the cash or get your ass sent to heaven\nHe must hit the alarm, 'cause I'm perspirin\nCause now I'm hearin motherfuckin sirens\nI tried to run out, three thousand decent\nNext thing I know, I'm sittin' in a fuckin' precinct\nFor tryin' to feed a family\nI need rubber balls, 'cause I'm fallin' off the edge of sanity\n\nEdge of Sanity (2X)\n\nWhat a fucked up night\nAnd I'm mad because the cop put on the handcuffs too fuckin' tight\nCentral Bookin is where they sent me\nSo they could take a couple of pictures after they fingerprint me\nThen they put me in a cell\nAnd it was all full of niggaz that was dirty and stinkin as hell\nFour hours passed already, so now I'm yawnin\nAnd I'm hopin to see the judge in the mornin\nFinally they call my name and I get up with speed\nTo appear before the judge, and make a plead\nI saw the judge, he was a brother\nHe said, \"How do you plead?\" I said, \"Not guilty, motherfucker!\"\nThen I got kicked out of court, sent to the Island\nWhere they got all of these young brothers wildin\nAnd all I seen was teenagers\nAnd brothers just slicin one another with straight razors\nI saw this nigga, he was stone tall\nI said, \"Yo, I gotta make this motherfuckin phone call\"\nHe said, \"These whores are mine, and you ain't widdit\"\nAnd put his face all up in mine, so I hit it\nC.O.'s came, niggaz started to zing\nNow I gotta do about three days in the bank\nI did my time and now I'm back from my vacation\nRight on track, they put me back in populations\nI got dressed, and hit the mess hall\nThen when I came back, FINALLY I got to make my phone call\nMy girl is bringin' out the man in me\n'Cause she's yellin' and shit, while I'm hangin' on the edge of sanity\n\nEdge of Sanity (4X)\n\nI'm sittin' Up North, and doin' three to nine\nAnd it feels like my whole life is bein left behind\nI'm goin' crazy in this place\nAnd I'm countin' the days, 'cause I'm about to be a mental case\nMy little son is gettin' bigger\nAnd he picked up the phone one day and thought I was some other nigga\nYeah that bitch is tryin' to play me like a sucker\nCause on the down and low I heard another nigga fucked her\nNow homicide is on my mind\nFor knowin' that this bitch is at home, screwin while I'm doin' time\nAnd the nigga that's hittin the skins\nIs a bold motherfucker 'cause he's one of my own friends\nBut that's all right 'cause I got somethin' for they asses\nAnd when I see him I'ma smash his fuckin' glasses\nLivin' in hell but now my blood is gettin' cold\nTwo months later, I got released on parole\nSo now I'm rollin' colder than a blizzard\nI got some iron from my man and went to pay the stupid bitch a visit\nI'm ringin' the bell like hell\nOh nobody's home huh? So I kicked it till the shit fell\nStepped in the house with my finger on the trigger\nButter ass nigga stuttered, \"Wha-wha-what's up nigga?\"\nMy bitch was scared, 'cause she knew that I was steamin\nShe ran her ass to the back and started screamin\n*One shot fired* to the body *two shots fired* to the head\n*One shot fired* put the barrel in his mouth, makin' sure he's dead\nAnd the police ain't cannin me\nInside a cell, 'cause I just fell off the edge of sanity\n\nEdge of Sanity (2X)\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "Straight Jacket", "href": "Straight_Jacket&&6801", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "(Kool G. Rap)\nHelp me doctor doctor 'cause I'm seein lots of spots\nI'm thinkin' of pink elephants with little polka dots\nI'm tired, crazy tired, but I can not get no sleep\nCause every time I close my eyes I think I'm six feet deep\nI feel I'm goin' slow as hell but everything is speedin\nLast night I woke up screamin and my bathroom walls were bleedin\nI thought I fell asleep at work, but then when I awoke\nI was all alone and had my own hands on my throat\nClippings from the newspaper of murders my library\nSometimes I get a urge to walk inside a cemetery\nI looked into a mirror seen a rope around my neck\nI smoked a lot of cigarettes, 'cause I'm a nervous wreck\nTryin' to relax, I ran some water in the tub\nVision somebody slaughtered, then the water turned to blood\nI'm runnin' down the hallway tryin' to reach an exit door\nThe more and more I run seems like it's further than before\nVoices sometimes tell me what I won't do, what I will do\nVoices in my head right now are tellin' me to kill you\nFilled up with anxiety, I went to Lover's Lane\nSeen a couple kissin', then blew out the brother's brain\nI feel the world's against me and the women are so dirty\nI hate women today because my mother used to hurt me\nI think I'm goin' crazy Doc no longer can I hack it\nPlease, doctor please, put me in a straight jacket\n\nA lady picked me up hitchikin, what a big mistake\nSeveral hours later, there's a body by the lake\nWalked into a train station, headed towards the back\nCaught a flashback, and pushed a man right on the track\nI'm in my darkroom inside my house that is deserted\nDevelopin the photo of a hoe that I just murdered\nI took a walk one night because I wanted to get out\nI stepped outside, I paused, and I was back inside my house\nCalled up PLENTY doctors, told 'em all about my health\nMy phone just plays a dial tone, I'm talkin' to myself\nSnap back to reality, at least that's what I thought\nRunnin' from the spirits of the bodies I just caught\nI can't escape this hell I'm in, not even in my dreams\nI cover both my ears, because I'm sick of hearin screams\nI been a mental case since I was in the seventh grade\nStabbed another student, licked his blood off of my blade\nI got two personalities inside sometimes they battle\nWhen I look at my picture all I see is scribble scrabble\nI feel I'm really losin it, I need to write to Abby\nThe characters on TV try to reach right out and grab me\nI always hear somebody talkin' bout they gonna do me\nBut I listen again and it's those voices talkin' to me\nYou heard of shadowboxin? I see mine and then attack it\nPlease, doctor please, put me in a straight jacket\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}, {"title": "Still Wanted Dead or Alive", "href": "Still_Wanted_Dead_Or_Alive&&5820", "artist": {"unique_name": "Kool_G_Rap_%26_DJ_Polo"}, "lyrics": "\"When you're on the run from the police, you got two options\nTurn yourself in... or come out BLASTING!\" *boom*\n\n(Kool G. Rap)\nThe chase ain't over, the battle ain't done yet\nGet your ass out of town before sunset\nBullets you felt got you runnin' for help\nYou gettin' struck and my nine is STILL tucked under the belt\nI'm wanted dead or alive, but I'm still standin\nJust tell Shannon, got the van with the cannon\nWhen I hit, either the nine or the pound spits\nI even flipped on a mob I was down with\nSo I'm packin a mac at night\nAnd blue and whites are everywhere in a nigga sight\nSo come on, you little pigs, who's the bravest?\n'Cause I'ma spit on your ass like Larry Davis\nBumpin 'em off somethin' decent\nJump out slow and drop the cocktail bomb in the precinct\nAnd drop ten with the Glock-10 *boom boom boom*\nI made another cop spin\nNow Uncle Sam really wants me\nBut I'ma hit some more spots, then I'm flyin out the country\nIt ain't about runnin' off like a sucker\nI dug my own grave out this motherfucker\nSo I gotta hustle and gamble\nBut before I split, believe I leavin' shit in shambles\nIt's a long plane ride, but a nigga gotta survive\nI'm still wanted dead or alive\n\nI'm turnin' the city morgue to a deli\nWas in the belly of the beast now the beast is in my belly\nI gotta get up more loot\nTime to throw back on the army suits and Timberland boots\nBlast at the niggaz from the East New York scene\nI got my man C with me from Fort Greene\nAl Capone, D Creative G, and peep my man named B\nReady to peel caps like potatoes\nKev and Akinyele's on the lookout\nUp in the spot, niggaz are crooked out and took out\n*Bang* There goes a brain *bang* There goes a liver\nAin't no time, for dumpin niggaz in the river\nI ain't lovin' you niggaz no more\n*Vrrrrrrrrrroom* It's time for the chainsaw\nOff with the legs, arms, and head later\nAnd throw the shit down in the incinerator\nThen I'm off with the drugs and ends\nNow it's time to get some motherfuckin revenge\nTo the nigga that stuck me in jail\nI sent his momma's fingers to him in the mail\nCaught up with his ass inside the 10th floor hall\n*Bullets spray* Painted the motherfuckin walls\nNever mind having balls, you niggaz better duck and dive\nI'm still wanted dead or alive\n\nAiyyo Jinx, bust 'em in they motherfuckin face\n\n\"I pop in my Kool G. Rap and Polo tape\" -&gt; Chuck D\n\nThey was - straight goin' out like a gunner\nBecause a nigga's wanted, I'm even hunted by bounty hunters\nBut I'm spittin' out bigger lead\nThey got about a half a million dollar reward on a nigga's head\nBut I murdered the whole crew\nI saw they spirits leave they bodies and I shot at them bitches too\nI put the nine to their it's so simple\n*Bang bang* Now that's what I call a Holy Temple\nYou put a nigga to the test\nBut if you fuck with me, then you fuckin' with the best\nI'm wettin niggaz and I'm fleein G\nCause Sing-Sing ? ? ? ain't seein me\nYou gettin' zipped up in leather\n'Cause if your ass leaks once, then your ass leaks forever\nTo the nigga that threatened my life\nWent up to his crib, started wettin his wife\nNigga hidin in a closet\nChecked his ass, and made a motherfuckin deposit\nSucker tried to get live\nYeah, I'm still wanted dead or alive\n\n", "album": {"title": "Live_And_Let_Die_(1992)&&4640", "genre": "East Coast Hip Hop", "year": 1992}}]