[{"title": "I Don't Give A Fuck", "href": "I_Don%27t_Give_A_Fuck&&3419", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "You been talkin', now we caught you\nBitch now its on\nThug line nor I don't give a fuck (I don't give a fuck)\nAbout you jumpin' up, actin' like you Krayzie\n'Cause you Hollywood niggas can't fade this\n\nTurn off that muthafuckin' radio\nAnd put in a CD or a tape\nAnd let them thug niggas show\nWe comin' to invade your space\nIn your face like \"Ho hey!\"\nThe original, criminal, blowing up on these niggas\nGive them something to listen to\nIs Right back up in the house\nMastermind of rap or crime\nAnother clack of a nine\nDamage your spine (spine)\nMash us and blast at your mind\nNiggas really think I'm carin'\nWhat they sayin' like they scarin' me\nBut all they talk is noise\nI'm not a toy, so boy don't play with me\nThug Line, Thug Line\nAnd yeah that's my clique (that's it)\nAnd if niggas wanna trip\nThen we can do this shit\nI'm not no muthafucking ho-nigga\nI came but I can go\nSo nigga come on\nAnd let me know what you down to die for\nStay strapped these days 'cause I don't know who to trust\nSo I just point my gun everywhere when I bust\nFuck these niggas\nI'm in your city, your TV and your radio\nSo don't act like I'm hiding\nNigga, y'all are just some scary-hoes\n\nWhy niggas be actin' like they know me?\nThen talkin' my shit\nAll on my dick\nNow nigga you know what we call them (A bitch, bitch)\nI'm running from nobody and nothing\nMotherfuck them if they coming\nWe'll be waiting with the pumps\nAnd bucking slugs into they stomach\nA hundred mini-missles won't miss you\nI can bet you we hit you\nSplit 'em, get rid of 'em\n10 of them, at the same time killin' em\nKeep my presence to a minimum\nBut I'm in your vision\nEvery time you see the thug line\nI'm on the front line\nI love mine\nI'm tellin' you now\nWe on a mission with no mercy\nWanna know how bad we wan't it?\nJust say we thirsty for it\nAnd any nigga trying to get up in my way\nMight I say, them bitches beggin' for a beatin'\nSo we left 'em bleedin'\nCompetition (competition), to me is an enemy\nSo think before you come try to get in it with me\nSo you can frown all you want to\nGet loud all you want to\nBut now we see you\nWhat you gon' do?\n\nNow if y'all really trying to get in some action\nYou heard my song\nCome nigga, get at me\nAnd bring your family\n'Cause we really need to practise\n\"Walk it, don't talk it\", I say this time after time\nHave the same nerve and courage when we see you outside,\nOnline, all right\nLet's get this party started, spark it\nThug style, showin' 'em love\nBut we stay heartless regardless\nHit 'em with bomb shit\nBetter ring the alarm\nIt's the thuggish ruggish niggas\nBustin' the gauge with one arm\nLike Vietnam, the enemies expendable, so fuck 'em\nFirst time we warn 'em\nSecond time we storm 'em\nNigga, you don't get no three shots\nWe not playin', and I know they understand\nThey tried to test the man\nBut the man was really a man\nSo it's the plan\nStay heated heavy and ready to die\nIf not then eat a magnum full of hollow point shots\nI'm just tryin' to make my profit,\nGet up out of this shit\nBut until then I gotta cock my shit (I cock my shit)\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Ride If You Like", "href": "Ride_If_You_Like&&4012", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "(Guy)\n107 Point, uh, Thugline Radio\nCallin you on the air\nWhat'cha wanna hear baby\n\n(Girl)\nHi, I wanna hear the new Thugline Krayzie Bone joint\nYou know, the one with...\n\n(Guy)\nAh yeah, yeah, yeah, that's right Krayzie Bone\n107 Point, uh, all day in your, uh, in your pee hole baby\n\n(Girl)\nUmm, can I get some tickets...\n\n(Krayzie)\nThugline, Thugline\nIt's Thugline, Thugline\n\n(Chorus: Krayzie (LaReece) - 2x)\nIf y'all niggaz think y'all can keep up (ride if ya like)\nThen come into my world we just (thugs for life)\nThink we just hangin' let's ride (ride if ya like)\nHave a hell of a time on the Line\nThugline (thugs for life)\n\n(Asu)\nY'all niggaz can't keep up (can't keep up)\nBust bigger like a D-cup\nAnd after we get rid of this dope we gon' have to re up\nAll you could say is we what? (what) thugs for life\nNo if, ands, or fuckin' buts, so ride if you like\nI stand and cut (stand and cut) and sparkin the weed up quick to heat up\nThem ladies love the way the thunder (thunder)\nPoke 'em waitin that cock beat up\nMic freaker, dope seeker, and I'm bangin' through your speakers\nStop ringin' my beeper bitch I said I'll see you when I see you\nBest believe a nigga servin' more wood than Ikea\nAin't nobody been in and out of more draws than me neither\nNow pass the reefer to propel chief, but nigga heaven's not either\nAnd that dip is only for all believers\nNow if you still with us you kept up\nIf not, guess what?\nThey're comin' to crept up\nAnd y'all chose the wrong niggaz to step up\nIt's F'd up, but can't and ain't changin either\nThugline ain't for the bullshit, and Mo Thug neither\n\n(Chorus: Krayzie (LaReece) - 2x)\n\n(LaReece)\nWhere the thugs at?\nAin't nuttin but dimes in the back\nAnd oh we wanna know just who's the mack with the biggest sack\nWhere your crew at? We can do that\nGot the Juice and the Gin round up all your cutest friends\nGot the Herbs and X and thicks that serve sex\nWe hope you G'd up\n'Cause bitches weed up flossin them D-cups\nWe came to kick it so don't smoke the weed up\nCheck the riders for heat 'cause you know\nThem drunk ass niggaz they always seem to fuck up the flow\nLet's go to the pool and sip Martini in our new bikiniz\nThe mood is right we tipsy and jacuzzi is steamy\nThese bitches see me and they mad 'cause the thugs on my crew\nThese niggaz riders, they love dope, don't give a fuck about you\nThey got the stripper up in V.I.P., for ballers with cheese\nAll of this please is streasin me like y'all won't believe\nThey all up on me\nI roll with playaz that pack heat and love crime\nI represent the ladies bitch the crew is Thugline\nYa know?\n\n(Chorus: Krayzie (LaReece) - 2x)\n\n(Krayzie)\nGet up outta my car I'm feelin' ziggity, ziggity, ziggity\nCan I get a little bit of Hennesy\nAdd a little bit of Gin and we got that Sin, let the party begin\nI'm with my friends and we rollin'\nSmokin', blowin', chokin, rollin' up some more, and more till we POD' ed\nPast cromatose fucked up and weeded\nNeed more reason for chillin', we having a good time\nAnd plus the hood's tight, so should I put up my pistol? No\nI brought my digs but you never know about these thug haters\nGotta stay ready to blaze 'em, fade 'em\nBut it ain't shit happening my niggas what's happening?\nThis one for the family and it gotta be T-H-U-G-Line\nLet me hit it one more time\nLook at my eyes shut all the way\nWe in the sky 'cause the only way to fly is high\nCome take a fly with'cha nigga hit this and close your eyes\nGet a ride free your mind\nBut watch out for one time\nCan never get blinded them bitches get up and they trailing behind me\nI'ma be the nigga with the heat seeker bring it on\n\n(Chorus: Krayzie (LaReece))\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "I Don't Know What", "href": "I_Don%27t_Know_What&&6440", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "Typed by: Cashmoneyrec2001@cs.com *\n\n* Send corrections to the typist\n\n(Krayzie: repeat 4x)\nThis is how we do it, when we do it...\n\nDoesn't it feel good to see us makin' money?\nFeel good like everyday's sunny\nFeel good see us takin' off?\nDoesn't it feel good to see us ball?\nAnd they can't take it from us at all\nAnd if you agree that we don't fall sing \"la da di da da di da di da di da\"\n\n(Verse 1: Krayzie)\nBack at'cha, it's the thug with the most droppin' more Thuggish Ruggish on ya\nKrayzie keepin' it flaming, so indeed it's fire for ya\nWater, don't need none let it burn\nLet it be known that it's my turn, let 'em turn\nBe concerned with these words I got\nWhatever they sayin' about the Line, we better kill 'em\n'Cause I got up and I got mine don't mean I'm trippin'\nReally left niggaz behind to handle business\nThey don't understand I'm in it to win it\nThug out with a crowd full of criminals and killers\nSo pump your fists if ya feel it, hear me\nWe in it to keep it the realest\nWith my remige, Thugline team, coming to kill something\nClose to 30 million sold and still thuggin', still strugglin\nWassup with Bone? Gotta keep it real, so I tell them I don't know\nCan't think no more excuses when niggaz don't show\nWe came up from poor, and I'm not going back to poor, no!\n\n(Verse 2: Krayzie)\nFor The Love Of $, I keep it funky\nJust thuggin' back down in the ghetto\nSleep in the PJ's they let me so I love 'em back\nBy keepin' it real, givin' 'em shit that they can feel, like hustlin need more than a mil\nLike how to make it on these streets and not be killed &#226;&#8364;&#732;fore you get grown\nLet a nigga go on 'cause he chose to live his life wrong\nAll I know is life is already short\nAnd you can bring your non-exsistance closer if you want\nTrust me, you don't nigga, live on, get'cha thug on (thug on)\nMake you some cheese, get some weed and go get your buzz on\nBut must of all you gotta stay sucka-free, them bustas out ya mix\nThat go for anything you do and they go all to jail, I don't trip\nI share a hater to the side, devil ass nigga\nAlways fuckin' up my vibe, that's right now, nigga\nYou done meet Krayzie Bone, you ain't meet Leatherface\nAnd I don't think you wanna though, no!\n\n(Verse 3: Krayzie)\nMy nigga, cover your ears and fuck what you heard (heard)\n'Cause it's about they bullshit they be talkin', why?\nNiggaz in my business like they my bitches, got me hot (so hot, hot, hot, hot)\nRun up, touch me, get burned, nigga\nSaid they saw me at the Source out on the floor, dropped (what?)\nChickenhead bitch from Miami said we was runnin' when the war popped\nHoe stop, you don't know none nigga rollin' with me\nWhat shut you puff? My niggaz hold on the B\nFor most of them niggaz they want peace when we meet\nLike we ain't be hearin what they be saying on the streets\nSo we gotta bring the heat\nSpeak if you want, but keep it to a mumble\nSpeak louder than a whisper, oh and we gonna get'cha\nY'all Don't Know Me, ain't that what I told 'em?\nHope they knowin' these pistols real's that we toat, jokin\nNaw nigga, we for real in the field\nBelieve what you want, but you suckas know the deal\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Da Thugs", "href": "Da_Thugs&&7313", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "Thugline guess who's back? Da Thugs\nTell 'em who the real niggaz is man? Da Thugs\nWho the fuck ya come to see? Da Thugs\nThe only niggaz down with me is Da Thugs\nWho the niggaz straight up off the Double Glock? Da Thugs\nWho them niggaz brought you Thug Luv with Pac (Bone) Da Thugs\nWho the niggaz mixing Hennessy and Gin? Da Thugs\nLet's start this shit up baby\n\n(Krayzie)\nNiggaz guessin it is my thug nature (thug nature)\nThat motivates me to chase some paper (paper)\nCause being broke (?) wasn't the plans when we made 'em\nStraight up you barely get up off your ass wake up, wake up!\nNigga, how long you think this shit gonna last?\nGet up, get up (Thugs!) got to keep your hustle\nGot to fight the struggle if ya wanna survive the jungle\nYou know I'm a thug for life\nI'm knowin' you already knowin' that\nDon't need to be showin that\nUntil it's time to let niggaz knowin' that that's what I'm doin'\n(Thugs!) gonna go platinum outta the box\nThe tracks out, the raps out\nAnd nigga don't act shocked\nYou fuckin' with Kray, Leatherface Sawed Off Slim\nGhetto Cowboy (boy) whatever you got to say you say it loud, speak up!\n(Thugs!) no need for flashin my jewerly to get a broad, hell no\nAin't got no game but nigga my real is raw\nYou feel me, kill me that's been the discussion of some bustas\nI heard (I heard) them motherfuckas tryin' to do the Thuggish Ruggish\n(Thugs!) bring it on, we about war world war!\nMeet us in the streets or bring it to the show\nWe can rap, bust caps, make 'em know it\nWhile I strangle this bastard with my microphone cord\n\nDa thugs\nWho them motherfuckas wanna be like? Da Thugs\nWho them niggaz feel the thug shit we write? Da Thugs\nTell them motherfuckas who we do it for? Da Thugs\nIf ya niggaz lookin' for us playa here we go, Da Thugs\nWhy the fuck the cops always fuckin' with Da Thugs\nFuck the police that's comin' straight from Da Thugs\nWho your girlfriend left you for? Da Thugs\nWho them niggaz you scared to approach? Da Thugs\n\n(Krayzie - 2x)\nThe way they leave ya fine till we get there\nNigga you're runnin' outta time (runnin' outta time)\nSee you with a cop, 'cause we be there pint ya!\nThugs on the line, frontline\n\n(Krayzie)\nSee Krayzie about that (Thugs!) nickels and profit\nKeepin' my pockets all swollen\nGimme that Bone Luv\nAs you can see it's no longer Mo Thug\nThat's your luck, cause it ain't no beefer that my peeps\nSo why do I hear 'em speakin' it different on the streets?\nBut check it out (thugs!) I'm through with trippin'\nThat's why I got on my mission and did this\nHandled my business, witness your nigga come up on these millions\nReally I been in the cut now for quite a while\nWhen I come out, niggaz gonna recognize the tighter style\n(Thugs!) now watch out this Harmonies speedin up\n(??????????)\nAin't never been down before just so you know\nWait a minute, oh I want you to meet and greet my thug tribe\nNew and improved, I bring to you the motherfuckin Thugline (Thugs!)\nFuck what you talkin' stupid bitch it's what you walk\nCan you walk? and my thugs strut\nIt's daily watch me walk, Da Thugs!\nI never really been one to claim no coast\nBut yo that Cleveland nigga in here for sho'\n(In da house!) that I know\n\nWho them niggaz stealin t-shirts and khakies? Da Thugs\nWho them niggaz keep it real when they rappin'? Da Thugs\nWho they tryin' to ban, who? Da Thugs\nAnd who don't give a damn, who? Da Thugs\nWhat you hearin when you turnin' on the radio? Da Thugs\nWho you seein when you lookin' at the video? Da Thugs\nWho them niggaz smokin' blunts non-stop? Da Thugs\nWho them niggaz escape the block? Da Thugs\n\n(Krayzie)\nWhen you kick it with the thugs, when you smoke a little weed\nCall me up you know the thugs always keep it\nWe got what you need just call me up, yeah\nDa Thugs teach the world (whole wide world) to be like\nWhat's up to my niggaz Flesh-N-Bone?\nStay strong my nigga\nFuck the law\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Rollin' Up Some Mo'", "href": "Rollin%27_Up_Some_Mo%27&&1761", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "Typed by: ThUgLiNe7ThSiNg@cs.com, Cashmoneyrec2001@cs.com *\n\n* Send corrections to the typist\n\n(Krayzie - 3x)\nRollin' Up Some Mo'\n\nAllittle bit of refer's all I need (all I need)\nWith alittle big of Gin mixed with Hennessey (Hennessey)\nAlittle bit lighter really sets the mood\nHave you feelin' like everything is so damn cool\n\n(Krayzie)\nHop in my Five-Double-O\nRoll up my window asshole your lettin out all the smoke\nYou never wate a blow, motherfucka don't you know?\nI'm a weedhead, P.O.D' ded stayin tweeded\nIt make me happy\nWon't even sleep unless I'm beamin, fiendin\nWhich one of you niggaz gonna put some ends in?\n'Cause I'm tellin' y'all right now I'm smokin' everything I'm spendin\nGoin' down, cop a quarter pound now we in here blowin' it\nWait a minute where's the bowl at?\nYoung Dre done got me spoiled man\nDone smoked two blunts, and now I'm feelin' like I can fly\nI get into zones of my own every time I get high\nAnd whenever it is, I think I see\nI'm buzzin so it doesn't really matter to me\n\n(LaReece)\nI got issues nuttin but problems feels my green\nMy nigga wanna test me with the same old games\nGot this chicken down in San Diego, and he trickin on my pesos\nAnd he think that I don't know\nAnd he got the gawl he fuckin' two of my dawgz\nNow they actin' kinda funny when I call\nSo when I'm with my Thugs On Da Line\nTonight no lady like instead I grab a fifth of Hen\nTake it to the head, c'mon\n\n(Asu)\nNow, niggaz came late to get me Keith G pass me the Henny\nKray lookin' like chimney I'll smoke whatever and any\nNaw, I'm buggin my squad ain't druggin like that\nLuggin the Mak, LeReece all nice with K-mont in the back\nBlunts and stunts is what's rolled up\nOnce it's lit it's hit, and if you ask me why I'ma tall ya what, what ya want?\nSmoke a blunt all jokes is front fuck beatin' around the bush\nKick the (?) ya punks\n\n(K-mont)\nI mix Henny with Alize get drunk and talk slick\nNigga be sizin me up, you know I'm ready to flip\nMy niggaz stay smokin' out, sippin Hen and Tengery\nNigga, we be havin' hella fun like they do in the bay\nIt be the weekend gangsta that me causin the tention\nYou might catch me willin' out, in the tough guy convention\nBut don't get it fucked up, because I'm all about my cheedar\nIt ain't easy being me, but nobody could do it better\n\n(Boss)\nEverytime I'm rollin' out with Krayzie we crazy, try not to get ciffed up\nFucked up sippin on that siz rup, pourin out that cup of stuff\nThem jolly ranchees and enhancers, I mix it up like a chemist\nDrop about 10 of 'em in it, then sip it slow till it's finished\nThen it's that (??) little (?) is safe at home\nThen get your brain broke, they boiler makers and they chain smoke\nBoss ain't no fuckin' rookiem put purple permethozine up on you ream\nThat's guaranteed to make you lean and keep you higher than girffe pussy\n\n(Kieth G)\nI ain't ate all day, but steadily gettin' fucked up\nSmokin' this weed, waitin to get scooped up\nIt's the bum Keith G, carribus we on twists\nWe needed a fix, my nigga dip into the rent\nWe worry about that payback later we gonna smoke\nAnd live for the meanwhile puffin with Juvenile, what?\nI'm in the mood to speak my piece, pass the mic\nI'm in the mood to drink some burb, we high tonight\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "If You A Thug", "href": "If_You_A_Thug&&6859", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "Typed by: THU6WORLDORDER@AOL.COM *\n\n* Send corrections to the typist\n\nClap your hands thug niggas jam hard\nClap your hands thug niggas clap your hands\n\n(LaReece)\nIf you a thug nigga what, you poppin' slugs at snitch niggas\nYou ain't playing, shit you's a halt about your figgas\nIf you thug, forever rollin' on dubs\n20 deep (?) pressin the clubs with your thugs\n\n(K-mont)\nNigga if you a thug than youu better have tatts\nAnd whenever I got beef than I can call you for straps\nNigga if you a thug than you all about paper\nAnd you know there's only one way you got to deal with a hater\n\n(Krayzie)\nIf you a thug\nYou wouldn't have been talkin' it\nYou would have been walkin' it\nLoading up your pistol marking your target and popping it\nIf you a thug then what the fuck that make me?\nA Krayzie... nigga y'all ain't trying to see\n\n(Asu)\nIf you a thug only thing squilling will be your wills and\nYou was a pilling at still at whoever the fuck you wasn't feeling\nThugs know the verse, my thugs holler louder than that\nYou don't hear them, you heard them in niggas just follow the path\n\n(Lareece)\nIf you a thug I know you ain't loving the bitch, hugging the bitch\nYou say you just be rubbing the clique\nIf you a thug you know you can't be tricking the dough\nRoll up in the halls, keep eyes on your foes\n\n(K-Mont)\n(Yeah yeah yeah)\n\n(K-Mont)\nNigga if you a thug than its bitches you lust\nYou know its hard to find a pritty dyme piece you trust\nNigga if you a thug than you got to get yours\nYou still doing your thang, but ain't no love for hores\n\n(Krayzie)\nIf you a thug you don't some money to make some money\nBecause if you a thug, if you ain't got it you taking money\nIf you a thug you don't give a fuck about the judge\nDoing three strikes when you living your life thug!\n\n(ASU)\nWhat a thug see through whatever you were trying to do\nI bet a thug can show you better than a thug can tell you\nThugs stay talking, and walking, stay rolling and sparking up\nThugs stay swollen in they hearts and in they nuts\n\n(Lareece)\nIf you a thug oh yeah you know you staying (?) so high\nKeep your heat on your side when you ride\nIf you a thug see you that type of nigga that never given a fuck\nMad doggin on than niggas like what\nIf you a thug\n\n(K-Mont)\nIf you a thug you probably fighting a case\nHarrassed by the police and probably sprayed with mase\nNigga if you a thug you know the law ain't shit\nYou screaming fuck the police\nAnd telling the president to eat a dick\n\n(Krayzie)\nIf you a you would have been screaming this shit before we was\nIs you a thug or a nigga just trying to ride the bandwagon\nIf you a thug you got no problem spending blood\nOver the shit you love so nigga tell me\nStill a thug?\n\n(Asu)\nIf you a thug you wouldn't be hollering\nAbout what you would of, could of but should of you done it\nNow nigga run it on your mothafuckin stomach\nAshes and elbows cocka-doo-doo\nYou know how the tail goes\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Talk To Myself", "href": "Talk_To_Myself&&9677", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "Typed by: ThUgLiNe7ThSiNg@cs.com, Cashmoneyrec2001@cs.com *\n\n* Send corrections to the typist\n\n(Krayzie - 2x)\nI talk to myself (myself), when there is no one to talk to\n\n(Tiffany)\nEver wonder just what it's like talkin' to yourself every night?\nWill I ever make it through the day?\n\n(Krayzie)\nIt's so hard to believe that I'm still living, I'm alive\nMy clock is still ticking, guessing that God is still with me (with me)\n'Cause I could have been gone so many times before\nMurda Mo is chasing me I'm bearly escaping it\nMy instincts is tellin' me that I might not live long in my life (my life)\nMy life is a jungle I really don't love it it's really to crumble\nI fight with these devils on daily basis\nAnd I try to stay humble\nTry not to fall, but what if I slip, trip?\nTry to stay calm, but what if I flip?\nKill 'em all\nLast night I had a long talk with myself (myself)\nDrama had a nigga wondering, wondering how close am I to hell\nThen I had to pray can't let them brake me, awww nah, awww nah\nBut it's everyday they try to make me soft\nBut so fried, so high is my mistake\nDon't worry when I'm in the clouds\nWell that's how I stay (stay)\n\n(Chorus: Tiffany)\nEver wonder just what it's like talkin' to yourself every night?\nWill I ever make it through the day?\nNever thought I make it this far\nKinda wonder just where you are?\nWill you ever make it through the day?\n\n(Krayzie)\nCaught up in my complications nowhere to go\nIt's mandatory that I face them, even though I don't want to\nThey say karma can murda ya, murda ya\nAll this drama just got me nervous\n'Cause I know I've popped shots that don't stop\nThey don't stop\nSoon as I lose it they know I get stupid\nAin't nowhere to you, to you\nStop, stop, look, look, listen\nWhere heard them\nI'm hearin they put to get me (get me)\nCan't let 'em get me\nI won't stop dumpin until my clique is empty (empty)\nWhen this one finish (finish) I'm buckin till I put my other clip in (clip in)\nThen get up spittin' back at y'all (back at y'all)\nThat's 'cause the can't get with this at all\nThe war is really raw (raw, raw, raw, raw)\n\n(Chorus: Tiffany)\n\n(Krayzie and Tiffany)\n(Last night I had a long talk with myself)\nAnd I told myself I can't depend on one\nNo one else\n\n(Krayzie)\nCrazy, crazy this thing done made me crazy\nHate to say it, I done went crazy {2x}\nWalkin' in the rain (walkin' in the rain)\nDisaster calls my name\nCallin my name feelin' so much pain\nWanna get away but ya can't, can't run, run, run\n\n(Chorus: Tiffany)\n\n(Krayzie)\nI talk to myself (myself) when there is no one to talk to {2x}\nWalkin' in the rain (walkin' in the rain)\n\n(Tiffany)\nLast night (myself) I had a long talk with myself, self, self\nWill I ever (myself) make it through the day?\n\n(Chorus: Tiffany)\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Bloody Murder (Skit)", "href": "Bloody_Murder&&4442", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "(Krayzie)\nDum, dum, dum, dum, dum {throughout the whole song}\nBloody murder (yeah)\nWatch out (yeah)\nNigga, killin' all of y'all (yeah)\nCause that's what we about (yeah)\nBloody Murder... (yeah)\nWatch out (yeah)\nWe be killin' all of y'all (yeah)\nCause that's what we about (yeah)\nYou know before we leave from the scene, from the scene you'll bleed\nYes indeed, when I squeeze trigger freeze\nNigga these are the thugs\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Ride The Thug Line", "href": "Ride_The_Thug_Line&&5773", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "Typed by: Cashmoneyrec2001@cs.com *\n\n* Send corrections to the typist\n\nThugline, Thugline, come Ride The Thugline\nAll day (day), keep it real, keep it real, keep it real {4x}\nAnd all night (night), yeah, yeah, yeah\n\nC'mon, c'mon, c'mon, c'mon\nWake up in the morning, glorious to see (what?)\nThen I hit the streets knowin' that I got beef\nSo since I got beef it make sense to pack the heat\nAin't no debate be (?) publicly\nYeah, I'm a rider call me R-K-C, ambassador, diplomet officially\nRide with my team, the Thugline regime\nEvil side regulated, smash, crash, tell me food stamp this game dig us?\nYeah, and tryin' to be sneaky\nAskin everybody that think I know 'em for my number to beep me\nOn my pager to beep me\nAnd I sense they negative energy\nFeelin' like some gangsta, gangsta shit to me\nDon't matter where you go it's psycho my flight flown\nTo the bottoms in Miami got off the plane like Rhinos\nSweaty in this humidity, high\nMy thugs, hit the club, scene it's crackin' tonight\nCome on, what, what, said it's crackin' tonight\nCome on, Thugline make it crack tonight\nYeah huh-uh, huh-uh, come on, come on\n\nAll day (day), keep it real, keep it real, keep it real {4x}\nAnd all night (night), yeah, yeah, yeah\nThugline, Thugline, come Ride The Thugline\n\nAll night long we ain't goin' to sleep\nBeat these motherfuckin streets with heats and break beats\nMake my way through the door, four rounds bar man\nMy niggaz on one, he snuck a (?) can in\nThe latest edition to some tight shit is spinnin\nHey DJ, you workin with that equipment\nProceed to stagger through the crowd, blowin' one\nLadies in abundance nigga seven to one\nBack of the straps, tattoos, holding some Hennessey\nI got my partner Krayzie Bone there go one for me\nI broke from the camp post tellin' baby this and that\nShe told me about herself she want to model and act\nI'm seeing other eyes, but I'm trying to lock this\nWho could really blame me about those ass and hips?\nShe say she got some folks, Young Dre what the deal?\nLet's cut this night short take them back up the hill\n\nThugline, Thugline, come Ride The Thugline {2x}\nAll day (day), keep it real, keep it real, keep it real [4x}\nAnd all night (night), yeah, yeah, yeah\n\nI gets a rush, thinkin' 'bout the fools that we crush\nAnd my little locs is down to bust, and makin' a fuss\nAll up in my pockets they gangsta hatin' on us\nFirst round that we (?) now we adding a plus\nLive just to die know you know it&#226;&#8364;&#8482;s a must\nSilly niggaz tellin' lies, fo' five make 'em hush\nListen, just hear the bullets come when they spittin'\nY'all reppin just steppin, I'm only playin' to win\nGot a pocket full of plenty niggaz splurgin on drink\nThirty dollars in the tank a nigga reaking of dank\nKhaki suit full of dirt from a nigga puttin' in work\nCan't understand a command niggaz, patrolin to turf\nGotta get it while the water's hot and fill up your pot\nHit the block with a rock with (?) make 'em (?)\nI level with a tickety tock, it don't stop\nAnd I'll be damned if they pull a nigga back on the block\n\nAll day (day), keep it real, keep it real, keep it real {4x}\nAnd all night (night), yeah, yeah, yeah\nThugline, Thugline, come Ride The Thugline\n\nYou might not recognize my flow, 'cause it's me bustin' at first\n'Cause I can put styles inside my verses motherfuckers ain't heard yet\nBut I won't battle MC's, but we do handle beef with these\nCompetition to me means an enemy (get rid of 'em)\nAsk some of these niggaz past nothin' but snakes in the grass\nTalkin' bout we bit they mad 'cause they career was a fag\nYou might been rappin' doin' it twistin, but that bullshit you're stressin\nKnowin' exactly when you're fresh, you niggaz wreck shit\nPlatinum? that ain't a thing for me, hit the studio make it happen\nNigga that's because I'm real with this thug music\nWe mash and wild in 2000, nigga no remorse\nWhat we be givin'?\nHeat from the kitchen when fuckin' with this shit\nGet with the Line, Thugline, the Line, Creepin' On Ah Come Up\nYou know what?, this time around it's on when we blow up (tell 'em)\nFakers, hate ya, later, y'a'll all die, nigga they all die\nThey die, they die\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Thug On Da Line", "href": "Thug_On_Da_Line&&3438", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "Typed by: Cashmoneyrec2001@cs.com *\n\n* Send corrections to the typist\n\nThese niggaz don't know who the fuck they fuckin' with man\nOn the real shit nigga, this is Thugline nigga\nAnd I'm that nigga Mr. Sawed Off Leathaface\nAnd I dedicate this shit to all them motherfuckas who used to be down\nWanna be down, but can't never be down\nAnd that's simple because we ain't fuckin' with no punk pussy ass nigga\nYou know them niggaz that always talk the real shit\nBut they can never walk the real shit\nListen up this ones for you, for you\n\n(Verse 1: Asu)\nSoon as I hear these cheese\nI'ma stick you like I took ya picture, Kodak smile\nYou know that number to dial when in need of work, I proceeds to lurk\nSquattin and schemin plottin on demon\nAnd It's a whole lot of semen in this dick\nPackin bisquit, once the bisquits is baked\nIt boils down to the risk us niggaz take\nTry Asu and leave ya loable to get floored\nAnd if you ain't fully insured you ain't just asleep, nigga snore\nI got somethin' it (all things)\nYou got some Henny nigga pour it (we can all drank)\nI done lost somethin' I ain't tryin' to find and I know it's love\nEven though I'm dying inside, nigga is still a thug\nThe company I keep be wantin me to heat fuck boom\nI don't really wanna scorn, how I'm supposed to warn?\nMy folk once provoked, It's on and not gradually\nCasualties is random, and like I tell 'em I dump naturally\n\n(Verse 2: K -Mont)\nAy, yo, ay yo whatever you, saw I seen it\nWhatever I say, I mean it\nMost of y'all bitch niggaz wasn't thugs until Bone screamed it\nRecognize the wisdom fuck that nigga shootin clips\nMatter of fact I'm tired of talkin', pull you pistol keep walkin'\nCatch me on the puly wearin a hoody\nOr standin on nigga lines, stressin, conversation about dyin' it's Thugline\nThat niggaz be askin who is he?\nIt's that nigga from Jerz, motherfucka it's K-Mizzy\n\n(Krayzie)\nThem motherfuckin thugs is in the place to be\nFuckin' shit up it's T-H-U-G-L-I-N-E\nGot niggaz in the club\nKillas out for blood\nMotherfuckas hit the floor when we lit shit up\nThugline, Thugline, Thugline, Thugline, hope you ready\nThugline, Thugline, Thugline, Thugline, we heated heavy (2x)\nDo my thugs run this motherfucka (hell yeah!)\nDo my killas run this motherfucka (hell yeah!) (2x)\n\n(Verse 3: Wish)\nNigga, anyway you want\nThis is Thugline willin' and ready to dump\nFuck 'em up, fuck 'em up\nI got my Line right here, here\nYou can step and we can jump it off right here\nFuck y'all niggaz, fuck y'all niggaz\nHow many niggaz you roll with that you feel is real?\nHow many niggaz you roll that know you gonna kill, gangsta huh?\nFuckin' with the Line It's about time someone took it over\nI'ma get mine, can't wait for time 'cause it's almost over\nI got wha'cha want baby\nYou can step, but best believe you won't play me\nIf you like that, throw your hands up\nI know you like that, throw your hands up\n\n(Verse 4: LaReece)\nChaotic situations got a bitch stressin, holdin' the guns\nDumpin on these trick niggaz for funds\nTitties bouncin' in the lo-lo, creepin' real slow\nLa Femme Nikita with my heater and they don't breathe no more\nSo trick, hit the floor\nIt's that boss bitch, Nina Ross bitch, know it cost bitch, floss bitch\nGot your sister hostage {girl screaming}\nYou got my green if not, I lost it\nI'm leavin' a corpse absence\nIt seems you don't understand my pockets pitfil\nSo it's critical that I get the dough right now\nAll your wants I can't satisfy needs\nCan't determine do's and don'ts amplifies my greed to multiply my G's\nYou want war nigga? I got somethin' for niggaz\nQuick to bust the fourth-fifth for more figures\nStandin on the Frontiline with my fan bam, Thugline\nBloody murder all these haters tryin' to take mine\n\n(Verse 5: Krayzie)\nCall me the boos fighter, Frontline rider\nLeathaface'll catch a case up in this place, we'll show 'em who 'bout it, bout\nIt\nHow the dealer stole and cut it, police won't even touch it\nI'm a rich nigga come to my show and bring your bitch wit'cha\nTwo Thousand niggaz all screamin out loud \"fuck the law\"\nAnd all y'all niggaz mean muggin me and my niggaz is my car\nPartna don't get me started\nY'all niggaz ain't seen me get retarted in that mode I'm harmless\nWhen her bare arms we far from harmless\nThis is the bomb shit so ring the alarm\nTakin' over the yard, nigga Thugline's in charge\nOn guard a new clique, and we got new shit\nThese niggaz ain't nobody you wanna fool with either, so be cool with it\nThen niggaz won't have any problems\n357 revolver is all it takes to squash an solve 'em\nWe all in this business to get paid\nBut meanwhile, we gotta go fight off the enemies that hate us for these styles\nMade us some cheese, now fuck the world\nTell 'em Krayzie said it, will I ever switch?\nGet out the thug shit? nigga forget it\nI'm real with these niggaz, I chill with these niggaz\nI kill for these niggaz, cause these my niggaz...\n\nThat's right nigga, just do y'all niggaz know y'all fuckin' with\nThe niggaz that's gone put the raw back in the game\nNiggaz that's 100% pure thug-bred, thug nigga\nYa better believe that, roll call for the soldiers on the Frontline for the\nThugline\nRoll Call\nAsu, where you at? (hey, yo Thug On Da Line)\nK-Mont where you at? (nigga, Thug On Da Line)\nWish Bone where you at? (what, Thug On Da Line)\nLaReece where you at? (playa, Thug On Da Line)\nYou niggaz knowin' where I'm at\nNigga, Thug On Da Line the Line, the Line yeah, yeah\nThat motherfuckin thug ass track you hear is my nigga Super Sako\nWe keep it thuggin'\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Can't Hustle 4 Ever", "href": "Can%27t_Hustle_4_Ever&&9265", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "* Send corrections to the typist\n\nHey yo, I'm tired of runnin' these streets, yo\nI'm tired of hustlin\nY'all motherfuckers think this is all a game\nThis shit ain't easy, this is all I know\nWhat am I supposed to do now? huh?\n\n(Chorus: repeat 2x)\nDo you know where you're goin' to?\nDo you like the things the streets it's showin you?\nDo you know, you Can't Hustle Forever?\n\n(Verse 1: LaReece)\nIt was you and me against the world\nWe switched the game up\nHustlin forever together before we came up\nIt changed our paths we went our separate ways\nNo more ridin' on them niggaz for me, how I miss those days\nSwore up and down you was a super thug, so it's told\nBut had compassion for your foes wit'cha heart of gold\nWhile I was rappin' and singing you started slangin and bangin'\nBut with money comes greed saw your heart it was changin\nNiggaz out on the street, your peeps gettin' covered in sheets\nYou relied on heat to keep you from suffering defeat\nAnd now you're different like these savages, you're soul golfed out\nI know you're hurtin' every time I see your soul from you\nYou at your crossroads, whatcho gonna do?\nWhere you going, boo?\nStreet is watchin just to take your soul from you\nWho will feed your seed if you're locked down, or better yet dead?\nDid you live your life to the fullest when you take your last breath?\nDo you know?\n\n(Chorus: repeat 2x)\n\n(Verse 2: Krayzie)\nCome follow me into my life, my life, my life\nI'm a young hustla\nThis is to get paid as I stay clean away from bustas\nStrugglin is in my blood\nMentality thug, reality I'm fucked up\nI gotta go get it my goddamn self, cause ain't nobody about to give me shit\nGotta go out and get the rent pay\nSo I'ma be out here on this block with these rocks and this glock\nUntil I profit could you stop it?\nMama used to say \"but until I see it better, it got to be this way\"\nAnd it don't look like I be going nowhere, nowhere\nLooks like I'm stuck in this here ghetto\nEven though I done got this dream of being famous\nThis is really short, and if I don't make it by the end of the year\nShit's feelin' to be changin I'ma be dangerous, bangin' nigga's brain\nNigga, I'ma start sharin my pain and bang\nHey, this shit we do for the dollar, dollar bill y'all\nSo, before I get killed y'all\nI gotta make better ain't tryin' hustle forever, ever\n\n(Chorus: repeat 2x)\n\n(Verse 3: Young Dre)\nGod, please I know you see me livin' better that this\nBut, truthfully it's hard for Dre to comprehend 'cause it's cheddar to get\nIf I don't hustle I can't eat\nSo in these streets it's you and me\nTakin' these fair penitentiary chances\nPlus some real finances that'll (?) me and my fam to better circumstances\nRider quote \"man even though I know I know how this game go\"\nGot the green light for cash and I can't let time pass\nGotta grabs mines reality's a mutha\nTryin' to hold on to all my survivin thugs brothas\nSee, this life'll make you sharp and hard two clenched fists for the struggle\nRide for my thug nation that love to hustle hard\nWith slugs from berettas, doing dirty business\nSome niggaz still can't get together collecting figgas\nMake it impossible to hustle forever\nBut life's a struggle we gonna survive until something come along better\nRiders!\n\n(Chorus till fade)\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Ready For Combat (Skit)", "href": "Ready_For_Combat_(Skit)&&6986", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "Typed by: young babyboy87@hotmail.com *\n\n* Send corrections to the typist\n\nDum, dum, dum, dum, dum {Throughout the whole song}\nI bring yo' Thugline (y'all)\nDon't they want to see me fall (y'all)\nBut I never had then I'm just to wrong (y'all)\nYou used to have a lot of devil scene (y'all)\nWhen I kept my soul, they see me disappear (y'all)\nAnd now the cryin on the line is perfect time\nTryin' shinnin', keep my mind, ready for combat\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Ya'll Don't Know Me", "href": "Ya%27ll_Don%27t_Know_Me&&7906", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "* Send corrections to the typist\n\n(Krayzie - repeat 4x)\nI'ts Krayzie Bone (Krayzie, Krayzie, Krayzie)\n\nHomie, y'all don't know me (know me)\nMighta heard my name (my name)\nAin't nobody feelin' hold me (hold me)\nNot in this game (not in this game)\nHomie, y'all don't know me (know me)\nMighta heard my name (my name)\nBut ain't nobody goin' to hold me (hold me)\nEspecially in this game\n\n(Verse 1: Krayzie)\nExcuse me, but do you know me?\nYou've seen me on TV and in the video\nGot caught up in Crossroads forgot that we was criminals\nThat's right, we them same niggaz to come up from nothin'\nTo what up with them figures?\nNigga, my album got better thangs\nAnd people changed when I got in the game\nNiggaz call me I don't even know how you know my name?\nHow the fuck you get my number?\nWhat the fuck is going on?\nThen I got these haters leavin' threats on my phone\nThey messages be records that they made just for me\nI'm not on that don't give a fuck if you rap faster than me\nBut when it come to being the realest niggaz that ever did it\nYou know Bone Thugs gonna be contendin for that position\nListen, if y'all niggaz wanna trip with us, bomb ya fall witcha dick in the\nDust\nGet up, what up? Thought ya had me figured out you didn't\nRemember next time, that last time that nigga wasn't bullshittin\n\n(Verse 2: Krayzie)\nHomie, y'all don't know me\nY'all mighta heard my name once or twice\nDon't start none (drama), won't be none (drama)\nCause however they want it, they can come get it believe I got it\nCan't be faded keep thinkin' Krayzie ain't really crazy\nHaters, that pressin me to make me show this lately\nAfraid that they mistaken that they thinkin' Kray ain't hip, hip, hip\nTo those who pose as friends\nBut are phony before they can infiltrate but can't imitate us for long\nThey better not come talkin' no shit 'cause I'm servin' 'em some\nAnd fuck whatcha heard, believe whatcha see please\nDap is cheap, dramatical action speaks\nDid you hear it, hear it?\nI know ya feel it, feel it the twelve gauge eruption\n\n(Verse 3: Krayzie)\nWe got a game full of clones that can't hold they own\nSo they be fast to bite\nNigga don't like Bone, then why the fuck you rappin' like me bastard\nYou know you like it, nigga'z funny\nBe bobbin they head to my music, but when they see me they mean muggin\nKeep lookin' ugly, niggaz but jut don't jump\n'Cause I'm a nervous nigga, and I'll buck, buck, buck\nThug haters they get me violent\nCops make me riot\nYou bitches make me sick and tired, sin keeps me wide up\nAnd I needs to be high, just for fuckin' with y'all\nAnd I dedicate this one to all them bustas I knew would fall\nHad to get rid of the dead weight that was holdin' me down (holdin' me down)\nThe Thugline officials and it's goin' down (down)\nSo wake up, wake up, wake up, wake up dawg\nNo need, don't even try to fade us, y'all\nWho the nigga in the halls, big balls?\nThat's Sawed Off Slim\nDon't try to get with him cause playa, playa\n\n(Chorus till fade)\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Gemini", "href": "Gemini&&6929", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "* Send corrections to the typist\n\n(Chorus: repeat 2X)\nGemini, every time I try to use my mind\nSeems like I gotta fight two sides\nAnd I never know which one's right\nThat's my life\n\n(Krayzie Bone)\nMan since I been off in this music business shit has gotten crazy\nI gotta be dealing wit devils bitches and bustas daily\nAll ah dem was screamin to take me on that long ride\nJourney or mission, whatever you wanna call it\nThey tryin' to get me Listen,\nI'm hearing voices sayin' Kill dem muthaphukkaz dead\nOther voices saying be humble man and understand\nI try to be level headed but it seems the devils winnin'\nTry to do the right thing but I always end up sinnin\nPin Me\nGod wont forgive you when you pray and do the same shit\nSo I repent, and you can't even pay yo rent\nIf it ain't no dollars ain't no sense right now\nBut as I stop and think, a nigga got kids right now\nAnd mine got ta eat\nBut they can't eat if daddy's dead or in jail\nSo, what would you do choose heaven or hell\nIf it's hell, you'd probly come up fast, and die\nThat's why {and i} I wonder why heaven\nAin't the chance on my mind\n\n(Deep voice Krayzie)\nListen nigga, you plan on having thought of thangs\nThen fuck everybody else, think about yo self\nThem muthaphukkaz never gave you shit\nFuck that nigga take that bitch\nYou smoke all the muthaphukkin reefa you give\nKill any muthaphukka you feel need to be killed\nAnd the niggaz that used to run wit cha\nThey ain't cha friends them niggas is out ta get cha\nAnd fuck this Ruthless bitch\nThem muthaphukkaz ain't paid you for shit\nIf I was you and you was me\nThen I'll bust in that office and take my profits\nBut nah, you muthaphukkaz tryin' ta go to heaven\nBe broke and ain't nobody bless you\nWhat happen to the muthaphukkin nigga I know\nThe nigga that was lokking the let the guns smoke\nYou a mastermind you need to say fuck this rap shit\nAnd put it in some crime {sometimes}\nYou money waitin nigga\nYa muthaphukkin money ways niggas\nDon't let chu know you gotta fight these niggas)\nYou know you got damn right\nHandle my pistol dawg 'cause I den got hype\nFinna be some muthaphukkaz dying tonight\nThe shit ain't right\n'Cause I den stayed humble and kept it real wit chu hoes\n(And muthaphukkaz try to play me still nigga I know)\nYeah muthaphukkaz is thinkin' a nigga got soft\nAnd I dropped my sawed off and I won't break 'em off\nBut chu know a nigga (show dem niggas)\nHoe ass niggas (told dem niggas)\nIf I had to fake that is was on\n(Stop hold up nigga wait don't go makin' a mistake wit cho life)\n(Man fuck this hoe shit niggas is bout ta ride)\nBut wait, what chu mean make a mistake\nMuthaphukkaz owe me\n(But killing ain't the way ta get it please hear me)\nWell how the fuck I'm pose to eat\n(Ain't no other way) (but it is)\n(It ain't fuck that) How you feel it is (Oh shit)\n(You got ta pray, they'll be a better day\nI can bet there'll be a better way\nBut chu gotta keep ya faith don't let them demons take\nYa soul don't sell ya soul no\nRemember what chu reap ya so, and if you try ta cheat he know)\n(Fuck that save the world shit\nDon't listen to that garbage\nDon't chu know niggas gone die hell regardless\nDon't chu got a family nigga what about cho daughter)\n(And that's just the reason you should trust in the\nLordy Lordy Lordy Lord)\nSo what am I to do, go dance with the devil\nOr be true ta you know who get paid I make due\nBut the bad is lookin' good\nAnd the good is lookin' bad\nShit you be the judge of that dat.\n\n(Chorus) - repeat until fade\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "A Thugga Level", "href": "A_Thugga_Level&&5573", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "Typed by: Cashmoneyrec2001@cs.com *\n\n* Send corrections to the typist\n\n(Verse 1: Boss)\nBig ballin bitch like Boss come through like it ain't no thang\nPaper chase, hustlin nothin' changed\nAsk me again I'll tell you the same\nDon't hustle the fame nigga, most of the game\nPut it down in the street for mine\n24/7, stayin on the grind\nFor days and days I shell at the cops\nEnough grenades to get at the block\nI'm a drug smuggler\nPart bitch, part thug, part hustla\nYou lift my crib and I'm touchin ya\nNo love for ya, draw blood from ya\nCause a nigga like you dreamin' to Boss\nAnd you fiendin to floss, and who pounds is flown\nWe're bustin' motherfuckas with the black game\nHoldin' them fiends and lovin' my crack, in the front got bud in the back\nWho can get more thugga than that?\nFrom hookers and jacks, put the house up, bitch\nI'm bustin' the gat\n\n(Krayzie)\nY'all niggaz always testing, gonna make me pull this weson\n\n(Boss)\nIf money ain't the answer rephrase the question, dawg\n\n(Krayzie)\nBig Boss and Krayzie Bone is...\n\n(Verse 2: Boss)\nRunnin' up in your town with an uncountable amount of numbers of mongols\nY'all mad we the real number owners\nRollin' like big, Thugline nothin' but runners\nTrouble Boss, a double cross\nA nigga named Krray they good as dead\nFrom the b-o-double, doin' double time\nAnd these tricks comin' up to bread\n\n(Chorus: repeat 2x)\nWe on some thugga shit\nWe on some other shit that you ain't fuckin' with\nThe thuggin' don't stop\nAnd you can't touch the clique\nYou know you love this shit\nTake it to what we spit\nThe thuggin' don't stop\n\n(Verse 3: Krayzie)\nI heard a silent motherfucka creepin' up from behind ya\nBet ya didn't think that I'd find ya, huh?\nWith a nine or pump (pump, pump, pump) your shit'll be fucked\nAnd I ain't even popped the goddamn trunk (trunk)\nI bet they never saw a nigga bring the heat and be so cool\nFreeze everything, nigga don't move\nYou can choose to be a fool and try to get away\nBut never make it out the room when the pump go BOOM!\nFuckin' 'em up, scream \"fuck the world\" while I cuff my nuts\nReal niggaz don't lie, hit 'em in the mind, every time goddamn we live\nSend 'em to the graveyard, who gonna save y'all?\nMatter of fact motherfucka who paid y'all\nYou runnnin up on them niggaz you know gonna bust back?\nTake no more shorts fuck that (fuck that)\nPistol control, we roll streets of the all know\nIf they run up I'll pop get your hand out my pocket\nFor the glock, glock shot 'em all on the floor\nYou dealin' with some motherfuckin real niggaz\nThrill niggaz, we'll kill niggaz if they wanna kill me\nStill runnin' with the AK-47 ain't shit changed\nStill got the same artilary\nBust at them bastards (bastard)\nMe and Boss steady breakin it off in they asses (in they ass)\nWanna see me get glasses (glass)\n'Cause I be all in your face but you walk right past me (past me)\nBut that let a niggaz know they don't really wanna swang them thangs\nFuckin' wit them thugs, the thugs... nigga the thugs, what?\n\n(Chorus: repeat 2x)\n\n(Verse 4: Boss)\nBare witness to Mrs. Gangsta\nWe're gun-toaters, blunt smokers, big bank folders, and high rollers\nQuick to burn off into toaster for fun, this bitch\nJudges wanna post as gorilla\nPimps, killers, and soldiers roll\nYou don't slip and we thought that we told ya\nKnow what Thug Luv nigga to bone ya\nThey can run your shit and bend a corner, scatter and spread\nLike mustard jam them buzzards up and leave 'em smothered\nQuick friends gats find ya like bookie and they down with me like fo' flat\nY'all niggaz got nuts, our niggaz got nuts\n\nSo we can go nut for nut see who first to crack and split\nLike ya down like wipers\n'Fore the motherfuckin piper pay the bitch\n\n(Verse 5: Krayzie)\nYou motherfuckas feelin' to feel it\nThugline put it down keepin' it the real it\nAnd I ain't really trippin' of these niggaz\nThey say they gonna get me yet they miss me\n(What?) 'Cause I've been here niggaz thuggin'\nWaitin for you motherfuckas to come bring it to me\nFuck waitin I'ma mingle with it\nThe nine millimeter and plenty more haters\nIf any more niggaz roll up put the cut I'm fuckin' 'em up\nWhen I hit 'em with the pump don't duck you gonna die\nFuck you, die, buck you, die\nReload, unload one more time\nHit him with the pump make sure he dead\nHe bled blood, we bail\nAsk me if a nigga prepared for war hell yeah\n\n(Chorus till fade)\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Hard Time Hustlin'", "href": "Hard_Time_Hustlin%27&&3363", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "(Krayzie - repeat 4X)\nWe hard time, hard time hustlin, hustlin\n\nMama been laid off\nShe ain't workin no mo'\nPapa been laid off\nHe say things done got slow\nMy brother's been laid off\nHe been locked down for more than two years now\n\n(Verse 1: Krayzie)\nMy world is crumblin, time is hard they were before, but oh my god!\nMama mad at pops 'cause he ain't workin\nBut today she lost her job\nNow what in the fuck is we suppose to do?\nWe on our last loaf of bread\nGot cereal, but no milk, Kool-Aid, no sugar, what the hell?\nAnd here come Mr. Billcollector beatin' down our door for dough\nMama say when they come knockin'\nY'all don't say nothin' (shhh) get on the floor\nKind of hard to see att night in a house when it ain't got no lights and shit\nNo gas or water, had to borrow H20 from my relative\nMan, it feels like I ain't even here\nI'm ready to get up and get all my own, but I got three more fuckin' years\nNigga 15, with a big dream to make it on out this ghetto\nBut the devil won't settle, fuckin' up my levels he won't let go\nI'm livin' to die it seems I just can't win\nNow I'm high, but I'm stopin to realize I drunk this whole fifth of Gin\n(Nigga damn!) I'm 17 and drinkin' like I'm grown up\nI got some problems, plus I need some money\nAnd it's really all because...\n\n(Verse 2: Krayzie)\nJuvenile nigga done strugglin, hustlin, strugglin like I want it\nThen fuck school, right now I'm hungry, and I can't eat that damn diploma\nBut on this corner I can eat everyday, all I gotta do is slang this yay\nNigga, If business keep going this way me and my family is fin to be straight\nI'm glad I took that fifty dollars that grandma gave me\nBought me a double up, now it's all about comin' up\nI'ma pay ya back next week\nRepeat, took my ass straight to the block with hand full of rocks, y'all\nAnd it's my first time I'm lowin, watchin for cop cars\nBy the end of the night a nigga sold all the rocks\nI'm trippin' out lookin' at all the dough I got\nI shoulda been came a sold the block and locked it\nMade me some profits, so nigga tonight my people gonna be eatin on lobster\nHate to say it, but I think these streets done really created a monster\nCause now that I see how quick I can come about breakin the law\nWhy in the hell is you steady tellin' me to go and get a job?\nFuck that, nigga this my thing right now I know\nI'm walkin' home happy, smilin', and I ain't even thinkin' about...\n\n(Chorus: repeat 2x)\n\n(Verse 3: Krayzie)\nBusiness was boomin so a nigga assuming I could do some improving\nLike new jewels, clothes, shoes, Cadillac Coupe, I'm out here doin' it\nGot me a cold ass broad, and that's something I never had\nBut I'm never mad 'cause I done snagged one bad one with my young ass\nOnce I turned 18 it was on\nBut my brother started writing home, tellin' me to leave this shit alone\nI say, what? nigga, he don't know that I'm too deep in this\nI'm livin' and breathin the street shit\nAnd if I don't play the crook, you ain't gonna have shit on your books\nLook, gimme a minute, I'll chill in a minute I promise I will\nAs soon as I finished this last load\nI'ma drop the dice after this last roll\nLittle did he know, I got no intentions on leavin' this shit here\nI'm feelin' to get rich here\nWhen you get out, you'll have some shit here if you still care\nMade enough money to move my moms and pops to a new pad\nThey was suspicious, but they ain't trippin'\nCause this more shit than we ever had\nBut shit went bad six in the morning crashing through my door was the Feds\nAnd they want that bread we want you, and I'm like ooh! (shit)\nShoulda listened to my brother, huh?\nBut I'm like fuck it now\nMama got to buggin out when them po po got to cuffin pops\nNow I'm in the courtroom when that asked me how I plea\nI tell the judge straight up, I've been havin' problems and it's all because...\n\n(Chorus till fade)\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "If They Only Knew", "href": "If_They_Only_Knew&&8894", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "(Krayzie - 4x)\nHe did (he did) ya wrong\n\nHey girlfriend, if someone told your boyfriend, oh, uh, uh,\nUh, uh\nIf they told him, what me and you be doin'\nSomebody's gonna be in trouble (gonna be in trouble)\n\n(Krayzie)\nGirl if the people only knew we be kickin it like husband and wife\nYou see that's the reason you sleepy sayin' 'not tonight'\nMeet me at the corner store ain't nobody gotta know\nSoon as you pull up we pull out and roll\nFollow me home\nLet's get away and be alone, unplug my phone\nYou know the song baby\nAll around the world it's the same song, the same song\nTurn off the light we be smokin' bud in the dark\nEvery time I hit the weed\nI can see your beauty reflectin when it spark\nGirl I feel it the reeder and the vibe is perfect\nAnd don't feel worthless 'cause if your man was actin' right he'd be\nWorth it\nBaby, he don't deserve this (deserve this)\nSo don't be actin' nervous\nAnd besides he ain't here it's closed curtains\nGettin' it on shit\nYou know it's something about\nWhen you be sneakin for some reason\nThe lovin' feel much better\nWhen you're creepin' don't you get too sleepy\nYou know you gotta go\nYo man is back at home and probably waitin at the door\nSo, I get with you tomorrow\nBaby just page me, hit me up\n\nAnd when I jump outta work\nCome on over and give me some\n\n(LaReece)\nAll I needed was a thug in my life\nSomebody that'll treat me right\nSlap it from the back, and keep it wet all night\nA rider like you that's ghetto-life\nAnswer to my dreams knew that you was him on sight\nThe way your shit was tight\nAin't no happy home, uh-huh\nTalkin' to them chickens on the cell phone\nTook your shit too long\nNow two can play the game\nI'm feelin' you and ain't no shame (shame)\nAnd when I'm in your arms I feel no pain (pain)\nCan't hit the spot like you, cop a knot like you\nFlip it over quick and knock it out the box like you\nKeep it locked like you it's only on my mind\nAnd when I'm rollin' in my Benz knowin' you on your grind\nYou make my heat melt\nAnd I don't want no one else\nIf I can't have you I'd rather touch myself\nJust give the word boo, I'm leavin' all this shit for you\nThat thug passion got me sprung, so whatcho gon' do?\n\n(Krayzie: repeat 2x)\nGonna be in trouble, gonna be in trouble\nIn trouble, in trouble\n'Cause if anybody find out, uh-uh, and you know that\nYes you know that\n\nHey girlfriend, if someone told you girlfriend...\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Everybody Wanna Be Thugs", "href": "Everybody_Wanna_Be_Thugs&&4803", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "* Send corrections to the typist\n\n(Chorus: repeat 2x)\nEverybody wanna be thugs\nThey really don't 'cause if they lived my life they'd understand\nNiggaz for they self, no love\nAnd it ain't nothin' better than a gun in hand\n\n(Verse 1: Krayzie)\nI'm lookin' at all my niggaz on the corner still trying to come up on something\nLike some paper, cash money\nTwo-double-o-zero, niggaz is desperate to make it\nBattlin Satan, but the plate that he made us looks so tasty\nTemptation over took my devils persuasion\nMakin' me chase the paper while trying to break 'em, I blaze 'em\nThen I raise up, nigga that's the way thugs do it\nSee it don't say nothin' just to find out we kinda stupid\nIn the streets we play for keeps\nNiggaz ain't comin' back for revenge or whatever, loc\nWe havin' none of that, so scandalous\nYou better keep your protection\nCause the grass and the blunts ain't the only thing we wet up\n\n(Verse 2: Krayzie)\nSee, I've been runnin' from the po-po ever since I was 11\nNigga bellin, ain't tryin' to get kept and slept in the cell, man\nA lot like my daddy, but then again I'm like myself\nKeep my nose in my business and worry about nobody else\nGot a mind of my own aside from Bone\nSo nigga don't think that you can run up and test me when I'm alone\n'Cause I got the chrome\nTalk mo' shit I'm still a street thug, but I make mo' hits (mo' hits)\nPlatinum packin magnum never leave the house without it\nAnd if he 'bout it don't sing about it nigga bring up out that shit\nThugline, frontline\nNigga it ain't scared, we done time\nLeatherface is on the rampage, murder mangler, strangler\nWhat you came with it just ain't enough\nTo tame the thug, we aim to drain the blood from your skull\nRappin' but we dangerous, dangerous\n\n(Chorus: repeat 2x)\n\n(Verse 3: Krayzie)\nNow to my youngsters with they guns\nOut on the corner perfomin tryna to be soldiers\nJust remember that I told ya, slow down, down, down\nI know you wanna be a thug, and do what we done\nBut if it ain't inside your blood then this ain't the game that you tryin' to\nPlay\nJust like one of my niggaz tried to hang, and he died in a day\nAwww, shame, shame, shame\nBullet hit him in the brain\nAnd he was a thug nigga, you get the picture?\nPicture niggaz in a single file line\nAll crying, upset because their niggaz died, nobody know why\nIt's so many dying cause too many trying to shine\nWe all trying to swang on the same godamned vine\nIt's about that time for the thugs to unite\nAnd let this motherfucka burn tonight (tonight, night)\nIf you a thug get up and join this thug nation (thug nation)\nWe got guns waitin (guns waitin)\nSoon as the enemy run up, blaze 'em (blaze 'em)\n\n(Chorus till fade)\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Time After Time", "href": "Time_After_Time&&4561", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "Typed by: Aswanton@yahoo.com *\n\n* Send corrections to the typist\n\nTime after time, find I question my life\nHow I went wrong, will it ever be right?\nWill I rise? Will I fall? Stand tall\nContinue asking, but I'm knowing only God know\n\nTime after time, find I question my life\nWhere I went wrong, will it ever be right?\nWill I rise? Will I fall? Stand tall\nContinue asking, but I'm knowing only God know\n\n(Verse One)\nGrowing up in the hood as a hard knock\nI never knew nothing too much about young\nMy only concern was making my money and running these streets as a thug\nInstead of the birds and bees, I always talk to murderers and the G's\nThat coldness inside me, but I ain't trying to hurt nobody\nTemptation is keeping me steadily going under\nAnd I wonder, if I could make it through the thunder\n'Cause I done caused so much hurt and pain to some that ain't deserve a thang\nIf I could change that, it would all be rearranged\nBut what's done is done and I paid the price\nAnd now I'm like, Help me Lord, to better my life, my life\nJust give me the chance to prove the world that I can be the man that I am\nAnd I plan, on keeping it realer, really slow and steady\n\n(Verse Two)\nSo now I'm headed to the chapel and I'm fin' to try marriage\nIt's goin' down yeah, yeah, yeah, but what do ya know?\nWho woulda knew that would make situations worse\nAnd my curse, nothing I've tried seems to work\nAnd I drop to my knees and I pray, yes I pray\nAnd I wonder if I'll ever see a better day (I need a better day)\nI've seen much in my time and I think it was too much for my eyes\nThe wickedness pulling me closer to failure every time I think I'm rising, yeah\nBut you live and you learn and try to make better, gotta get control\nThen follow the Lord and who knows where you'll go, for sho'\nI can see how I've been sinnin\nI'm asking the Lord for a little bit of forgiving, 'giving\n\n[Chorus] - repeat till fade\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}, {"title": "Kneight Riduz Wuz Here", "href": "Kneight_Riduz_Wuz_Here&&4490", "artist": {"unique_name": "Krayzie_Bone"}, "lyrics": "Typed by: ThUgLiNe7ThSiNg@cs.com *\n\n* Send corrections to the typist\n\nAs the new world order takes us into the year 2000\nThe shadows of death over the sky causin total destruction\nAs we transform day into night, darkness falls down upon us\nWe rise from the fog uncomparable to any other form of life\nTogether we ride by night, unidentified, unseen, unknown\nYes we are the pirates\nOur missin' is to destroy enemies by any means necessary\nAnd those who interfere with prosecution for execusion\nShall indeed be terminated any race be gone\nFor we are the Kneight Riduz\nKillers of the night and first of our kind\n\nCan't you feels the temperature droppin' gettin' cold?\nBelow zero murda mo go slow flow under your door\nIs it magic? not it's murda they don't know that we're pirates\nBy night we get violent like fighters fightin\n\nYou're takin' chances runnin' around upon me\nI got somethin' waitin in a cage for you\nWipe that smile off your face when you see us ridin' through\nKillin' 'em all (till everyone fall)\nYou get out of my way or you're subject to get killed without the clues\nI thought people should continues bouncin'\nA war right now is not what you're really wantin\nPirates got the world on lockdown, we rule from the darkness\nWe come from beneath the ground, so who wants to party?\nWe got runnin' up with slugs for everybody\nRenovate the town in blood with a slaughter\nWhat's the matter? you're not soundin so tough\nAm I callin your bluff?\nWhen them high tides come crashin ashes to ashes and dust to dust\nWe are the pirates, the pirates\nYes we are the pirates, pirates\n\nWanna come fuck with me?\nMe bloody matey got me back so check your tick-tock\nHow many minutes ya got before you drop? been shot\nThe smell of gun powder fills the air\n(????) There you beg for mercy we don't care\nBloody bodies stacked up in a pile and set the fire\nIt's the pirates behind all this violence it's not the devil\nIt's rebellin with my shovel, with my victims lifeless\nTossed over my shoulder as I showed him to his hell-hole\nDead foes to the bottom\nUs pirates be heartless my conscious was fuckin' with me I shot him\nAnd got 'em all believe me\nWe gonna (??) crazy and I'm silent until my other mode\nWe front the underland understand, understand?\nWe live to die so we fear no man not at all\nEverytime we call stay outta the way and outta the dark\nAnd just hope to god, that he'll just come and kill us all\nWe all gonna dies, it's the ways of life wildest new generation pirates\nUs new generation pirates, pirates, us new generation pirates, pirates\n\nUp in my temple proceddin I'm waitin to taste your blood run throught my veins\nAnd see you gasping out my name\nYou'll be sayin' \"psycho bitch, psycho, psycho, psycho\"\nSee (??) is how I kill you\nI have to fill my thirst so now I gots to kill you\nWe are all forgotten souls nightmare of every boy and girl\nKneight Riduh pirates the leaders of the underworld\nI'm so happy, happy knowin' my torture brought you pain\nPlay in my little game you hide I'll blow out your brain\nIsn't that fun?\nWhoever wants some you can hide but you can't run\nI cut off your legs now beg, yes beg {laughing}\n1-2 Riduz comin' for you\n3-4 you shoulda locked your door, let me in {laughing}\n\n", "album": {"title": "Thug_On_Da_Line_(2001)&&6761", "genre": "Midwest Rap", "year": 2001}}]