[{"title": "Real Hip-Hop, Part 2", "href": "Real_Hip-Hop,_Part_2&&4384", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One)\nHah! They not ready, uh uh\nSet it off, South Bronx\nSet it off, uh, check it\n\nThe real hip-hop, is over here\nThe real hip-hop, is over there\nThe real hip-hop, is over here\nThe real hip-hop, is over there\n\nIt's a demo, it's a demo, it's a demo, it's a demo\nSteppin out the limo, KRS-One, gettin' in you\nFrom the get-go kiddo throw 'em out the window\nFlip 'em like a nickel\nPeep the hottest single\nHe'll sink them like the S.S. Minnow\nThat same kid that rocks the Benz rocks the Pinto\nWatch my signal, I rock the rap game like Nintendo\nHey diddle, diddle, get played now like a fiddle\nI watch you wiggle, in front of the audience that was fickle\nNow you can't make a nickel, the sour pickle you are\nKRS-One, ninety-seven superstar\nI got one thing to say and let me make this clear\nEverywhere, now throw your hands in the air\n\nThe real hip-hop, is over here\nThe real hip-hop, is over there\nThe real hip-hop, is over here\nThe real hip-hop, throw your hands in the air!\n\n(Mic Vandalz)\nYo, been rockin' rooftops, knahmsayin?\nInternat', yaknahmsayin?\nKRS, vandalizin, yaknahmsayin? With the Mic Vandalz\nBoogie Down, Uptown, yaknahmsayin?\nIt's dope, check it out\n\n(KRS-One)\nWhen I ain't doin' a show, or bringin' all the money in\nOr at the studio, or home studyin\nI'm checkin' out Funkmaster Flex on cassette\nAs he wrecks turntable sets with many subjects\nHuff now that's the Blastmaster connects, the larynx\nTo a high-tech mic set, you get what you get\nTech and Sway, index of singles is complex\nOn Technics sets, he wrecks, collects a fee next\nWhile you rejects practice, suffix and prefix\nHip-Hop I reads it, and mark your album incompleted\nI seen it, saw it, back in eighty-five\nPlatinum rappers yo that can't rock live\nTheir mental facilities, lack the ability\nFor lyric agility -- battle? You're killin' me\n\nThe real hip-hop, is over here\nThe real hip-hop, is over there\nThe real hip-hop, is over here\nThe real hip-hop, throw your hands in the air!\nThe real hip-hop, is over there\nThe real hip-hop, is it over here?\nThe real hip-hop, yo it's over there\nThe real hip... now throw your hands in the air!\n\n(Mic Vandalz)\nThrow your hands in the air (get loose now)\nThrow your hands in the air (get loose now)\nThrow your hands in the air (get loose now)\n\nAiyyo I'm breakin, in this rap thing, I've been waitin\nReady for the world, rude like awakening\nHomo sapien, ? ? rock every stadium\nScholars and players, here to Las Vegas\nEmbrace the papers, land of money makers\nBrothers hate us cause the brothers ain't us\n\nYo yo, from coast to coast I'ma overdose you and BDP you\nAnd Kris-Kross your mind, wouldn't wanna be you\nA Uptown thing, world premier\nThrow your hands in the air baby it's on\nHow many MC's wanna get they rep torn?\nFrom Joe to Cage and mics in my juvenile days, I abuse\nThe mic get lifted, the crowd gets amused\n\nI got next... you lose!\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "I Been There", "href": "I_Been_There&&769", "artist": {"unique_name": "KRS-One"}, "lyrics": "(Chorus: repeat 2X)\nI talk how I talk when I talk 'cause I been there\nI walk how I walk when I walk 'cause I been there\nOn your own sleepin' in the park yeah I been there\nHow we really gonna survive? Let us begin there\n\n(KRS-One)\nI'm talkin' to the little you but, there is a bigger you\nThe bigger you is spiritual, little you that is physical\nKRS is givin' you, somethin' more than I get with you\nI'm hittin you, splittin you, rippin you down with me\nYou busted that metaphysical rap, at the pinnacle I'm at\nI'm down here just to deal witchu cats\nI never bleep you, I just remind you that they don't need you\nThey gonna keep you for as long as they can eat you\nBut that mic you speak through goes from here to Mogadishu\nAnd how you represent US is the issue\nI'm not here to diss you, or dismiss you\nBut at any moment we can be hit with missiles\n\n(KRS-One)\nHow many MC's must get dissed\nHow many young men must get frisked\nHow much ice can really go on one wrist\nHow many shots get fired at a target and just miss\nWe gonna live like this?\nI walk the same path that Ma$e do\nBut he went in the church, I stayed out to face you\nThe difference between us is not just man to man\nBut in fact it's fan to fan\nPeople that buy KRS-One goin' places\nPeople that buy your shit, they catchin cases\nMy people eat, your people cheat\nSuch is the words you speak and you reap\nYou can pop that shit if you like\nBut people that buy KRS-One, they lookin' for the light\nLike NYCE, Jada, Lizzard, B.C.\nHarold, Symone, Server yo man see me\n\n", "album": {"title": "Keep_Right_(2004)&&4989", "genre": "Hip Hop", "year": 2004}}, {"title": "Halftime", "href": "Halftime&&1615", "artist": {"unique_name": "KRS-One"}, "lyrics": "Right now as we rockin' they shootin outside\nNow we have got to chill\nWe have got to chill\nWe can't have no gunfire because hip-hop can't build\n\nLet's leave all the shootin and the violence outside\nI know there's some people in here, armed to the teeth\nBut understand...\nIt is the consciousness behind the gun\nThat determines if the gun is positive or negative\nSo let's not blame it on no pistols, no guns, no gats\nLet's blame it on the consciousness of the mind holding the gat\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "Alright With Me", "href": "Alright_With_Me&&8454", "artist": {"unique_name": "KRS-One"}, "lyrics": "I've got the illest live show (Now what you sayin'?)\nI drop the illest rhyme flow (Now what you sayin'?)\nBut you still want to act like you don't know\nWell, that's all right with me\nPeople sample me like James Brown (Now what you sayin'?)\nWhen they want to hear that sound (Now what you sayin'?)\nBut you still want to put me down\nWell, that's all right with me\n\n(Verse One)\nThe Kristyles is officially on blast\nDon't worry about what he say, 'cause he won't last\nIf you want to learn the way take a seat in this class\nI write albums like singles and release them so fast\nI get around the whole country on foot like Flash\nI don't fly across country I be there with the mass\nDrivin', drivin', pulling up to your hood spot\nYou sayin' to your son, \"now this how radio should rock.\"\nI pray for these radio cats 'cause they don't know\nHow fast I be movin when they be movin slow\nThis ain't no fast food rap dude, get it and go\nThis that home cooked type meal, lyrical flow\nSpiritual grow, ya know 'cause ya was there, fo sho\nLike Joey Greck I'm not the average Joe\n(Yo, welcome cats to the BDP show\nWith KRS, Kenny Barker, G Simone, and Chalk-o)\n\nI've got the illest live show (Now what you sayin'?)\nI drop the illest rhyme flow (Now what you sayin'?)\nBut you still want to act like you don't know\nWell, that's all right with me\nPeople sample me like James Brown (Now what you sayin'?)\nWhen they want to hear that sound (Now what you sayin'?)\nBut you still want to put me down\nWell, that's all right with me\n\n(Verse Two)\nI spit when I speak, when I speak I spit\nWhen I spit what I spat it splits ya clique\nSpit, spat, speak, spoke, either way\nI spat that your rap's not dope any way\nWhen you spoke I spit that splattered your scope\nI split that and spit that unanimous quote\nNo hope when I battle I'm staggering folk\nThey slip-sliding away there rappers ain't dope\nGet my coat, I make sure you can see shells\nFor sure you gon' see them 'cause all you see is sales\nForget it you ain't wit it, admit it\nEvery thing you did I already did it\n\nI've got the illest live show (Now what you sayin'?)\nI drop the illest rhyme flow (Now what you sayin'?)\nBut you still want to act like you don't know\nWell, that's all right with me\nPeople sample me like James Brown (Now what you sayin'?)\nWhen they want to hear that sound (Now what you sayin'?)\nBut you still want to put me down\nWell, that's all right with me\n\n(Verse Three)\nToo many emcees not enough time\nNine out of ten niggaz say they wanna rhyme\nFour out of nine talk about drugs and crime\nThree out of four say they wit it but they not\nTwo out of five spit fire plus the underground\nOne out of three spit righteous but they never shine\nOne out of two claim they ballin all the time\nAnd only one make it to prime\nDo that math, only one Biggie, one Pac, one Jay-Z\nOne Nas, one Fifty, one X, one Slim Shady\nOne KRS-One, one L, one K, one Busta, one Pun, one Love, only one me\nTake that TNT, that spit is my property\nYou copy me, fuck you, pay me (nigga)\n\nI've got the illest live show (Now what you sayin'?)\nI drop the illest rhyme flow (Now what you sayin'?)\nBut you still want to act like you don't know\nWell, that's all right with me\nPeople sample me like James Brown (Now what you sayin'?)\nWhen they want to hear that sound (Now what you sayin'?)\nBut you still want to put me down\nWell, that's all right with me\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "De Automatic", "href": "De_Automatic&&6160", "artist": {"unique_name": "KRS-One"}, "lyrics": "(Feat. Fat Joe)\n\nSome fear de 'matic\nAh hah hah, heh heh heh, EHHH\nCheck it out\n\nSome fear de 'matic, yes de automatic\nDisrespect, from MC's, me nah go have it\nDe automatic, get de automatic\nTonight a rapper gwan die\n\nCrazy MC's waste they time chasin millions\nWhile KRS-One, holds the minds of the children\nI'm buildin a followin of a hundred and forty-four thousand\nChosen few heads up in project housin\nA true rapper, street rapper, rappin' to the center\nI enter any cipher, with tales of adventure\nIf rappers are ridin' beats like cars, I'm bendin mad fenders\nPut down your mic and surrender\nYouse a pretender, Blastmaster KRS rules the pavement\nKickin Edutainment while you wait for your arraignment\nSave it friend before your chest I cave it in\nI got my way again, I'm classical like a fuckin' Harley Davidson\nHow do you think I kick a lyrical style no and you figure\nIt's simple, I'm a rap God, and youse a nigga\nDon't mean I'm bigger, it simply means I'm smarter\nFor starters, I come at you poetically harder\n\nDe automatic, get de automatic\nDisrespect, from MC's, me nah go have it\nDe automatic, get de automatic\nTonight a rapper gwan die\n\nHa hah, fake ass rapper, how you think you got juice?\nWhen you rock a pair of panties underneath your bubblegoose\n(Word) KRS-One will fuck up parties dramatically\nMy reflex'll slap a wack rapper automatically\nWhen you was home witcha mother, afraid of the dark\nI was sleepin' out in Prospect Park\nEatin one meal every 48 hours\nWritin dope rhyme styles that you now devour\nDon't you realize, that I'm all about survival\nI got only friends 'cause I KILLED all my rivals\nShow up at the rhyme recitals, took they titles\nFrom eighty-six to ninety-six completes my first cycle\n\nDe automatic, get de automatic\nDisrespect, from MC's, me nah go have it\nDe automatic, get de automatic\nTonight a rapper gwan die\n\nI spent 40 days, and 40 nights in the wilderness\nI'm hard, from head to toe yo there ain't no killin' this\nI wrote over 100 rap hooks\nAnd sociological books, while you worried about your looks\nNow you wanna enter the dragon in sound\nBut I've got the live club show locked down\nPlatinum and gold don't hold in my arena\nYou gots to keep it real on the mic, when they see ya\nI manifest, in the West the East and overseas\nThe vision in rap is wack, and I don't know of these\nI represent New York to be specific\nThe South Bronx, but in Japan I'm still gifted\nI grab a jet and land on your set, what the fuck?\nTwenty bucks for a rap show is still, twenty bucks\nI start from eighty-six, and bring you into ninety-six\nNo gimmicks, tricks or lip-sync lyrics\n\nDe automatic, get de automatic\nDisrespect, from MC's, me nah go have it\nDe automatic, get de automatic\nTonight a rapper gwan die\n\n(Fat Joe)\nYeah yeah it's the God Fat Joe\nRepresentin the motherfuckin South Bronx\nWith my nigga Kris, knockin' off frauds\nMotherfuckers wanna do what?\nBig shout out to my nigga Kenny Parker\nIll Will, BDP crew for life nigga\nNaughty Gotto, the Big French productions\nOf course the TAT crew, my nigga Brim\nThe T.S. crew, and the whole Godsville\nSouth Bronx represent nigga, uh\n\nThe South Bronx, the South South Bronx\nSouth Bronx, the South South Bronx\nYeah! Uh!\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "False Pride", "href": "False_Pride&&8558", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One)\nOkay now, listen to this...\n{*Sound effect: seagulls*}\nA mystical teacher sat by the seaside\nIt was about five o'clock 'cause we heard the free ride\nAnyway; the teacher was talking in stride\nSitting upon a rock that was wide\nAnd warning against false pride\n\"Come to where I reside!\" a woman cried\nAnd the teacher replied, \"Do you serve your fish fried?\"\n\"Yes,\" she replied, \"with potato salad on the side.\"\nAnd the teacher replied, \"Well where do you reside?\"\nShe said, \"Up on the hillside, it's not a far ride.\nIf you came to have dinner, I would be so gratified.\"\nThe teacher replied, \"It's six o'clock, seven o'clock, you decide.\"\nShe replied, \"Seven o'clock, do you like stir-fried?\"\nShe was mystified and felt so dignified\nThe teacher was coming to the house where she resides\nSo she purified with pesticides\n{*Sound effect: chemicals sprayed*}\nCalled her friends up nationwide\n{*Sound effect: phone being dialed*}\nSome of her friends were tongue-tied they felt so glorified\nShe made steamed fish, baked fish, fish that was fried\nSoup, steamed vegetables, potato salad on the side\n{*Sound effect: food cooking*}\nYou could smell the bread in the oven far and wide\nNatural juices and water purified\nOrganic fruits brought from the countryside\nWith silver forks and knives placed side by side\n{*Sound effect: silverware clinks*}\nYou could not be dissatisfied;\nLooking out the window staring at the mountainside,\nYou would have died\n6:59 she's swollen with pride\nAs the moment intensified, there's a knock from outside\n{*Sound effect: door knocking*}\nShe opens the door, for the teacher has arrived\n{*Sound effect: door creaks open*}\nBut to her surprise, it was a bum who cried\n\"Please, I smelt the bread from outside!\nOne piece,\" and then she replied\n\"The teacher is coming, he's soon to have arrived.\nYou're making me look bad, come on now, step aside!\"\nThe bum then replied,\n\"When I say I'm hungry I haven't lied.\nGive me some of that chicken that you just fried.\"\n{*Sound effect: food cooking*}\nShe replied, \"Chicken - fried?\nNo that's for the teacher, you're not purified\"\nThen she slammed the door and went back inside\n{*Sound effect: door closes*}\nSat on the couch with the TV Guide\nShe looked at the clock, it was 7:09, then 7:30;\nHe still hasn't arrived\nEight o'clock, she's on the downside\nNine o'clock, by now she's teary-eyed\nShe's pissed off and her anger multiplied\nShe cried, then fell asleep dissatisfied\nNext day she woke up, and was preoccupied\nWith meeting the mystical teacher who lied\nWhere could he hide?\nShe ran down by the seaside\n{*Sound effect: seagulls*}\nHe was there teaching about - false pride\n\"You lied!\" she replied, \"You lied!\nYou said you'd be there at seven o'clock, you lied!\"\nHe replied, \"No I have not lied.\nI came at 6:59, and you told me to move aside.\nI asked for bread and the chicken that was fried.\n{*Sound effect: food cooking*}\nAnd you said, that I wasn't purified.\"\nShe replied, \"I wasn't notified!\nI had no idea that you was the bum that cried!\"\nAnd the teacher sighed, then replied,\n\"This concludes our lesson on false pride.\"\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "Me Man", "href": "Me_Man&&7958", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One)\nYou told me man, you need me man\nWho the teacher me man, who gon' lead you me man\nWho gon' free you me man, well not mostly me man\nBut come up close to me man, make a toast with me man\nI'm not starvin me man, I be feedin me man\nYou won't be seein me man, 'cause I be bookin me man\nThem lights be hookin me man, while people look at me man\nThey sing the hooks with me man, yo read this book with me man\nHow these rappers slash actors wanna fuck with me man\nWhen we be up inside the spot they be duckin me man\nI be movin me man, showin and provin me man\nMy wife is soothin me man, yo' life is new to me man\n\n(Minister Server)\nAiyyo what's goin' on this is Minister Server\nNow you've been readin the books, seein the lectures\nHearin the CD's watchin the tapes\nNow's the time for you to get rid of your fears\nAiyyo teacher tell 'em what's going on\n\n(KRS-One)\nYou see me man, it don't take much to be me man\nI just stay extra focused on the G-O-D in me man\nNot too many ahead of me man\nIf rappers were television channels I'd be C-SPAN, believe me man\nDon't nobody sound like me man, I'm a free man\nFor that golden age hip-hop, you know you gotta see me man\nFrom 1973 man, to 1993 man\nIf you unaware of them 20 years you won't understand me man\nSo here's the plan for you and me man\nHip-Hop is not a product to be bought and sold\nHip-Hop is you and me man\nSo in the years to come you gonna see me man\nOn top of a Shaquille like Leland\nAnd you gonna be right there with me man\nAs you can see man I got S-T-Y-L-E man\nWhy for 17 years you already knew this about me man\nSo you be you man, and I'll be me man\nBut remember Knowledge Reigns Supreme - yup, that's me man!\n\n", "album": {"title": "Keep_Right_(2004)&&4989", "genre": "Hip Hop", "year": 2004}}, {"title": "Doth Thou Know", "href": "Doth_Thou_Know&&2526", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One)\nThou knowest not what thou sayeth in speech?\nDoth thou know what thou teacheth to each?\nFrom thine own mouth, thy corrupt thine own house\nThy corrupt thine siblings and thine own spouse\nSatan has hold of thy spirit\nSo evil has hold of thy lyric\nWhomsoever shall hear it shall adapt it\nAnd walk the talk of evil just as ye rapped it\nBut I cometh forth today to say thus\nEvil is an illusion, in GOD we trust\nIn Satan we lust\nCoveting thy brother's vehicle while riding the bus\nFeeling unjust\nTrust not sinners in the flesh they aren't winners\nBut in the spirit they art children, beginners\nEat not of the dinner they serve\nSeek the experienced MC, not the beginners in word\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "Krush Them", "href": "Krush_Them&&1952", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One)\nWe crush, them, and they click\nLet me tell you right now what you supposed to get\nYou supposed to get free and intelligent\nNot a platinum plaque, that's irrelevant\nWe CRUSH, THEM, and they crew\nLet me tell you right now what you supposed to do\nWhile they floss with the chi-ching and all the rings\nYou stay focused, keep doin' your thing\nYou cannot get the diamond ring, if you can't really sing\nOr if you haven't got a skill, that you ready to fling\nWhat you bringin' to the table if you not really able\nTryin' to get to the top, like the Tower of Babel\nBack in the days, remember all the old gold cables\nWhere they at now? Sold, when they dropped from the label\nAll the money they gave you made you very unstable\nThey really enslaved but you wasn't able with the coke in your nasal\nTo see, you up in the crib but they rockin' your cradle\nYou a joke and you fatal, they made you an M.C.\nMeaning: Most Confused\nNot E-M-C-E-E, that's what I use\nMany people really wanna know from me\nWhen I'ma drop and they can go cop, the next LP\nOr CD, or T-A-P-E you see\nIt's about word of mouth, for me\n\nWe crush, them, and they click\nLet me tell you right now what you supposed to get\nYou supposed to get free and intelligent\nNot a platinum plaque, that's irrelevant\nWe CRUSH, THEM, and they rap\nYo, they don't really know where the money is at\nAnd what's funny is that, is if you'd just stay focused\nThey'd be the one to be the brokest!\nI'm from the inner city, that's right\nFlashy asses and titties that's right\nNo pity mad graffiti that's right\nBroken gang treaties, that's real\nI speak complete broken slang freely at will\nI spit what I'm about to spit, get what I'm about to get\nNever no counterfeit, movin about a bit\nKnowledge Reigns Supreme, only a few like the sound of it\nOthers can't get down with it (ONE... TWO... THREE... BREAK!)\nSo why did I have to come off my sabbatical?\nBattle you? My metachromatical will splatter you\nI got another track to do, I can't mack witchu\nYour rhymes are fictional, mine are factual\nI'll embarrass you, I'm glad to do\nI'm the teacher but in the streets it can be bad for you\nI feel sad for you, cause you frontin like you gettin' ahead\nBut you really on E instead\nI've come to show these people you're not my equal\nAll you want is the cash and a hoe in a see-through\nYeah; KRS-One comin' through with the breeze team\nYou know how we do\n\nWe crush, them, and they click\nLet me tell you right now what you supposed to get\nYou supposed to get free and intelligent\nNot a platinum plaque, that's irrelevant\nYo we crush them, and they squad\nLet me tell you right now that it's all about God\nYou can walk around the streets like you livin' it hard\nBut a real teacher know when you scarred\nI refuse to be bought, I refuse to snooze\nI refuse to come up short, I refuse to lose\nI refuse to be caught in the court\nI refuse to refuse bein taught, I refuse evil thoughts\n'Cause they whole {shit's} wack, trap's wack\nYou're wack, you're pack's wack, in fact I jab-slap that\nCap at that, now, retract that crap, wherever I'm in or at\nYou better go back and sip that crap\nBring your gat, I'm lovin' that\nLike football, you'll be, runnin-back\nBlazin' 'em, merely dazin 'em, barely playin' 'em out\nThese are God's lyrics, I'm just sayin' 'em out\n\nWe crush, them, and they click\nLet me tell you right now what you supposed to get\nYou supposed to get free and intelligent\nNot a platinum plaque, that's irrelevant\nWe CRUSH, THEM, and they crew\nLet me tell you right now what you supposed to do\nYou supposed to be buttoned up right to your neck\nIf you a woman, you'll get respect\nLet me tell you we crush the, and they crew\nLet me tell you right now what you supposed to be\nYou supposed to be a man of integrity\nAbove the law, you effect destiny\nWe CRUSH, THEM, and they lies\nThis is conscious rap, we not hypnotized\nAnywhere the action's at, we rappin' at\nTakin' it home and unpackin that-that-that\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "Just To Prove A Point", "href": "Just_To_Prove_A_Point&&7342", "artist": {"unique_name": "KRS-One"}, "lyrics": "Tell me right now, tell me what&#25263; wrong\nPlease tell me something before I&#25254; gone\nIt seems like we have come to the end\nShould I be listening to all my friends\n\nIs it true what they say?\nIs it true what they say?\nIs it true what they say?\nIs it true what they say?\n\nI&#25186; hearing things like you&#25185;l be sleeping creeping behind my back\nYou might be laughin' might be jokin but i&#25186; thinkin' it&#25204; wack\nIf we are over let&#25204; be over and let&#25204; leave it at that\nSee I can&#25205; trust you anymore because your love is an act\n\nIs it true what they say?\nIs it true what they say?\nIs it true what they say?\n\nJust who do you, think I really am?\nOne of your mindless and stupid friends?\nWhy can&#25264; you simply tell me the truth?\nSo I can hold you, or cut you loose?\n\nI&#25186; not the type to listen to what everybody will say\nBut more and more it&#25204; seemin that I can&#25205; trust you anyway\nYou make me think that I must sleep with somethin' over my head\nFor fear I wake up in a pool of blood and probably dead\nHow are we livin' how are we livin' it seems\nYou are not givin' what you gave in the beginning\nHow are we livin' how are we livin' it seems\nYou are not givin' what you gave in the beginning\n\nIs it true what they say?\nIs it true what they say?\nIs it true what they say?\n\nI&#25186; hearing things like you&#25185;l be sleeping creeping behind my back\nYou might be laughing might be joking but i&#25186; thinking it&#25204; wack\nIf we are over let&#25204; be over and let&#25204; leave it at that\nSee I can&#25205; trust you anymore because your love is an act\nI&#25186; not the type to listen to what everybody will say\nBut more and more it&#25204; seemin that I can&#25205; trust you anyway\nYou make me think that I must sleep with somethin' over my head\nFor fear I wake up in a pool of blood and probably dead\n\nProbably dead!\nProbably dead.\nProbably dead...\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "Can't Stop, Won't Stop", "href": "Can%27t_Stop,_Won%27t_Stop&&5076", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One)\nOpen a de herb gate sellin pure ganja\nBabylon come but they undercova\nThey never really want me stop sell ganja\n(They just wanna take a cut of what you make so far!)\nBut I'm not havin' it, I load the SLR\nPack the ganja BOOM! They break down the door\nPop-pop! T'ree shots, exchanged at close range\nOut of three Babylon, me hit one in the brain\nPop-pop! Two shots hit da window pane\nI exchanged four shots, I drop and feel pain\nBut I'm not hit, into the bathroom I crawl\nI look out the window, it's a one story fall\nI'm fallin', hit the ground and start crawlin\nSoon I'm walkin' 'round, blendin in with the crowd\nAnother day, I got away, I gotta fix this problem someday\nBut the very next day...\n\n(Chorus: repeat 2X)\nCan't stop, won't stop - sellin mad izm\nAll competition - I gots to get wit 'em\nMe nah go jail and me nah go prison\n(Take it to his face kid, diss him!)\n\n(KRS-One)\nI'm in another herb gate like a superstar\nEleven A.M., things are safe so far\nI used to worry 'bout the competition on the block\nBut now the competition on the block is the cops\nAnd even block watch doesn't know where we lay\nWell... (\"Open up! It's the D.E.A.!\")\nAww man, just when I went for more lead\nThe door opens up, I got a glock to my forehead\n(\"Get down! Get on the floor!\") I felt the stick, I thought I was dead\nBut I woke up instead in a cell layin on my bed\nI lay back down, then I heard the crack sound\nTwo D.T.'s came in and laid they glocks down\nOne was whistlin a love song, as he put some gloves on\nI thought to myself, damn something's wrong\nBoom bap! Boom ba, p against my head\nI fell back on the bed, down to his feet\nThe pain was insane but the hit was sweet\nCause these dumb-ass cops punched me right by the heat\nThe glock, two shots, three shots they screamin\nThen someone said... (\"Hey wake up kid, you're dreamin'!\")\nI said, \"Yo dreamin'?! That nightmare was hell\"\nBut as I look around, I was still in my cell\nDamn, I got myself caught up in a jam\nThe D.T. that woke me up was like, WHAT?!\nI wiped the saliva, off my mouth\nThe D.T. said... (\"Let's make a deal\") No doubt!\nNo question, now we started up the session\nNo need for guessin, yes they want my supplier\nI said, what makes you think there's anyone higher?\nHe said... (\"Don't be a God damned liar!\")\nYou killed three D.T.'s yesterday, you heard me\nBut still the cops you knocked off yeah was dirty\nNow the whole investigation is federal\nWe want you to point out, the rest of the cops that are criminal\nHe continued to say, you can't think it through\nThis whole drug game is BIGGER than you!\nFollow our plan man and you'll be free\nLet me explain one thing so you can see, we\n\n(KRS-One)\nNow I'm back in the herb gate, all wired up\nConstantly thinkin' about bein tied up\nSnap out of it - I'm thinkin', \"Damn we like elves!\nThe federal and local cops got wars with themselves;\nAnd I'm in the middle, and can't solve the riddle.\nMy nose is runny..\" {*knock at door*} (\"Let me get a 20!\")\nA 20 of the green or a 20 of the brown?\n(\"Gimme the whole pound, clown, or duck down!\") {*gunfire*}\nGod damn, God damn, here we go again\nBut this time I'm set up by my federal friend\nSuddenly I hear... (\"Yo, move from the door!\") {*two shots*}\nFollowed by the shot sounded like a four-four {*two shots*}\nAfter the violence, then there was silence\nThen I heard... (\"Hey yo it's us, open up the door!\")\nBut rule number one in this game is self-reliance\nSo I picked up the mini-mac in case they wanted more\nThe door opened up, the feds said WHATTUP?\nThey was stickin you up, so they had to get bucked\nSuddenly a sense of trust came over me\nI thought to myself, \"Well soon I'll be free!\"\nBut as I turned around, I heard the gun go click {*clik-clak*}\nI said wait, but it was too late - {*GUNSHOT*}\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "Feel This", "href": "Feel_This&&1082", "artist": {"unique_name": "KRS-One"}, "lyrics": "Get 'em, get 'em (yeah yeah!)\nGet 'em, get 'em (that's B &amp; NYCE)\nGet 'em, get 'em (ha ha)\nGet 'em, get 'em\n\n(Chorus: KRS-One)\nLet's go, let's start the show\nContracts and dough, you came to hear Kris\nLet's go, let's start the show\nWatch how I flow, you came to feel this\nLet's go, live MC rappin'\nCut mix and scratchin, you came to see me\nLet's go, let's make it happen\nFor your satisfaction, you came to be free\n\n(KRS-One)\nFrom all the bull, from all the push, from all the pull\nFrom all the critics and the cynics that there happens to be\nRelax from the attacks, there's no battlin me\nWrite whatever you like, I will rattle you G\nNo hassle for me, with the freestyle skill\nBelieve I'm ill, chill, I be surpassin MC's\nAin't too many faster than me man\nNeck movin, sweat oozin, schoolin, that's how we jam\nI write with a free hand, I write with a purpose\nIf you bought the CD, thanks for the purchase\nIf you downloaded the album then COME to the concert\nDon't sit in front of the computer till your eye hurt\nGet up, get out, and join the movement\nHip-Hop culture is more than music\nAnd I'ma prove it, whether freestyle or written\nAx yourself how KRS still spittin'\n\n(NYCE)\nMe and my niggaz go to the club with hooded jeans and boots\nFuck a dress code, fuck a tie, fuck your shoes and suits\nWe rock doo rags to fitteds, and throwback jerseys\nFront pockets with cash, paint a wall with a slash\nGettin' our drink on, burnin trees, eyes lookin' Japanese\nWhylin out because the DJ threw on M.O.P.\nPeepin how the ballers with the gators is hatin'\nBut fuck what they be talkin' this is straight from the streets\nThey got war comin' out they mouth but they don't want beef\nCause yo I snatch them outta they ride, click click, surprise\nRun your jewels, your shoes, before you make tonight's news\nAll downs are bet, and I'm playin' for keeps\nActin' like you gon' scheme, then my man gon' squeeze\nWord to the {?} 'cause I knows you don't want it\nYou be up in, {?} tear while I be, everywhere\nYeah, it's like that what?\n\n", "album": {"title": "Keep_Right_(2004)&&4989", "genre": "Hip Hop", "year": 2004}}, {"title": "Ova Here", "href": "Ova_Here&&5068", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One: speaking live)\nFirst of all, I don't know <i>who</i> y'all saw on this stage before me, aight?\nI don't know <i>who</i> y'all gonna see on this stage after me, true?\nBut <i>this</i> is REAL HIP HOP! Worrrrrd UP!\nI'm gonna find out tonight, where the real hip-hop\n\n[Hook] + (live response)\nThe real hip hop is ova (Here!)\nThe real hip hop is ova (Here!)\nThe real hip hop is ova (Here!)\nThe real hip hop is ova (Here!)\n\nBlaow Blaow! Blaow Blaow! Clear 'em out clear 'em out! Word!\n\nYo Nelly! You ain't Fo'Reel and you ain't Universal\nYour whole style sounds like a N'Sync commercial\nIgnoramus\nI'm the baddest\nWith the mic apparatus\nChallengin' the God of rap is madness\nI'll snatch your status\nWith this ugly lookin' billboard you could stop them\nBut I got enough albums to make my own top ten\nYou limited, like the spread of traffic\nYou bite my style off the radio so when you speak you bet I hear the static\nYou better chill out like Chuck, I kick like three Norrises\nOne of my sixteen bar rhymes is eight of your choruses\nOf course it is ridiculous\nWatch out, I be in the club inconspicuous\nGotcha on your hands and knees!\nAin't it about time for some real MCs?\n\n[Hook] + (live response)\nThe real hip hop is ova (Here!)\nThe real hip hop is ova (Here!)\nThe real hip hop is ova (Here!)\nThe real hip hop is ova (Here!)\n\n(Uh!) Uh! We on the hunt tonight\nWhen you see me comin', I don't front - I fight\nPeople say I'm contradictin, 'cause I'm all about peace\nTo say the least\nWith a violent history\nIt ain't no mystery\nThese rappers wanna get with me\nMy people don't see that; all they hear is: \"Stop hittin' me!\nStop beatin' me KRS!\"\nYou want to help my career, Nelly? Well, you can help if you don't exist!\nI think it's 'bout time we stop these pop-rappers\nFuck these pop-rappers!\nHip-hop DOES matter to me!\nDoes it matter to you,\nMy crew?\nIf it does, you know what the hell to do:\nThrow your guns in the air!\nPump it like, \"yeah!\"\nLet these bitch ass rappers know we in here!\nGo to the shows huh, boo 'em off stage\nTell 'em KRS told you they at the end of they days!\nLet me tell you: let's give hip-hop a lift,\nAnd don't buy Nelly's album on June 25th\nThat'll send a message to all them sellouts\nHouse nigga rapper, your bottom done fell out\nYou don't even know how!\nI told you: I wasn't talkin' about you then, but I'm talkin' about you now!\nBlaow! one to the knees! Blaow! one goes right through!\nEven St. Louis don't like you!\n\n", "album": {"title": "The_Mix_Tape_(2002)&&6676", "genre": "Hip Hop", "year": 2002}}, {"title": "HipHop Knowledge", "href": "HipHop_Knowledge&&3604", "artist": {"unique_name": "KRS-One"}, "lyrics": "You know... life is funny...\nIf you don't repeat the actions of your own success\nYou won't be successful\nYou gotta know your own formula, your own ingredients\nWhat made you, YOU...\n\n1987 I was at the Latin Quarters\nListenin to Afrika Bambaata give the order\nThe call of the order was to avoid the slaughter\nHe said, \"Record companies ain't got nuttin for ya!\"\nWithout a lawyer, he taught The Infinity Lessons\nIn how hip-hop could be a, many a blessing\nAnd that was great, so in 1988\nThere was no debate, we had to end the hate\nThe name of the game was \"Stop the Violence\"\nAnd unity, knowledge, and self-reliance\nWe - started talkin' bout Martin and Malcolm\nHad these ghetto kids goin', \"Huh, what about him?\"\n1989, Professor Griff speaks his mind\nBut his freedom of speech is declined\n1990 came with the West coast\nEast coast, West coast, who is the best coast?\nLookin' back now, of COURSE it was bogus\nThe whole argument was where we lost focus\nWe got hopeless; not with the lyrics and music\nBut with hip-hop, and how we used it\nOr abused it, you know how the crew get\n\"You like it cause you choose it\"\n1991, we opened our eyes\nWith Human Education Against Lies, we tried\nTo talk about the state of humanity\nBut all these others rappers got mad at me\nThey called me \"Captain Human\", another message was sent\n\"Self Destruction don't pay the {fuckin} rent\"\nRemember that? Nobody wanted conscious rap\nIt was like - where these ballers at?\nWhere can they call us at? All was wack\nHip-Hop culture was fallin' flat and that was that\nSo in 1992, I found my crew\nThey said, \"Yo Kris, what you wanna do?\"\nI said, \"Damn - why they wanna get with me?\nIf I bust they {shit} I'm contradictory.\nIf I play the bitch role, they take my shoe.\nTell me what the {fuck} am I supposed to do?\"\nSo I did it, don't stop get it get it get it\nAll of a sudden these critics they wanna spit it\n\"Kay Are Ess One is con-tra-dic-to-ry\"\nJust 'cause I wouldn't let these rappers get with me\n{Fuck} that, {fuck} you and {fuck} your pen\nIf a rapper wanna diss, yo I'd do it again\nBut I'm makin' these ends, and I got my friends\nAnd I really don't wanna have to sit in the pen\nSo I go back to the philosopher\n1993 hip-hop is uh... wack\nGo back, check the facts\n1994, \"Return of the Boom Bap\"\nIt wasn't all about the loot\nIt was all about Harry Allen Rhythm Cultural Institute\nBlowin' up, 1995\nConscious rap is still alive\nBut nobody wanna play it, nobody wanna say it\nNobody okayed it, they'd all rather hate it\n1996 it really don't stop\nWe put together somethin' called the Temple of Hip-Hop\nNot just DJin, breakin, graf and lyrics\nBut how hip-hop affects the spirit\n\"Step Into a World,\" that's what I did\n1997 I was raisin my kid\nOr kids, but I, had to go\nCause New York DJ's changed the flows\nTo clothes and hoes, but that wasn't me\nI'll be damned if I dance for the MTV\nSo in 1998 I began to debate\nShould I go now, or should I really wait?\n'99, I moved to L.A. you see\nAnd took a gig with the WB\nStarted studyin philosophy full-time\nTo have a full heart, full body, full mind\nBut you know what the problem is or was?\nDJ's don't raise our kids, 'cause\nThey so caught up in the cash and jewels\nHow they gonna really see a hip-hop school?\nHow they gonna really see a hip-hop temple?\nThey don't even wanna play my instrumentals, but\nBig up Dr. Dre, Snoop, Xzibit\nEspecially Xzibit, he was there in a minute\nMic Conception, all of them, said\n\"Yo you need help? I should call them\"\nWhen I was in L.A., I held the crown\nBloods, Crips, they held me down\nI could never forget Mad Lion, killer pride\nWith the gat in the lap in the low-ride\nOh I can't forget, Icy Ice, Lucky Lou\nJulio G, that was the crew\nDavey D, Ingrid, David Connor\nThe list goes on and on, let me tell ya\nFredWreck, and my man Protest\nMuch respect, no less\nTo my spiritual and mental defenders\nBig up to L.A., temple members\nBut in 2000, I seen how I wanted to live\nI wasn't no executive\nSo I picked up the mic and I quit my job\nSaid to Simone I gotta get with God\nShe said, \"Don't worry bout these dollars and quarters.\nRecord companies ain't got nuttin for ya.\"\nDamn, she took me back to Bam!\nTook me back to who I am!\nBrought me back to the New York land!\nNow I overstand!..\n\n{Interviewer}\nNow KRS-One, now you've been quoted as saying that\nRap is something we do, hip-hop is something you live.\n{KRS} Yes!\n{Interviewer}\nExplain that to us please.\n{KRS-One}\nWell, well, today hip-hop, we are advocating that hip-hop is not,\nJust a music, it is an attitude, it is an awareness, it is a way\nTo view the world. So rap music, is something we do, but HIP-HOP,\nIs something we live. And we look at hip-hop, in it's 9 elements;\nWhich is breaking, emceeing, graffiti art, deejaying, beatboxing,\nStreet fashion, street language, street knowledge, and street\nEntrepenurialism - trade and business. And uh, that's where y'know\nThat's the hip-hop that that that we're about. We come from the uh\nThe root of, of Kool DJ Herc, who originated hip-hop in the early 70's\nAnd then Afrika Bambaata and Zulu Nation (mmhmm)\nWho instigated something called The Infinity Lessons\nAnd added consciousness to hip-hop, and then Grandmaster Flash\nWith the invention of the mixer, on to Run-D.M.C. and then myself.\nAnd uh, we created the \"Stop the Violence\" movement, you may recall\nA song, \"Self Destruction\" and and and so on. All of this, goes to\nUh uh, the idea of LIVING this culture out and taking responsibility\nFor how it looks and and acts in society.\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "How Bad Do You Want It", "href": "How_Bad_Do_You_Want_It&&8741", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS)\nYo, my man, how bad do you want it?\nYou know how many cats I threw the pitch, and they never caught it?\nI told them to bring they lyric, but they never brought it\nScared to get ripped off, cheated, deleted, rejected and shorted?\nYo, how bad do you want it?\nFear&#243;I ain't got no time for it\nIf you want it, yo there's the track&#243;put your rhyme on it!\n\n(Peedo)\nThis hunger inside of me's unexplainable, Kris\nThe struggle we put in this box will be put into disc\nBirth and ever, these family problems is hurtin'\nBoth of my sisters is pregnant, fuckin' feel like murkin'\nAll I have is my word and my balls\nAnd my fam and my music speaks for them all\nIt's the Dominican animal ready to damage, you puttin'\nPressure to rappers that think they can challenge you, Kris (uh huh)\nWe been through it all, the grimiest days, this earth ain't\nReady for my brain, comin' to face (word)\nEveryone plus everyone\nDo you hear me, KRS-One?\n\n(KRS)\nWell listen\nYou grimy and hungry?\nBut how long you gonn' trust me?\nYou really down for this cause or just chasin' the money?\nI be up in them spots to be hot, so dusty and ugly\nNothin' be funny, it's all dark, nothin' sunny\nCan you walk with me? Talk with me? Pop the cork with me?\nWhen we in other cities, will you rep New York with me? (yeah!)\nI need respect and honor\nDiscipline and no drama\nHow bad you want it, poppa? (with all my)\n\n(Peedo)\nLoyalty is the key to it all (remember)\nGet used to my face, we the winners of all\nBy mi gente, yo I go low to say-ah\nReal like them Washington Heights\nNiggaz there (say yeah!)\n\n(KRS)\nAfter you rap, will you stab my back? (never)\nYou gimme a track, will you take that back? (never)\nI give the word, yo you bustin' your Gatt? (whatever)\nRespect from your crew? They livin' like that? (they better)\nThis is no game! Why should I make you popular?\nYou know I'm the philosopha\nHow bad do you want it?\nHow bad do you need it?\nIf you see it, you can believe it, perceive it, retrieve it and flaunt it\nHow bad do you want, doggone it, there's the track, if you want it\nYou got to put your rhyme on it!\n\n(Peedo)\nHow bad do I want it? I'm ready to die like Big\nA serious man with blood in my eyes for this\nSuccess doesn't come overnight\nIt's gonna be dark a while until I see light (that's right!)\nWhat is it?\n\n(KRS)\nThis is no game, why should I do it?\nKRS-One, me and Peedo runnin' through it\nI saw you down the street in FedEx\nYou said you had the beats was comin', like \"I Got Next\"\nSo we went upstairs, my man Choco hooked it up\nThis is KRS-One&#243;turn my voice up! Wha&#243; (wha-, wha-)\nHow bad do you want it?\nHow bad do you see it?\nHow bad do you hear it?\nHow bad do you BELIEVE you can be it?\nIf you doubt, then you're out\nIf you believe, you can achieve\nI got the city on lock, but I'm gonna hand you the Keys like Alicia\nYou know my style, you know I'm the teacha\nPhilosopha, minister, emcee, Hiphop's spiritual leader\nWith the heater\nYou comin' with me? You runnin' with me?\nIn the spirit Scott LaRock, JMJ and Pun is with me\nYo, cats be steppin' to me ALL the time\nWith the rawest rhyme\nBut two weeks later, they fall to crime\nIf you listenin' to this song, and you want to be put on\nYou must be loyal to the cats that made you strong\nIt could be your friend, your father, you sister, your mother, your brother\nOr some other\nJust remember the days when YOU was under!\nBefore the Hummer, before the Benz\nBefore the hundreds, before the fifties, the twenties and tens\nWhen you was thirsty, remember the living water, and who poured it\nNow ask yourself, how bad do you want it?\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "Things Is About To Change", "href": "Things_Is_About_To_Change&&5003", "artist": {"unique_name": "KRS-One"}, "lyrics": "Word... we stand out, word\nWe don't wanna sound like that bullshit\n\n(KRS-One)\nLet 'em all be aware, not at all will I care\nYou gotta know it's about the flow when you comin' in here\nNot how long is your hair, but how long were you here\nHow many dues you paid, crews you slayed, yeah\nHow many clubs you done rocked, f'real\nYou ever rocked outside with cats poppin' they steel?\nYou fake like Ma-Ma-Ma-Max Headroom\nYou go from the bedroom to the studio back to the bedroom\nWe be on the front line, pavin the way\nFor you to do what you do, get what you get, say what you say\nFlip what you flip, play what you play at the Grammy's\nBut you don't represent our family, you a thief!\n\n(Chorus: KRS-One)\nAll up and down the East coast\nThings is about to change\nAll up and down the West coast, down in the South\nThings is about to change\nAll up top and in North Canada, make some noise\nThings is about to change\nAll my cats in London, Birmingham, Brixton, word!\nThings is about to change\n\n(KRS-One)\nJoin the campaign to rearrange the rap game\nDon't look at me like I'm insane, the facts remain plain\nYou to blame, when you take it in vein\nThe gains and struggles and pains of those that already came\nFrom the beginning we tried to attain, the money and fame\nThat's not new to the game, it's still the same\nBut what seems to change is the loyalty\nRappers degrade hip-hop for a royalty\nIt's all about me and my click and we ballin G\nBut we fallin', stallin our callin to be free\nYou can't see, they're gonna judge our poetry\nIn two-thousand and twenty-three, where will your money be?\nWhere will your Benz be? Your friends be?\nYour beginnin be? Your end be? Gently\nYou tell me to my face my style you envy\nBut behind my back you condemn me, you a thief!\n\n(Chorus: KRS-One)\nAll out in Germany, Africa\nThings is about to change\nWord up, hip-hop, join the nation, movin!\nThings is about to change\nWord up, all them fake-ass whack rappers, word up!\nThings is about to change\nTell 'em, go to they shows and let 'em know it's like this\nThings is about to change\n\n(KRS-One)\nFor sure, it's the people that defend me\nYeah you on MTV, but did you know Ted Demme?\nWhat about Fab 5 Freddy, Red Alert?\nYou not ready... ready... ready... {*fades*}\n\n{*Ends with sound of glass shattering*}\n\n", "album": {"title": "The_Mix_Tape_(2002)&&6676", "genre": "Hip Hop", "year": 2002}}, {"title": "Over Ya Head", "href": "Over_Ya_Head&&5737", "artist": {"unique_name": "KRS-One"}, "lyrics": "But am I over ya head?\nAm I over ya head?\nBut am I over ya head?\nYo am I over ya head?\nBut am I over ya head?\nAm I over ya head?\nWell am I over ya head?\nYo am I over ya head?\n\nHuh? What? Where? Who?\nWhat? Whattyathinkinabout\nWhen who says what when how\nYou can't maybe follow my style\nYou be the child, I be the teacher\nSmile, who said when, what\nMouth not shut, what?\nWhenever however whenever\nWhatever the cut\nHow you maybe could you ever\nBelieve, that you could so quickly achieve\nThese crafts, please laugh at his stupid ass\nUpon your knees in glass\nYou lust, for everything but trust\nSo we bust back, with consciously charged art\nWith a mic instead of a brush\n\nBut am I over ya head?\nAm I over ya head?\nBut am I over ya head?\nYo am I over ya head?\nAm I over ya head?\nYo am I over your head?\nYo am I over ya head?\nListen...\n\nYes, us must trust us, who? Us must trust\nNot fuss with us, us must trust us discuss trusting us\nUs must trust us, who? Us must trust\nNot fuss with us, us must trust us discuss thus trusting us\nTrusting us, us must trust discuss\nDiscuss not trusting us must not fuss\nUs with us means us discussing trusting us\nUs must trust us, who? Us must trust\nNot fuss with us, us must discuss trusting us\n\nBut am I over ya head?\nYo am I over your head?\nBut am I over ya head?\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "Illegal Business Remix 2004", "href": "Illegal_Business_Remix_2004&&7095", "artist": {"unique_name": "KRS-One"}, "lyrics": "Ha! Ha! Huh! Huh! What's this?\nYo, huh, huh, huh\n\n(Verse One)\nI'm the one that steps in the club, ya not see it\nGivin' dap, givin' pounds and hugs, ya not see it\nIn the club I'm not lookin' for love, ya not see it\nGimme the mic and I'll show you whassup, better believe it\nI'm not at the bar, whatever the pub, ya not see it\nStill they sendin me these bottles of bub, ya not see it\nBut I will open the minds of thugs, ya not see it\nWho you think really bring in the drugs, ya not see it\n60 million people smokin' the bud, ya not see it\nCause the American way of life is bugged, ya not see it\nYou never peep it, yo this ain't a secret, ya not see it\nThey confiscate it, resell it, you retrieve it, ya not see it!\nSo believe it while you sit there weeded, ya not see it\nHip-Hop culture who gonna lead it, ya not see it\nK, R, S One, ya not see it\nPeace love unity and havin' the fun, ya not see it\n\nCocaine business control America\nGanja business control America\nKRS-One still causin hysteria\nIllegal business control America\nDiamond business control America\nThe oil business control America\nKRS-One still causin hysteria\nIllegal business control America\n\n(Verse Two)\nYo, rise up brother, raise up sister\nVisualize wealth, put yourself in the picture\nVery few cats gon' tell you the half, ya not see it\n'Cause they're really only after the cash, ya not see it\nBut they wind up sellin they own ass\nOne album, two album, they gone they don't last\nSo hold on a minute now, don't be so fast\nKnowledge Reigns Supreme with me ya won't crash\nHa, I'm the cat that spits the raw, ya not see it\nThey can't believe when I hit the tour, ya not see it\nI'm not ready to retire for sure, ya not see it\nI'm from the 70's, I'm down by law, ya not see it\nWe passed fliers door to door, ya not see it\nPopularity's growin' more and more, ya not see it\nConscious rap where the heart is at, ya not see it\nWe be screamin WHERE THE PARTY AT, ya not see it\nBut instead of the Bacardi sack, ya not see it\nFallin' out in the party in the back, ya not see it\nLet me show you where the art is at, ya not see it\nPut down your money I'm takin' all of that, ya not see it\nAll the clubs they be callin me back, ya not see it\nI'm never short 'cause I'm taller than that, ya not see it\nI'm only showin you the other way out\nMaybe I'm preachin but this is what love is about, ya not see it\n\n(Verse Three)\nKRS, I speak when I must\nThis that official underground rap, this you can trust\nI stand outside the industry and there's many of us\nTalkin' mad shit but for those who not bilingual, plenty of stuff\nMy whole crew is why you can't get with any of us\nReason I'm not on TV 'cause I'm not sellin you nothin'\nI'm not rhymin for a Bentley or a house this plush\nI spit for the conscious, what about us?\nTime's up, time to open that mind up\nTemple of Hip-Hop sign up, devils we bind up\nWhen I'm up rhymin cuts your spirit hear it and shines up\nClimb up before you wind up takin'\n\n{*Scratching*}\n\n(Chorus - minus instrumental)\n\n", "album": {"title": "Keep_Right_(2004)&&4989", "genre": "Hip Hop", "year": 2004}}, {"title": "4th Quarter - Free Throws", "href": "4th_Quarter_-_Free_Throws&&8505", "artist": {"unique_name": "KRS-One"}, "lyrics": "Yeah, listen to the lyrics\nWe are the ones prophesized to return\nMy main concern is for all of you to learn\nHow to live, yes through the lyrics I give and send my friend\nThis age is coming to an end\nNot the world, but the age is ending\nEnding, listen to the astrological message I'm sending\nI'm sending, tell em\nTruth is truth, whether or not you like me\nWe are living now in the age of Pisces\nWhen Pisces is over, at the year two thousand\nWhen the Sun of God, changes his house and\nEnters the Age of Aquarius\nThe Sun of God as man is hilarious (okay)\nWhen you think of Jesus, think of the Sun\nThe flaming Sun, that's where they stole this concept from\nStop believing and read your bible logically\nThe new testament is really old astrology\nJesus is the son of God no lie\nBut they might be talking about the Sun up in the sky\nThe Sun, that hangs on the cross of the zodiac\nThe zodiac with twelve signs to be exact\nEach sign is a house, and you should keep in mind\nEach house equals, a period of time\nThe time, two thousand years and that's a fact\nIt's called an age or a house in the zodiac\nThe twelve disciples, are twelve months of reason\nThe four gospels signify the four seasons\nWhen Jesus fed the multitude with two fishes\nIt signified the Age of Pisces, not fish or dishes\nIf you read the bible astrologically it's clearer (no doubt)\nThe next age will be the age of the water-bearer\nIt's called the Age of Aquarius (word)\nWhen logic and truth will take care of us\nSo in this age, of spiritual dignity\nYou'll see a rise in femininity\nAnd creativity, meshed with masculinity\nYou got to get with me, this is your true her-story (rrry!)\nDo you wanna go higher...\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "The Movement", "href": "The_Movement&&5860", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One)\nWhere the real at!\nWhere the real at!\nYeah!\n\n(KRS-one)\nYo\nWhere I come from gats bust for nothin'\nThugs, ministers, cops, teachers, all be hustlin'\nYour family's the only one ya trustin'\nClubs be jumpin', redesigned cars be bumpin'\nNow there's ranks supreme KRS is a free man\nIn Hip-Hop culture, I'm like Allen Greenspan\nI tell the culture what's hot and what's not\nNow look who's on top and look whose shit just dropped\nWe ain't about sellin' records, we ain't music merchants\nWe emcees we go straight to the club and hurt shit\n\nNew York, New Jers', Boston, COME ON!\nCalifornia, D.C., Baltimore, COME ON!\nTexas, Atlanta, New Orleans, COME ON!\nPhilly to Chicago, Carolinas, COME ON!\nMemphis to Nashville, Colorado, COME ON!\nDetroit to Pittsburgh, Cincinnati, COME ON!\nSeattle to Miami, Arizona, COME ON!\nSan Fran', Oakland, Hip-Hop, COME ON!\n\n(KRS-One)\nDown to the spot this is real Hip-Hop\nJoin this movement; them other cats steal a lot\nYou can feel the knowledge of self or feel this glock\nI'm authentic, KRS I'm really hot\nYo, what up Fat Joe that's my nigga for life\nRemember when Pun fell off the stage, right on my wife\nIn the Bronx, we all laugh about it today\nWhat up Freddie Fox, 2 Glocks, Pik and Spay\nDr.Dre all day, both of them\nDr.Dre with Ed Lover and the one with Eminem\nThis a movement, all over the world we reach\nI can prove it, all over the world I teach\nYou hear that Dr.King, \"I Have A Dream\" speech a lot\nBut no where is it manifested but in Hip-Hop\nWhile them other cats be lookin' for a radio song\nI'm in Washington Heights, puttin' them Dominicans on\nYou can feel it I'm strong, I last longer let's do it\nYou want the real Hip-Hop well join this movement\nWe ain't about sellin' records, we ain't music merchants\nWe emcees we go to the club and straight hurt shit\n\nUtah, Minnesota, Mexico, COME ON!\nV.A., Arkansas, Portland, COME ON!\nIndiana, Oklahoma, Kansas, COME ON!\nEast St.Louis, Milwaukee man, COME ON!\nMontreal, Toronto, Canada, COME ON!\nEast Coast, West Coast, Dirty South, COME ON!\nMid-West, Bible Belt, Up-Top, COME ON!\nHip-Hop, COME ON!\nHip-Hop, COME ON!\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "Things Will Change", "href": "Things_Will_Change&&7421", "artist": {"unique_name": "KRS-One"}, "lyrics": "Hands in the air! (X 4)\n\n(KRS)\nGood looking, word...\nDJ Revolution, word up...\nLet's do this, kid...\nHere we go!\n\nA good time, a good vibe, and a house with a court\nGood life, good wife, a little food for thought\nI need (I need) food, clothes, and a whip with rims\nI need God in my life\nI need family and friends\n(I need) money, power, respect, I need love\nI need world peace, homeless to eat, no drugs\nI need every race and creed to be one\nEvery nation, every face and seed to see sun\n\n(KRS)\nYou need to listen to this\nYou need to listen to Kris\nYou need to have peace at least\nYou need spiritual bliss\nYou need a lyrical twist\nDo you know what a miracle is?\nBefore we begin, you may need a kiss\nI suggest either one from J to O-one from the lips\nEither way what I'm saying, yo, is bound to uplift\nYou need checks, you need cash\nYou need intellect\nYou need to be moving fast\nYou need that big respect\nYou need to be rolling in a car\nGoing to a bar that's far\nMakin' the deal to make you a star\nYou need to ask yourself, now do you know who you are?\nWhere you goin'? How many steps you took so far?\nYou need patience, you need to control your mind\nIf you read and don't act, then you're wasting your time\nWe need better leaders, we need better preachers\nWe need a three-thousand dollar raise to all teachers\n\n(KRS)\nYou need some meditation\nYou need rejuvenation\nYou need assistance right now with your situation\nYou need some contemplation\nYou need a combination\nA combination of will power and concentration\nYou need some syncopation\nWith regular relaxation\nBut you can't, 'cause you runnin' and racin' and chasin'\nYou need to slow down, maybe you should speed up\nOne sayin' \"lay down,\" the other's sayin' \"leap up\"\nYou gotta keep up\nI suggest you start to speak up\nA lawyer, a doctor, a rapper&#243;you wanna be what?\nWhatever it is, you gotta visualize\nYou need to focus for real, and stop livin' them lies\nThe time you givin' them guys\nYou could be workin' upon the goal you hold\nYo, you must realize\nYo, you need to be wise\nYo, you need to be alive, there could be no revenge or deceit in your eyes\nRise!\n\n(KRS)\nGimme what I need\nDo it with speed\nChange the situation around, plant new seeds!\nI roll with a righteous team of adults\nForget the insults\nWe plan to get results\nYou can call us a cult, you can call us a gang\nBut when it comes to Hiphop, no, you cats can't hang\nWhen the Gatts go bang\nAnd the telephone rang\nTelling you to come to identify the remains\nThat's when you feel the pain\nAnd my name comes as comfort, ease and all stress and strain\nYou need to know the game\nYou need to know the meaning of your own name\nReprogram your own brain\nAsk questions with no shame\nHow you think you gonna master your craft if you don't train?\nPerfecting your skill, that's the aim\nPerfect your skill, and you'll always have money and fame\nC'mon!\n\nWhat I, uh, what I need\n(House on the hill)\nThat's what I need\n(Cash credit on my bill)\nThat's what I need\n(All my dreams fulfilled)\nThat's what I need\n(New whip that I can wheel)\nWhat I need\n(With the chromed out grill)\nUh huh, that's what I need\n(And the girl that can chill)\nThat's what I need\n(And my spirit all healed)\nThat's what I need\n(That's what I need)\nThat's what I need\n(That's what I need)\nThat's what I need\n(That's what I need)\nThat's what I need\n(That's what I need)\nThat's what I need\nThat's what I need\n(That's what I need)\n(Fade)\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "Rappaz R. N. Dainja", "href": "Rappaz_R._N._Dainja&&5591", "artist": {"unique_name": "KRS-One"}, "lyrics": "Verse One:\n\nBlastmaster Kris I don't talk ish\nExpand your consciousness and dismiss foolishness\nNo one is new to this or new to Kris\nIn hip-hop's atomic structure, I am the nucleus\nThat is the center of the group we/us\nThey/them/you, every squad every massive every crew\nDental floss is lost when a true rapper jumps off\nThe cash is incidental but not mental distract you off course\nThe style that I am kickin is like chicken\nIt will be bitten, rewritten, then performed for a $25 admission\nReviewed in The Source\nYou will listen then find somethin' missin' of course... it's skills\nThat's what you're fishin for, it's lost\nI'm gettin' too explicit, the track jingles\nI won't do a wack album then remix it for my single\nKickin rhymes till I wrinkle, and my brown eyes twinkle\nGod called hip-hop for the nine-cinco\n\nVerse Two:\n\nTasty like a souflee French croisant on Tuesday\nRappers be boo-tay\nGoo-fy that's how they crew stay\nBitin whatever you say to boost they ego\nWe know the steelo, your whole character is foul\nMakes me want to shoot a free throw, BLAOWW\nFrom the git go, no, get go, my flow hits low\nWherever all the dope shit go, there's where my shit go\nBee-dee-bee-bo, skank, I think\nSelf with ya groups everyone else and the bank\nOthers like to bring the shottie to the party\nI bring knowledge of self, you cure the mind, you cure the body\nSome rappers like to come to the party, hopin to leave with somebody\nCheck, I come with skills and I leave with your motherfuckin respect\nAh yeah... so check, UH!\n\nVerse Three:\n\nNew types of verbal hip-hop I bring\nWhen you know you can sing BOY you know you can sing\nI do not clutter up the airwaves, with stacks of useless facts\nMC's trying to be macks, but acts like ignorant blacks\nFreak that, I'll snap your back as it cracks\nYou will experience, loss or lack of balance\nStop the violence, fry from week to week like an allowance\nAll of you are cowards hiding behind the mask of MC\nI remember, thinkin' back to eighty-three\nNo video, no you had to be a real live MC\nNow you younguns grow up buggin, any new jock you're huggin\nWeak production, let me tell you somethin'\nAny MC can battle for glory\nBut to kick a dope rhyme to wake up your people's another story\nAct like you never saw me\n'Cause when it comes to lyrics, I'm in a different category\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "Step Into A World (Remix)", "href": "Step_Into_A_World_(Remix)&&8131", "artist": {"unique_name": "KRS-One"}, "lyrics": "Intro: Puff Daddy\n\nI'ma make you dance\nAnd we won't stop, 'cause we can't stop (repeat 3X)\nDon't stop\nKRS-One\nPuff Daddy\nBad Boy remix\nHit me baby\n\nVerse One: Puff Daddy, KRS-One\n\nHear the sound of my money machine\nSee the 600 Benz see the chrome rims gleam\nSee the teacher KRS and the Puff Daddy\nSee the young black and famous Rich like Matty\nWith the power and the knowledge at our fingertips\nWith a style make the ladies wanna lick they lips, shake they hips\nShake they rumps, bass thump\nBelievin they could fly by the way you jump, player, uh\nHip-Hop mayor, fat rhyme sayer\nFrom the Boogie Down to the Himilayas I'm\n\nComentating (say what?) illustrating (yeah)\nDescriptions given, adjective expert (I hear you)\nLet's work, till your neck hurt (ooh)\nLike Bedwork I Rock Steady, you ain't really ready\nFor the teacher, just when you thought you had me licked\nI come equipped with another hit, oh shit!\n(I hear you, I hear you, I hear you, I hear you)\n\nAnd we won't stop, 'cause we can't stop (repeat 4X)\nStep into a world, where there's no one left\nBut the very best, no MC can test\n\nStep into a world, where there's no one left\nBut the very best, no MC can test\n\nVerse Two: Puff Daddy\n\nPolitic with the teacher (c'mon) as the hits reach ya\nPuff Daddy and KRS-One, double feature (that's right)\nUptown diplomats, watch chips get stacked\nSo-and-so, this and that (uh)\nJust 'Show me the money!' Ain't nuttin funny (uh-huh)\nHave you stuck on stupid broke feelin' crummy (ahah)\nAin't no time for Girl 6\n'Cause I got a ten, holdin' my stack of big Benz\nCorreographer causin your funky dope maneuver (say what?)\nBad Boy represent, keep it sewer\nKillin' You Softly wit my song\nCall from the heist, I know y'all better think twice (what?)\nAbout the still number one (uh-huh) South South Bronx (say what?)\nAt the Latin Quarter, dancin witcha daughter (ooh!)\nYou can't handle me, I keep it tight\nWith my Bad Boy family, that's right\n\nAnd we won't stop, 'cause we can't stop (repeat 4X)\nStep into a world, where there's no one left\nBut the very best, no MC can test\n\nVerse Three: KRS-One\n\nUh, uh, South Bronx\nYou sitin and you wonderin, how we keep it comin' in\nKRS and Puff again to push it, and shove it in (that's right)\nThe neighborhood be buggin when we we comin' in, rulin\n(With more Wildcats than Rick Pitino, I mean yo)\nJust Coolin', like Levert, I do work\nThey love me, thick with G. Simone, Puffy\nYoung black and educated, that's how we made it (oh yeah)\nStudy and bring the money in, you can't fade it\nThis scholar, gets the dollars\nWhile these other scholars just holler (remix)\nWith no dinero, your zero (remix)\nYou think I care what you whisper\nYou got the wrong picture (remix)\nI'm chillin' with G. Simone eatin dinner (haha)\nThe 1997 winner, of your respect\nHigh tech, you get the album or cassette (that's right)\nAnd don't forget, while you listenin, skills I flaunt it\nThat Boogie Down Bronx shit, we on it\n\n(Puffy)\nScott LaRock rest in peace, Biggie Smalls rest in peace\nStep into a world\nWe love y'all, always and forever, and we won't stop\nWhere there's no one left\n'Cause we can't stop, and we won't stop\nWhere the very best\nBDP, Bad Boy\nNo MC can test\n\n'Cause we can't stop, and we won't stop (repeat 4X)\nStep into a world, where there's no one left\nBut the very best, no MC can test\n(Repeat last refrain to fade)\n\nRock on, Bad Boy, remix, for eternity baby, BDP rock on rock on...\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "Blowe", "href": "Blowe&&4471", "artist": {"unique_name": "KRS-One"}, "lyrics": "Intro: Redman\nHey baby bring me something to drink in here\nSit down and watch a little TV\n\n(KRS-One)\n(Static) Yo they comin'. It's crazy but I know it they comin'. Maybe not\nLately I feel it coming. I knew it, they comin'. (static) This just in.\nPresident (static) I guarantee (static) Jim... Jimmy, Jimmy wake up. Jimmy!\n(Static) Only the Lord can save (static) 5.99 no obligation (static) Let me\nStart to rock this mic (static) Now the polar bear hibernates (static) And\nAnd what was going through your mind right now.\n\nKRS-1:\nLook aat these weak MC's getting G's\nNever wore BVD's or even bellbottom Lees\nPlease, with these fantasies about you selling keys\nWhen you know you bees in front of the TV eatin' grilled cheese\nOn your knees you know my steez\nKris is nice with theses M-I-Cs\nI'm Poison like BBD the plot thickens while I be hittin\nAnd lyric lickin', flippin' any mix and over the skippin'\nAnd cable clippin', still sickenin'\nEven though some people ain't admitting\nThrough they system I keeps it kickin'\nAnd tippin' the scale I pay tuiton not bail\nDrink water not ale, MC Hammer hits it right on the nail\nI can't fail with my 7 stripes\nStrike one pierces the lung over the drum MC's become dumb\nLike \"um?\" They numb, bite the tongue over the bass drum\nI am D the MC like Run, spittin' lyrics for fun\nAnd for a sum of the bread crumb\nYou missed when you swung, I connected whole hum\nAnother one done underestimated KRS-1, yeah so...\n\nRedman: Say blowe\nKRS-1: If you really want true skill\nRedman: Say blowe\nKRS-1: If you want the hip hop to build\nRedman:Say blowe\nKRS-1: We rock it all year round\nRedman: You better cool the F out before we go up in your mouth\n\nKRS-1:\nIt's just beguuuun, to bubble\nKRS-Onnnne spells trouble\nOn the mic soooon there is no double\nI emerge from under the rumble\nCount the truth poetic construction, audio abduction\nShowbiz production for wack lyric reduction\nAnd fly rhyme instruction keep the party hoppin'\nKeep the DJs buggin' for the orthodox\nNon Xerox hip hop chatter box\nIt was dope first crack out the box with Scott LaRock\nHow MC's are washed up like sweat socks\nKRS-1 makes the heads nod\n\nRedman: KRS-1\nKRS-!: Yes my son\nRedman: Tweet tweet (x2)\nKRS-1: You know they can't compete, ain't that right\nRedman:\nNo doubt. You better cool the F out before we go up in your mouth\n\nKRS-1:\nWhen it's my turn kid, look at what you done did\nLike my head is dreadable you edible\nI kick incredible shit, for my poeple\nI'm jackin' these like me so sue and Stretch like Bobbito overloops\nWhile you sittin' on stoops I'm rockin' mics for U.S. troops in group\nYou screwed up, oops, I can read a true crook\nLike I can read a good book\nI'm hooked on hip hop culture\nLook at the tip top lyrical structure\nFloatin' like a soap bubble that you don't wann puncture\nOr rupture, I write what I udder, mother mother mother\nThere's too many of us dying still trying and not doin'\nNot succeeding still pursuing what you doing?\nWhat you doing? What you doing?\nThe session is started departed on schedule\nI beg you please look over my lyrical menu\nWhat other can't do I can do\nEnhancing 7 levels of your mental\nI dismantle stress, you're listening to the advanced lyrical best\nWorldwide qualified to administer any MC test\nStop guessin' class is in full session\nNow Showbiz show 'em how\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "Wannabemceez", "href": "Wannabemceez&&804", "artist": {"unique_name": "KRS-One"}, "lyrics": "(Feat. Mad Lion)\n\n\"One two, testing one two\nAll right party people in the place to be\nThe party has already started\nAn-an-an-and it's about to il-il-il-ill *echoes*\"\n\nLet me introduce you to another type of rapper MC\nWhere glamour and glitter don't matter gently\nI'm tired of the Chattanooga empty\nClassical like a German luger\nDeep like a tune for scuba diving who am I the hyper\nLike I said before my radar's going BIBBIT BIBBIT\nThe microphone I grip-it grip-it, lyric lyric I live it\nHear it my spirit is where it should be\nDon't push me if you pussy, HUH\nI spot em, it seems you want to ride the dillz\nI got em, KRS got skills in the place\nI waste megahertz of bass bottom, chill\nAs I rock 'em and get ill, I build the perfect spot to kill\nVerbal excitement will lead to your indictment\nWhether or not you like it, still, number one I hype it\nYour album, rewrite it\n\nHow many MC's, wannabemceez\nNever be MC's, 'cause they can't MC\nHow many MC's, wannabemceez\nNever be MC's, 'cause they can't MC\n\nTriplet syllables for minimal criminals\nLyrical riddles that got hard flavors in the middle\nSit back and chittle as I stand and still rebuild on skills\nThe admission of serial lyrics, calculated to weaken the spirit\nWill be diverted by this lyric when you hear it\nRicochet any style any day\nAny which way and you'll Cherish the Day like Sade\nThe advanced oratorical techniques I speak\nKeep the heat at full peak! My grammar\nWith stamina, grabs a rapper like the fresh catch of the day\nAnd crack the back of that DJ\nI'm strappin and attackin a pack\nAnd whatever happens after that just happens, FACT\nFlamboyant and flashy is one point in time when you're not ashy\nFocus on the syllable formats and the cash G\nG for guard your grill, I'm hard to kill\nOdd but ill, a job to fill is to refill on skills\nWe built and killed style and skill\nWhile poetically recriminate you like a child I will\nGet ill, and switch to earn\n'Cause I prefer to slur but not blur\nBlurring you're stirring up trouble surely you don't need it\nBe seated I'm undefeated dem not see it\nObserve me then beat it\n\nHow many MC's, wannabemceez\nNever be MC's, 'cause they can't MC\nHow many MC's, wannabemceez\nNever be MC's, 'cause they can't MC\n\nLet's get back to the point quickly, get with me\nThe voice from New York City is too witty\nI come from a era of ?OJ cars?, Latin Quarter\nFake Gucci and fake Fendi, you can't send me\nNowhere, that I ain't been to\nYou can't tell me nuttin that I ain't been through\nDisrespect the teacher I gots to get you\n*'Cause they can't MC*\nBut what you really sayin'\nYou sound like a bitch-ass rapper when he's saying\n\"Yo Kris you hit too hard\" stop playing!\nSwitching and swaying\nDay in and day out, your styles are played out, see you way out\nBefore you're laid out, your bright lights start to fade out\nThe last thing you heard is \"Who let the K out?\"\n?No great area?\nEverything is black and white we took the gray out it's scarier\nEither you're winnin' or losin, spinnin the rules of conscience\nBut lyrically there ain't no stoppin'\nI'm droppin' a lot in your noggin\n'Cause I know that you're lyrically starvin\nCarbon, your name, battle battle\nEverybody wants to battle but you BAB-BLE\nWho knows ya, battlin me, is the only way that you can gain exposure\nI feel for ya soldier\nI hate to say it but I told ya so\nYou know that I know the ancient flow KRS-One\nIs the holder of a boulder yo, money folder yo\nYou want a fresh style let me show you slow\nYour blow, I'm not your foe\nBattling me? No no no no no no NO!\n\nHow many MC's, wannabemceez\nNever be MC's, 'cause they can't MC\nHow many MC's, wannabemceez\nNever be MC's, 'cause they can't MC\n\n(Mad Lion)\nIf a DJ think he man den he better prepare for war!\nBDP crew get up in that ass like a piece of toilet tissue\nGeneral Lion I chase them all and I am on fiyah\nRepresent the hardest crew, you know how we do\nAnything tess, dead! Gun shot to dem head\nGwan *echoes*\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "A Friend", "href": "A_Friend&&1655", "artist": {"unique_name": "KRS-One"}, "lyrics": "The beat was sposed to drop right there\nThe beat was sposed to drop right there\nThe beat was sposed to drop right there\nYeah yeah yeah... uh\n\nI send this one out, to my right hand man\nOr mens, or womens, the whole crew\nThe real fam\n\nChorus: KRS-One\n\nWe can count the dough or kick a flow\nOr chill out watchin videos\nOr actin' really silly yo but really doe\nAll that can end...\nWhether at the bar with superstars\nOr cruisin in the trooper car\nI really don't care who you are\nAll I really need is a friend\n\nVerse One: KRS-One\n\nIf we can't have trust then you can't hang with us\nWe respond to those who show respect with respect\nWe respond we connect on the same deck\nSame intellect, my man, never shifty, thinks quickly\nIf you can't understand, we boys we boys\nWe could stand on the corner with a hat sellin toys\nIt ain't about your Benz I hope it ain't about mine\nMy man, I be dissin in my freestyle rhyme\nGettin' G's around the world, I can trust you with my girl\nMy man, we chillin' at the jam, what's the plan?\nI'm not a yes man and none of my friends are yes men\nOr women, I'm drivin', I see my peeps yo get in\nWhere you fit in? True friends are quick to sit\nIn the beginning of all trouble, and when your bankroll doubles\nFred Flintstone and Barney Rubble\nStill I got my own space like Hubble\n\nVerse Two: KRS-One\n\nCause don't nobody care about us, all they do is doubt us\nUntil we blow the spot then they all wanna crowd us\nAnd wanna shout us, but you my man from way back\nI just gots to say that, actin' large I don't play that\nBut I can't say that, where I play at isn't fast-paced\nA friend can acquire the taste to become two-faced\nAnd that's a disgrace there ain't nothing you can say to us\nWhen the kid you grew up with betrays your trust\nWhen we used to ride the bus we had trust\nNow we cash checks and drive Lex, and can't show respect to one of us\nYo the heads I hang with ain't tryin' to just get\nWhat they can get, sit quickly backstabbin the click\nI roll thick, but only some are friends really\nDown to the end, my right hand men and women\nMutual support, from the beginning\nBeen in, exactly what I've been in\n\nVerse Three: KRS-One\n\nBack to back we attack corporate America\nGettin' fees that amount to G's in every area\nYou my man I ain't gotta drag you along\nYou pull your own weight, yeah you definitely got it goin' on\nI don't see nothin' wrong wit a little bumpin car system\nThumpin, between the crew we always got sump'un\nBut if we had nuttin no frontin whatever\nWe'd still be crew you and me, me for you together\nWord, fake people ain't worth a turd\nThey only want to be your friend because of what they overheard\nI send this record to the well respected\nFriends that I've collected, I hope I am what you expected\nYeah, so check it, so check it\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "Philosophical", "href": "Philosophical&&7222", "artist": {"unique_name": "KRS-One"}, "lyrics": "(Verse One: KRS-One)\nYo turn me up just a bit, so I can hear it and spit\nReverse spit, and get tips, rehearse a hit and take tricks\nResearch the art just a bit, don't let me start I won't quit\nBut if I start I'ma flip, just like I'm startin the whip\nPuttin' the key into it, mentally seein it\nG.O.D. believin in it, I get a fee when I spit\nC-L-U-B's I just rip, I'm lyrically well equipped\nOver the beats and the mix, I keep the streets in a fit\nWhen it comes to lyrical spit, I'm the t'cha of it\nHigher consciousness, truth, I'll be reachin' for it\nMetaphysics, here's an example 'cause I'm speakin' of it\nPut your hands in the air, but you must be aware\nThat even if your hands are down, ain't they still in the air?\nI be takin' you all the way down the road, takin' you there\nI'm livin' and givin' just a smidgen of what I share\nThe style that I'm kickin, lyric lickings from over there\nWe rockin' forever, we get better with every year\nWith letters and intercessors I sever every fear\nLookin' here, like UPS KRS takes it there\nLet's make it clear, thought waves go through the air\nYou can act like you busy or you dizzy or you don't care\nBut listen here, everybody got a fear\nAn insecurity, some type of thing they gotta clear\nSo that's when I, reappear, from the rear\nPhilsopher, follow the bright light to right here\nI might wear, light gear\nAppear when you least expect it, tellin' you now how to fight fear\nWith faith, you hear the bass, well clear the waste\nYou gotta get the negative cats out your face\nGet that irrelevant crap out your space\nConceive it believe it decree it achieve it with HASTE!\n\nNuttin in the world is impossible\nListen to the shit that I drop on you\nKRS-One, philosophical\nBelieve and achieve what you got to do\n\n(Verse Two: KRS-One)\nWe rawwwwwwwwwk, we don't stop\nHip-Hooooooooop, we don't stop\nTick-tooooooock, we don't stop\nWe at the top we never drop cause true hip-hop is so hot\nSome people thuggin', some be pimpin', I be teachin a lot\nI be teachin about the meaning of a deeper hip-hop\nThat don't make me any better than a thief or a cop\nAll I know is when I flow, the people be shocked\nYou don't really want the teacher to come step on your block\nWith my whole glock takin' everything that you've got\nI'm a different type of deeper intellectual rock\nFor when you really wanna compete and get up off your block\nYou are not just doin' hip-hop, you +ARE+ hip-hop\nLike if you have a badge and a gun, you ARE the cop\nLike if you practice medicine, you ARE the doc\nYou just forgot rappers rap about cars a lot\nAnd the magazines worry about stars a lot\nBut I'm the sun and they avoid me BECAUSE I'm hot\nThe orthodox hip-hop is sure to rock\nWith or without a video, I'm leavin' 'em all in shock, Oh!\n\n[Chorus] - repeat 4X\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "Splash", "href": "Splash&&9108", "artist": {"unique_name": "KRS-One"}, "lyrics": "Word up! It's just a little somethin' to tide you over, word up\nThe \"KRStyle\" album comin' soon, KRS-One all in the room\nWe gonna bounce these cats this year, word up\nWhy they do this? Ha - yo, yo\n\n(KRS-One)\nI climb up the back of rappers\nReach over they head, and rap backwards at 'em\nExcuse me madam, I used to throw these uzis at 'em\nBut I'm a teacher, skills I truly have 'em\nThese clubs I duly pack 'em\nPotential lawyers engineers and doctors, I do attract 'em\nGo to your professors and ask 'em\nIf the songs of the \"Edutainment\" in college they didn't blast 'em\nYes - I'm that ancient one\nI set the framework for today's rappers to make they funds\nBut no you don't know me son\nMy facial features matches the Sphinx with it's nose redone\nYou know how many clubs we done rocked?\nYou know how many guns we done popped?\nYou know how many funds we done dropped?\nYou know how many ones we done got?\nWe been gettin' live since the days of Chubb Rock\nWe know how to survive; these other cats\nBe in at nine o'clock then be out at five, uh\nWe doin' the overtime, on stage I over-rhyme\nMakin' these whack rappers tow the line\nSteppin to me, I know you blind; cause your whole flow\nYour show, your style, you know it's all mine!\nThe first time you learned to spit\nIt was either me, Kane, Rakim or Slick Rick!\n{*Water splashes*}\n\nWelcome to the \"KRStyle\"\nThis year I had to switch styles and bust off two miss-iles\nAnd that's not all, rappers have the gall\nTo pray and pray for my downfall - but still in all\nI have X amount of lyrics to get 'em all\nLive at the club I spit 'em all\nRappers backstage lookin' sad and piti-fal\n'Cause they know I'm the pinna-cle and they mini-mal\nI spit the metaphysical, the spiritual\nThe oracle, the lyrical, the oratorical\nRookie! I'll mop the floor witcho'\nI'm the lyrical foundation to all your flows\nAll your clothes, all your shows and I'm not alone\nYou wouldn't even know how to hold the mic or the phone\nYou couldn't even bite on the bone\nWhile we was rockin' mics out in Rome\nNow you hyped cause you grown?\nYou know we internationally known, the people love it\nBut what they learnin bout is on the whole, look above it\nBut let us get back to what we call hip-hop\nBefore you whack rappers went pop\n{*Water splashes*}\n\n", "album": {"title": "The_Mix_Tape_(2002)&&6676", "genre": "Hip Hop", "year": 2002}}, {"title": "Survivin'", "href": "Survivin%27&&4441", "artist": {"unique_name": "KRS-One"}, "lyrics": "(Feat. Tekitha)\n\n[KRS-One] Yeah, all my fathers\n[Tekitha] That survive, gotta ride to break the illusion, confusion\n[KRS-One] Uh... uh, word\n[Tekitha] Keep on fightin, strivin\n[KRS-One] Uh... hold your head up!\n[Tekitha] Survivin, survivin\n[Tekitha] That survive, gotta ride to break the illusion, confusion\n[Tekitha] Keep on fightin, strivin, survivin, survivin\n\n(Verse One: uncredited - possibly Shuman)\nYo, time to do what we gotta do\nThese days, livin' ain't true, but I ain't mad at you\nI don't got time for the stress and the nonsense\nSo I try to stay blessed, but it's all tense\nWhen I awake, feel the sun on my right side\nIt make me wanna grab a gun and change my lifestyle\nBut it only goes so far, so live it up\nOr realize what you know star, and give it up\nOr either switch it up, gotta keep reppin on\nAnd lookin' out for our kids, like the rest of (?)\nNow I know how it is, and what you're handin me\nSo I can calculate the right moves for my family, yo\n\n[Tekitha] That survive, gotta ride to break the illusion, confusion\n[KRS-One] Keep on!\n[Tekitha] Keep on fightin, strivin\n[KRS-One] C'mon, c'mon!\n[Tekitha] Survivin, survivin\n[KRS-One] C'mon, that's right\n[Tekitha] That survive, gotta ride to break the illusion, confusion\n[Tekitha] Keep on fightin, strivin\n[KRS-One] Word up!\n[Tekitha] Survivin, survivin\n\n(Verse Two: KRS-One)\nC'mon, let's do this\nWhen it comes to the cash, we ain't equal\nRich man, poor man, poverty defeats you\nWhere my people? Yo, Kris see you\nThere's only one of you, that's why you gotta be you\nThem others be see-through, flashin and flossin\nMe I'm with Inebriated Beats in Boston\nStrivin, survivin, we get cash often\nBut do you really know what daycare be costin?\nAll my fathers, all my mothers\nAll my sisters, all my brothers\nHold your head up and teach them younger cats\nIt ain't where you're from, it's where you're at!\n\n[Tekitha] That survive, gotta ride to break the illusion, confusion\n[Tekitha] Keep on fightin, strivin, survivin, survivin\n[Tekitha] That survive, gotta ride to break the illusion, confusion\n[Tekitha] Keep on fightin, strivin, survivin, survivin\n\n(Verse Three: uncredited - possibly Priest)\nNow see I'm livin' just to die without most any reason\nSo I keep on chasin paper till it's time to go\nBut should I really go for mine and put the clip all in the 9\nOr stay at the 9 to 5 a day I just don't know\nBut a brother got a daughter I gotta support her\nCaught up in the system inside a order, man I can't afford\nA kitted Escalade, or bling bling\nAnd so I gotta keep survivin, is the song that I keep singin'\nI try to keep my head off the floor, the country's goin' to war\nWhile Bush is givin' dough to NASA and ain't feedin the poor\nBut I keep love over these beats, these beats keep me alive\nAlive, I got to stay the Priest, I will survive y'all\n\n[Tekitha] That survive, gotta ride to break the illusion, confusion\n[KRS-One] Uh, word\n[Tekitha] Keep on fightin, strivin, survivin, survivin\n[KRS-One] C'mon, c'mon... SURVIVIN\n[Tekitha] That survive, gotta ride to break the illusion, confusion\n[KRS-One] Uh! Keep your head up, word!\n[Tekitha] Keep on fightin, strivin, survivin, survivin\n[KRS-One] C'mon, uh... SURVIVIN\n[Tekitha] That survive, gotta ride to break the illusion, confusion\n[KRS-One] Uh\n[Tekitha] Keep on fightin, strivin, survivin, survivin\n[KRS-One] Word! Uh-huh\n[Tekitha] That survive, gotta ride to break the illusion, confusion\n[KRS-One] Uh... ALL MY FATHERS\n[Tekitha] Keep on fightin, strivin, survivin, survivin\n[KRS-One] Word!\n\n(KRS-One)\nSadat X, is down wit us\nStud Doogie, is down wit us\nLord Jamar, down wit us\nAlamo, you down wit us\nGrand Puba, down wit us\nBrand Nubian, down wit us\nShuman, you down wit us\nYo Priest, you down wit us\nMarlo, you down wit us\nChoco, you down wit us\nVangod (?), you down wit us\nDesmond Terrow (?), you down wit us\nCliff Cultrary (?), you down wit us\nYo Tekitha, you down wit us\nAiyyo RZA, you down wit us\nThe whole Wu-Tang, is down wit us\nMakin' funky music is a must!\nMakin' funky music is a must!\n\n{*Sampled: \"One For All... All... All..\" repeats to fade*}\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "Squash All Beef", "href": "Squash_All_Beef&&8461", "artist": {"unique_name": "KRS-One"}, "lyrics": "Hah, respect!\nAll crew, all massive, everywhere in the world\nYou practice the art of hip-hop\nThis goes out to every boy and every girl\n\nGive me relief! I sing!\n\nGive me relief! Squash all beef!\nDon't let these arguments destroy us! I sing!\nGive me relief! Squash all beef!\nDon't let these arguments destroy us!\n\nCheck it\nAll beef can be squashed if you want it\nBut instead of forgiveness, ego you flaunt it\nEverybody gets into two or three quarrels\nLeadin to a squabble, someone will die tomorrow\nLife is not a thing you can borrow\nAll beefs don't have to lead to sorrow\nWill ya, go out tomorrow\nI think, you should think about the beef you got\nAnd confront your enemy before it gets too hot\nNever feel ashamed, to say, \"Yo G I'm sorry\nI apologize,\" the object is to stay alive\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "The Raptism", "href": "The_Raptism&&1972", "artist": {"unique_name": "KRS-One"}, "lyrics": "* H.W.C. harmonizes a melody (no words) where this appears\n\nSo gather round now for the raptism\n'Cause if the dogs don't get 'em\nThe cattle get 'em, or the gat'll get 'em, or the crack'll get 'em\nTime for spiritual activism, life is a journey\nAnd Kris got the map with him\nTeach latinos and blacks with 'em\nIt's amazing when whites and asians kick raps with 'em\nCause out of a thousand MC's, believe I taught half of 'em\nKnowledge Reigns Supreme, I beam through many images\nMy origin is a mystery like capstones on pyramids\nWe live it kid, challenge the teacher you will regret that\nI'm giving careers and taking careers away, did you forget that?\n* Better check that, you can rock this track and the next track\n* But when I correct the spirit hit, you'll always be set back\nSo gather round now for the raptism\nOnly those that got hip-hop in 'em\nAnd not rap in 'em and no crack with 'em\nStep up now and receive a holy dose\nFrom a holy host, and take a break from these rappers that only boast\n*\n{HWC} Wake up, to make up\n[KRS] Yeah yeah, yeah\n{HWC} Wake up, to make up\n[KRS] Huh, huh, yeah yeah, yeah\n{HWC} Wake up, to make up\n[KRS] Yo, yeah, yo...\n* My intellectual battle will make your brains rattle\n* I'll unwrap you and your crew from the same shackle\nI'm on many different planes like a airport\nPsychologically you be rethinkin your identity and cuttin' ya hair short\nNow there's a thought, that exposes your insecurity\nYou put no fear in me, I break the M from the C\n* And reverse it to say \"See 'em? See 'em?\"\n* They allow the devil to lead 'em, and they be givin' up they freedom\nSo, huh, gather round for the raptism\n{HWC} Wake up\nWhen the spirit hear it the lyric long before the track get 'em\n{HWC} Wake up\nI spit 'em out, gotta get 'em out, the world I never been about\nI see them glitter but their spirit's goin' in and out\nWe see them fading, we also see them hating\nWe also see those living for musical chart ratings\nHear what I'm stating or trading for what you're paying\nReplace fear with faith and you'll stop decaying\nGather round for the raptism (word)\nGather round for the raptism (word, word)\n{HWC} Wake up, wake up, wake up\n* Gather round for the raptism\n{HWC} Make up, make up, make up\n* 'Cause if the dogs don't get 'em\n* The cattle get 'em, or the gat'll get 'em, or the crack'll get 'em\nYo, yo, gather round for the raptism\n{HWC} Wake up\nWord... word...\n{HWC} Wake up\nWord...\n{HWC} Wake up\nThe dogs don't get 'em\nThe cattle get 'em, or the crack'll get 'em, or the gat'll get 'em\n{HWC} Wake up\n{HWC} Everyday, when you wake up\n{HWC} You got a chance, to MAKE UP!\nRemember, you are not just doing hip-hop, you ARE hip-hop\n{HWC} Wake up to make up\n{HWC} Wake up to make up\nTwice a year, hip-hoppers come together\nTo celebrate the unity of hip-hop\nWe come together, during Hip-Hop Appreciation Week\n{HWC} Wake up to make up...\nWhich is every third week in May\n{HWC} Wake up to make up...\nThen, we come together in Novemeber\nTo celebrate Hip-Hop History Month\nI will see you there - PEACE!\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "The Mind", "href": "The_Mind&&2987", "artist": {"unique_name": "KRS-One"}, "lyrics": "(Chorus One 2X: KRS-One)\nFirst thing we must do is make up our - MIND\nThen we must go and really clear our - MIND\nErase the doubt and the fear from our - MIND\nShare our - MIND, speak our - MIND\n\n(KRS-One)\nStand up brother, stand up sister\nI told y'all before, love is gonna get'cha\nLovin' that money, lovin' that liquor\nLovin' that sex without respect you gets no bigger\nI ain't got time to chill, only got time to build\nYou find that in those with skills\nThis a real MC, of the highest degree\nWith no video, my show they dyin' to see\nNot whether I'm buyin 'em three\nWhen you watch television just keep sayin' they lyin' to me\n'Cause they are - how long you gonna stay at the bar?\nI'm not desperate for money, maybe you are, but listen\n\n(Chorus Two 2X: KRS-One)\nFirst thing we gon' do is make up our - MIND\nThen we gon' go, and we gon' clear our - MIND\nErase the doubt and the fear from our - MIND\nShare our - MIND, speak our - MIND\n\n(KRS-One)\nDon't you think it's time we thought about the future?\nWhether our children they gonna be winners or losers?\nDon't you think it's time to advance the rhyme we spit?\nWhether you know it or not, you deep in politics\nAll inside of it, in fact YOU the issue\nDon't let this government diss you!\nThey really do not want you to vote\nThey really do not want you to hope\nThey really want you sniffin they coke\nYou look around yo we missin' the boat\nI coulda wrote about ANYTHING to get on, but this what I wrote\nAnd what I'm writin, is guaranteed to enlighten\nLike Dr. Cornel West, Michael Eric Dyson\nThis is how we do it today, enough of the crime talk\nKRS got somethin' new to say\nRise up, and put aside childish things\nThis is the message we bring; listen\n\n(Chorus Two)\n\n(KRS-One)\nLast verse, KRS, blast first\nIgnorance is bad, but temptation that's worse\nThey hide they purse, cause of the way we spit the verse\nNo one ever told 'em that the style's rehearsed\nAnd even if they did, it wouldn't be new to they mind\nCause all day rappers confess to doin' these crimes\nSo when the cops see you, they're not thinkin' about me\nThey thinkin' about takin' you out of society\nKeep it right, don't lie to me\nYou think it's too much preachin teachin?\nHuh, well fine, we'll see\nWhen you're locked up in J.D.C., or even prison\nThe truth shall set you free, just listen\nYou want health, and really that's about prevention\nYou want love, real love, and not depression\nYou want awareness, which come from discipline and will\nYou want wealth, which come from skills\nWhen you really ready to talk, let's build\nYou ain't gotta be a scholar to know the next 4 years gonna be ill\nI believe you already know the drill, don't lie\nDon't steal, seek peace and don't kill\n\n(Chorus One)\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "The Sneak Attack", "href": "The_Sneak_Attack&&9738", "artist": {"unique_name": "KRS-One"}, "lyrics": "(April S. Williams)\nWe keep it tight... we keep it right...\nWe're comin' strong... we're movin on... (yeah)\nIt's time to rise... and unify...\nKeep comin' strong (uh-huh, uh-huh, uh-huh!)\nJust keep movin on...\n\n(KRS-One)\nYo, where's my people at?\nWe be where the elite be at\nWe really never need the gat, we comin' with a sneak attack\nIn fact, best believe we back\nWhat we rap it heats the track\nKenny Parker sees to that, my job is to teach these cats\nPresent the clear speech they lack\nAnd show 'em how to eat from rap\n\n(April S. Williams)\nWe keep it tight... we keep it right... (that's right)\nWe're comin' strong... (uh-huh, yeah) we're movin on... (tell 'em again!)\n(Uh) It's time to rise... and unify... (yeah, yeah)\nKeep comin' strong (uh-huh, uh-huh, uh-huh!)\nJust keep movin on...\n\n(KRS-One)\nYou know why the devil can't get with me?\n'Cause he's a liar, I've got victory\nYou can stick with me, my click is free\nNegativity, that doesn't live with me\nThese rappers on one, I've skipped to three\nThese rappers on A, I've skipped to C\nMy image, heads ain't quick to be\nSo I thank you for pickin' me\nI know why people got to know, these wack rappers got to go\nLet a MC rock the show\nI'll show 'em how it 'posed to go\nWe forgot simply what we supposed to know\nWe still must defeat the foe\nSo what you got the dough? Your words don't make us glow\nIn fact they make us slow\nHow long this gonna take to know you ain't gotta be a hoe?\n\n(April S. Williams)\nWe keep it tight... we keep it right... (yeah)\nWe're comin' strong... (yeah, yeah) we're movin on... (uh-huh)\n(Tell them again!) It's time to rise... and unify... (yeah)\nKeep comin' strong (uh-huh, uh-huh, uh-huh!)\nJust keep movin on...\n\n(KRS-One)\nLook at the teacher, I stay attuned\nPeople are blessed when I walk in the room\nSnakes (?) don't stop me, and if they did\nThey'd be askin for a tag 'fore they kids\nMedical students lose it when I enter any hospital\nDoctors wanna talk music and whatever's topical\nIt's all logical, I perform the impossible\nThrough words I put hip-hop in you; listen\nHere's what we got to do, unify\nDefeat the flesh, defeat the beast in you and I\nWin or lose I never shout, believe in yourself and never doubt\nDiscipline is simply a better route\n\n(April S. Williams)\nWe keep it tight - we keep it tight\nWe keep it right - we keep it right\nWe're comin' strong - comin' strong\nWe're movin on - movin on!\nIt's time to rise - it's time to rise\nAnd unify - unify\nKeep comin' strong - comin' strong\nJust keep movin on - keep on movin on\nWe keep it tight - we keep it tight\nWe keep it right - we keep it right\nWe're comin' strong - we're comin' strong\nWe're movin on - movin on!\nIt's time to rise - it's time to rise\nAnd unify - it's time to unify\nKeep comin' strong\nJust keep movin on - keep on movin on\n...\nJust keep movin on - keep on movin on\nJust keep movin on - we gotta keep on movin on\nJust keep movin on - wake up and realize\nJust keep movin on - that you just keep movin on\nJust keep movin on - it's time to realize\nJust keep movin on - that you gotta keep movin on\nJust keep movin on - keep movin on, keep movin on\nJust keep movin on - you gotta keep movin on, you gotta take that time\nJust keep movin on - you gotta realize, that it's time\n- Keep on movin on, keep on movin on\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "It's All a Struggle", "href": "It%27s_All_A_Struggle&&4236", "artist": {"unique_name": "KRS-One"}, "lyrics": "[Chorus: KRS] + (guest)\nIt's all a struggle (tryin' to make it day to day)\nIt's all a struggle (from my hood to around your way)\nIt's all a struggle (single parents all by theyself)\nIt's all a struggle (diseases decreasin your health)\nIt's all a struggle (fiends swearin that's they last puff)\nIt's all a struggle (hustler tryin' to avoid handcuffs)\n(No matter what you do, who you are or where you from)\n(Rich poor black white, at the end of the day)\n\n(Verse One: KRS-One)\nIt's all a struggle - and most people's struggles are doubled\nYou ain't the only one with a challenge facin some trouble\nLook at the woman chewed up by the dog with no muzzle\nOr the workers that got trapped underground in that tunnel\nSome kids are playin' in pools, others in puddles\nWhen they listen to the news the propaganda is subtle\nBut it's time for you to know that the cryin got to go\nRelease the guilt that you built and let it flow\nSlow and low, that is the tempo\nMove slow and on the low, this you gotta know\nYou don't get the muscles without the hard struggles\nYou ain't the only one out here tryin' to get dough\nFrom the hustler to the preacher to the government leaders\nFrom the airline pilot to the chef to the teachers\nWe linked in the same huddle, in the same tussle'n'bustle\nCause at the end of the day, it's all a struggle\n\n(Verse Two: KRS-One)\nIt's all a struggle - but don't let the challenges bug you\nOr the government drug you, or the thieves in the street\nBeat and mug you - build your tunnel under the rubble\nCome up on the other side eye to eye with the trouble\nLook at the Twin Towers crumble\nLook at the religious leadership stumble, everybody struggles\nBut not everybody comes through nifty, it's fifty/fifty\nThe city itself will outrun you quickly\nWhether you be healthy or sickly\nWhether you be wealthy or thrifty, ugly or pretty\nEverybody's tryin' to get 50's and 100's\nI taught this at UCLA just off Sunset\nNow run get \"Ruminations\"\nIt's a book that I published for the healing of this nation\nIn just a few chapters we run through, some possible solutions\nCause at the end of the day\n\n(KRS-One)\nIt's all a struggle\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "Problemz", "href": "Problemz&&8330", "artist": {"unique_name": "KRS-One"}, "lyrics": "Yeah man, yo Marla what's up\nYeah, Inebriated Beats, big up Boston, the whole Boston\nEdo.G what's up man? I got you\nWe gon' bounce this now, can I start? Can I start?\nHere we go\n\n(KRS-One)\nI'm the newest and the truest MC on the mic\nI wrote over 500 songs, pick what you like\nIt ain't easy bein me, by day or night\nBut it's easy bein free to recite what you like\nHip-Hop is my inalienable right\nWhen it comes to emceein KRS is a whole different type\nNow go get it right, did I flow spit it tight\nIn a fight I was the type to go get a pipe\nBINK! BINK! BINK! BINK! Movin 'em back\nBINK! That's the sound of an aluminum bat\nBut it seems they new to these facts\nWhich means they new to the tracks\nWhich means they do hold us back\nToo new to know all that but still runnin' they trap\nDo the math, radio gets a 20 record a week stream\nBut only three are ever seen\nWhat happens to the other 17?\nIt's a PROBLEM... PROBLEM...\nProblem in hip-hop today!\nWe gotta solve it\n\nToo many players and not enough crime\nWhen they finally wake up they woulda ran out of time\nThey can't see today how they effect tomorrow\nToo afraid to follow, 'cause they trust is hollow\nBecause according to the laws they'll harp some sorrow\nYo, \"Victory Over the Streets\" - that's our motto\nBut if people ain't got no vision, that's a PROBLEM...\nProblem in hip-hop today!\nWe gotta solve it\n\nPeople say, \"Kris - why you teach so much?\nWhy you preach so much? Why you speak and such?\nWhy you so bent on reachin' each of us?\"\nI reply - because you eatin with us\nIn the future our children will be meetin with us\nHave a seat then with us and start speakin' with us\nThey'll be critiquin us to be sure they believe in us\nWe don't need a PROBLEM...\nProblem in hip-hop today!\nWe gotta fix it\n\nWe live non-toxic, we teach that hip-hop is\nThe transformation of all subjects and objects\nRetrain your optics, to reinterpret the topics\nWe gotta stop treatin hip-hop like a product\nAnd more of a strategy; I got graphs, charts\nSacred textbooks, these cats can't battle me\nBut they try, and why? Cause that's a PROBLEM...\nProblem in hip-hop today!\nWe gotta fix that\n\nThese cats need history to get with me\nBut hip-hop's history's a mystery\nSo how they gonna find out, trial and error\nWe can make one the example for all to get better\nInform, KRS is not the norm\nI go from hot to warm to cold to hot\nBut hip-hop's history many forgot\nAnd that's a PROBLEM...\nProblem in hip-hop today!\nWe gotta solve that\n\n(Interlude beat)\n\nProblem... problem in hip-hop today!\nWe gotta fix that\n\n", "album": {"title": "The_Mix_Tape_(2002)&&6676", "genre": "Hip Hop", "year": 2002}}, {"title": "Somebody", "href": "Somebody&&8667", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One)\nOh, do it now, oh, do it now\nYeah, we celebrate diversity in the university\nEverybody can't be a queen, everybody can't be a ho and a bitch (Ha ha)\nEverybody can't b e a philosopher\nSome of y'all gotta load up the clip\nWord up, watch this\n\nIt goes 1, 2, 3 we the best\nKnowledge Reigns Supreme, as you can see, or KRS\nYou don't wanna test the team, why get a vest\nYou don't wanna be cursed in a verse, by the blessed\nKRS with the sound for the eat and the west\nFollow no, follow no, follow no, follow no beast on a quest\nSomebody gotta be fresh\nSomebody gotta be wack\nSomebody gotta be the MC\nSomebody gotta do the rap\nSomebody gotta be smart\nSomebody gotta do that\nSomebody gotta do art\nSomebody gotta be black\nSomebody gotta have heart\nSomebody gotta be white\nSomebody gotta do their part\nSomebody gotta be bright\nSomebody gotta be up\nSomebody gotta be down\nSomebody gotta be the teacher\nSomebody gotta be the clown\nSomebody gotta be lost\nSomebody gotta be found\nSomebody gotta be in the economy making the money go round\nSomebody gotta be the president\nSomebody gotta get down\nSomebody gotta be hesitant\nSomebody gotta be relevant\nSomebody gotta be celibate\nSomebody gotta be having their sex in a lex for the hell of it\nSomebody gotta be intelligent\nSomebody gotta be illiterate\nSomebody gotta go all the way\nSomebody gotta go a little bit\nSomebody got to be an idiot\nSomebody gotta be belligerent\nSomebody gotta be hip hop\nCause somebody else is living it\nSomebody gotta be spitting it\nSomebody gotta be ignorant\nSomebody gotta be holy\nBut somebody gotta have sin in it\nSomebody gotta be losing it\nSomebody gotta be winning it\nSomebody gotta be flippin' the style I'm kicking just a little bit\nSomebody gotta be into it\nSomebody gotta be out of it\nSomebody gotta be up for it\nSomebody gotta be doubtin' it\nSomebody gotta be running it\nSomebody gotta be all that\nSomebody don't even known that\nSomebody gotta come right here\nSomebody else gotta go back\nSomebody gotta be scheming\nSomebody gotta be a witness\nSomebody gotta be seeing in the meaning is different\nSomebody else gotta be somebody, for some else to be somebody\nSomebody else to run into to wealth, to try to create one body\nOne aim, one GOD, one destiny\nI'm not non-violent, you can back up off of me\nI sip my tea, and cock back three\nOne for Tiny Tim, Mr.Walt, and Evil Dee\nI hope you all see, the need for unity\nI'll never stop speaking about Marcus Garvey\nKwame Ture or Malcolm X all day\nBlack leadership today is all play\nY'all play, y'all immature black behavior\nIS worse than being a trader\nDo on to others, as you would have done do to your neighbor\nBig up to my philosophy majors\nFree Mumia Abu-Jamal from the cages\nWe writes the pages and teach all ages\nJustice, tell me what we want now\nJustice, for Mumia Abu-Jamal\nOr justice for Amado Dialo\nJustice, there is no peace without (*Justice*)\nAll dem mercy, now watch this\nI sing, 1,2,3 we the best\nKnowledge Reigns Supreme, as you can see, or KRS\nYou don't wanna test the team, why get a vest\nYou don't wanna be cursed in a verse, by the blessed\nKRS with the new sound for the eat and the west\nFollow no, follow no, follow no, follow no beast on a quest\nFollow no, follow no, follow no, follow no beast on a quest\nFollow no, follow no, follow no, follow no beast on a quest\nFollow no, follow no, follow no, follow no, follow no, follow no, follow no\nFollow no...\n\nFollow no beast, on a quest\nDo you hear me?\nFollow no beast, on a quest\nWord\nHip Hop ya don't stop\nTiny Tim ya don't stop\nKRS ya don't stop\nGet by us\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "H.I.P.H.O.P.", "href": "H.I.P.H.O.P.&&2175", "artist": {"unique_name": "KRS-One"}, "lyrics": "[KRS] Yeah that's the one -- yo Thor-El just just check your mic\n\nVerse One: Thor-El\n\nSo you wanna be the million dollar man, kid what's your plan\nMake a deal with the devil settle for a hundred grand\nNot enough I call your bluff, hit you with the stuff\nDeal with this and think you're tough, gimme a call when things get rough\nYou get no Vette and, if I could stay leaded\nI'm leavin' rappers one-legged from fakin like the prosthetic\nYou're artificial by cripple, rap is like your pistol\nGrim Reaper, I got the whistle, death I pull no tissue\nHit you, like the Mac-11, MC's subtract by seven\nCallin callin for the reverend, lookin' at hell like heaven\nI'm on the map, makin' it like the crazy on the track\nOh what the hell I get my mail while I raid you till it crack\n\nChorus: KRS and Thor-El\n\nH, I, P, H, O, P, we are\nH, I, P, H, O, P, we are\n\nVerse Two: KRS-One\n\nC'mon, uh\nDead two in the head before some A&amp;R tell me\nI must give up the streets you lift the company can sell me\nWhat's the sense in being large if you can't take a risk?\nThinkin' a risk upon a disc means you&#25262;e written off the list\nI'm not sayin' you can't have your fame and glory just don't bore me\nWhen I come to see you live, and I paid twenty-five\nThat's, crazy loot Kris is saying I don't play those games\nKilling Rhyme Sessions is the meaning of my name\nBut don't call my name in vain, 'cause I will appear\nAnd your livest MC will get slain right here\nSee I do the homework, and I do the extra credit\nYou could sell a million records, and still can't set it\nCause the Lex or Beem is probably just the matches and a Jeep so\nI'm sure your rap career now if they come before your people\nOh Lord! You can't be thinkin' about Billboard\nWith the mic cord, and several thousand people just bored\nBeing dope live is like being insured for life\nYou always get called back twice, you are\n\nVerse Three: Thor-El, KRS-One\n\nI burn like hy-dra-cho-loric and my city got itty\nHe's terrible, Thor-El's incredible and terrific\nIs it, that you're under the influence of local obvious\nRappers that die, but why, explain the obvious\n\nNo stoppin' this lyrics from the esophagus\nRockin' strictly the hip-hop populace\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "The Only One", "href": "The_Only_One&&1029", "artist": {"unique_name": "KRS-One"}, "lyrics": "In case you ain't know, check it\nLet me tell you right not and the whole world\nYou are the only one\n\nI saw them guys you were with\nI don't flash platinum watches and drop-top whips\nBut you can rest assure you're my perfect fit\nEvery dollar that we get, we be earning it\nYo, you never have to worry about me taking a trip\nOr leaving you at home so I can quickly forget\nYo, with me it's the opposite, you swerve the jeep\nYou the queen of your house, you earn your keep\nAnd I respect that, in high school we both got left back\nWe both were divorced and had setbacks\nBut you should never let that depress you\nGod has blessed you\nYo, here's what KRS do\nSupport your goals, keep you warm when it's cold\nIt ain't about now it's about when we get old\n\nLet me tell you right now and the whole world\nYou are the only one\nIn my heart you are that number one girl\nYou are the one (one, one, one)\nEven when your hair ain't done with no curl\nYou are the only one (one, one, one)\n\nCrazy why love making we already did\nShit, that's why we got four kids\nRomantic, our parenthood we planned it\nOn the queue two to England, cross the Atlantic\nRespect, you don't have to demend\nIt's like you got the perfect husband and your friends can't stand it\nEspecially when I watch the kids\nAnd when you come home I ain't trying to find out what you did\nIt flips theirs leave, 'cause they looking for the player\nA little boy trying to pay theirs cell phones and pagers\nBut with me you living with the savior\nWe be up in the temple of hip-hop, or chilling with the mayor\nI thank the creator\nWe don't need what they handing out\nThis is what your man is about\nIt's like peace and much love\nTrust and respect\nYour friends may have diamonds but they ain't get that yet\nThey may have the burghettes and cars and private jets\nBut all they're really good for is sex\n\nWe be hanging out late night at denys\nHaving conversations about every and any\nMany people want what we got\nA relationship that just keeps getting hot like hip-hop\nYou know I'm not the regular guy\nYou know I can't be compared\nYou know when the drama comes I ain't scared\nMy name rings bells in the street\nYou can say my name in any hood your protection is complete\nThugs be right on their feet\nSaying What, your man is Kris?\nYou don't worry miss\n\nBut most of the time you're with me and the kids\nMind at ease, chilling out at Chucky Cheese's\nThese are my kids, I know what their need is\nI know what the doctor bill in school to which in fee is\nMy daughter, I know who she is\nAnd all my sons know exactly what being free is\n\nNo, you might not get the drop-top three\nBut all your kids want to be like me\nTheir father, and even when times is getting harder\nThere's only one name you could trust, Kris Parker\n\nUh\nSend this out to you\nYou and yours... word\nIt's that time yo... that's word\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "I Will Make It", "href": "I_Will_Make_It&&2757", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One)\nInstead of reading the word of Christ, BE the word of Christ\nInstead of following God's word, BE God's word\nThat's the consciousness of hip-hop\nYou are not just doing hip-hop, you ARE hip-hop\nYou are not just reading the word of God, you ARE the word of God\n\n[KRS] I will make it\n[HWC] I will make it!\n[KRS] They can fake it\n[HWC] (??)\n[KRS] Time that I state it\n[HWC] I can create it\n[KRS] I create it\n[HWC] No one can make it\n\n(KRS-One)\nFor me, what you see is what you get in these days\nI'm so hungry you can throw my dinner right on the stage\nYou can bite down on my rage, bite down on my anticipation\nWith no doubt or hesitation, repeat this affirmation\n(I WILL MAKE IT) Not I wanna make it\n(SHOW 'EM HOW WE MAKE IT) In fact, we've made it\nEvery time we state and believe it we create it\nThe power of your very word is highly underrated\nSleepin' in the dark in the park watchin others push they cart\nSay this whole thing in your heart\n\n[KRS] I will make it\n[HWC] I will make it!\n[KRS] They can fake it\n[HWC] (??)\n[KRS] Time that I state it\n[HWC] I can create it\n[KRS] I create it\n[HWC] No one can make it\n\n(KRS-One)\nFor me, I ain't askin I ain't beggin I ain't pleadin\nIn a positive direction my lifestyle I'm leadin\nI'm readin about ways of achievin what I'm believin\nEvery time I'm speakin' I'm seein myself leapin\nOver buildings, over the one on the corner chillin'\nStraight into knowledge of self, countin' up millions\nChangin my situation, with creative visualization\nGivin' libation for this ancient information\n\n[KRS] I will make it\n[HWC] I will make it!\n[KRS] They can fake it\n[HWC] (??)\n[KRS] Time that I state it\n[HWC] I can create it\n[KRS] I create it\n[HWC] No one can make it\n\n[KRS] For me\n[HWC] I will make it... 'cause you're gonna make it!\n[HWC] I will make it... 'cause you're gonna make it!\n[HWC] I will make it... 'cause you're gonna make it!\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "Shutupayouface", "href": "Shutupayouface&&4611", "artist": {"unique_name": "KRS-One"}, "lyrics": "Yeah, whassup?\nWhassamatta you? (You) Why you lookin' so sad (so sad)\nKRS is back (he's back!) But you don't look so glad\nAh shutupayouface!\nLook at this place!\nWhy was I chosen to pick up the race?\nAnd carry the flame, the torch, the name?\nMillennium games, it's all the same\nSinners repent, many for fear\nEnd of the year, everyone cheers\nOnly a few hear my voice in they ears\nEveryone else well they really don't care\nBut what if I told you I could read the future\nAnd in the future, they the losers\nWe the winners, 'cause they the sinners\nWell it's all mathematics, can I eat my dinner\nAnd think (think) why was I made to link\nBetween them and the universe; battle, who the first?\nI don't really care, 'cause I'm really not here\nI'm showin you skill, but you still sayin' \"Where?\"\n\nWhassamatta you? (You) Why you lookin' so sad (so sad)\nKRS is back (he's back!) But you don't look so glad\nAh shutupayouface!\nEvery race, walkin' around with they head up in space\nThey cannot see that we all really one\nIn any battle I already won\nThank the creator, it's already done\nKRS-One? Leavin' 'em stunned\nDunn duh-duh dunn dunn done it again\nMe and Will and my brother named Ken, now let me tell you\nThe bass in your face, the highs in your eyes\nWill make you real-IZE\nIf you down with the Temple of Hip-Hop, you not no average GUY, or girl\nC'mon take a critical look in my world\nSee the metaphysical books that I twirl and twist\nForces the ventriloquist\nI'm just a dummy gettin' money at this name Kris\n\nWhassamatta you? (You) Why you lookin' so sad (so sad)\nKRS is back (he's back!) But you don't look so glad\nAh shutupayouface!\nKRS-One, Knowledge Reigns Supreme Over Nearly Everyone\nLook, I be chillin' readin a book\nWhile the hip-hop nation repeats my hooks\nAll I wanna see is y'all healthy and wealthy\nYeah we already did it, really what can they tell me\nAbout the pimps and the hoes, players and the clothes\nYou gets no money if you got no flow, no skill\nC'mon y'all it's time to build\nIf you got no skill, how you gon' build?\nBuild, c'mon y'all it's time to build\nIf you got no skill, how you gon' build?\n\nWhassamatta you? (You) Why you lookin' so sad (so sad)\nKRS is back (he's back!) But you don't look so glad\nAh shutupayouface! Negative ass...\nWe bring the light!\n\nNorth Carolina - they got me\nFlorida - they got me\nTexas - yeah they rock me\nIn New York City they got me\nL.A. - ha hah, they got me\nCanada - Up North they rock me\nD.C. - Atlanta, they got me\nHa hah - none of y'all can't stop me\n\nWhassamatta you? (You) Why you lookin' so sad (so sad)\nKRS is back (he's back!) But you don't look so glad\nAh shutupayouface! ...\nGive it to 'em...\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "You Gon Go", "href": "You_Gon_Go&&3588", "artist": {"unique_name": "KRS-One"}, "lyrics": "(Verse 1: KRS-One)\nI'm bringing back the style that others have pushed to the rear\nNow you see me, now you don't, now I'm everywhere\nMaybe you can see that knowledge does reign supreme\nRap is like a ballclub and I coach the team\nMove the crowd, that's what MC mean\nHow many albums I got? Mmmm... 12, 13\nI've told y'all before\nYou are not just doin' hip-hop, you are hip-hop\nThem jokers need to stop, be hip-hop\nI mastered this and him, her, they, them, that one\nShe and he did not\nI speak a lot\nI hit 'em in they weakest spot\nCome see me rock, yo, you'll leave in shock\nKRS, you ever wonder why he's so hot?\nIt's because he's not pop yo, he's hip-hop\nWest to East the sound of the police will rock\nIf you don't love this you won't have the heat I got\nDisciplined if you listening the beats (?)\nFuck the dumb shit yo, we gotta teach the tots\nThey say I preach a lot\nAnd last year the took the jeep and shot\nBut this year the beat will knock\n\n(Hook x2: KRS-One)\nI know where\nWe can go\nTo see how a real MC flow\nNo video\nNo radio\nJust a live show\nC'mon now you gon' go?\n\n(Verse 2: KRS-One)\nI'm still standing, demanding playing my lex jammin'\nCats wanna really see me start blam-blammin'\nPut away the cannon for this overstandin'\nI'm landin'\nLet the music play like Shannon\nI'm so hot, why not, I bring all the fans in\nWatch me now come alive like Peter Frampton\nListen to me people, listen to me loud and clear\nIt's time I found out what type of people up in here\nWhen I shout out the classic if you know it say yeah\nSouth Bronx-Yeah!\nMy Philosophy-Yeah!\nBlack Cop-Yeah!\nYou Must Learn-Yeah!\nYeah we gonna do it up in here\nI'm still standin'\nAnd rappers be mad-mad\n'Cause they know they'll give birth like the American\nFlag in Baghdad\nAll they do is blab-blab, that head chatter\nWhy the dopest MC always a dead rapper?\nI'm a real live rapper, I'm out to set it\nI pay dues, while your crews still on credit\nYou talk that shit till I come out the school\nAnd all y'all sound like Trina sayin' \"That's Cool\"\nTime for the streets again\nTime for them cats to pop gats into the mic you speakin' in\nI'm creepin' in with a hundred soldiers\nWhen I step on the stage it's over\n\n(Verse 3: KRS-One)\nThey don't play me a lot\nKRS you don't see a lot\nOn TV a lot, but I do MC a lot\nI don't duck and hide when I see the cops\nI'm free with the knowledge to free the block\nLive on the radio I'm sendin' my rhyme, you can see\nI'm behind enemy lines\nYou already heard about plenty of crime\nNow hear about the sciences that could really open ya mind\nI only got a little bit of time to rhyme before the\nProducer over here says \"Ok, that's fine\"\nSo let's get to it, I got my whole squad with me\nOn top'a all that I got God with me\nYou can go far with me\nFrom New York, to Atlanta, to LA\nYou know they all with me\nYou might not see me on this station cause this is a\nRapcity and KRS leads a Hip-Hop nation\nEven though y'all chase ends\nWhy can't weeeeee be friends, it all depends\nCats wanna thug it out\nIsn't it true that Hip-Hop was bigger when we all loved it out?\nLook at the difference in raps\nSee when I'm spittin' the facts\nLouder than anyone could rap, the industry collapse\nNo one's special anymore\nVariety is gone for sure\n\n", "album": {"title": "Keep_Right_(2004)&&4989", "genre": "Hip Hop", "year": 2004}}, {"title": "3rd Quarter - the Commentary", "href": "3rd_Quarter_-_The_Commentary&&4175", "artist": {"unique_name": "KRS-One"}, "lyrics": "For those interested in higher knowledge\nOn issues of health, wealth, and self-mastery\nYou are urged to register with the Temple of Hip-Hop\nBy filling out the attached registration form and questionnaire\nLocated on the album's pull-out panel\nAnd here now, another KRS classic\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "Ah-Yeah", "href": "Ah-Yeah&&3210", "artist": {"unique_name": "KRS-One"}, "lyrics": "Intro: KRS-One\n\nAh yeah, that's whatcha say when you see a devil down\nAh yeah, that's whatcha say when you take the devil's crown\nAh yeah, stay alive all things will change around\nAh yeah, what? Ah yeah!\n\nVerse One: KRS-One\n\nSo here I go kickin science in ninety-five\nI be illin, parental discretion is advised still\nDon't call me nigga, this MC goes for his\nCall me God, cause that's what the black man is\nRoamin through the forest as the hardest lyrical artist\nBlack women you are not a bitch you're a Goddess\nLet it be known, you can lean on KRS-One\nLike a wall 'cause I'm hard, I represent GOD\nWack MC's have only one style: gun buck\nBut when you say, \"Let's buck for revolution\"\nThey shut the fuck up, kid, get with it\nDown to start a riot in a minute\nYou'll hear so many Bowe-Bowe-Bowe, you think I'm Riddick\nWhile other MC's are talkin' bout up with hope down with dope\nI'll have a devil in my infrared scope, WOY!\nThat's for calling my father a boy and, KLAK KLAK KLAK!\nThat's for putting scars on my mother's back, BO!\nThat's for calling my sister a hoe, and for you\nBUCK BUCK BUCK, 'cause I don't give a motherfuck\nRemember the whip, remember the chant, remember about rope and\nYou black people still thinkin' about vot-ing\nEvery president we ever had lied\nYou know I'm kinda glad Nixon died!\n\nVerse Two: KRS\n\nThis is not the first time I came to the planet\nBut every time I come, only a few could understand it\nI came as Isis, my words they tried to ban it\nI came as Moses, they couldn't follow my commandments\nI came as Solomon, to a people that was lost\nI came as Jesus, but they nailed me to a cross\nI came as Harriet Tubman, I put the truth to Sojourner\nOther times, I had to come as Nat Turner\nThey tried to burn me, lynch me and starve me\nSo I had to come back as Marcus Garvey, Bob Marley\nThey tried to harm me, I used to be Malcolm X\nNow I'm on the planet as the one called KRS\nKickin the metaphysical, spiritual, tryin' to like\nGet wit you, showin you, you are invincible\nThe Black Panther is the black answer for real\nIn my spiritual form, I turn into Bobby Seale\nOn the wheels of steel, my spirit flies away\nAnd enters into Kwame Ture\n\nVerse Three: KRS-One\n\nIn the streets there is no EQ, no di-do-di-do-di-do\nSo I grab the air and speak through the code\nThe devil cannot see through as I unload\nInto another cerebellum\nThen I can tell em, because my vibes go through denim\nAnd leather whatever, however, I'm still rockin'\nWe used to pick cotton, now we pick up cotton when we shoppin'\nHave you forgotten why we buildin in a cypher\nYo hear me kid, government is building in a pyramid\nThe son of God is brighter than the son of man\nThe spirit is, check your dollar bill G, here it is\nWe got no time for fancy mathematics\nYour mental frequency frequently pickin' up static\nMakin' you a naked body, attic and it's democratic\nThey press auto, and you kill it with an automatic\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "Ya Feel Dat", "href": "Ya_Feel_Dat&&418", "artist": {"unique_name": "KRS-One"}, "lyrics": "Ya feel dat? (HO!) Ya see dat? (HO!)\nYa hear dat? (HO!) You believe dat? (HO!)\nYa follow dat? (HO!) Could it be dat? (HO!)\nYa follow dat? (HO!) Can you believe dat? (HO!)\nYa hear dat? (HO!) Ya see dat? (HO!)\nYou believe dat? (HO!) You can feel dat (HO!)\nYa follow dat? (HO!) You believe dat? (HO!)\nYa see dat? (HO!)\n\n(Verse One)\nShow me an MC that think he's too hot\nBring him to KRS-One, I'll show him he's NOT\nBlowin' the whole spot up when I spit up\nKnowledge Reigns Supreme, when I walk past, get up\nMy wrists ain't lit up! I don't even live that life\nGold, diamonds, platinum, I give to my wife - you see\nDiamonds are a girl's best friend, not mine\nYou got it, FINE - but what about that rhyme?\nCan you rhyme? Can you spit it quick\nLike watermelon pits at a picnic? Ha!\nOr are you just dressed up with nowhere to go?\nOr is the record company the pimp and you the ho?\nLet's go!\n\n[Chorus] w/ variations\n\n(Verse Two)\nI write my own books like I write my own hooks\nStep in the spot and these rappers be so shook\nThey don't look here cause KRS is BOOM!\nPlatinum rappers be hidin out in they dressin rooms\nYo, get away from me\nYou got a million dollar video but I'M the one they wanna see\nThe capital E-M-C-E-E\nA repitition of words, I been divorced Melodie\nI'm out, confident, no doubt\nI get what I gotta get when I spit I don't shout\nThis New Yorker, Kris Parker's a quick talker\nYou can get what I spit or get the klik-klocker\nOverseas I got the breeze as a hip-hopper\nWhere they speak eat and drop the beats proper\nStreet doctor, I'm +Brown+ and +Foxy+ like the +Ill Nana+\nWhoever you think is hot, I'm hotter\n\n[Chorus] w/ variations\n\n(Verse Three)\nRADIO! These suckers never play me\nOr Chuck - but do you think we really give a...\nSouthside, Westside, Eastside, North\nI spit the hot flame, you get your flesh torn off\nI come from that place where you cats can't face\nWhere cops can't chase or invade my space\nWe turn up the bass, you tremble in the place\nPhones ain't traced and flows we don't waste\nHoes we don't chase or kiss, they know they place\nWith Kris or Christ, they'll lose their life\nYou don't lose if you come in two's, you and a wife\nBut you crews wanna be bruised, so choose your knife\nChoose your gat, choose your rat, when the smoke clears\nYou'll be like, \"God damn - who was that?\"\nLoosen that noose around your neck and back\nEmbarassin blacks, ain't no respect in that!\n\n[Chorus] w/ variations\n\n(KRS-One)\nLet's do it! (HO!) (HO!) (HO!) (HO!)\nEverybody up top! (HO!) (HO!) (HO!) (HO!)\nYo, all my cats in the front! (HO!) (HO!) (HO!) (HO!)\nYo, yo, all my cats in the back (HO!) (HO!) (HO!) (HO!)\nYo, we out!\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "Hot", "href": "Hot&&4351", "artist": {"unique_name": "KRS-One"}, "lyrics": "Yeah\nWho will be standing when the smoke clears?\n\n(KRS-One) --&gt; Redman\n\nWord up!\nWhat's up with this?\nWe're coming through\nBoogie Down style, kid\nWhat's up\nThis is KRS-One\nThe light at the end of the tunnel\n\nYo, they not HOT, all they do is talk a lot\nThat's not HOT, where's your respect on the block?\nThat's HOT, not 'cause you're friends with the cops\nThat's not HOT, a real MC you're not\nI'm HOT, been hot, repeatedly heated\nDon't call the teacher, hah, you best be seated\nYou got these kids gased up like you own the inventory\nFake muthafuckas ain't tellin' the whole story\nTell 'em how you borrow from everyone you knew\nAnd now that you're on top, they can't borrow from you\nThat's not hot, tell 'em how you love bein pop\nCause you was so broke before, sleepin' cold on a cot\nYou don't rock, you grab money\nYour crocks rock the spot and you grab them honeys\nIt's about to get ugly\nI don't even go to these bullshit kiddie-ass clubs\nYou wanna be a thug? Let's thug\nFirst of all, soldiers speak to soldiers\nCaptains speak to captains\nLieutenant/lieutenant, cool?\nBut your first mistake is: he's steppin to me, rookie\nLike you a O.G. and you just a run-up, fool\nWho really got these streets on lock?\nWhose name really holds high respect on the block?\nWho opened up these clubs and taught you how to mix?\nWho opened up these thugs from Compton to the Bricks?\nI don't even sound like the rest of you kiddies\nI study the ways of God, you studyin titties\nAnd ass, I pity your class\nCause you come out with a blast\nBut you're trash, so you really don't last\n\nThey not HOT, all they do is talk a lot\nThat's not HOT, where's your respect on the block?\nThat's HOT, not 'cause you're friends with the cops\nThat's not HOT, a real MC you're not\nThey not HOT, all they do is talk a lot\nThat's not HOT, where's your respect on the block?\nThat's HOT, not 'cause you're friends with the cops\nThat's not HOT, a real MC you're not\nThis is hotter than heat, too deep, I'm on top of the streets\nYou weak, you ain't really rockin' these beats\nYou ?????, you dress straight, eat straight\nBut you're a slave, and yo, you can't come up in a heat tank\nG-o-d we thank, we watch what we sell\nYou better hope these Christians are wrong cause you goin' to hell\nThink about that when you're spittin' your raps\nAnd you call out KRS, I'll put you flat on your back\nYou're not HOT, all you do is talk a lot\nThat's not HOT, where's your respect on the block?\nThat's HOT, not 'cause you're friends with the cops\nThat's not HOT, a real MC you're not\nWhat's HOT?\n(KRS-One)\nThat's HOT!\nWhat's HOT?\n(KRS-One)\nThat's HOT!\nWho's HOT?\n(KRS-One)\nThat's HOT!\nWhere's your respect on the block?\n(*Scratching of*)\n(KRS-One need to be runnin' for office\nSo Butta-Pican Rican, tell 'em to get off it) --&gt; Redman\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "My Mind Is Racing", "href": "My_Mind_Is_Racing&&2921", "artist": {"unique_name": "KRS-One"}, "lyrics": "Vroom vroom vroom vroom\nMy mind is racing\nVroom vroom vroom\nMy mind is racing\nVroom\nMy mind is racing\n\nWhen you young you talk shit and get slapped up for it\nThe ice, the cars, the clothes, we already bought it\nThe streets, the projects, the hood, we already support it\nThe rep, the respect, them cases we already carted\nThe gold, the platinum plaques, we already flaunted\nThe leathers in freezing weathers we already sported\nThe wise see your lies and you already shorted\nThem boys they talkin' to boys, we men we ignore it\nThe whole planet, so-called Earth, we already toured it\nMy levels be on max with the bass distorted\nWhen the economy is up we getting all of that\nWhen the economy is down we still touring Jack\nLook back at '88, where them ballers at?\nThey was buyin' out the bar, I ain't fall for that\nSpending they money, you'd think the club would call them back\nBut they didn't, that shit was all an act\nI go\n\nVroom vroom\nMy mind is racing\nVroom vroom vroom\nMy mind is racing\nVroom\nI said my mind is racing like\nVroom vroom vroom\nMy mind is racing\n\nI'm a warrior\nI'm a warrior\nIn this concrete jungle it's hard to stay humble\nI'm a warrior\nI'm a warrior\nI bring that drama to whoever, whenever, WHAT!\n\nYo, let me tell you 'bout defeating the drama\nIn the street with the armour\nIt's the teacher, Kris Parker\nI be in the hood, looking good, speaking of honour\nBeing a father\nNot avoid the baby mama drama\nRespect myself I gotta, we gotta live proper\nThe True hip-hopper, hits yes a non-stopper\nA no quitter, heavy hitter\nLooks within to, be the winner\nNow let us begin the orientation\nHip-hop culture is what we call the nation\nBut annihilation is what we facing\nCats getting killed from Scott La Rock to Jam Master Jason\nThat's why we was at the United Nations\nLaying down the foundation\nFor hip-hop as a real nation\nYou know what time we wastin?\nBut...\n\nVroom vroom\nMy mind is racing\nVroom vroom vroom\nMy mind is racing\n\n", "album": {"title": "Keep_Right_(2004)&&4989", "genre": "Hip Hop", "year": 2004}}, {"title": "The I", "href": "The_I&&5682", "artist": {"unique_name": "KRS-One"}, "lyrics": "Where shall we land, there?\nWhich city shall we destroy today?\nThis one, or that one? This one?\n\n(KRS-One)\nTake a look a look around, we last forever\nWe carry books around, manuals are bound in leather\nWe rock the center, the only point that's in the circle\nWe free MC's, what we decree will not desert you\nWe know what we doin', we wise and we chillin'\nWe calculate against the continued cries of our children\nThey may be cryin now but they won't be cryin later\nWe love hip-hop, because WE are it's creators\nSo we, build the Temple, write the books, teach the classes\nCreate instrumentals, write hooks and rock masses\nNONE passes, without studyin this flow\nIt's all good as long as you know Kris know!\n\n(Chorus: Mad Lion)\nWhile I deal with I, Jah talk to I\nWhen I dem go alike, only de one comply\nWhatchu see with de I, look twice toward de I\nIf you don't unify your children them a gon' cry\n\n(KRS-One)\nI stand with the rejected, the unsuspected, the unconnected\nThe neglected the one you, never suspected\nIt seems you forget hip-hop plays the back\nSayin' that's my sound, and that's my sound\nAnd that's my track, and that's my rap\nAnd that's some chorus they did way back, look honey bringin' it back\nI'm actually, I'm everywhere at every time\nAnimating every rhyme and every dare in every mind\nKRS is my representative on Earth\nChallenge him not, he's been hip-hop since birth\nHis main objective, is to put hip-hop in perspective\nShow pity, and DESTROY these wack cities\n\n(Mad Lion)\nInna style dem a {?}, yo alla dem a cry\nDey worship slackness and to be under sky\nWe lead dem to de water but we cyan't make dem drink\nPussy to take a sip, cause it gon' make you t'ink\nWe don't usually {?} shit {?}, yo alla dem a sing\nWisdom wort more den any diamond and gold\nPeople use it and find it like de Dead Sea Scrolls\n\n[KRS] Take dem Lion, take 'em, take it over!\n\n(Mad Lion)\nCause of dem outer, dem outer, dem outer inter outer inter\nOuter inter outer inter out of control\nDey neva find wisdom till dem dead oh\nMad Lion make de {?} roll\nKRS make up a sea and bulge ya\nOf the story of never been told-a\n'Cause we outer, outer, inter outer outer ese\nOut of control, out of control\nI'm so serious ay (what?)\nWe don have no time fi play, ay (tell 'em again)\nSome people diss dem {?} hell's in this world\nBut dey'll come around one day\n\n(KRS-One)\nYo, yo, only Beezlebub think my voice is aggravatin\nChildren of light hear my voice and start congregatin\nThe mind's debatin, is he a prophet or is he Satan?\nBut the tree is only known by it's fruit, what am I creating?\nWhat am I stating? Have I stood the test of time?\nOr am I fading, or has God blessed my rhyme?\nSettle your dissin, you better be listenin, forever we glisten\nThe metaphysician with a better way, makin' a better day daily\n\n", "album": {"title": "Keep_Right_(2004)&&4989", "genre": "Hip Hop", "year": 2004}}, {"title": "Come to Da Party", "href": "Come_To_Da_Party&&8705", "artist": {"unique_name": "KRS-One"}, "lyrics": "[KRS] One, two, three...\n\n(Joe)\nCome to da party, come to the dance\nEveryone is fightin\nSo they fired up, up and away\nCome to da party, come to the dance\nTo pull out the vinyl\nSo they fired up, up and away\n\n(KRS-One)\nYeah, yeah\nHardcore lyric comin' at ya they attackin ya\nRappers bite like Dracula the soul of hip-hop\nI'm puttin' back in ya, with the South Bronx vernacular\nBound to put the crack in your armor, I am much sharper\nThan a lot of other mic rockers, slightly eccentric\nBut everything's authentic, when I said, \"I'm hip-hop,\" I meant it\nEmcees wanna debate the issue, but false though\nIf they studied they would see that they are hip-hop also\nHip-Hop you can't do it, you gots to be it\nYou can't confine it, you have to free it, so you can see it\nAs your expression, and learn the lesson, on life in ghetto sections\nAnd what you feel is the forward direction\nFor black people, not these Star Wars save that for R2-D2\nI got five fingers like Bruce Lee do\nAnd with the five fingers I grab microphones and bring the\nStinger to DJ's, rappers, singers and beer drinkers\nThis MC's a thinker, unlike others but I won't diss yaz\nYou're still my brothers and sisters, Kris is\nONE aspect of hip-hop rap\nNegative rap, positive rap, forget that black it's a trap\nTo set us back, concentrate on various rap talents\nPresently the rap radio format is unbalanced\nYou either got the player, or the conscious rhyme sayer\nAll day, on your radio, not with a different flavor\nSomeone has to DIE before you hear a conscious record\nPeople don't like gangsta rap, but conscious rap, they don't respect it\nThe truth is people are afraid of black youth\nOur expressions, our lessons and gold teeth, so...\n\n(Joe)\nCome to da party, come to the dance\nEveryone is shoutin\nSo they fired up, up and away\nCome to da party, come to the dance\nEveryone is singin'\nSo they fired up, up and away\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "The Message 2002", "href": "The_Message_2002&&1296", "artist": {"unique_name": "KRS-One"}, "lyrics": "Uh-ha! Uh-ha!\nAnother Inebriated beat\nYou know what time it is, straight for the street\nKRS-One, hold tight! Look, look\n\n(Chorus One: KRS-One)\nCrack - don't mess with that\nSpeed - don't mess with that\nIt's whack - don't mess with that\nGreed - don't mess with that\nKnowledge - yeah, mess with that\nGod - yeah, mess with that\nCollege - yeah, mess with that\nA job - yeah, mess with that\nLook look; dealing - don't mess with that\nCrying - don't mess with that\nStealing - don't mess with that\nLying - don't mess with that\nMeditation - mess with that\nForgiveness - mess with that\nEducation - mess with that\nHip-Hop - we lovin' that\n\n(Verse One: KRS-One)\nI rhyme for respect y'all, intellect y'all\nNot sex y'all, move that neck y'all, correct y'all\nChecks y'all, cash y'all, don't last y'all\nWith cops y'all to blast y'all, harass y'all\nFlash y'all as they pass y'all, through the glass y'all\nThese videos gas y'all 'cause they trash y'all\nI ask y'all this fact y'all\nUnaired y'all, these cops y'all they scared y'all\nThey fear y'all they hear y'all they hate y'all\nLess than 40,000 a week, they make y'all\nCops y'all with black feet, livin' from week to week\nWalk crooked beats in the streets y'all\nThey greet y'all with the heat y'all, to defeat y'all\nIt's deep y'all, hear what I teach y'all, and speak y'all\n\n(Chorus Two: KRS-One)\nHate - don't mess with that\nTrends - don't mess with that\n? - Don't mess with that\nRevenge - don't mess with that\nTruth - yeah, mess with that\nSkills - yeah, mess with that\nProof - yeah, mess with that\nBuild - yeah, mess with that\nWars - don't look for that\nFreaking - don't look for that\nWhores - don't mess with that\nCheating - don't mess with that\nG.E.D. - mess with that\nScience of mind - mess with that\nFamily - mess with that\nHip-Hop - we lovin' that\n\n(Verse Two: Shuman)\nYeah, yo... aiyyo, yo\nWho seein us, with an overdose level of free in us\nThey bring the heat to us\nThey don't really want the beat in us\nTake heed to us\nWhile they plottin and schemin to be deletin us\nBest believe in us, they not defeatin us\nThem glocks wanna bust\nWith twenty-one shots to put the leak in us\nSo they can bloody the street with us\nWhat does it mean to us\nYou know what they need from us\nGive cream to us, hide the lies and deceit from us\nThat doesn't equal us\nWho's ready to get in the Jeep with us\nForm a fleet with us and take back the street with us\nMeet with us, drop bombs in the street with us\nNever saw it comin', attack on the sneak with us\nThus, they can't compete with us\nWe flow through your veins like DJ's\nWhen they cut, you'll be bleedin us\nI came with Kris to heat it up\nShowin my body's the temple, hip-hop is the lock\nNow put the key in us\n\n(Chorus One)\n\n(Verse Three: KRS-One)\nTruth y'all, facts y'all, proof y'all, black y'all\nTime to check this map y'all, are we goin' back y'all?\nLet's make a pact y'all, come together watch your back y'all\nStay in tact y'all, never whack - gimme dap y'all\nComin' at y'all, headcrack y'all with the facts y'all\nPolice y'all, on the attack y'all if ya black y'all\nSo if this is fact y'all, when we rap y'all\nOver the track y'all, why we rap about crack y'all?\nThat's whack y'all, we trapped y'all\nHoldin' the gat y'all just to kill another black y'all\nClak clak clak y'all, it's like that y'all\nKRS-One yo, let's take it back y'all, listen!\n\n(Chorus Two)\n\n", "album": {"title": "The_Mix_Tape_(2002)&&6676", "genre": "Hip Hop", "year": 2002}}, {"title": "Build Ya Skillz", "href": "Build_Ya_Skillz&&1551", "artist": {"unique_name": "KRS-One"}, "lyrics": "(Feat. Busta Rhymes)\n\nVerse One: KRS-One\n\nCheck, I control your mind with one rhyme I speak\nAnd get you open like a prostitutes buttcheeks\nRapper get kicked in they mouth with cleets\n'Cause they're speech refuses to reach beyond the beach\nHave a seat quick I speak or spit flicks on your ???\nTime to complete shit, no weak shit, I mean freak shit properly\nI can feel myself becoming a lyric monopoly\nOthers will copy me but repeat my shit sloppily\nShocking me with inclinations of rocking me\nInsanity it got to be\nMy true idenity is never meant to see\nI simply use the gifts sent to me mentally\n\n(Busta Rhymes)\nYo! Word up! Get from out my face, before you get bust quickly!\n\nVerse two: KRS-One\n\nThat's the hip hop, the hibby\nI rip it in a minute 'cause I'm gifted\nLike December 25th\nNow let me flip\nI'm all knowing lyrically syllable growing\nEven when it's snowing I'm party going\nFree flowing and stomping!\nNever tip-toeing\nOverthrowing the comp\nBig up Bronx!\nI got more styles than the planet got women\nI got as many rhymes as is many styles of women\nDon't make me come out on that ass start flippin'\nYour mental I'm afflictin'\nActin' ill and sickin'\nPickin' the victim at random, slammin' 'em\nDraggin' them to the stage and dismantlin' them\nAs my Hydrogen turns to Helium I shine!\nNone of your lyrics I'm feelin' 'em\nYou rhyme\nLike you should be wearin' an apron scrapin' a pot with a name like Mariam\n\nBut rappers talk too much shit\nAnd can't back it up with lyrics\nBuild ya skills\n\nIt's time for the raw shit\nNot that on tour shit\nThat real hardcore shit\nKRS-One runs shit like diarrhea\nBitin' motherfuckers hear my shit and get up outta here!\nI don't care this year\nAlot of albums is wak this year\n\"Will KRS bring it?\" Ah yeah!\nThanks for the invite\nIt's just about to get hype\nThat straight up raw street type shit is what it feel like\nI will be displayin' lyrical styles I'm saying\nLyrical styles from the miracle child\nWant a pile of ill styles wildin' on your radio dial?\nSmile\nI been here for awhile\nPeep my style while I go on with the song\nI rock the microphone then it to the streets with the Krylon\nClicka clacka! clicka clacka!\nTake a spraycan and slap a wak rapper!\nStacks of money for videos I don't have it\nYou're lookin' at the last MC with true talent\nGet your tape recorder fast kid\nBoombastic another classic\nTurn up the cassette!\nAll my styles are lyrically fantastic and movin'\nWhile soothin' any urges for booing\nUngluing your mouth from my private\nThe more the merrier\nSyllable superior\nEast coast- West Coast battles are inferior\n'Cause I by myself will take out the whole North America\nWe need to expand rap beyond this land\nSet up competitions with England and Japan\nWorld cups for rappers that really fuck shit for fun\n...Yeah I know I'll get one\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "Get Yourself Up", "href": "Get_Yourself_Up&&9102", "artist": {"unique_name": "KRS-One"}, "lyrics": "Yeah\n(Yeah)\nYeah\n(Yeah)\nAh-ha\n(Ah-ha)\nAh-ha\n(Ah-ha)\nHardcore!\nWord\nHardcore!\n\n(*Live excerpt*)\n(You really think they're ready, black?)\nLet's break it all the way down\nAll the way down\nHuh-huh\nDon't be fooled\nDon't be fooled\nRap is something you do\nHip-hop is something you live\nRap is something you do\nHip-hop is something you... (*crowd responds*)\nRap is something you do\nHip-hop... (*crowd responds*)\nYou are not just doing hip-hop...\n(*Crowd responds*)\n\n\nYeah\nLet's get this started\nWord up\n\nYou gotta - get - your - self - up!\nYou been knocked down?\nGet yourself up!\nYou been shot down?\nGet yourself up!\nYou been locked down?\nGet yourself up!\nGet - your - self - up!\nBeen knocked down?\nGet yourself up!\nBeen shot down?\nGet yourself up!\nYou been locked down?\nGet yourself up!\n\nWhat is a real hip-hop MC?\nIs it MTV, is it BET?\nIs it five m-i-c's\nSo the people can see\nI mean, how you think you're free\nWhen you act like property?\nTell me, how do you judge an MC when he's rockin'\nI mean rockin' it live, not pickin' his cotton\nI mean adjustin his clothes, I mean how do you know\nBefore you come to the show that you're not gettin' heated\nThat you're not gettin' cheated\nThat you ain't come to the club thinkin' 'I must've been weeded!'\n(Word)\nYou got to be a educated consumer\nSpend your money on MC's cause these rappers'll do ya\nAss they want is your cash, ass, grass, gas in a flick\nWhen you ask for that autograph they ass-dash quick\nBeware of the rapper, he talks like it don't matter\nHe pulls his gat while we bust off the gatler\n\nThis is the \"Sneak Attack\"\nThe \"Edutainment\" style returns like that\nTake it off your shelf\nCause all we deal with is knowledge of self, health and wealth\nNot Stealth bombers, leather goose bombers\nOriginal hip-hop armor on CD-rom - eh\nYou got to get with a\n21st century philosopher\nRepresentin the religion of hip-hop, sir\nThose that oppose are foes and will get rocked - eh\nStopped, eh - I rise like a helicopter\nLike Zulu I'll Shaka, crowd\nWith a beat that's loud\nHuh, I'm black and I'm proud - irrelevant\nI'm black and intelligent\nI teach my kids to watch the education they give em\n'Cause it's really all about street wisdom\n\nTrue hip-hoppers don't bleed\nTrue hip-hoppers don't need\nTrue hip-hoppers don't speed\nNo time for greed\nTrue hip-hoppers do read\nAnd will lead, not plead\nWill sow seeds that breed\nAh-ha that's safer than weed, indeed\nTrue hip-hoppers don't slave\nTrue hip-hoppers don't crave\nSilver and gold, we're not amazed\nWe live f-r-e-e\nIf you not into lyrics you can't really hear it nor see me\nMy philosophy keeps it plain and simple\nHere it is: the kingdom of hip-hop is within you\nOr is it the kingdom of hell that sends you?\nI'm ringin' a bell within you\nYou only seek in a cell, that's what sin do\nIt tells you to put your craft on a menu, a chart\nSo they can sell you and your art\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "Ain't The Same", "href": "Ain%27t_The_Same&&9828", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS)\nYou know it's Kris!\n\nIt ain't the same now (it ain't the same)\nThey switched the game now (they switched up on us)\nThey talk 'bout chains now (bling bling)\nRims on the Range now\nIt's sounding plain now\nY'all rock the same style (sound of the mic)\nI know the way how (I know)\nBring it back to one\nIt's supposed to be...\n\n(KRS)\nThis is the way it's supposed to be\nIt's supposed to be like you more close to me\nIt's supposed to be about our families\nIt's supposed to be about avoiding catastrophe\nBut it's all about salary and flattery\nDistrust, lust, hate and tragedy\nIt's supposed to be about you and me on the same route\nWere you there in eighty-six when I first came out?\nAnd you know about how they runnin' this game out\nIt's supposed to be about fun and getting' the pain out\nBut it's all about clout and poppin' them chains out\nInstead of forgiveness, we poppin' they brains out\nIt's supposed to be about seekin' in the seek out\nYou witnessin' injustice, you got to speak out\nIf you claimin' you love this, you got to release doubt\nKnowledge is what I'm all about\n\n(KRS)\nWell it's supposed to be sunlight over me\nLight over you, not you runnin' over me\nIt's supposed to be a two dollar royalty minimum\nA Hiphop guild&#243;we got to begin buildin' 'em\nIt's supposed to be NO police brutality\nAnd the fact that we tolerate that crap is insanity\nIt's supposed to be museums and archives\nWhere people can see the importance of OUR lives\nBut it ain't about any of this\nCats are trying to get that diamond-studded Rolex on they wrist\nYou hear a voice in the wilderness&#243;you know it's Kris\nHigher consciousness lyrics, they will persist\nBut it's supposed to be about makin' it better\nYou see, Hiphop's not a product like pants or sweater\nGo ahead&#243;be a hero, get your cheddar\nEven y'all gonna see when you look back you remember that\n\n(KRS)\nYou can see in your heart how it's supposed to be\nYou doin' your part, THAT'S how it's supposed to be\nPursuin' your art, THAT'S how it's supposed to be\nToday you will start, THAT'S how it's supposed to be\nIt shouldn't be about you movin' slowly\nThen talkin' junk when you don't even know me\nAnd you cats be pussy like Josie\nI +Touch+ \"50 MC's\" like +Tony+\nEverybody in the hood ain't your homie\nI spit the truth, but I'm not the only\nThere's plenty\nK-R-S-O-N-E\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "Down the Charts", "href": "Down_The_Charts&&7934", "artist": {"unique_name": "KRS-One"}, "lyrics": "You cats still worried about chart position\nIt's the heart that your missin'\nIt's the art that your missin'\nJust a little something to hold y'all over\nThe Kristal album on the way, word up\n\nWhen you're number one, everybody come\nBut when you drop to two everybody still with you\nBut when you drop to three everybody want to see\nBut when you drop to four everybody still endures\nBut when you drop to five people will help you strive\nWhen you drop to six you still in every mix\nBut when you drop to seven people start guessin\nWhen you drop to eight people hesitate\nBut when you drop to nine that's when you start to find\nThat when you drop to ten you start to lose your friends\nWhen you drop to eleven your record stop sellin\nWhen you drop to twelve it's everyone for themselves\nSo when you drop to thirteen you stop working\nWhen you drop to fourteen no more self esteem\nYou drop to fifteen 'cause you lived and you seen\nWhen you drop to sixteen you now out the scene\nWhen you drop to seventeen you see things you never seen\nLike when you drop to eighteen you know what it mean\nSo drop to nineteen and on then to twenty\nAt nineteen you lose your honey\nAt twenty your money to a Playboy bunny\nAt twenty one things ain't funny\nAt twenty two you don't know what to do\nSo you hit twenty three you look for security\nSo you drop to twenty four no more can you endure\nWhen you drop to twenty five at the bottom you've arrived\nWhen you drop to twenty six you in a old school mix\nWhen you drop to twenty seven until you start steppin\nWhen you drop to twenty eight you start to meditate\nWhen you drop to twenty nine you expand your mind\nWhen you drop to thirty you see it was all dirty\nNo you drop to thirty two and it occurs to you\nWhen you hit thirty three now you can see\nThat it's all about skill and a love for the art\nNot whose above or whose below in the chart\nYou got to look in your heart\nIt's there where you start\nI and hip hop are never ever ever apart\nWORD!\n\n", "album": {"title": "The_Mix_Tape_(2002)&&6676", "genre": "Hip Hop", "year": 2002}}, {"title": "The Lessin", "href": "The_Lessin&&7977", "artist": {"unique_name": "KRS-One"}, "lyrics": "Yeah... uh-huh... underground, never stop y'all\nUnderground, K.P. y'all c'mon!\n\n(Chorus: April S. Williams)\nAin't no stoppin' what we done\nDon't give up this fight is won\nThere's no way they can hold us down\n'Cause with power and strength we gonna take it now\nTake that stand realize the truth\nKnowledge intellect bringin' minds anew\nThere's no way they can hold us down\n'Cause with power and strength we gonna save you now\n\n(KRS-One over Chorus)\nUh-huh\nYeah, yeah, yeah\nUh-huh\nTell them again, tell them again!\nUh\nGet 'em up now, word\nJust get it up now, uh-huh\nAll of the massive!\n\n(KRS-One)\nB, R, O, N, X\nSee these cars, see these checks, intellect\nSee these thugs, ain't no sweat, intellect\nA thousand miles, how do you do it? One step\nNow check out this flow, they wanna be down, but they cain't\nOriginal +Criminal Minded+ flow, they just ain't\nReady for the real, ready to peel off the paint\nYour style is fake, the teacher returns to debate\nYou the best? That's bull, you questionable\nHighly flexible, wasn't you sexual?\nNow you hardcore? You need to see God more\nI sit on the faculty; you, you sophomore\n\n(KRS-One over Chorus)\nUh, get 'em up\nYeah, get 'em up uh\nYeah, uh, that's right\nThat's right uh-huh, tell 'em again\nIt go... get 'em up\nYeah, that's right, uh-huh\nUh-huh\nAnother Kenny Parker exclusive!\n\n(KRS-One)\nTime to get it, now you did it, tryin' to spit it\nYou don't fit it, ask the critics, already did it, skipped the gimmicks\nI don't mimic, metaphysics, you'll admit it, better to live it\nBetter to give it, so I spit it every minute so you get it\nMy lyric is wicked an' full of culture y'all\nHuh? Battle, nah - get back in your car\nEither you never heard of me or you really wanna get with me\nBut as your teacher let me test you for a learning disability\nYou feeling me? Cause you can't, get it through your head\nThis is, sui-CIDE! You're better off dead\nLet me not amp you up, cause this style you can't do what\nMy stomach can take it and your stomach it'll cramp you up\nThis is, breath control, breath control stylee\nI get up all in that ass that (?) heinie\nTry me, back in the days you woulda had sorrow\nTry the teacher today, and you won't see tomorrow cause\n\n(KRS-One over Chorus)\nUh, we get 'em up\nUh, that's right, get 'em up\nYeah, uh-huh, get 'em up\nYeah, ONE MORE TIME NOW!\nUh, that's right, get 'em up\nUh-huh, uh-huh, get 'em up I HEAR YOU\nUh-huh, I HEAR YOU, WORD UP!\nLook at this!\n\n(KRS-One)\nLike a piss on the streets I exist\nNot the meat but the fish\nComplete the feat when I'm speakin' the heat into this\nWitness Kris rippin this\nDon't trip on this, skip ahead if you're ready\nMy show medley is deadly\nI'm about a hundred million mic years away\nThese players I don't hate, but I'm not here to play\nI hit it all day, all night, all afternoon\nRock all mics from the days of sassoon\nWhere the hell was you? On the corner with rats\nWhen we was at the LQ, lockin it down and that was that\nDivine speaker, mind keeper, time teacher, time leader\nI'll be sittin' in the club by the speaker\nWaitin for you rappers to choke up then I eat ya\nLike some prehistoric winged creature, Ah!\nOn your neck, like the American eagle facin East and West\nI be the best, Blastmaster KRS cause\n\n(KRS-One over Chorus)\nWe get 'em up\nUh, yo, we get 'em up\nLike, Yeah, I SEE IT OVER THERE\nI see it over there, it's... yeah it's over here!\nUh! Uh, one more time we get it up\nYeah, yeah, we get it\nUh, uh, IT'S OVER HERE NOW!\nIt's over here now! uh!\n\n(April and KRS-One ad lib)\n\n(KRS-One)\nAttention all true hip-hoppers\nLet us come together, for the unity of hip-hop culture\nEvery third week in May, is hip-hop appreciation week\nCelebrate with us\nThen, join us in November, for hip-hop history month\nBig up, to the Zulu Nation, PEACE!\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "What Kinda World", "href": "What_Kinda_World&&3503", "artist": {"unique_name": "KRS-One"}, "lyrics": "There's no such thing as a government\nThere's only people rulin over people\nPeople jerkin around people\nPeople lendin a hand to people...\nWhat part of the system do you play?\nWho do you oppress? ... Uh!\n\nWhat kinda world are we livin' in? Yo\nWhat kinda world are we livin' innnnnn?\nCan I get with my people? Can I sit with my people?\nBreak bread with my people? Move ahead with my people?\n\n(KRS-One)\nWhen every day, seven thousand kids are gettin' locked up\nWhen every day the justice system seems to stay stocked up\nWhen every day they cuttin' 'em down 'fore they even pop up\nWhen every day you gotta duck 'fore you get shot up\nWhat kinda world are we livin' in, spinnin in\nWinnin' in, sinnin in, let us begin again\nChurches are ran like corporations makin' me holla\nCorporations are ran like churches praisin the dollar\nThere's no way out, or is it? Release your doubt and live it\nTeachin metaphysics don't listen to these critics hear it\nWhat kinda world are we livin' in?\nBelieve in yourself, achieve for yourself, see for yourself\nSpeak for yourself, never weaken yourself, by deceivin yourself\nBelieve in your wealth, c'mon!\n\n(KRS-One)\nYo, yo, yeah\nWhat kinda world are we livin' out, we move about\nIn fear and doubt, tryin' to get more clout\nJust check it check it out, we took the wrong route\nTo a morality drought, basically I'm callin 'em out\nWhat kinda world are we livin' in, when a song\nWill not get on, unless it talks 'bout thongs\nNow where did we go wrong? We don't have long\nPreference all torn all worn not norm and all gone\nWhat kinda world do we live around, when we lay around\nLet me break it down, they shuttin us down\nWhile we play around, we fallin', stallin\nWhile God's callin, all in to fall in\n\n(KRS-One)\nWhen every day another unwanted pregnancy ends\nWhen every day another person is betrayed by a friend\nWhen every day it never ends, and the people pretend\nLike the President is there cause of them, let me ask\nWhat kinda world can we really trust\nWhen the cops they can shoot at us? Bo bo!\nWhat kinda world can we really grow (oh)\nWhen our daughters wanna be hoes (oh)\nAnd a father that nobody knows (oh)\nAnd a mother wearin them sexy clothes (ho)\nWhat kinda world are we livin' in, yo\nWhat kinda world are we livin' in, uh\n\n[Chorus] w/ variations\n\n(KRS)\nCan I get with my people? Can I sit with my people?\nBreak bread with my people? Move ahead with my people?\nCan I sit with my people? Can I get with my people?\nBreak bread with my people? Move ahead with my people?\nCan I sit with my people? Can I get with my people?\nBreak bread with my people? Move ahead with my people?\n\nFresh... for two-thousand-one... you SU-CKAZZZZZZ!\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "9 Elements", "href": "9_Elements&&530", "artist": {"unique_name": "KRS-One"}, "lyrics": "Well my ladies and gentlemen\nThis is a rapsession and my name is \"KRS-One!\"\nAnd when I talk about \"Hip-Hop Music!\", I know\n\n(Kris)\nOne : Breaking or breakdancing\nRally b-boying, freestyle or streetdancin'\nTwo : MC'ing or rap\nDivine speech what I'm doing right now no act\nThree: Grafitti art or burning bombin'\nTaggin', writin', now you're learning! uh!\nFour : DJ'ing, we ain't playing!\n{*Scratch*} You know what I'm saying!\nFive : Beatboxing\nGive me a {*beatboxin*} Yes and we rockin'!\nSix : Street fashion, lookin' fly\nCatchin' the eye while them cats walk on by\nSeven: Street language, our verbal communication\nOur codes throughout the nation\nEight: Street knowledge, common sense\nThe wisdom of the elders from way back whence\nNine : Street entrepreneur realism\nNo job, just get up call 'em and get 'em\n\nHere's how I'm tellin' it, all 9 Elements\nWe stand in love, no we're never failing it\nIntelligent? No doubt\nHip-Hop? We're not selling it out, we're just lettin' it out\nIf you're checkin' us out this hour, we teatchin' hip-hop\nHoly integrated people have it, I'm the present power!\n\nRap is something you do!\n3x Hip-Hop is something you live! *scratched*\nRap is something you do!\nHip-Hop is something you live! *scratched*\n\n(Kris)\nSkaters, BMX-bike riders rock\nDon't you ever stop! You are hip-hop\nYou doing the same things we did on our block in the suburbs\nYou know you be packing that black block\nSelling that crackrock and ecstacy\nGettin' pissydrunk, fallin' out next to me\nBut like I told those in the ghettoes\nHere's the facts! True hip-hop is so much more than that\nSome much more than rap, so much more than beats\nHip-hop is all about victory over the streets\nWhat you see on TV is a lie\nThat's not something you wanna live or pattern your life by\nBut, huh that's too much preachin' ain't it?\nYou don't want the ?education?, you wanna be dead on the pavement\nWell, so be it, some of y'all ain't gonna see it\nOthers wanna enslave your mind! Kris wanna free it!\n\nRap is something you do!\n5x Hip-Hop is something you live! *scratched*\n\n\"Oh yeah\" *scratched* --- From \"P is dead\"\n\n\"I have spent my whole life livin'\", \"talk to the fullest\", \"no doubt\"\n\n(Kris)\nYou know that's why these rappers can't hang\nCause the essence of hip-hop is not a material thang\nThey so careless, hip-hop is in a {?} we give\nRap we do, hip-hop we live\nHow many times I gotta say it? How the radio ain't gonna play it\nAnd you hip-hoppers sit back and okay it\nThink about it! (think about it)\nThe present course of action, we have got to reroute it!\n\n(Chorus: repeat 3X)\nHip-Hop is something you live!\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "Heartbeat", "href": "Heartbeat&&4429", "artist": {"unique_name": "KRS-One"}, "lyrics": "(Redman)\nAll right everybody move back from the ropes\nIf you don't move back we're gonna turn this music off\nAnd that's my word, move back!\nWord is bond let's get this shit goin'\nWord up, it's the Funk Doc in the house\nSay hell yeah! HELL Yeah!\nSay fuck yeah! FUCK Yeah!\nWord up, it's the Funk Doc Spock you don't stop\nIt's my man KRS you don't stop\nIt's the girl Angie you don't stop\nWith the hah haha ha haha hah!\n\n(Angie Martinez)\nIt's the Butter Pecan Rican speakin' deletin\nOther radio jocks that think they competin\nThey pre-sweetened, like candy, I'm hot like pepper\nBig up to Sandy but my name is Angie\nMartinez, what a true microphone fiend is\nSteppin up lovely with MY, AD-IDAS\nThrough your speakers, representin\nBoriquas, and all hip-hop rhyme seekers\nYou may think I'm crazy right, but I'm crazy hype\nSlay this nice y'all, every time Angie grab the mic\nI jams it right tonight, not the hardest\nBut peep the style of this Puerto Rican Goddess\n\n(Redman)\nAiyyo yo yo yo, stop the music!\nAiyyo back up off the ropes, man, word up!\nYo get from the off the ropes\nNow aiyyo yo yo, KRS-One, come again the selector!\n\n(KRS-One)\nIt's been a long time but we made it, you waited\nYou gettin' frustrated cause these MC's in trainin\nSkills on the mic for a royalty save it\nPullin down rap so that others can't make it\nThey can't fake it in front of KRS they naked\nThat same old MC trend I'm here to break it\nThe highly conceptional multidirectional\nHot in ninety-seven so I guess I'm flexible\nRap relieve stress so yes I guess it's medical\nAll your wrecking and raping is still theoretical\nRedman, you know you must understand (Whatup?)\nRedman, you know you gots to understand (Hah! Whatup love?)\nAngie, rockin' with the one BDP (Ha, haha)\nRepresentin right now at Hit Factory\n\n(Redman)\nOne two hah, and you don't quit\nIt's Kris and Angie with the ultimate\nOne two hah, and you don't quack\nIt's Funk Doc smoke weed and don't smoke crack\nHahaha, hah, and you don't quit\nHoohahhahah, and you don't quit\nI rock jams like, Samsonites with mics\nStage two boomin system and flood the lights\nThe lyrical, fo'-fo's lettin off like suppose\nReggie Reg is rockin' on the ra-dioooo!\nHah, huh, the ooh-child too chill\nCaps peeled, Someone In My Bed like Dru Hill\nRaise 'em up, 'cause I feel my spot can't be touched\nNo time for the Pauline jack, hit the clutch\nShotgun what?? It's the high exalted\nRuler of the buddha, the cash make my pockets\nStick out like a tumor, for the consumers\nI get busy with La Pluma, detonate the bomb\nTo make you hibernate sooner, certified luna-tic\nMy click run deeper than Charlie Tuna\nKahunas, raw for the able key movers\nAll over the hood like them Crooked I coolers\nBang maneuvers, from Jerz to Vancouver\nBack to the Bronx with heartbeats ample looped up\nI Blastmast like Kris, funk abyss\nLike a phone chauvinist with a Roley on the wrist\nSike! I can afford it, less I slaughtered\nThree platinum niggaz and none of 'em prerecorded\nKRS-One need to be runnin' for office\nSo Butter Pecan Rican -- tell them to get off his\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "Health, Wealth, Self", "href": "Health,_Wealth,_Self&&7213", "artist": {"unique_name": "KRS-One"}, "lyrics": "Yeah... yeah... yup!\nYou know what? I was just downstairs\nAnd I was on my way up here to the studio and\nA guy bumped into me and\nAnd he said... he said, \"Yo Kris!\nHow is it that you stay in this music?\nYou know, this rap music ex-specially for SO... LONG... SO... LONG\"\nI said, \"Well you know years ago I made a deal with the Goddess\"\nHe said, \"The Goddess?\"\nI said, \"Well yeah, you might know her as God\nBut I know her as the Goddess\"\nThe universal mother\nThe mother of everything you see in existence\nI ax-ked her for assistance\nIn lyrical persistence\nAnd she gave it to me, under one condition\nShe said, \"I'll give you the gift\nBut use the gift to uplift\"\nI said, \"Okay mom!\"\n\nSo I tell you the truth, really\nMe nah gon' need nuttin else\nBut health, wealth, and knowledge of myself\nMe nah gon' need nuttin else\nBut health, wealth, and knowledge of myself\n\nIn the beginning was the word, the word was made flesh\nKnowledge K. Reigns R. Supreme S.\nSome of us guess while others of us are blessed\nTake heed to the word, that I manifest\nI manifest the future, the present, followed by the past\nEverything in nature, rules by kickin ass\nWhat they tellin' me, but yo, you a friend to me\nSo I'ma tell you the secrets of MC longevity\nSecret one: if it ain't fun, you're done\nAnd about your career, huh, well choose another one\nIf you don't like what you do, you're through\nLesson two: make sure you got a dope crew\nNot some crew, that's like an anchor on a shoe\nA MAD CREW, that's of some benefit to you\nLesson three, might be contradictory or funny\nBut MC's should have OTHER WAYS of gettin' money\nThat's to say learn other things beside music\nMake money elsewhere, Hip-Hop you won't abuse it\nToo many MC's, just emcee\nSo their longevity, is based on an Uncle Tom\nAt the record company\nLesson four: sell your image, never sell a record\nImage is respected, records come and go\nAnd get collected\nEven the records of platinum artists, that used to rip shop\nCan be bought, for a quarter at the thrift shop\nWhich brings me to lesson number five, the illusion\nHas me thinkin', the minute they drop a record\nThey'll be cruisin, in the Acura\nSlow down! You're still a amateur\nWhat separates the pro from the amateur is stamina\nNot how long you can rhyme, but how long you've been rhymin\nChangin with the times, and findin yourself\nStill CLIIIIIIIIIIIIMbin for wealth\nBlow for blow, you're still growin', still showin\n(All knowin') now that's a pro at it\n\nMe nah gon' need nuttin else\nBut health, wealth, and knowledge of myself\nMe nah gon' need nuttin else\nBut health, wealth, and knowledge of myself\n\nThank you Mother, I'm out\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "Step Into a World (Rapture's Delight)", "href": "Step_Into_A_World_(Rapture%27s_Delight)&&5873", "artist": {"unique_name": "KRS-One"}, "lyrics": "Step into a world (Klaka klaka, klaka klaka!)\nWhere there's no one left (Buku, buku! Alla de massive!)\nBut the very best (Klaka, bo bo, BDP crew, bo bo bo bo!)\nNo MC can test *cut and scratch of KRS saying \"but one\"*\nStep into a world, where hip-hop is me\nWhere MC's and DJ's\nBuild up their skills as they play every day\nFor the rapture\n\nYeah, what what!\nYes yes y'all, ya don't stop, KRS-One, rock on!\nYes yes y'all, ya don't stop, KRS-One, rock on!\n\nI'm bout to hit you wit that tradional style of cold rockin'\nGivin' options for head knockin' non stoppin'\nTip-toppin lyrics we droppin' but styles can be forgotten\nSo we bring back the raw hip-hoppin\nJust like the records and tapes you be coppin\nCop some breakdancin, boogie poppin', and lockin\nTic tockin, guaranteed to have you clockin\nWe only get better and only better we have gotten\nThis type of flow don't even think about stoppin'\nBeware, the length of the rhyme flow can be shockin\nAll music lovers in the place right now\nThat never understood the way that KRS got down\nYo I'm strictly about skills and dope lyrical coastin\nRelying on talent, not marketing and promotion\nIf a dope lyrical flow is a must\nYou gots to go with a name you can quickly trust\nI'm not sayin' I'm number one, uh I'm sorry, I lied\nI'm number one, two, three, four and five\nStop wastin your money on marketing schemes\nAnd pretty packages pushin dreams to the beams\nA dope MC is a dope MC\nWith or witout a record deal, all can see\nAnd that's who KRS be son\nI'm not the run of mill, cause for the mill I don't run\n\nYes yes y'all, ya don't stop, KRS-One, rock on!\nYes yes y'all, ya don't stop, KRS-One, rock on!\n\nStep into a world\nWhere there's no one left (Alla de massive!)\nBut the very best\nNo MC can test *cut and scratch of KRS saying \"but one\"*\nStep into a world, where hip-hop is me\nWhere MC's and DJ's\nBuild up their skills as they play every day\nFor the rapture\n\nYeah, yeah\nEverybody on the mic in the party sound alike\nUntil I recite, in black and white what's right\nLet me take flight, my style is TIGHT AN GOOD\nTIGHT AN GOOD, come is it TIGHT AN GOOD\nOld styles I pass dat, slow down on fast rap\nAll in yo' ass crack, old King go Blast dat\nConjure to ask dat, hyper type of flashback\nI publish like ASCAP lyrics for hand clap\nNo past rappin', youth trackin, talent lackin\nMC's more worried about their financial backin\nSteady packin a gat as if something's gonna happen\nBut it doesn't, they wind up shootin they cousin, they buggin\nI appear everywhere and nowhere at once\nI know my style is bumpin, even though some people front\nIt's the God of rap, you heard of it\nThe one that rhymes toward the sky givin' airplanes mad turbulence\nIn rap tournaments, I reign permanent\nDon't you think by now the number one spot I'm not concerned with it\nThe course of rap I'm turnin' it\nBack to that good old fashioned way of getting cash money by earning it\nNo bogus hocus pocus, I bring back to focus\nSkills if you notice my position is lotus\nNow quote this, MC's are just hopeless\nThinkin' record sales make them the dopest\n\nYes yes y'all, ya don't stop, KRS-One, rock on!\nYes yes y'all, ya don't stop, KRS-One, rock on!\n\nStep into a world\nWhere there's no one left\nBut the very best\nNo MC can test *cut and scratch of KRS saying \"but one\"*\nStep into a world, where hip-hop is me\nWhere MC's and DJ's\nBuild up their skills as they play every day\nFor the rapture\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "Underground", "href": "Underground&&6306", "artist": {"unique_name": "KRS-One"}, "lyrics": "What does it mean to be UNDERGROUND?\nIt means you gotta be free to be UNDERGROUND\nYo, you got your own key when you're UNDERGROUND\nIf you're listening to me yo you UNDERGROUND\n\n(Verse One)\nIt's time that I open with a thunder sound\nNow look around your own town for the UNDERGROUND\nYo, you rhymin for the TV, or a million CD's?\nYou ain't a MC, you ain't UNDERGROUND\nYou could be platinum or gold, hot or cold\nBut it's the respect you hold that's UNDERGROUND\nWhen the critics don't get, that for the streets you spit it\nWhen your lyric they fear, that's UNDERGROUND\n\n(Verse Two)\nYo, white kids, black kids, skinny kids, fat kids\nThem Asian cats be UNDERGROUND\nChicanos, Palestinians, Milanos, fuck the Lone Ranger\nWhere's Tanto? That's UNDERGROUND\nFreddie Foxxx, Blackalicious, Kweli\nM.O.P., GangStarr that's UNDERGROUND\nMad Lion, Smif-N-Wessun, Buckshot\nArmageddeon T.S. that's UNDERGROUND, UHH!\n\n(Verse Three)\nYo, the t'cha returns, I told y'all I went to Cali to learn\nAnd that shit was UNDERGROUND\nIf the cops be eyein you, cause survive is what you try to do\nYo I'm wit you, you UNDERGROUND\nIf it's justice you want, and you protest the ice they flaunt\nYou want skills that's UNDERGROUND\nYo it's not about a rugger rapper, or an actor\nIt's about your subject matter that's UNDERGROUND\nLOOK!\n\n(Verse Four)\nChevonne Dean from Ruff Ryders, all the Outsiderz\nYoung Zee, that's UNDERGROUND\nWhen all your money's spent, and you're still hangin' on\nTo 50 Cent (get it) you UNDERGROUND\nWhen you rep the collective consciousness of hip-hop\nNot hip-pop, you UNDERGROUND\nYo it ain't about jewels, bitches and cars\nIt's about Nas, that's UNDERGROUND, yo!\n\n(Verse Five)\nTo be underground simply means that you're down\nFor the struggle, get 'em up, that's UNDERGROUND\nYou could be a classy lady or a whore\nBut if you protest the war, for sure, you UNDERGROUND\nIf the government can't see you, or deceive you\nYou love your people, believe you UNDERGROUND\nIf you refuse to play the game, you go against the grain\nYou ridin' the train, you UNDERGROUND - get it!\n\n(Verse Six)\nYo, yo, that blast from the past, like Grandmaster Caz\nBam and Flash, that's UNDERGROUND\nDoug E. Fresh, Lord Finesse, KRS\nIf you listenin to this you UNDERGROUND\nTurn it up now KRS about to show you how\nThey go wow, BLAOW for the UNDERGROUND\nMr. Walt, Evil Dee, KRS, BDP\nKenny P, that's UNDERGROUND - do it!\n\n(KRS-One)\n(All right!) Turn it up ah, turn it up ah\nTurn it up ah, turn it up ah\nTurn it up ah, turn it up ah\nTurn it up if you UNDERGROUND - LISTEN!\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "Why", "href": "Why&&1662", "artist": {"unique_name": "KRS-One"}, "lyrics": "[KRS-One] Class in session. What, is, democracy?\n[Student] Yo it's the rule of the people. The self rule.\n[Student] It's what the people want!\n[K] That's right. But is this a democracy?\n[S] Nah, democracy is a goal to be attained.\n[K] That's right. The character of the people should be reflected\n[K] in the laws and the institution of the state.\n[S] Psssh, I don't see my character reflected!\n[K] Tell me\n\n(Chorus One: KRS-One)\nWHY, are all the schools they fallin' apart\nAnd WHY, the youth not takin' no musical art\nAnd WHY, the professionals really don't know where to start\nNo, one, really, cares, about\nWHY, the people ain't trustin the law and the order\nAnd WHY, the hookers from 70's look like our daughters\nAnd WHY, the radio station they help with the slaughter\nNo, one, really, cares, about\n\n(KRS-One)\nThe mind, they usin' until it's time they doin' a rhyme\nWill ruin what you doin' if you crime pursuin\nLet me tell you bout gettin' your family out the mean ghetto\nTo green meadows, where you can finally be settled\nThat street level, freak level, pullin out heat level\nEatin meat level, deceit level, that's that beast level\nYou gotta stand upright in a house with three levels\nWhere you don't even see devils unless he shovels the snow\nMany philosophers live on the low\nNever crazy hazy or lazy we get up and go\nWhaddya know, I'm always teaching after the show\nNot messin with hoes, I'm with my wife, changin my clothes\nBlowin' my nose, deliverin blows to foes\nWith new flows; then disappear where nobody knows\n'Cause I got too many questions, too many lessons\nI gotta go, too many people stressin but I gotta know\n\n(Chorus Two: KRS-One)\nWHY, these officers gunnin us down on our block\nAnd WHY, the President never steps in on these cops\nAnd WHY, the mayor don't even look like he in shock\nNo, one, really, cares, about\nWHY, the call of the poor is always ignored\nAnd WHY, the senators governors breakin the law\nAnd WHY, they taxin and taxin and taxin the poor\nNo, one, really, cares, about\n\n(KRS-One)\nYou, me, or themselves you can tell, they livin' in hell\nBut they come on the TV lookin' so swell\nSellin you dreams of schemes of you gettin' green and cream\nBut they never explain the work and all it means\nYou got to visualize, close the lid on your eyes\nAnd visualize, minimize lies\nSee yourself bigger in size, quicker to rise up\nWise up climb up, before your time's up but\n\n(Chorus One)\n\n[S] The votes\n[K] That's right\n[S] The politics\n[K] That's right\n[S] The government you know!\n[K] Uh-huh, people basically have the government they want\n[S] If people felt dissed, they'd be out rebellin right now\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "Attendance", "href": "Attendance&&7294", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One)\nWho was the first to flash the heat on the cover?\nWho was the first crew to go against another?\nWho was the first to go acapella on a video replay?\nWho was the first to lose a DJ?\nWho was the first to teach at Yale?\nWho was the first to hit that hip-hop reggae, on the nail?\nWho was the first to say +Stop the Violence+\nAnd teach that real bad boys move in silence?\nYou're soon to see the mindbendin rhyme weapon\nGet more busy than two-two-three-double-nine-seven\nAll these rappers, swear they the best\nI know whatchu thinkin' about, \"Where's KRS?\"\nEighty percent of these rappers fake they {shit}\nThe other twenty percent they goin' upstate and {shit}\nThere's no way out except knowledge and wisdom\nI got it so I spit 'em you ain't got it you gotta get 'em\nWho was the first to produce mix and write\nAt the same time up in the club rockin' the mic?\nWho was the first to have a DJ and a side man?\nThe first to say what is hip-hop? \"I AM!\"\nWho was the first to produce gangster {shit}?\nPut out, gangster hits with a gangster click?\nNot no prankster {shit}, Steady B, Mad Lion\nJust-Ice, Shabba Ranks and {shit}\nMy Channel is Live, my only battle is Jive\nMC to MC, you won't survive\nYou'll be censored cause my Crew is 2 Live\nI ascend like Christ and watch you die\n(Chorus: repeat 2X)\nBreakers (HERE!) MC's (HERE!)\nWriters (HERE!) Beat-boxers (HERE!)\nDJ's (HERE!) Hip-Hop (HERE!)\nHip-Hop (RIGHT HERE!) Hip-Hop (RIGHT HERE!)\n(KRS-One)\nI'm like Noah, I'm takin' 'em, two by two\nI took, them and them and I'll take, you and you\nBe I'm right or be I'm wrong\nYou'll see I'm tight with this mic, you should be like, \"B I'm gone\"\nBut you still in my face Neo, I'm not your girl\nAll that ice and thug life, that's not my world\nI'm the teacher, but you still can't see\nCause while you respect Tupac, Tupac respected me\nAnother thing; don't ever show me another ring\nRemember you Rudy Ray Moore, I'm Martin Luther King\nEverything you bring sounds horrendous\nYou need repentance, 'fore I take attendance\n{*KRS-One hums a melody for a bit*}\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "Hush", "href": "Hush&&793", "artist": {"unique_name": "KRS-One"}, "lyrics": "Uh-huh, whatchu thought? Uh-huh, we was done?\nUh-huh, whatchu thought?! Yeah, yeah\nYeah, whatchu thought? Uh, uh, uh\nYo, yo, back again! What's that? Back again!\nWhat's that? Word! C'mon\n\n(Chorus 2X: Nyce)\nA North Face and skully hat don't MAKE YOU A THUG\nA army suit, a pair of Timbs don't MAKE YOU A THUG\nAn ill mug and a gat don't MAKE YOU A THUG\nA real thug is a thug that's HUSH!\n\n(KRS-One)\nYo, yo, yo, check it, check it\nLet us begin, KRS, winnin' again, KRS-One did it again\nKRS bigger than them, look at them they bit it again\nI think my gun just gonna start clickin again\nClick-clack, I always spit back\nAnybody call my name I go get that\nIn fact we draggin 'em out, to a deserted route\nThe teacher returns, you must learn, the word is out\nNo doubt highly respected, Front Page Records\nOff the hook, yet still connected\nAre you teachin yourself, teachin yourself?\nI'm like history repeatin itself\n\"Criminal Minded\", you've been blinded again\nLookin' for my style you can't find it again\nYou can find these others that may sound like Kris\nBut when it comes to the hands they don't get down like Kris!\nThey never ran up in the clubs with a hundred thugs\nNever had the respect of Crips and Bloods\nNever knew B.O., they never knew Big Pun\nThey never battled MC's, they never bust they gun\nThey don't know that, all they know is that show DAT\nThat's Digital Audio Tape if you don't know that\nNow go back and get my name correct\n'Fore I snatch that platinum from 'round your neck\n\n(Chorus 2X: Nyce)\nA doo rag a platinum chain don't MAKE YOU A THUG\nA fat ride with chrome don't MAKE YOU A THUG\nThat tough guy talk don't MAKE YOU A THUG\nA real thug is a thug that's HUSH!\n\n(KRS-One)\nWord, yeah yeah, uh-huh, yo\nYo, yo, yo (hit 'em Kris!)\nWhat mean the world to me? H-I-P, H-O-P\nAnd S-I-M, O-N-E\nAnd G-O-D, I stay low key\nI go down to hell, and slap up Satan\nThen return to heaven, where Scott LaRock is waitin\nResurrection, just like my brown complexion\nWhen I speak, I don't need protection from the heat\nI walk these streets and I'm quick to hit first\nThrow on any beat I'll be quick to spit first\nAnd rip town, I take one look around\nAnd all you hear is, \"Get down, get down, get down!\"\nKnowledge Reigns Supreme, I stay on blast\nThat's why these rappers want me to go on last\nThat's the truth, that's the fact, that's the deal\nForget sex appeal, my tech is real\nAnd my rep is real, K-R-S\nWoo-woop-woop! That's the sound of E-M-S\nThe rag on your head, it best stay white\n'Cause I can turn that red in a mintue a-ight?\nNow go back and get my name correct\n'Fore I snatch them diamonds from 'round your neck\nOnce again, get my name correct\n'Fore I snatch that platinum from 'round your neck\n\n(Chorus: Nyce)\nA North Face and skully hat don't MAKE YOU A THUG\nA army suit, a pair of Timbs don't MAKE YOU A THUG\nAn ill mug and a gat don't MAKE YOU A THUG\nA real thug is a thug that's HUSH!\nA doo rag a platinum chain don't MAKE YOU A THUG\nA fat ride with chrome don't MAKE YOU A THUG\nThat tough guy talk don't MAKE YOU A THUG\nA real thug is a thug that's HUSH!\n\n(KRS-One)\nYeah... yeah... yo, yo, yo\nTo all my heads who wanna see an improvement\nIn hip-hop culture, join this movement\nWe need more glocks than my man Freddie Foxxx\nThe knowledge I spit to the click it don't stop\nThat hardcore God-core, ready to start war\nRock more shock more top your pop tour\nI'm sure I'll drop the grade to zero\nWhen the teacher return, I don't chase DeNiro\nLike where yo? Where yo? They livin' in fear yo\nIt's a jungle sometime, but I got my spear yo\nThe album's called \"Sneak Attack\", that's what it is\nKRS-One spittin' facts to kids\n\n(Chorus: Nyce)\nA army suit, a pair of Timbs don't MAKE YOU A THUG\nThat tough guy talk don't MAKE YOU A THUG\nAn ill mug and a gat don't MAKE YOU A THUG\nA real thug is a thug that's HUSH!\nA doo rag a platinum chain don't MAKE YOU A THUG\nA North Face and skully hat don't MAKE YOU A THUG\nA fat ride with chrome don't MAKE YOU A THUG\nA real thug is a thug that's HUSH!\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "The Truth", "href": "The_Truth&&1014", "artist": {"unique_name": "KRS-One"}, "lyrics": "<b>KRS-One</b>\nIt's not natural, if it goes against God\nIt's not factual, her truth is not hard\nIt's not natural, if it goes against God\nIt's not factual, gimme the truth!\n\nListen to the lyric as the negative is shrinkin\nIt's shrinkin out your life when you decide to change your thinkin'\nOne of the first things we gotta switch around of course\nIs Jesus Christ, and him dying on the cross\nYou're looking at the cross, surrounded in it's mystery\nWith Jesus on the cross in a, total misery\nNow separate Jesus from the cross so you can see\nThe truth about the cross, and the cross's history\nThe cross was created by the Roman government\nIt's only purpose and use is capital punishment\nBut Jesus Christ was all about the revolution\nWhile the cross was used as Jesus Christ's execution\nSee what if Jesus Christ was hung upon a tree\nUpon every church wall, that's exactly what you'd see\nIf Jesus Christ was shot in the head with no respect\nWe'd all have little gold guns around our neck\nIf Jesus Christ was killed in electic chair, now get it\nYou'd be knealing to the electric chair with Jesus still in it\nYou gaze upon the cross and you see the execution\nYou yell stop the violence but the cross you're still using\n\nIt's not natural, if it goes against God\nIt's not factual, her truth is not hard\nIt's not natural, if it goes against God\nIt's not factual, gimme the truth!\n\nSo I say listen, listen, open up your third eye vision\nGod is not down with religion\nReligion they be sellin it, listen up, God is intelligent\nReading of the bible is irrelevant\nYou gotta look within yourself, not a scripture\nKRS-One comes to rearrange the God picture\nIf you sit and believe, you can achieve\nIf you sit and accept, you don't know, what's correct or incorrect\nTake for instance Adam and Eve\nThe first two people on the planet, or so you believe\nTheir first time in heaven kids they had, Cain and Abel\nHuh, now let me show you, why the story's unstable\nAccording to the story, according to what you believe\nThere was only Cain, Abel, Adam, and Eve\nOn the whole planet, now use your intellect\nAnd tell me, what did Cain and Abel do for sex?\nUpon the whole planet there was not another\nCould it be for sex, heh, they were looking at each other?\nHold up! I thought the church wasn't into that\nBut wait, still yet, there is another fact\nHow did the world get populated? Now tell me if I'm wrong\nBut obviously Eve had it goin' on\nThink for a minute, I know it gets notorious\nBut yo G, check out the chorus\n\nIt's not natural, if it goes against God\nIt's not factual, her truth is not hard\nIt's not natural, if it goes against God\nIt's not factual, gimme the truth!\n\n<b>Rich Nice</b>\nYo yo...\nYo bring that back\nI wanna say something on this BlastMaster session\nYo this is Rich Nice\nYou brothers gotta stop treating these hoes like nice girls\nAnd these nice girls like hoes\n\n<b>KRS-One</b>\nTrue indeed, I'd like to welcome the rebirth of the Goddess\nWord up it's all about knowledge of self\nYo Busta Rhymes, why don't you take the session over from here\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "And Then Again", "href": "And_Then_Again&&8671", "artist": {"unique_name": "KRS-One"}, "lyrics": "Peace and much love my people, I am Minister Server\nRight here with the teacher, KRS-One\nAlbum #13, \"Keep Right,\" or you gon' get left\nYou know what time it is, ain't no time to be frontin\nTrust yourself, get with the movement\nYo teacher, let 'em have it - like this, c'mon\n\n(Krs-one)\nYou get the CD and then, it's time to see me again\nYou break it open and then, no we not jokin again\nTurn on your player and then, the rhyme sayer again\nPut in the CD and then, you can't believe me again\nTurn up the volume and then, we blowin' by you again\nYou start to listen and then, you see the mission again\nYou start to listen and then, you get the vision again\nU-N-I-T-Y that spells unity man\nOn G-O-D I demand, as you can see I don't end\nYour family I defend, don't battle me you won't win\nI'm not livin' in sin, but I'm livin' with Him\nHer/They/Them/Us trust yo let us begin\nKRS is unique, you can hear how I speak\nI be teachin the streets, I'm fin' ta reach for the peak\nI rock a club every week, I keep them thugs on they feet\nHe's back, just me, please, don't try to compete\nI kick that knowledge in college when I club it it gets rugged\nAnd you can see that these others be garbage and I love it\nUh, what's the state of hip-hop? Don't confuse it with rap\nIt's the state of your mind, it's the way that we act\nIt's that thing that makes you say yo I can never be whack\nIt's also clickin through my lyric lickings spittin' the facts\nHot tracks y'all prep for combat\nBaby I'm back, they crazy whack, takin' 'em out!\nThe philosophical flow son, that's live at my show son\nI'm soundin like no one, you feelin' me though?\nThe people want me back like they want The Arsenio Show\nThey want the real, not a video hoe!\nThis is KRS-One, you gotta believe me\nI'm sittin' in the studio with Nice and B.C.\nSee me tonight, we keepin' it tight\nIt's another from the brother KRS, \"Keep Right!\"\n\n", "album": {"title": "Keep_Right_(2004)&&4989", "genre": "Hip Hop", "year": 2004}}, {"title": "Free Mumia", "href": "Free_Mumia&&6330", "artist": {"unique_name": "KRS-One"}, "lyrics": "(Feat. Channel Live)\n\nKnowledge, where the people at?\nFree Mumia!\nChannel Live! (KRS-One, come and represent)\n(The wisdom)\nHah hah hah hah hah hahaha!\nFree Mumia!\n\nEverywhere I look there's another house negro\nTalkin' about they people and how they should be equal\nThey talkin' but the conversation ain't goin' nowhere\nYou can't diss hip-hop, so don't you even go there\nC. Delores Tucker, you wanna quote the scripture\nEverytime you hear nigga, listen up sista\n\nVerse One: Hakim, KRS, Tuffy\n\nI met up with this girl named Delores, a prankster\nI said I MC, she said, \"You're a gangster\"\nBut she was caught up, she hit the floor like a breakdance\nWrapped her up like the arms in a b-boy stance\nRecognize moms I'm one of your sons I'm hip-hop\nIn the form of Channel Live and KRS-One\nRepresentin MC's across America\nShe said, \"You're the one who be causin all that mass hysteria\"\n\nWisdom shall come out of the mouths of babes and sucklings\nBut you blinded by cultural ignorance and steady judging\nBut judge not, lest ye may be judged\nFor the judgment ye judge ye shall surely be judged, you gets no love\n\nShe said, \"I like it, that's why I jock it\"\nThen I said, \"You only on my back because I fill brother's pockets\"\nGot 'em drivin' Benzes Jeeps and Rolls Royces\nAttackin me will leave youth with no voices\nThe choice is yours not mine hang with me\nI'll have you freestyle and bombin graffiti\nWe can cut it up like like wax\nClaimin I cause violence but America was violent before rap, FACT\n\nChorus: KRS-One\n\nWarner, Elektra, Atlantic equals WEA\nInstead of fighting them why don't you go free Mumia\n(Repeat 2X)\n\nVerse Two: Tuffy, KRS, Hakim\n\nWild recital, I kicks the vital, like the Final\nCall as I watch, Babylon fall\nI had to Rush Limbaugh, get that pig with an axe\nTuffy dips to the side, buckin cannons that's phat\nBecause he censors the uses of the metaphor\nYou can get the dick bum up\nBecause it's you that brings the, real horrorcore\nExpenditures forgettin, gut from the poor\n\nWhy sure! Back before we were born they sold us out\nYeah Dade Jackson we know what you about\nYouse a Slave Mason, not a Free Mason\nBefore long the Goddess Tiamat through hip-hop you'll be facin\nDon't start me, 'cause I be the, lyricist\nAt the nineteen ninety-nine millennium party held at Giza\nSayin' he's a, fraud, oh my Goddess\nNever in your life should you disrespect an artist\nInstead, focus your attention on astronomy\nAnd the up and coming, shift in the economy\nIf you can't do that, then heed the final call\nTo free Mumia, Abu-Jamal\n\nHate to be so rough, it could be the White Owls\nHouse niggaz are full of crap, like my Colin Powell\nKickin vowels, is how we relieve the tension\nUntil we start to bounce white people like suspension (revolution)\nYou paint the pictures, the black man on the corner\nBut tell me, who blew up Oklahoma?\nThe City, ain't no pity, for the beast\nIt's Hakim that voice from the East\n\nVerse Three: KRS, Hakim, Tuffy\n\nBuck buck! Buck buck buck!\nIt sound like gunshots but it could be the plot\nOf a chicken, definition, is what you're missin' and\nListen to your children instead of dissin em\nSenator Dole doesn't understand the young people\nLike they be sayin' want to, but we be sayin' wanna\nThey gettin' dumber every summer as they walk the rope\nMaybe because they cannot understand the quotes\n\nWord, in actuality, this Norman Bates mentality\nAlways seems to represent, minus three-sixty percent\nFor degrees full circle, dead from the purple\nRays of the sun I gots melanin so check it\nBag your nuts quick or get sick from being naked\nSuspect it, was it a means for the end\nFor just a few to drive the Benz while you eat the pigskins\nTurned you into mannequins, cause the trick of technology\nA revelation, revalations\nSensation gives me inspiration of revolution\nThat's my solution, there will be no sequels\nI'm audi hundred forty four thousand with my people\n\nFrom Caligula to Hitler, now it's Schwartzeneggar\nA lust for the violence is the science of their behavior\nWho enslaved ya (it's the Devil) but the God of virtuosity\nAnd of the world created, could it be mental sodomy\nGot my mind twisted like the blades of fonta leaf\nI sit in disbelief as he crawls underneath\nThe rock cock back the glock, 'cause I don't trust\nThe Devil I rebel until Babylon is dust\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "Preserve the Kulture", "href": "Preserve_The_Kulture&&9716", "artist": {"unique_name": "KRS-One"}, "lyrics": "{*Audience clapping, beat starts*}\nWe've been having these gatherings for over 12 years\nUh, my first one, was ah at Latin Quarters in 1987\nWith Afrika Bambaataa - he threw the first one, that I attended\nWe kept the tradition going through the Stop the Violence Movement\nThrough Human Education Against Lies, Rhythm Cultural Institute\nAnd now the Temple of Hip-Hop\nThis is Hip-Hop's spiritual base\nAnd as a spiritual base, we look to guide the youth in that discipline\nUh, no culture is a culture, unless it has principles\nUnless it has morals, unless - we are unified\nIn some sort of principle, something we are not going to step beyond\nSomething that defines us\nWhat I'd like to do, is just for a moment as we... deal with this\nThink about your role in Hip-Hop\nThink about what you do everyday in Hip-Hop\nThis is not about right now\nIt's about twenty years from now\nIt's about ten years from now\nThe tapes are rolling, the notes are being taken\nThis is the type of thinking we have to get into\nIf this is going to survive and last\nSo again, Hip-Hop Appreciation Week, is a time of self-reflection\nA time for Hip-Hoppers to ask,\n\"What am I doing, to preserve the culture?\" {*echoes*}\n\n", "album": {"title": "The_Mix_Tape_(2002)&&6676", "genre": "Hip Hop", "year": 2002}}, {"title": "Hold", "href": "Hold&&9273", "artist": {"unique_name": "KRS-One"}, "lyrics": "Yeah... yeah...\nAll right, here we go...\n\nI'm thinkin' real hard about some money I can hold\nBut everybody I know is deep in the hole\nA steady payin' job is too hard for me to hold\nI call around for work but they puttin' me on hold\nBut in my hand a shiny .45 is what I hold\nI make a mayonnaise sandwich out of some whole-\nWheat, I'm feelin' weak, I can't hold\nI gotta rob somebody tonight and take the whole\nBank roll, some cash I gotta hold\nAt the bottom of my shoe is a little bitty hole\nThat's it, my mental sanity I can't hold\nI'm walkin' to the store with this pistol that I hold...\n\nYeah... yeah...\n\nHalf of me is sayin' maintain and uphold\nSuddenly I bump into some asshole\nHe's cursin' me out, but this pistol that I hold\nTook control, and in his head I put a hole\nAh man, now I'm lookin' around the whole\nArea, the gun is still hot that I hold\nI'm buggin' out, and I don't know how much longer I can hold\nI feel myself sinkin' deeper in the hole\nSo in my victim's pants I rip a little hole\nAnd felt for the wallet, and took the whole\nBill-fold, forty bucks is what I hold\nSuddenly I hear, \"Freeze! Police! Hold!\"\n\nYeah... mmmmm...\nCome on!\nYeah... wooh!\nCome on...\n\nIn the penitentiary I see a whole\nBunch of blacks and Hispanics that they hold\nIn my cell I cry like hell, my head I hold\nOne day somebody ax if my shoes they could hold\nI told this guy, \"Listen! My shoe's got a hole\nBut what's up with that shiny sharp knife that you hold?\"\nHe lunged forth, the first thing that I thought of was to hold\nThe arm with the knife so that he couldn't put a hole\nIn me, but then I put him in a chokehold\nTook the knife and in his neck I put a hole\nSuddenly all the C.O's come to me and it's me they hold\nBeat my ass and I spend two weeks in the hole\nI'm ready to bug out, my sanity I can't hold\nMy needs and wants messed up my life on a whole.\n\nDamn. Just wasn't satisfied with life.\n\nYeah... uh!\nYeah...\nCheck!\n\nThe moral to the story is... your addiction to your needs and your\nWants is what causes problems in your life. Make sure you got whatcha\nNeed. Put at a safe distance all the things that you want. It's wants\nThat get you into trouble.\n\nThis is the balance of life... the balance to life on a whole.\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "Ova Here (Remix)", "href": "Ova_Here_(Remix)&&5280", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One: speaking live)\nFirst of all, I don't know WHO, y'all saw on this stage before me (aight)\nI don't know WHO, y'all gonna see on this stage after me (true)\nBut THIS, is REAL... HIP... HOP! Worrrrrd UP!\nI'm gonna find out tonight, where the real hip-hop\n\n[Intro] + (live response)\nThe real hip hop is (ova here!)\nThe real hip hop is (ova here!)\nThe real hip hop is (ova here!)\nReal hip hop is (ova here!)\n\nBla-blaow! Bla-blaow!\nClear 'em out, clear 'em out - word!\n{*Scratching: \"Aww yeah!\", \"The real hip-hop, is ova here\"*}\n{*Scratching: \"KRS, come get up in they asses\"*}\n\n(Verse One)\nYou ain't Fo'Reel and you ain't Universal\nYour whole style sounds like a infomercial\nYou ignoramus, I'm the baddest with the mic apparatus\nChallengin the God of rap is madness, I'll snatch your status\nWith these elders lookin' at Billboard you could stop them\nBut I got enough albums to make my OWN top ten!\nYou limited, like the spread of traffic\nYou bite my style off the radio\nSo when you speak in fact I hear the static\nYou better Chillout like Chuck, I kick like three Norrises\nOne of my sixteen bar rhymes is eight of your choruses\nOf course it is, ridiculous\nWatch out, I be in the club inconspicuous\nGotcha, on your, hands and knees\nAin't it about time for some real MC's?\n\n[Chorus] + (live response)\nThe real hip hop is (ova here!)\nThe real hip hop is (ova here!)\nReal hip hop is (ova here!)\nReal hip hop is (ova here!)\n\n(KRS-One)\nYo yo, Beatminerz, turn up the track a little bit\nGonna do this right now\n\n(Verse Two)\nRemix it, don't re-fix it\nFirst brigade, second brigade - all swords lifted\nFormation, classified information\nCode red rhyme style accurate articulation\nDon't test my foreign relation\nThe cats in Brixton, Birmingham and London just waitin\nGot my cats in France like ill\nEven Africa's laughin' at'cha right along with Brazil\nThe West Indies? Jus' wan fi kill\nGot Canada mad at'cha, Germany heard of me, they seen the skill\nHip-Hop is more than a thrill to us\nA dollar bill to us, believe you will trust in that\n'Cause if you bust at me, on TV, CD\nInternet trust that, I WILL BUST BACK\nI turn down heat real quick, when I spit\nYou need the medicine what I speak is so sick\nThen again these veteran be better than many men\nForever we hit 'em again better than ANY trend they could ever say\nIn any season, hot warm cold or freezin\nWhen it comes to MCin, we believe in rhymin for a different reason\nNo frontin, my rhyme style tells you somethin'\nThey rhyme style tells you who they freakin\nBut you was already told - what does it profit a man\nTo gain the whole world and lose his soul?\n\n", "album": {"title": "The_Mix_Tape_(2002)&&6676", "genre": "Hip Hop", "year": 2002}}, {"title": "2nd Quarter - Free Throws", "href": "2nd_Quarter_-_Free_Throws&&5744", "artist": {"unique_name": "KRS-One"}, "lyrics": "Anybody in here right now with tape decks turn 'em on\nAnd put 'em on record, I'll give you a second\nI want to add authenticity to your tape\nSo when it's sold out in the street\nYou all can know this was a real party\n\nThese are poems circulating throughout the nation\nEverybody's bad and everybody's tough\nBut how many people are intelligent enough\nTo open up their eyes and see through the lies\nDiscipline themselves, yourself to stay alive?\nNot many\nThat's why the universe sent me today on this stage\nWith this to to say\nThe rich will get richer and the poor will get poorer\nAnd in the final hour many heads will lose power\nWhat does the rich versus the poor really mean?\nPsychologically it means you got to pick your team\nWhen someone says the rich gets richer\nVisualize wealth and put yourselves in the picture\nThe rich get richer, 'cause they work towards rich\nThe poor get poorer, cause their minds can't switch from the ghetto\nLet go, it's not a novelty\nYou could love your neighborhood without loving poverty\nFollow me, every mother, father, son, daughter\nThere's no reason to fear the New World Order\nWe must order the whole new world to pay us\nThe New World Order and the old state chaos\nThe Big Brother watching over you, is a lie you see\nHip-Hop could build it's own secret society\nBut first you and I got to unify\nStop the niggativity and control our creativity\nThe rich is getting richer, so why we ain't richer?\nCould it be we still thinking like niggas?\nEducate yourselves, make your world view bigger\nVisualize wealth and put yourselves in the picture!\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "Represent the Real Hip Hop", "href": "Represent_The_Real_Hip_Hop&&1114", "artist": {"unique_name": "KRS-One"}, "lyrics": "(Feat. Das EFX)\n\nOnly a few... will understand\nAnd appreciate what's about to happen\nDas EFX, come in!\n\nVerse One: Das EFX\n\n(Drayz)\nWell it's the super duper rhymer rhymer I'm about to set it\nNiggaz best forget it let it be or you'll regret it D\nSo what it B... the D to the fuckin' P\n(Yo it's me the lyricist they fear in this as you can see)\nI be's the ultimate, drop the ultra shit, fuck the other shit\nBiggety buttah shit is how we comin' kid we runnin' shit\nNow who you fuckin' with is Diggey Das EFX'n\nWe flexin, cause kid we got this rhyme and took effect y'all\n\n(Books)\nAiyyo I figgety flow I rocket blow a nigga out the socket\nKeep in mind to keep the dread, now they like my pocket, watch it\nIt's the rhyme fiend about a second from the crime scene\nThe boogie banger twisted off the lime green\nFuck a dime we, strictly fifty, the BDP and Hit Squad committee\nKing of my city, ask my cousin Smitty, yo\nGot to get the dough, got to blow the spot\nDiggity Das KRS East coast on lock\n\nVerse Two: Das-EFX, KRS\n\n(Drayz)\nTo corny niggaz y'all get ate, my shit'll make you faint\nSo much platinum on my walls that I can hardly see the fuckin' paint\nYou think it ain't before a year and stopped recordin\nNow look we comin' back and runnin' shit like fuckin' Michael Jordan\nAccordin, to my niggaz in the sewer\nYo you a, corny nigga so we gots ta do ya\n\n(Books)\nThis for my niggaz on the block, handlin rock like Kenny Anderson\nI'm brandishin, stiggedy styles to keep MC's vanishing\nScattering, fuck it, styles don't be mattering\nMy pattern's amazing son Blazing like a Saddle and\nBattling's a no-no, got more Fame than Coco\nI'm paid and still drips ya with a blade from my logo\nSo take your, style and Go-Go like D.C. niggaz\nY'all know the haps we movin strapped on the East nigga\n\n(Drayz)\nYo, yo, well miggedy mayday, mayday, it's Crazy Drayz's payday\nI riggedy wreck it eryday, kick shit like fuckin' Pele\nBut wait a, minute, 'cause we get in it for the masses\nFor classes, yo KRS come get up in they asses\n\n(KRS)\nWhat... I say, follow me follow me\nWith my syllable syllable lyrical criminal\nMC threats are minimal to my phsyical they just\nWhittle and whittle away, with little and little to say\nAs they piddle and paddle away, they say OK\nBut I chop that ass up anyway\nWhat's your handle I got mad MC heads upon a mantle\nI got genuine MC skin sandals\nI light the mic up like a candle, watch it melt\n'Cause when I felt lyrics you both are screamin for help\nWhen you hear it, you can't bear it, you can't even wear it\nYou oughts to just cheer it, go get it spirit!\nAs I fa-la-la-la-la, I'm comin' with that rara\nRockin' mics when you was googoo gaga to your momma\nYou wanted to battle KRS when you was young you told your poppa\nHe slapped you in your head and said UHH-UHH\nBut you didn't heed the warning\nNow I'm in the place, now I'm your face\nLookin' at your crew but they all broke out\nBecause they nothin' but lace\nKRS is like mace, in your motherfuckin face\nYo DJ Dice, tear down the place!\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "Out for Fame", "href": "Out_For_Fame&&4654", "artist": {"unique_name": "KRS-One"}, "lyrics": "* Train whistle *\nYo right here, right here\nIt's right through the fence, right through the fence\nJump!\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "R.E.A.L.I.T.Y.", "href": "R.E.A.L.I.T.Y.&&1446", "artist": {"unique_name": "KRS-One"}, "lyrics": "Reality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\n\n\"These are the streets!\nShit is real out here!\nThis ain't no fuckin' joke!\"\n\nI lived in a spot called Millbrooke Projects\nThe original Criminal Minded rap topic\nWith twenty cents in my pocket I saw the light\nIf you're young gifted and black, you got no rights\nYour only true right, is a right to a fight\nAnd not a fair fight, I wake up wonderin who died last night\nEveryone and everything is at war\nMakin' my poetic expression hardcore\nI ain't afraid to say it, and many can't get with it\nAt times in my life, I was a welfare recipient\nI ate the free cheese, while the church said believe\nAnd went to school everyday, like a god damn fool\nWell anyway, here I am, chillin' at the party\nBrothers lookin' at me like they wanna kill somebody\nA cypher manifested in the center of the jam\nI got to show these wack rappers really who I am\nIt's me against them, so I clear the phlegm\nAnd wage the war, hardcore to the end\nFor someone lookin' inside, yeah from the out\nIt seems like disrespect is what rap is all about\nBut hip-hop as a culture, is really what we give it\nBut sometimes the culture contradicts how we live it\nCause every black kid lives two and three lives\nThe city's a jungle, only the strong will survive\n\nReality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\nReality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\n\nEvery single day I hear lie after lie\nLike \"Black people don't die, we multiply\"\nSo when I kick a rhyme I represent how I feel\nThe sacred street art of keepin' it real\nWhy I gotta listen, to somebody else?\nHow they got wealth, let me talk about myself\nBut all I really got is hip-hop and a glock\nThe results are obvious, if I'm confined to my block\nOccasionally, in the city I'm released\nTo meet other beasts, lookin' for the feast\nWe grunt and growl, on the prowl, as the air gets thinner\n\"Yo yo there he go, him,\" there's the dinner\nWhite meat, carryin a bag of some sort\nLife is short, white meat is quickly caught\nA scuffle a muffle yet none of us hesitated\nLike Mother Africa, white meat is violated\nWe quickly disappear, like Santa's little elves\nAnd go into a area to fight amongst ourselves\nWe say, \"peace/piece\" cause that's what we really want\nA piece of the pie that America flaunts\n\nReality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\nReality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\n\n\"Oh shit!\"\n\nThe truth is that police must serve and protect\nREALITY is black youth is shown no respect\nThe truth is government has a war against drugs\nREALITY is government is ruled by thugs\nWith all this technology, above and under\nHumanity still hunts down one another\nRappers display artistic cannibalism\nThrough lyricism, we fight each other over rhythm\nThrough basic animal instincts, we think\nSo the battle for mental territory is glory, end of story\n\nReality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\nReality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\nYeah\n\n\"These are the streets!\nShit is real out here!\nThis ain't no fuckin' joke!\"\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "Gunnen' Em Down", "href": "Gunnen%27_Em_Down&&4452", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One)\nUh-huh! Y'all forgot about this shit right? Haha\nHaha, TURN THE RADIO OFF!\nWord! Yeah, whattup Choco? Haha\nYo turn it around for me one time\nUh, uh, yo\n\n(Verse One)\nI don't despise thugs, I +ADVISE+ thugs\nI teach y'all thugs, cause that's what I was\nYeah I say was cause today I'm above\nAll the guns, illegal funds, the crews and the drugs\nANY HOOD I walk in, they show me love\nThey say 'Knowledge Reigns Supreme, WHATTUP CUZ?'\nCops wanna get sit down and get all bud\nThey wanna think as they drink drink down to the suds\nI respect it, but I don't get down with the fuzz\nI don't drink with DT's I don't hang with the judge\nBut truth be truth and I got the proof\nMost ministers were straight thugged out in they youth\nSee if you're over 25 and you never got live\nWhen it was time to ride, you ain't got no heart\nBut if you're over 26 and you're still in the mix\nAnd your life you ain't fixed, you ain't doin' your part\nYou see them cats on TV, playin' the role?\nGassin y'all, them cats be over thirty years old!\nActin' all dirty and cold\nNONE OF MY CLASSIC ALBUMS they was worthy to hold\nI'm concerned with the soul, overstand?\nWhen we was slappin up rappers they was doin' the running man\nYou don't know my style, we be straight gunnin man\nIf you don't know you better ask your older brother man\nShit gets realer than, Real TV\nFrom eighty-six, ain't no rapper realer than me\nOr Just-Ice, I.C.U. or Steady B\nWhat y'all waitin to see? Somethin' faker than me?\nDon't let me have to pull out the Jamaican in me\nI'd rather pull out the asalaam alaikum in me\nWa-alaikum salaam, yo you wan' tess de Don?\nBLAOW BLAOW BLAOW-BLOAW-BLAOW, bwoy gone!\n\nThey don't really wanna learn - well start gunnin 'em down!\nYo they really ain't concerned - well start gunnin 'em down!\nThey don't wanna get the book - well start gunnin 'em down!\nThey don't want a conscious hook - well start gunnin 'em down!\nThey don't wanna pay dues - well start gunnin 'em down!\nThey be actin' brand new - well start gunnin 'em down!\nThey don't wanna get the light - well start gunnin 'em down!\nYo, pass me the mic - we'll start gunnin 'em down!\n\n(Verse Two)\nWatch dis! Your crew is my crew and my crew is my crew\nYour crew you lied to, my crew will find you\nThe light I recite will blind and outshine you\nStreet cats be wonderin why they even signed you\nWhere they find you? WHO is the first cat to rap\n\"Wa-da-da-ding\" and show you what the nine do?\nYou ain't never seen me behave with them firearms\nMaybe not, cause you just a slave to Viacom\nMe, I'm a free MC hip-hopper\nI teach real gangsters, hang with real Godsters\nI am to hip-hop what Selassie is to rastas\nWatch your mouth before someone I don't know pops ya\nLemme stop, don't-a-stop the street rhetorhic, ha\nYour soul you sellin it ha, come wit some better shit, ha\nIn five years your whole catalogue's irrelevant ha\nYou spit the ignorance while I spit intelligence\nYou got it backwards like sayin' hop-hip\nThat's why when you battled your whole crew got ripped!\n\n{*Needle drags across record*} You wanna battle?\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "Ghetto Lifestyles", "href": "Ghetto_Lifestyles&&2491", "artist": {"unique_name": "KRS-One"}, "lyrics": "\"Why do you listen to KRS-One?\"\n\"'Cause it's more than just music.\nHe speaks to my way of life.\"\n\"KRS is the best. Listen for the inner meanings.\"\n\"Never heard, anyone like this.\"\n\n(KRS-One)\nFeel this! Feel it!\nFeel the power, of DJ Kenny Parker, word up... huh!\n\nC'mon, yeah... uh... {\"Yeah yeah yeah\"}\nSo we gonna come down one time for your mind, you know whassup\nTurn it up, turn it up turn it up turn it up\nLook!\n\nWe spit out hits, ghetto chicks, chromed out whips\nPhilosophers rockin' your corner movie scripts\nGhetto lifestyles, keep watchin...\n{\"Protect yourself\"} - that's right!\nWe spit out hits, ghetto chicks, chromed out whips\nPhilosophers rockin' your corner movie scripts\nGhetto lifestyles, keep watchin...\n{\"Protect yourself\"}\n\nYo, all summer they bump the KRS-Oner\nFrom the microscopic atomic structure of the under\nI spit thunder, which hunts ya, runs you down and stuns ya\nI'm at the center of all rap worlds like a rotunda\nThen again, I rock you and your friend again\nIn any club in the country when you say KRS they say, \"Let him in\"\nV.I.P. passes for intellectuals with glasses\nIgnorant asses get left outside with the masses\nNext day we attend classes and gatherings\nShattering, those that be rattling about battling\nBattin 'em down from the Bronx like Don Mattingly (?)\nThe black African snappin backs again and laughin' again\nYou won't be askin again, my album I'm already masterin\nWhoever you think is dope I'm already blastin him\n\nWe spit out hits, ghetto chicks, chromed out whips\nPhilosophers rockin' your corner movie scripts\nGhetto lifestyles, keep watchin...\n{\"Protect yourself\"} - that's right!\nWe spit out hits, ghetto chicks, chromed out whips\nPhilosophers rockin' your corner movie scripts\nGhetto lifestyles, keep watchin...\n\n", "album": {"title": "The_Sneak_Attack_(2001)&&5717", "genre": "Hip Hop", "year": 2001}}, {"title": "MC's Act Like They Don't Know", "href": "MC%27s_Act_Like_They_Don%27t_Know&&4327", "artist": {"unique_name": "KRS-One"}, "lyrics": "Clap your hands everybody, if you got what it takes\n'Cause I'm KRS and I'm on the mic, and Premier's on The Breaks\n\nIf you don't know me by now I doubt you'll ever know me\nI never won a Grammy, I won't win a Tony\nBut I'm not the only MC keepin' it real\nWhen I grab the mic to smash a rapper, girls go \"Illlll!\"\nCheck the time as I rhyme, it's 1995\nWhenever I arrive the party gets liver\nFlow with the master rhymer, that's to leave behind\nThe video rapper, you know, the chart climber\nClapper, down goes another rapper\nOnto another matter, punch up the data, Blastmaster\nKnowledge Reigns Supreme Over Nearly Everybody\nCall up KRS, I'm guaranteed to rip a party\nFlat top, braids, bald heads or natty dread\nThere once was a story about a man named Jed\nBut now Jed is dead, all his kids instead\nWant to kick rhymes off the top of they head\nWord, what go around come around I figure\nNow we got white kids callin' themselves niggas\nThe tables turned as the crosses burned\nRemember You Must Learn\nAbout the styles I flip and how wild I get\nI go on like a space age rocket ship\nYou could be a mack, a pimp, hustler or player\nBut make sure live you is a dope rhyme sayer\n\nThis is what you waited all year for\nThe hardcore, that's what KRS is here for\nBig up Grand Wizard Theodore, gettin' ill\nIf you see then ya saw I'm in your grill with mad skill\nMC's can only battle with rhymes that got punchlines\nLet's battle to see who headlines\nInstead of flow for flow let's go show for show\nToe for toe, yo, you better act like you know\nToo many MC's take that word 'emcee' lightly\nThey can't Move a Crowd, not even slightly\nIt might be the fact that they express wackness\nLet me show ya whose ass is the blackest\nI flip a script a little bit, you ride the tip and shit\nToo sick to get with it, admit you bit, your style is counterfeit\nNow tone it down a bit\nMy title you will never get, I'm too intelligent\nI'll send your family my sentiments, my style is toxic\nWhen I rock and shock and hip hop it unlock your head, I knock it\nIt split quick from the lyric\nDirect hit, perfect fit, you can't get with it\n\nSome MC's don't like the KRS but they must respect him\n'Cause they know this kid gets all up in they rectum\nSlappin' and selectin' em, checkin' em, disrespectin' em\nJust deckin' em, deckin' em, deck-in' em\nWho in their right mind can mimic a style like mine?\nI design rhyme and get mine all the time\nMC's standin' on the sidelines, always dissin'\nWhen I roll up and rush their crew they start bitchin'\nI don't burn, I don't freeze, yet some MC's\nBelieve they could tangle with the likes of these\nCross your t's and dot your I's whenever I arrive\nWide, magnified, live like the ocean tide\nYou dope, you lied, I reside like artifacts\nOn the wrong side of the tracks, electrified\nComin' around the mountain, you run and hide\nHopin' your defence mechanism can divert my heat-seeking lyricism\nAs I spark mad iszm\nThe 1996 lyrical style's what I give 'em\n\n", "album": {"title": "KRS-One_(1995)&&4742", "genre": "East Coast Hip Hop", "year": 1995}}, {"title": "Do You Got It", "href": "Do_You_Got_It&&6591", "artist": {"unique_name": "KRS-One"}, "lyrics": "(KRS-One)\nTurn it up now, it's yo' time (ha!)\nThanks for yo' nickel and yo' dime (ha!)\nThe Kris-Style will blow yo' mind (ha!)\nLet's get it started, RIGHT ON TIME (ha!)\nThe elements, I represent all nine (ha!)\nI do the written or the freeflow rhyme (ha!)\nThese rappers nowadays they be so blind (ha!)\nYou lookin' for the skill but you won't find (ha!)\nReal live skills I show mine (ha!)\nWhack rappers I'll pay them no mind (ha!)\nImprovement, they showin no sign (ha!)\nDJ's, I hang with the dope kind (ha!)\nAll you cats, know meeeee (ha!)\nI'm not ashamed of who I beeee (ha!)\nI teach about G.O.Deeeee (ha!)\nIt's YOU that's frontin, not meeee (ha!)\nI keeps it bumpin in the C-L-U-B\nEleven albums, what are you tellin' me?\nI am B-L-E-S-S-E-D\nYou are C-U-R-S-E-D\nI don't need radio +OR+ TV\nAll I wanna do is recite my poetry\nYou hear somebody preachin, Yeah you know it's me\nYou hear the t'cha speakin' and yo, you gotta see\n\"Criminal Minded,\" do you got it?\n\n(Switching to a live performance)\n(Throw your hands up!) \"Criminal Minded,\" do you got it?\n\"By All Means Necessary\" (uh)\n\"By All Means Necessary\" (uh)\n\"Ghetto Music,\" do you got it? (uh)\n\"Ghetto Music,\" do you got it? (uh)\n\"Edutainment,\" do you got it? (uh)\n\"Edutainment,\" do you got it? (uh)\n\"Sex and Violence,\" do you got it? (uh)\n\"Sex and Violence\" - ooh they got it!\n(\"I Got Next\" - do you got it?)\n(\"I Got Next\" - do you got it?)\n(\"The Sneak Attack\" - do you got it?)\n(\"The Sneak Attack\" - do you got it?)\n\"Spiritual Minded,\" do you got it? (huh?)\n\"Spiritual Minded,\" do YOU got it?!\n(All right, check it out..)\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}, {"title": "Phucked", "href": "Phucked&&7248", "artist": {"unique_name": "KRS-One"}, "lyrics": "Yeah\nY'know when advice is in your face, you need to heed that\nWord, you need to read that\nY'know, I put this lil' joint together real quick\nYou know what it's called?\nIt's called - NOW YOU'RE FUCKED!\nThat's right, listen\n\n(Verse One)\nWasn't you the type to mimic what you saw on TV?\nWasn't you the type to mimic what you heard on CD?\nYou never wanted to work you wanted everything easy\nYou heard KRS and you said, \"That's preachy!\"\nA wise young man says, \"Father - teach me\"\nA foolish young man wants to live life freaky\nOh yes, Knowledge does Reign Supremely\nWhen I said it eighty-nine you didn't believe me\n\nNOW YOU'RE FUCKED! ... that's right\nNOW YOU'RE FUCKED! ... life is over, finished, done\nNOW YOU'RE FUCKED! ... better heed that, read that\nNow you're fucked!\n\n(Verse Two)\nListen - back in the days on the Boulevard of Linden\nBROOKLYN! Kris was a, metaphysician\nLOOKIN'! For better ways to live without bein\nTOOKEN! We started our own management and\nBOOKIN! Makin' moves with them live cats on\nFULTON! I can't even 'member all the dough that we\nTOOK IN! But you was lookin' down on us\nCause platinum never astounded us, so\n\nNOW YOU'RE FUCKED! ... word, like that\nNOW YOU'RE FUCKED! ... ha, you shoulda heed that, you better\nNOW YOU'RE FUCKED! ... y'all was chasin the radio, remember that?\nNOW YOU'RE FUCKED! ... what they givin' you back now?\n\n(Verse Three)\nBack when we was all singin' \"Monie in the Middle\"\nYou wanted to wiggle, jiggle in a tight skirt and giggle\nEven when outside was brittle, you still had on little\nAnd KRS warned that you'll get played like a fiddle\nNow you havin' cravings for pickles cause you pregnant\nAnd don't know where the dad went and you poppin' them drugs like Skittles\nWhen the baby is born it's little and sick\nBut it's no riddle, you was movin too quick, huh\n\nNOW YOU'RE FUCKED! ... word, look at this\nNOW YOU'RE FUCKED! ... you shoulda stayed home and read a book\nNOW YOU'RE FUCKED! ... literally, symbolically\nNow you're fucked!\n\n(Verse Four)\nWhen advice is in your life you need to take it\nCause frankly, everybody ain't gonna make it\nBack in the days we, showed 'em the way\nI put it there in the music but you weren't amazed\nYou would criticize, debate, and basically hate\nBut let it be known I wanted everyone to be great\nBut you would diss and not even try to do better\nWhen we was at the U.N. you said \"whatever\"\n\nNOW YOU'RE FUCKED! ... word\nNOW YOU'RE FUCKED! ... we movin ahead, you still in the same spot\nNOW YOU'RE FUCKED! ... 'member all that back talk, all that?\nNOW YOU'RE FUCKED! ... takin' over\n\n", "album": {"title": "Keep_Right_(2004)&&4989", "genre": "Hip Hop", "year": 2004}}, {"title": "1st Quarter - the Commentary", "href": "1st_Quarter_-_The_Commentary&&8053", "artist": {"unique_name": "KRS-One"}, "lyrics": "Welcome to hip-hop culture\nWhere DJ-ing, MC-ing, graffiti art, breaking\nAnd the philosophies are expressed everyday\nWithin the inner cities of America, and the world\nYou are not doing hip-hop\nYou ARE hip-hop\nLove yourself and your expression, you can't go wrong\n\n", "album": {"title": "I_Got_Next_(1997)&&1738", "genre": "Hip Hop", "year": 1997}}, {"title": "What Else Happened", "href": "What_Else_Happened&&7724", "artist": {"unique_name": "KRS-One"}, "lyrics": "[KRS-One] + (voices)\nThere once was a dreamer named Peter (what else happened?)\nPeter was also known as SKeeter (what else happened?)\nPeter had sex with Anita (what else happened?)\nAnita got pregnant from Peter (what else happened?)\nPeter wasn't just with Anita (what else happened?)\nPeter knew this girl named Rita (what else happened?)\nPeter had sex with Rita (what else happened?)\nRita got pregnant from Peter (what else happened?)\nNow TWO girls are pregnant by Peter (what else happened?)\nBut Rita doesn't know of Anita (what else happened?)\nAnd Anita, doesn't know Rita (what else happened?)\nThe two of them, only know Peter (what else happened?)\nNow Peter's at the mall with Anita (what else happened?)\nYou know, he runs into Rita (what else happened?)\nWell Rita takes a look at Anita (what else happened?)\nAnd Anita takes a good look at Rita (what else happened?)\nWell Rita starts to pull out the heater (what else happened?)\nThe heater now is pointed at Peter (what else happened?)\nAnita jumps right on Rita (what else happened?)\nRita busts shots at Anita (what else happened?)\nRita missed Anita by meters (what else happened?)\nBut Rita's bustin' shots at Peter! (What else happened?)\nJust then somebody shook Peter (what else happened?)\nYo how many spoons of the dairy creamer? (What else happened?)\nIt's Keisha sayin' WAKE UP PETER (what else happened?)\nThat's why they call you the dreamer (Now that's happenin'!)\n\n", "album": {"title": "Kristyles_(2003)&&5609", "genre": "Hip Hop", "year": 2003}}]