[{"title": "Blue Lagoon", "href": "Blue_Lagoon&&2839", "artist": {"unique_name": "Laurie_Anderson"}, "lyrics": "I got your letter. Thanks a lot.\nI've been getting lots of sun. And lots of rest. It's really hot.\nDays, I dive by the wreck. Nights, I swim in the blue lagoon.\nAlways used to wonder who I'd bring to a desert island.\n\nDays, I remember cities. Nights, I dream about a perfect place.\nDays, I dive by the wreck. Nights, I swim in the blue lagoon.\n\n<i>Full fathom five thy father lies. Of his bones are coral made.</i>\n<i>Those are pearls that were his eyes. Nothing of him that doth fade.</i>\n<i>But that suffers a sea change. Into something rich and strange.</i>\n<i>And I alone am left to tell the tale.</i>\n<i>Call me Ishmael.</i>\n\nI got your letter. Thanks a lot.\nI've been getting lots of sun. And lots of rest. It's really hot.\nAlways used to wonder who I'd bring to a desert island.\nDays, I remember rooms. Nights, I swim in the blue lagoon.\n\nI saw a plane today. Flying low over the island.\nBut my mind was somewhere else.\nAnd if you ever get this letter. Thinking of you.\nLove and kisses. Blue Pacific. Signing off.\n\n", "album": {"title": "Mister_Heartbreak_(1984)&&1995", "genre": "Experimental", "year": 1984}}, {"title": "Langue d'Amour", "href": "Langue_D%27Amour&&6777", "artist": {"unique_name": "Laurie_Anderson"}, "lyrics": "Let's see. Uh, it was on an island. And there was this snake.\nAnd this snake had legs. And he could walk all around the island.\nYes. That's true. A snake with legs.\nAnd the mand and the woman were on the island too.\nAnd they were not very smart.\nBut they were happy as clams. Yes.\n\nLet's see. Uh... then one evening the snake was walking about\nIn the garden and he was talking to himself and he saw the woman\nAnd the started to talk. And they became friends.\n<i>Very</i> good friends.\n\nAnd the woman liked the snake very much. Because when he\nTalked, he made little noises with his tongue, and his long tongue\nWas lightly licking about his lips.\nLike there was a little fire inside his mouth and the flame\nWould come dancing out of his mouth.\nAnd the woman liked this very much.\nAnd after that, she was bored with the man.\nBecause no matter what happened,\nHe was always as happy as a clam.\n\nWhat did the snake say? Yes! What was he saying?\n\nOK. I will tell you.\n\nThe snake told her things about the world. He told her about\nThe time there was this big typhoon on the island\nAnd all the sharks came out of the water. Yes.\nThey came out of the water and they walked right into your house\nWith their big white teeth\n\nAnd the woman hearrd these things. And she was in love.\nAnd the man came out and said: We have to go now!\nAnd the woman did not want to go. Because she was a hothead.\nBecause she was a woman in love.\nAnd this is not a story my people tell.\nIt is something I know myself.\nAnd when I do my job, I am thinking about these things.\nBecause when I do my job, that is what I think about.\n\nOoh la la la la.\n- Yeah. La La La La.\nVoici. Voila\n- Here. And there.\nOoh la la la la.\n- Oh yes.\nVoice le langage de l'amour.\n- This is the language of love.\nOoh la la la la.\n- Ooh. Oh yeah.\nLa la la.\n- La la.\nVoice. Voila. La la.\n- Here it is. There it is. La la.\nVoice le langage de l'amour.\n- This is the language of love.\n\nAh! Comme ci, comme ca.\n- Ah! Neither here nor there.\nVoila. Voila.\n- There. There.\nVoici le langage de l'amour.\n- This is the language of love.\nVoici le langage de l'amour.\n- This is the language of love.\nAttends! Attends! Attends!\n- Wait! Wait! Wait!\nAttends! Attends! Attends!\n- Wait! Wait! Wait!\nEcoute. Ecoute. Ecoute.\n- Listen. Listen. Listen.\nOoh la la la la.\n- Ooh. Oh yeah.\nOoh la la la la.\n- Oh yeah. Yeah.\n\nVoici le langage de l'amour.\n- This is the language of love.\nVoici le langage dans mon coeur.\n- This is the language of my heart.\nOoh la la.\n- Ooh. Oh yeah.\nVoici le langage dans mon coeur.\n- This is the language of my heart.\nVoici le langage de l'amour.\n- This is the language of love.\nVoici le langage dans mon coeur.\n- This is the language of my heart.\nVoici le langage dans mon coeur.\n- This is the language of my heart.\n\n", "album": {"title": "Mister_Heartbreak_(1984)&&1995", "genre": "Experimental", "year": 1984}}, {"title": "Sharkey's Day", "href": "Sharkey%27s_Day&&3363", "artist": {"unique_name": "Laurie_Anderson"}, "lyrics": "Sun's coming up, Like a big bald head\nPoking up over the grocery store\nIt's Sharkey's day, It's Sharkey's day today\nSharkey wakes up and Sharkey says: There was this man\nAnd there was this road, And if only I could remember these dreams\nI know they're trying to tell me, something\nOe, Strange dreams, (Strange dreams), Oh yeah\n\nAnd Sharkey says: I turn around, it's fear, I turn around again\nAnd it's love, Oh yeah, Strange dreams\nAnd the little girls sing: Oe Sharkey\nAnd the manager says: Mr, Sharkey? He's not at his desk right now\nCould I take a message?\nAnd the little girls sing: Oe Sharkey, He's Mister Heartbreak\nThey sing: Oe Sharkey, Yeah, He's Mister Heartbreak\n\nAnd Sharkey says: All of nature talks to me, If I could just\nFigure out what it was trying to tell me, Listen!\nTrees are swinging in the breeze, They're talking to me\nInsects are rubbing their legs together\nThey're all talking, They're talking to me, And short animals\nThey're bucking up on their hind legs, Talking, Talking to me\nHey! Look out! Bugs are crawling up my legs!\nYou know? I'd rather see this on TV Tones it down\nAnd Sharkey says: I turn around, it's fear\nI turn around again, and it's love\nNobody knows me, Nobody knows my name\n\nAnd Sharkey says: All night long I think of those little planes up there\nFlying around, You can't even see them, They're specks!\nAnd they're full of tiny people, Going places\nAnd Sharkey says: You know? I bet they could all land\nOn the head of a pin\nAnd the little girls sing: Ooooeee, Sharkey!\nHe's Mister Heartbreak, They sing: Oooee, That Sharkey!\nHe's a slow dance on the edge of the lake, He's a whole landscape\nGone to seed, He's gone wild! He's screeching tires\nOn an oil slick at midnight on the road to Boston a long time ago\nAnd Sharkey says: Lights! Camera! Action! Timber!\nAt the beginning of the movie, they know they have to find each other\nBut they ride off in opposite directions\n\nSharkey says: I turn around, it's fear\nI turn around again, and it's love\nNobody knows me, Nobody knows my name\nYa know? They're growing mechanical trees\nThey grow to their full height, And then they chop themselves down\nSharkey says: All of life comes from some strange lagoon\nIt rises up, it bucks up to its full height from a boggy swamp\nOn a foggy night, It creeps into your house, It's life! It's life!\nI turn around, it's fear, I turn around again, and it's love\nNobody knows me, Nobody knows my name\n\nDeep in the heart of darkest America, Home of the brave\nHa! Ha! Ha! You've already paid for this, Listen to my heart beat\n\nAnd the little girls sing: Oe Sharkey, He's a slow dance\nOn the edge of the lake, They sing: Oe, Sharkey\nHe's Mister Heartbreak\nPaging Mr, Sharkey, White courtesy telephone please\nAnd Sharkey says: I turn around, it's fear\nI turn around again, and it's love\nAnd the little girls sing: Ooooeee Sharkey, Yeah\nOn top of Old Smokey all covered with snow\nThat's where I wanna, that's where I'm gonna\nThat's where I'm gonna go\n\n", "album": {"title": "Mister_Heartbreak_(1984)&&1995", "genre": "Experimental", "year": 1984}}, {"title": "Excellent Birds", "href": "Excellent_Birds&&63", "artist": {"unique_name": "Laurie_Anderson"}, "lyrics": "Flying birds. Excellent birds. Watch them fly. There they go.\nFalling snow. Excellent snow. Here it comes. Watch it fall.\nLong words. Excellent words. I can hear them now.\nThis is the picture.\nI'm sitting by the window. Watching the snow fall. I'm looking out.\nAnd I'm moving. Turning in time. Jump up!\nAnd I can land on my feet. Look out! This is the picture.\nThis is the picture. This is the picture. This is the picture.\n\nLooking out. I'm watching out. But when I see the future,\nI close my eyes. I can see it now.\nI see pictures of people rising up. I see pictures of people falling down.\nI see pictures of people, they're standing on their heads. They're ready!\nI see pictures of people rising up. I see pictures of people falling down.\nI see pictures of people, they're standing on their heads. They're ready!\n\nThey're looking out. Look out! They're watching out. Watch out!\nThey're looking out. Look out!\nThey're watching out. Watching watching out.\n\nI see pictures of people. I see pictures of people.\nThey're watching. They're watching out. Watch out.\nI see pictures of people. They're watching out. They're watching out. \nI see pictures of people. Watching. Watch out. They're watching. \nI see pictures of people. Watching out. Watch out.\n\n", "album": {"title": "Mister_Heartbreak_(1984)&&1995", "genre": "Experimental", "year": 1984}}, {"title": "Kokoku", "href": "Kokoku&&6046", "artist": {"unique_name": "Laurie_Anderson"}, "lyrics": "I come very briefly to this place. I watch it move. I watch it shake.\n\n<i>Kumowaku yamano. Watashino sakebi. Watashino koewo.\n</i>Ushano kokoku. Watashiwa sokoni. Watashiwa asobu.\n<i>Mountain with clouds. A cry. My voice.\n</i>Home of the brave. I'm here now. And lost.<i>\n\nThey say the dead will rise again. And here they come now.\nStrange animals out of the Ice Age. And they stare at you.\nDumbfounded. Like big mistakes. And we say: Keep cool.\nMaybe if we pretend this never happened, they'll all just go away.\n\n</i>Watashiwa sokoni. Watashiwa asobu. Mewotoji. Mewotoji.\n<i>Kikunowa kotori. Watashino sakebi. Watashino koewo.\n</i>I am here in this place. Losing. My eyes are closed. Closed.\n<i>Birds are there. Hearing something. Shouting. My voice.</i>\n(And yet, we could all be wrong. Wouldn't be the first time.)\n\n<i>Kumowaku yamano. Watashiwa sokoni. Watashiwa asobu.\n</i>Kumowaku yamano. Kikunowa kotori. Watashino sakebi.\n<i>Mountain with clouds. I am there. Lost.\n</i>Mountain with clouds. Birds are there. Hearing something. A shout.<i>\n\nThey say the world is smaller now. Small world.\nThey say that man is taller now. Tall man.\nThey say the stars are closer now. Thank you, lucky stars.\nYou come very briefly to this place.\n\n</i>Jikanwa tomaru. Ushano kokoku.\n<i>Time is stopped. Home of the brave.</i>\n\nAnd on a very distant star, slimy creatures scan the skies.\nThey've got plates for hands. And telescopes for eyes.\nAnd they say: Look! Down there! A haunted planet spinning 'round.\nThey say: Watch it move. Watch it shake. Watch it turn. And shake.\n<i>Watashiwa sokoni. Watashiwa asobu. Kumowaku yamano.\n</i>Watashino sakebi. Watashino koewo. Mewotoji. Mewotoji.\n<i>I am there. Lost. Mountain with clouds.\n</i>A cry. A shout. My eyes are shut. Shut.<i>\nAnd we say: Watch us move. Watch us shake. We're so pretty.\nWe're so pretty. We say: Watch us move now. Watch us shake.\nWe're so pretty. Shake our hands. Shake our heads. We shake our feet.\nWe're so fine. The way we move. The way we shake.\nWe're so nice.</i>\n\n", "album": {"title": "Mister_Heartbreak_(1984)&&1995", "genre": "Experimental", "year": 1984}}, {"title": "Gravity's Angel", "href": "Gravity%27s_Angel&&8204", "artist": {"unique_name": "Laurie_Anderson"}, "lyrics": "You can dance. You can make me laugh. You've got x-ray eyes.\nYou know how to sing. You're a diplomat. You've got it all.\nEverybody loves you.\nYou can charm the birds out of the sky. But I, I've got one thing.\nYou always know just what to say. And when to go.\nBut I've got one thing. You can see in the dark.\nBut I've got one thing: I loved you better.\n\nLast night I woke up. Saw this angel. He flew in my window.\nAnd he said: Girl, pretty proud of yourself, huh?\nAnd I looked around and said: Who me?\nAnd he said: The higher you fly, the faster you fall. He said:\nSend it up. Watch it rise. See it fall. Gravity's rainbow.\nSend it up. Watch it rise. See it fall. Gravity's angel.\nWhy these mountains? Why this sky? This long road. This ugly train.\n\nWell he was an ugly guy. With an ugly face.\nAn also-ran in the human race.\nAnd even God got sad just looking at him. And at his funeral\nAll his friends stood around looking sad. But they were really\nThinking of all the ham and cheese sandwiches in the next room.\nAnd everybody used to hang around him. And I know why.\nThey said: There but for the grace of the angels go I.\nWhy these mountains? Why this sky?\nSend it up. Watch it rise. See it fall. Gravity's rainbow.\nSend it up. Watch it rise. And fall. Gravity's angel.\n\nWell, we were just laying there.\nAnd this ghost of your other lover walked in.\nAnd stood there. Made of thin air. Full of desire.\nLook. Look. Look. You forgot to take your shirt.\nAnd there's your book. And there's your pen, sitting on the table.\nWhy these mountains? Why this sky? This long road? This empty room?\nWhy these mountains? Why this sky? This long road. This empty room.\n\n", "album": {"title": "Mister_Heartbreak_(1984)&&1995", "genre": "Experimental", "year": 1984}}, {"title": "Sharkey's Night", "href": "Sharkey%27s_Night&&2292", "artist": {"unique_name": "Laurie_Anderson"}, "lyrics": "Sun's going down. Like a big bald head.\nDisappearing behind the boulevard. <i>(Oooee.)</i> It's Sharkey's night.\nYeah. It's Sharkey's night tonight. And the manager says: Sharkey?\nHe's not at his desk right now. <i>(oh yeah.)</i> Could I take a message?\n\nAnd Sharkey says: Hey, kemosabe! Long time no see.\nHe says: Hey sport. <i>You</i> connect the dots. <i>You</i> pick up the pieces.\nHey says: You know, I can see two tiny pictures of myself\nAnd there's one in each of your eyes. And they're doin' everything I do.\nEvery time I light a cigarett, they light up theirs.\nI take a drink and I look in and they're drinkin' too.\nIt's drivin' me crazy. It's drivin' me nuts.\n\nAnd Sharkey says: Deep in the heart of darkest America.\nHome of the brave. He says: Listen to my heart beat.\nPaging Mr. Sharkey. What courtesy telephone please.\n\n", "album": {"title": "Mister_Heartbreak_(1984)&&1995", "genre": "Experimental", "year": 1984}}]