[{"title": "Left Hand Man", "href": "Left_Hand_Man&&6706", "artist": {"unique_name": "Lexicon"}, "lyrics": "See my right hand man is a left-handed man\nMy man Big Oak is on the left mic stand\n\nAnd my right hand man is a right-handed man\nMy man Nick Fury's on the right mic stand\n\nAnd we are (L-E) X-I (C-O) N\nRun and, tell a, friend\n\n(Repeat 2X)\nSaid we are (L-E) X-I (C-O) N\nRun and, tell a, friend\n\n(Verse One)\nYo, I'm out the gate like a caged dog that never ate\nBut had a taste of blood so now he wants the steak\nI'll take the cake, cause Oak'll slay fakes\nFrom L.A. to the Great Lakes from sundown to daybreak\n(Okay) I'll spare y'all the details\nBecause today it seems like everybody has A.D.D.\nWhen all you really need to understand is that we will be\nThe most dynamic MC duo no if buts or maybes\nI'll send this warning, 'cause I've been doin' this\nSince Fab 5 Freddy held down Saturday mornings\nTry to wipe the sleep out your eyes and stop the snoring\n'Cause when it, rains and what, well now it's pouring\n\n(Verse Two)\nSee, I live just polite (polite)\nMeant to drive around with my windows at night\nLove to live, live to explore\nI'm out for twenty-five points with at least ten boards (ten boards)\nGot a profession, I call it emceein\nUnfortunately that's not what my degree's in\nI make it hot when it's ten below freezin\nAnd make it cold when it's hard to keep breathin\nLife (man) that's what I believe in\nNot stupid shit where I'll wind up bleedin\nPrefer shit that'll keep the crowd rockin'\nAnd inspire heads noddin inside the Walkman\n\n(Hook: repeat 2X)\nMy right hand man is a left-handed man\nMy man Big Oak is on the left mic stand\nAnd my right hand man is a right-handed man\nMy man Nick Fury's on the right mic stand\n\nAnd we are (L-E) X-I (C-O) N\nRun and, tell a, friend\n\n(Repeat 3X)\nSaid we are (L-E) X-I (C-O) N\nRun and, tell a, friend\n\n(Verse Three)\nStraight out the Greenfield Academy, went up to Rum Nasty\nI'm a long time tenant while you just moved in last week\nSee we're the L-E, X-I, C-O\nMan you know the rest, I deliver like the P.O.\n\nSee I can see what makes you run like C-3PO\nGot the East side of town sayin', \"Dios mios!\"\nSenor Fury got the homies, balls and gall\nAll in all I keep swingin', till all will fall\nMashin all boulevard, represent represent, said\nLexicon, represent represent\nWhen the mic is in my hand, I'm never hesitant\nMy favorite jam back in the day was \"Steve Biko\"\n\nDon't be so, stingy with the mic, cut the leash let him out\nMy brain is gettin' bigger and my head is fillin out\nAnd if my head is fillin out then the words are spillin out\nCatch 'em if you can or else keep sleepin' on the couch\n\nSo we just leave 'em there to sleep (that's right)\n'Cause when you're sleepin' and your eyes can't see (no sight)\nBut me? I'm wide-eyed like Japanimation\nAll these amped up rappers need to take a vacation\n(And relax a bit) that's just the half of it\nThe other half is the fact that they're wack\nBut I ignore that, sit on the balcony and inhale fog\nAnd exhale the bullshit into the smog\n\nAnd we are (L-E) X-I (C-O) N\nRun and, tell a, friend\n\n(Repeat 3X)\nSaid we are (L-E) X-I (C-O) N\nRun and, tell a, friend\n\n", "album": {"title": "It%27s_The_L!!_(2001)&&8504", "genre": "", "year": 2001}}, {"title": "It's the L", "href": "It%27s_The_L&&8336", "artist": {"unique_name": "Lexicon"}, "lyrics": "Bring it in like...\n\nIt's been a long time comin', maybe too damn long\nThat's why I'm tacklin everything that I'm takin' on\nIt's like, I'm sick and tired of behavin calm\nSo when they play our song they all raisin arms\n(IT'S THE L!) That's the startin gun that gets 'em all to start to run\nI got this habit I ain't stoppin' till I'm number one\nAnd once I get goin' I ain't gon' start slowin\nWe'll soon need a mowin the way we keep growin'\nYO - you gotta twist it like a change in the plot\nIf the beat knock you off your feet call it a Cheapshot\nAnd if there's any doubters from the very beginnin\nGuaranteed by the end of the night we'll have 'em singin' like...\n\nLexicon'll have you singin' like...\nCheapshot will have you singin' like...\nNick Fury's got 'em singin' like...\n\nBig Oak will have you singin' like you don't even care\nTurn up your voice and just let down your hair\nSick of all the frowns and intimidating stares (man)\nPut your guard down and bob your head to the snares\nWe're upstairs like the next level\nCuties give me horns like the sex devil (damn)\nFeelin' kinda high, better check the treble\nSee with the L-E, X-I, C-O, N\nIf you need it spelled out before you pass the hell out\n\nSee we can take it to action if that's what you wishin\nI, got a faction and none of us are fiction\nAnd, an ass-kickin man that's my prediction\nIf, you do it all for show like an exhibitionist\nYou can call me Nickolaus, Furious, the fantastic\nDrop the Reebok it's Lexicon classic\nMaterial, hardrock, you crack like plastic\nUnder the weight I take it all like elastic\n\nSo if there's any doubters from the very beginnin\nGuaranteed by the end of the night, we'll have 'em singin' like...\n\nS.O.B. will have you singin' like...\n4-Zone will have you singin' like...\nVin Skully's got you singin' like...\n\nYo, I spent the last two years tryin' to get my mind straight\nAnd I suggest you do the same if you're watchin time escape\nCause things move too fast in this Indy 500 of life\nYou gotta slow down and take a bite y'all\nYou can move to the left and move to the right\nBut you gotta move forward through the green light\nSo many cats that I came up with\nStalled at the first stop sign while I kept droppin' rhymes\nLike we told you back in ninety-nine\nYou gotta keep on movin or else you'll be losin\nBut when the work's done, pass me the blunt\nAnd the light and by the end of the night, we'll have you singin' like...\n\nP.B.S.'ll have 'em singin' like...\nRum Nasty's got you singin' like...\nHave you singin' like...\n\n", "album": {"title": "It%27s_The_L!!_(2001)&&8504", "genre": "", "year": 2001}}, {"title": "The Official", "href": "The_Official&&262", "artist": {"unique_name": "Lexicon"}, "lyrics": "(Nick Fury)\nI got the crowd gathered round like it's fight, night\nMinor leaguers stay at home with your night, light\nBecause I'm quite, tight\nThey seen that Fury knows how to rock the mic, right\nAnd get a right, right\nAnd a true, that\nAfter I rock your whole crew gives me a few, daps\nThey all really seem to love the way I do, that\nBut I knew, that\nIt's the same exact reason that your crews, lack\nAiyyo who dat?!\n\n(Ryu)\nYou know the name, type it in caps\nThe life of the party with straws and we siphonin Pabst (Pabst!)\nDrunk as a bum, Kinnoga brown bag it and blaze\nFraggin your regiment, rip every dragon I slay (slay!)\nOff of respect I step like I'm walkin' on props\nSo high that when I drop rhymes it look like dots (dots!)\nRippin you out of your skin like I'm openin gifts\nIn front of a sucker and burn like a solar eclipse\n\nThis is the of-fi-CIAL\nRaps that combat the arti-fi-CIAL\nWhen I'm pullin out my automatic pis-TAL\nClick click, CLICK, click click, POW\nOoh ooh, CHILD, sick sick, STYLE\nRaps to combat the arti-fi-CIAL\nWhen I'm pullin out my automatic pis-TAL\nOoh ooh, Ooh, ooh ooh, CHILD, click click, POW\n\n(Big Oak)\nYou better be smooth and you better be swift\n'Cause I'm lookin' down at y'all like I was on a ski-lift\nGet your teeth chipped by a stray adjective\nBetter run for cover we creatin' havoc kid - ah CHECK IT\nIf you haven't seen us comin' yet then EXPECT IT\nFinally got an opportunity, so I KEPT IT\nMeant to do my thesis but instead I made a RECORD\nSo when you're spinnin ones and twos SELECT IT\n\n(Nick Fury)\nI rock like Sebastian Bach so ill\nThat I got 'em on my words from wintertime to autumn\nThese tracks are magnetic, the way they clock to it\nWith their hands in the air like how the cops do it\nLet 'em swing (swing) cut (cut) slash, bruise (Ooh!)\nWhatever method they choose, I still won't lose\nWhat you think you could subdue these dudes?\nSeems to me you got it twisted like a Rubik's Cube\n\n(Ryu)\nAny shine you ever get now consider it gone\nThe second the record is dropped like consecutive bombs\nI can develop a crisis quicker than Dodge Vipers\nWith nitrous bottle kits and horsepowered hypeness\nBring your whole squadron, bitch, click and your posse\nSaddam and Qaddafi, Hitler and every Nazi\nWatch me, I can time travel in stealth\nThen come back in ten seconds I can battle myself\n\n(Big Oak)\nI gotta lot of things to tell y'all so now I'm RELAYIN IT\nBut I mean what I spit while you're just SAYIN' IT\nMaybe that's why you get ignored when they're PLAYIN' THIS\nAnd maybe that's why we get adored while you're HATIN' THIS\nIf she charts can't diss and I'm PAINTIN IT\nNick be my right hand man and he's SLAYIN IT\nSame as Ryu, we wanted this now we're TAKIN' IT\nIt's the L, if you don't know then start FAKIN IT\n\n", "album": {"title": "It%27s_The_L!!_(2001)&&8504", "genre": "", "year": 2001}}, {"title": "Makin' Music", "href": "Makin%27_Music&&2044", "artist": {"unique_name": "Lexicon"}, "lyrics": "(Verse One)\nIn my ninety-nine Saturn, switchin four lanes\nHollerin out the window, \"Can I borrow some change?\"\nThis broke shit got me goin' deranged\nThinkin' it'd be so much easier if it was a Range\nAnd my man Tomas said, it could be arranged\nBut, the last thing I need now's to be arraigned so\nI do my best to maintain on the right side of sane\nAnd not complain about my very few pesos\nYo, I can make 'em start to move\nLike I was pushin through the crowd to the front actin' rude\nOr, I can make 'em nod they necks\nLike when they ask did they wreck you'll be noddin yes\nSo there's your options, and I don't need much room\nFor you to get it twisted like vision on mushrooms\nLexicon's got the strength to crush crews\nBut instead we make music and add a FUCK YOU\nSee? Ain't nuttin changed but the haircut\nMan still got the right, Oak's got the left hand and\nI don't ask for shit, I demand\nIt's so live in here I got you lookin' for the band\n\nWe're makin' mu-SIC, you better learn how to use IT\nYou got the skills better step up and prove IT\nIf you got a title pretty soon you're gonna lose IT\nCause the L is here to stay, okay?\nWe're makin' mu-SIC, not the corny-ass shit\nThat permeates the airwaves and makes my hair gray\nAll right okay, they can't take all the blame\nBut it's not us, we're just here to save the day\n\n(Verse Two)\nCheck it, we're makin' music while you're makin' money\nBut in a couple years, where you gonna be? (Gone)\nYour records are disposable, while mine are straight quotable\nOak will change the game like quarterbacks callin audibles\nYo, you can find me at the scrimmage line\nI'm the one who calls the shots and packs 'em in like dinnertime\n(Hah) We're makin' music while you only make noise\nPuttin' out lousy songs you can't even sell to your boys\nWhat you thought (what) and what you're thinkin' currently\nAll gets tossed out the window courtesy of me {*WHOOSH*}\nIt's time to start thinkin' differently (uh-oh) just like that Mac ad\nAnd if you act bad you'll get the backhand {*SLAP SLAP*}\nLike that, and don't fight back\nJust stop and stare like at a girl with a nice rack {*WHISTLE*}\nLexicon's your wake-up call\nThat ringin' in your ear you hear is cause y'all dropped the ball\nYou coulda made a difference, you coulda made your mark\nBut instead of makin' music you were blinded by the dark\nBut that doesn't matter now anymore (why?)\nLexicon is walkin' straight through the open door\n\n\"Here I come to save the day!\"\n\n(Chorus) - repeat 2X (last repeat last line - \"Lexicon saves the day\")\n\n", "album": {"title": "It%27s_The_L!!_(2001)&&8504", "genre": "", "year": 2001}}, {"title": "Charismatic Rapper", "href": "Charismatic_Rapper&&2407", "artist": {"unique_name": "Lexicon"}, "lyrics": "Let me take you back to the day when MC's were short\nAnd rap wasn't treated like a little league sport\nOn this, \"Mom I wanna rap when I come of age\"\nAnd every MC could control the stage\nRemember back then, after the backspin\nBefore everyone who's a fan was rappin'\nBack when every album had a classic track\nAnd if it was on sale then the shit was wack\nBack when on Tuesday you could find me at the Wherehouse\nEvery new release on one receipt\n\n(You remember it man?) I remember it well\nBack when Rick the Ruler was still locked in jail\n\nBack a half a decade, when everyone had a fade\nAnd I taped every video that Rap City played\nBefore Black Sheep broke up, L.O.N.S. broke up\nThe Soul Brothers broke up, Tribe broke up\nWe were all smoked up, big East coast fam\nBefore Jive became focused only on boy bands\nBefore Rawkus, Fat Beats, Bad Boy or No Limit\nBefore I had a chance to come out independent\nWhen \"Unsigned Hype\" was a sign of who's next\nBefore rap artists saw six figure checks\nBack when, major labels were screwin MC's\nAnd Nirvana and Pearl Jam ran MTV\nWhen a group put an album out, every few years\nBack when people made music for the listeners ears\n\n(You remember it man?) It wasn't too long ago\nBefore we were old enough to go to a show\n\nIt was just before all the major labels merged\nBefore rappers started usin' scientific words\nBack when rap fans had a common bond\nIf I heard a beat, I could name the song\nBefore every damn track was about a par-tay\nAnd Fellowship resided on 4th and Broadway\nWhen I used to lay in my bed with my walkman on\nListenin to mix shows till the break of dawn\nBack when rap was half mellow, half thug\nJust before the mainstream, was controlled by Suge\nBefore Biggie got shot, before 'Pac got shot\nBack when rap was different than what the mainstream thought\nBefore Hilfiger knew, we were wearin his clothes\nBefore beats took importance over lyrics and flows\nBack when Common loved rap, and I did too\nAnd every group or MC was a part of a crew\nBefore everyone was preachin on the five elements\nAnd music in videos had no relevance\nBefore the reunion of Guy, and EPMD\nRemember when we all had a favorite MC?\nCats had personality in the last chapter\nLet's bring it back to the charismatic rapper\n\nOne two, testin one two\nAll right party people in the place to be\nThe party has already started, and it's about to end...\n\n{*Scratched: \"rap is outta control\"*}\n\n", "album": {"title": "It%27s_The_L!!_(2001)&&8504", "genre": "", "year": 2001}}, {"title": "Last Night My DJ Stole My Girl", "href": "Last_Night_My_DJ_Stole_My_Girl&&4743", "artist": {"unique_name": "Lexicon"}, "lyrics": "(Nick Fury)\nYou see I'm not real good at approachin girls\nSometimes I feel like I'm divin for ocean pearls\nTo the bottom where it's dark and it's harder to breathe\nShe laughed with a smile that you wouldn't believe\n\"What's your name again?\" she told me, but since then I forget\n'Cause I'd smoked a lot of beer and drank a lot of pot - I mean\nShe laughed again, I played it off like I meant it\nShe threw me a look and I knew it was cemented\nThis game I presented, it worked again\nAs long as the team don't act like jerks again\nIt's happened before, they cling to 'em like suction\nLike vultures they circle waitin for an introduction\nBut not this time (nah) this one was somethin' special\nFrom her hips to her eyes to her lips to her freckle\nTo a tee - best of all she was jockin me\nUntil I heard, \"Yo Nick!\" and she was like, \"Who is he?\" Oh\n\n(Repeat 2X)\nLet me introduce you to my partner Oak\nHe's my left hand man and he ain't no joke\nBut yo, back to this interaction, what was that you were askin?\nLet me take you to the back, where there's no distraction\n\n(Big Oak)\nHolllld up, aiyyo hold up Nick\nDon't you think you should go buy this girl a drink? (see ya)\nShe can wait right here, I'll keep her company\nIf I play my cards right, maybe she'll be humpin me (ha!)\nNick shot me a dirty look, and the middle finger\nBut I don't care, I'm on some Jerry Springer\nShit but it's legit cause last week Nick took my girl and split\nAnd only offered me a shrug and a blunt hit\nSo I'll get him back tonight\nAiyyo honey follow me to the back to where there ain't so much light\nI'm your Mr. Right, at least for tonight\n... Or umm, hello?\nI looked at her and she wasn't even payin' attention\nMind off in space explorin new dimensions (shit)\nShe wasn't gonna hear a damn word I say\n'Cause she was starin' right at my DJ\n\n(Repeat 2X)\nLet me introduce you to my DJ Cheapshot\nHe's a both hand man and his feats are hot\nBut back to this interaction, what was that you were askin?\nLet me take you to the back, where there's no distraction\n\n(DJ Cheapshot)\nDamn you look familiar, have we met before?\nI think I caught a glimpse of you on the dance floor\nAs a matter of fact, weren't you freakin MC Nickolaus?\n\"No that wasn't me,\" my bad, now I feel ridiculous\nYou know it's kind of hard to see when I'm busy scratchin\nYeah, I've been rockin' shows three years, thanks for askin\nYou wanna hear some Jigga? (yup) Funny you should mention that\nJust got a call from him, told him that I'd holla back\nEnough about him, change the subject back to me\nI'm six foot three with the college degree\nPlus this key to that Camaro double parked outside\nIf you carry my wax, I'll give you a ride\nNow be a good girl, and go buy daddy a drink\nAnd by the time you get back, we'll leave in a blink (yup)\nThen it's on like Chaka Khan\nAnd oh yeah, on the way out, say goodbye to Lexicon\n\nUh... did I say Camaro? Oh my God, I can't...\nI meant to say Ford Focus, how embarrassing\nYeah no-no-no, no-no, look, where you going?\nWhere you going? No-no-no, come back\nI know Jigga, Jay-Z, y'know a good tune\nNo-no-no, come over to my house right now\nI'll show you his number, no\nDon't walk, don't walk away, come on!\nI know, please come back, please, please please\nPlease come back pleeeease\nAww geez, oh geez, oh geeeeez\n\n", "album": {"title": "It%27s_The_L!!_(2001)&&8504", "genre": "", "year": 2001}}, {"title": "You Gotta Stop", "href": "You_Gotta_Stop&&7564", "artist": {"unique_name": "Lexicon"}, "lyrics": "Maaan, you got a problem Nick\n(Nah you got a problem Oak)\n\n(Chorus 1: repeat 2X)\nYou gotta stop smokin' weed in the morning Nick\nYou really gotta stop doin' that shit (that shit)\nBecause you're always talkin' bout how you gonna quit\nWell now you gotta deal with it\n\n(Verse One)\nCheck it out\nThe alarm went off, around a quarter to nine\nMy eyes were stuck shut so I was pretty much blind\nBut my nose was workin so it was already defeat\nSee I was sellin some herb, to make ends meet\nAnd the smell was sweet (sweet) so so sweet\nI'll just take a little hit to put some movement in my feet\nSlow movement, slowly got me out of bed\nAnd quickly put me in the kitchen fryin eggs and bread\nWatchin \"Divorce Court\" instead of class at ten\nBut I knew I wouldn't make it before class'd begin\nHopped in the shower and (yeah) after a half an hour\nOf deep concentration and my own meditation\nIt was time for motivation the way Cali knows how\nAgain it's the third time in three hours\nAnd the phone rings, and it was my man Raoul\nHe said he wanna smoke a blunt before school, I said, \"Cool\"\nSwooped through the spot I don't got class till two\nWhere I wasted my time but I slept for a few\nMy next, I think that I slept right through\nAnd I was still feelin' sleepy skipped the last one too\nThen I snapped at my girl, forgot to call my mother\nStarted actin' like a dick and really pissed off my brother\n(Then it's) home by three wantin my MTV\nSayin' I'm stoppin' this shit, startin next week\n\nMan (f'real) you're not gonna stop\n(Aw c'mon man you're one to talk, look at you, cause you, y-you)\n\n(Chorus 2: repeat 2X)\nYou gotta stop havin' sex with your ex Big Oak\nYou gotta really stop doin' that shit (that shit)\n'Cause you're always talkin' bout how you gonna quit\nWell now you gotta deal with it\n\n(Verse Two)\nYeah I know but see it's easier, and I'm a lazy guy\nSo I'd rather sit at home and touch my ex-girl's thigh\nShit, she's hella cute and the sex is great\nSo there's no reason to go out and make my next mistake\nWith some girl that's probably gonna shoot me down anyway\nWe all know how it goes in L.A. don't we fellas?\nSo my choice is the booty call, don't be jealous\nAnd don't pretend like you haven't done the same thing\nGet with the same ring on your phone after you broke up\nIt was your ex-girl and now she wants to hook up\nIf you said you didn't do it then you lied\nNo guy has that much willpower in his mind\nI know I don't, I'm a sucker for it\nAnd now she's got me callin her when I need a good hit\nShe pulls right up to my place lookin' sexy and shit\nBut then right after we're done I'm always regrettin it\nSo how'm I gonna quit? I'm a picky man\nAt least I don't hit on my cousin like Steely Dan\n{*Phone*} Aiyyo wait, hold up, let me check the caller ID\nYep it's her, I'll be back in about twenty\n(Hah! I'll be back in about twenty. Go hit that!)\n\n{*Arguing ad libs fade*}\n\n", "album": {"title": "It%27s_The_L!!_(2001)&&8504", "genre": "", "year": 2001}}, {"title": "Nightfall", "href": "Nightfall&&1329", "artist": {"unique_name": "Lexicon"}, "lyrics": "(Big Oak)\nMy days are filled with hassles\nLittle problems that run through me like a slider from White Castle\nI have to, keep my mind in line and be patient\nCause all I wanna do is rock the mic to standing ovation\nBut that day will soon come I tell myself\nFor now I gotta stay content puttin' papers on a shelf\nBut when the sun goes down, I feel free (ah)\nWhen stars cover the sky, I release the true me\nThe MC, you know the vocal technician\nMr. Black steps into the phone booth and comes out on a mission\nNow I'm the Super Big Oak\nRestorin integrity to what's become a big joke\nSee, just put a beanie on my head and a mic in my hand\nA swallow of the night air that blankets the land\nMy right hand man Nick Fury on the right mic... stand, damn!\nIt's a done deal, go 'head and seal all the exits\nLexicon will now display why we're on some next shit\nNo questions, just pay attention\nAnd maybe then you'll understand, that\n\n(Chorus: repeat 2X)\nThere isn't many that can say they're here to save the day\nIt's the two that recognize the ones that paved the way\nLexicon is out to move the crowd like the wave\n'Cause when night falls, these two make the people say HEY!\n\n{*Scratch: \"the night is on my mind\" -&gt; Q-Tip*}\n{*\"It's the beat bumpin, late night, 40 amp\"*}\n{*\"Lexicon and..\" \".. Thanksgiving brown\"*}\n{*Scratch: \"the night is on my mind\" -&gt; Q-Tip*}\n\n(Nick Fury)\nThe world startin to move around me again\nI'm just tryin' to catch up, tryin' to keep up\nThat's why I always keep my Nike's all the way laced up\nWork on dealin' with the rest of the world from the waist up\nI, go through the motions and smile in the face of\nThe cast of real life who appear to be a waste of\nNah, forget it there's a fight out back\nBetween Nickolaus Furious and Nickolaus Black\nAnd the winner is? You see at nightfall I am\nMuch less of Peter Parker and more of Spiderman\nPlus I'm tighter than a spandex; and when combined with my brother\nThere's no doubt we'll take the advantage (yo)\nRolled down the windows and let the air blow\nAway the day's flow of straight and narrow\nWorks like a scarecrow, that's how I stand in the field\nAbove it all, rock with universal appeal\nSo you better make way for the rap superheroes\nExpect no less when there's an L on my chest\nGot L's in the air on the East and the West\nYou must confess we're the illest, Big Oak said it best, yo\n\nLexicon... Thes One... People Under the Stairs\nYes, yes, yes yes y'all...\n\n", "album": {"title": "It%27s_The_L!!_(2001)&&8504", "genre": "", "year": 2001}}, {"title": "Years and Years", "href": "Years_And_Years&&955", "artist": {"unique_name": "Lexicon"}, "lyrics": "(Verse One)\nI think I'm gonna snap one of these days\nOne of these days, I'ma snap into a rage, in half\nI think I'm gonna snap somebody, for real\nI feel I gotta slap somebody\nAnd I don't know, if I'm losin my patience\nOr the world's gettin' more difficult than it was before\nBut people seem dumber, prices are higher\nMy wallet got thin and now the straights are dire\nAnd it's all really startin to get to me\nI feel like one ingredient inside the recipe\nAnd the rest of me, is fallin' off to the bone\nLike leprosy, everything starts to pester me\nSo I hide behind stacks of bills\nAnd the cracked windshield of my automobile\nThat's why everything gets more distorted than it seems\nMy girl tellin' me that I'm havin' hoop dreams\nNow we're arguin again (damn) I take a hit\nAnd turn the volume up to ten and run with no direction\nAnd only hopes of an escape\nBut it's like runnin' in circles on a twelve inch plate\nThey say, to be insane is when you do the same\nAnd get the same results and still do it again\nThey say, to be insane is when you do the same\nAnd get the same results, check it, check check it out\n\nTurned on my VCR, same one I had for years\nTurned on my stereo the static hurts my ears\nI sit in my old car, same one I had for years\nBattery's been runnin' down for years and years and years\n\n(Verse Two: Takbir)\nYo, I'm sick of bein confused and always gettin' my hopes up\nSpin the barrel twice and put it back in my holster\nDiamond in my confidence watch three (?) as\nI'm blockin in my passion for rappin' it's all provocative\nThis is how it is if you hate havin' jobs\nIf you wait then you strong if you fake then you gone\nThe fiasco of cash flow, makin' me laugh\nSo I throw on my costume while swingin' my lasso\nSteak for the butcher shop, weightin to slay\nA nice meal till they cookin raw paper mache\nSo last but not peace I dropped a few lines\nIn the book of thought ingredients passin through time\n\nLet me hear you say fuck, that, shit\nIf you can't deal, with, it\nLet me hear you say fuck, that, shit\nIf you can't deal, with, it\n\n(Verse Three)\nYo, yo, yo\nIt's been a long time since my brain felt peace\nIt's this and it's that but not me\nOr is it, all the think to thought makes me (?)\nWith my fingernails with no guilt makes a visit\nI wish I was ten years old again (why?)\nCause back then I wasn't so picky about my friends\nPlus I'd rather worry about which toy I want next\nThan havin' to worry about my rent check\nSee man, don't you understand?\nYou have to beat the system, before you make demands\nAnd that's all fine and dandy for the time being\nBut I'm sick of payin' bills with money I'm never seein (help!)\nDamn computer screen makes my eyes hurt\nI hate givin' up my time, that's why I'm always late for work\nAt least fifteen minutes (hurry up)\n'Cause I need the snooze bar the way Popeye needs his spinach\nI hate when the little things become big things\nAnd the big things become bigger things\nThat's when I simply shut my eyes, and cover my ears\nSame thing I've done for years\n\n(Repeat 2X)\nLet me hear you say fuck, that, shit\nIf you can't deal, with, it\nLet me hear you say fuck, that, shit\nIf you can't deal, with, it\n\n", "album": {"title": "It%27s_The_L!!_(2001)&&8504", "genre": "", "year": 2001}}, {"title": "Nikehead", "href": "Nikehead&&3918", "artist": {"unique_name": "Lexicon"}, "lyrics": "\"And I'm a Nike head..\" -&gt; Nas\nLexicon! Lace up your sneakers\n\"And I'm a Nike head..\" -&gt; Nas\nNick Fury, lace up your sneakers\n\"And I'm a Nike head..\" -&gt; Nas\nLace up your sneakers\nComin' out your speakers\n\nEverybody's got an addiction, mine is shoes\nIt started with my very first pair of Kangaroos\nAnd to L it see, made for tennis I play none of it\nBut I owned 'em in brown and black suede\nBut that was hardly the beginnin of my obscene spendin (nah)\nSavin' up pennies, parental begging (what)\nEven now if I only got forty bills\nI'ma buy a sack of weed and go straight to Marshall's\nCause one time at Ross I found Nike Zoom Airs\nFourteen bucks (what) I bought two pair\nI always do dat dere so there's no need to despair\nIf my kicks get ugly from some wear and tear\nI know it's sick, my addiction, I'm addicted, I admit it\nLike an alkie to his liquid, I ain't tryin' to kick it\nI predicted I'm headed only downhill from here\nCause my foot hasn't grown in the past five years\nI got old shoes, new shoes, on my closet floor\nIn my trunk, holdin' open my doors (where)\nOverdue shoes, borrowed from my brother yup\nAlternates, duplicates, hard to find colors (check it)\nI got four pairs of Air Force Ones high and low\nAll in all white, one with a gum sole\nBuyin Air Max Runners since they first came\nBefore wearin neon colors was a G thang\nRemember the first ones in pink, makin' eyes blink\nAll my clothes drab except the kicks that I drag\nAnd my top five fades all got, orange on 'em\nFrom old Air (?) to the new Airmada\nLava Domes (check) Internationalist (check)\nAnd a bag of ankle socks, do you accept checks?\n(No not for you Mr. Fury not at Sporty L.A.\nYour account's made of rubber find another way to pay)\nThat's when I go on the internet\nTo the Japanese sites, where I can't read a word of it\nBut the pictures taunt, tell me to max out my Mastercard\nDeal with it later these shoes are hard\nSaid the same thing for my Wallabees, Timberlands (shit)\nI even got Cortez to match my Pendletons\nI got a problem, and I need salvation\nSo at this time I'm accepting donations\nCash is fine, or anything in size nine\nBut please don't send no Jordans\nSend 'em to someone else - I'm not the only, one on this Earth\nWho will buy food second but a pair of shoes first\nOak's a Nikehead (yo) and my man Double-O\nWhose got more Air Force Ones than anyone I know\nI mean I even got my girl into obscure kicks\nIf it ain't in my size then a boy size six\nSo if you wonder why I'm broke (why) or my bank account's dead\nA - I'm underground, B - I'm a Nikehead\n\n\"And I'm a Nike head..\" -&gt; Nas\n{*Scratch* \"I'm an addict for sneakers\"}\n\"And I'm a Nike head..\" -&gt; Nas\n{*Scratch* \"I'm an addict for sneakers\"}\n\"And I'm a Nike head..\" -&gt; Nas\n{*Scratch* \"I'm an addict for sneakers\"}\n{*Scratch* \"I'm an addict for sneakers\"}\n\n\"And I'm a Nike head..\" -&gt; Nas\n{*Scratch* \"I'm an addict for sneakers\"}\n\"And I'm a Nike head..\" -&gt; Nas\n{*Scratch* \"I'm an addict for sneakers\"}\n\"And I'm a Nike head..\" -&gt; Nas\n{*Scratch* \"I'm an addict for sneakers\"}\n{*Scratch* \"I'm an addict for sneakers\"}\n\nSo when your girl gets bent cause you spent the rent\n\"And I'm a Nike head... and I'm a Nike head\"\nAnd your dad gets mad 'cause it's just a fad\n\"And I'm a Nike head... and I'm a Nike head\"\nAnd your folks complain, say they all look the same\n\"And I'm a Nike head... and I'm a Nike head\"\nWell lace up your sneakers, I'm comin' out your speakers\n\"And I'm a Nike head... and I'm a Nike head\"\n\n", "album": {"title": "It%27s_The_L!!_(2001)&&8504", "genre": "", "year": 2001}}, {"title": "What Do You Take Me For?", "href": "What_Do_You_Take_Me_For%3F&&3414", "artist": {"unique_name": "Lexicon"}, "lyrics": "(Chorus 1: Nick Fury)\nMy name is Tonya - my name is Nick\nMy name is Diana - my name is Nick\nMy name is Sarah - my name is Nick\nAnd whaddya take me for, the last kid to get picked?\n\n(Chorus 2: Big Oak)\nMy name is Diana - my name is Oak\nMy name is Tonya - my name is Oak\nMy name is Sarah - my name is Oak\nNow whaddya take me for, the little local funny joke?\n\nNow, why is that? Why do I get passed by?\nIt's not like I have a peg leg and a glass eye\nI'm a nice guy, but that's my curse\nWe all know that they say that's last and the jerks finish first\nSee I don't get that, it makes no sense to me\nI'm not stocky so the girls won't even mention me?\nShit, I'm no J. Crew model\nBut my mind can offer you more than that beer in your bottle\nPlus, I can tell you a lot more about life\nThan some smuck who wears a see-through jersey and packs a knife\nOr some jerk that will talk you out of your panties\nIn a half an hour, and then forget your name in half that time\nMy name is Oak, my profession is to talk in rhyme\nBut when it comes to talkin' to girls I'm at the back of the line\nBecause I'm nice, the girls think I'm harmless\nThe shallow guys with cash, those are their targets\nThe good thing is, I talk to lots of girls\nBut it always heads straight to the friend zone\nMore often than the Rams get to the end zone\nWhich makes it difficult to get to the bed zone\nBut I'm not gonna change, I'll always be the same\nI've had a couple of girls, that understood my game\nSo I've had some success here, to all the dimes of the world\nI'm coming for you next year\n\n(Chorus 2) + (Chorus 1)\n\n(Nick Fury)\nSee I'm, five-seven and a little bit more\nI got a, head of hair that the girls adore\nI never call them a bitch slut skeezer or whore\nAt least never to their face and if I did they deserved it\nBut, I got class so I'm holdin' the door\nI guess I must be the doorman 'cause I'm gettin' ignored\nI'm the nice guy except for the new tattoo\nAnd the small criminal record startin back in high school\nBut because these reasons, seems we exist in different seasons\nYours range from cold to freezin\nThat's what your back told me as you walked right by\nBut I've been watchin too closely and I figured out why\nI need to, grab your arm when you first walk in\nI need to check out other girls while we're talkin'\nI'll never, call you back ever tell you how I feel\nI see that's the way to get 'em - keepin' it real\nThese L.A. girls man they're all the same\nThere must be somethin' bout surroundin 'em with fortune and fame\nThat's why I sit in the back just a little bit lifted\nEyes a little shut, mind a little more gifted\nNow she's talkin' shit, I got a chip on my shoulder?\nAlways hang around with all these people that are older\nMind your own business, that's what I told her\nAnd simple as that, she's takin' orders like a soldier\n\n(Chorus 1) + (Chorus 2)\n\n\"Just remember my rhyme, just remember my rhyme!\" -&gt; 3X\n\"Take heed to my rhyme and get the hell away!\" -&gt; Will Smith\n\n{*Same samples ad libbed to fade*}\n\n", "album": {"title": "It%27s_The_L!!_(2001)&&8504", "genre": "", "year": 2001}}]