[{"title": "Platinum in Da Ghetto", "href": "Platinum_In_Da_Ghetto&&4862", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(Billy Cook)\nLivin' my dreams, if they could\nSee me now\n(Lil'Keke)\nIf they could see me now\n(Billy Cook)\nSee me now ooh yeah\n\n(Chorus:Billy Cook + Lil'Keke)\nLivin' my dreams, 'cause it's all\nI know keep my head up everywhere\nI go makin' my cash and baby\nThat's fa sho-c'mon they got me\nPlatinum In Da Ghetto!\n\n(Lil'Keke)\nP-L-A-T-I-N-U-M people in the hood\nFor real you oughta see them I know I must\nDo what I can it's the same place that\nTook me from a boy to a man give it all back\nOnly just to see us come up y'all the same\nNiggas that use to watch the laws run up\nNow we concentration on tryna be grown men\nWatchin the earth turn feelin' the world spin\nIt's a mad psalm-tryna do it on your own\nOne day you here and the next day gone\nThe sky waits for no one I know you heard that\nEverything is mad when your broke plus black\nI'm dedicated unto my lord I pray can't see the\nFuture livin' day one day I'm workin heard\nTryna platinum charts in the ghetto my hood\nI've touched a million hearts c'mon!\n\n(Chorus:Billy Cook + Lil'Keke rp.2x)\nLivin' my dreams, 'cause it's all\nI know keep my head up everywhere\nI go makin' my cash and baby\nThat's fa sho-c'mon they got me\nPlatinum In Da Ghetto!\n\n(Lil'Keke)\nMy nieghborhood hero-80 or number 0\nGet yours and get own for real that's all\nI know live your dream because its somethin'\nTo see and the best thing happenin' is alive and\nFree I took the cashmoney and started slicin and\nCuttin' 'cause I swear that this game ain't gon'\nPromise you nothin' it's a circumstance that we\nAll go through some things is fake nigga somethings\nTrue I reconize that I've been down forever\nTime to pull the family up and try to do it together\nI got no where to run and no where to hide\nMy false is my worst so I'm stuck with pride\nCause the women and the cars it don't equal the wealth\nSo I'm all about my cash tryna impress myself\nCause the man make the money-money don't make the man\nIf you feel what I'm sayin' then raise your right hand!\n\n(Chorus:Billy Cook + Lil'Keke)\nLivin' my dreams, 'cause it's all\nI know keep my head up everywhere\nI go makin' my cash and baby\nThat's fa sho-c'mon they got me\nPlatinum In Da Ghetto!\n\n(Lil'Keke)\nIt's a hard life so I'm takin' it slow\nThat's the G-H-to the E-to the T-T-O on\nA long road but I'ma ride to die and if\nYou thuggin' then you know just what I'm talkin'\nAbout it's a ependic so I take it to the limit\nThe hood off the chain them folks they still\nIn it you should see me now and I ain't goin' to\nFar I got love for my people man whoever you are\nSo I'ma take it back then I'ma bring it up\nI ain't the only nigga out here dodgin bad luck\nTry to feel me before I let you go and its\nForever and a day we Platinum In Da Ghetto,\nIn Da Ghetto...\n\n(Chorus:Billy Cook + Lil'Keke)\nLivin' my dreams, 'cause it's all\nI know keep my head up everywhere\nI go makin' my cash and baby\nThat's fa sho-c'mon they got me\nPlatinum In Da Ghetto!\n\n(Billy Cook)\nI'm tryna give back to the hood\nAnd you see Billy Cook and Lil'Ke\nTryna do somethin' good we tryna give\nSomethin' back to you, and you, and you\nLivin' my dream if they could see me now\nOh me now... (rp.in background of chorus)\n\n(Chorus:Billy Cook + Lil'Keke)\nLivin' my dream, 'cause it's all\nI know keep my head up everywhere\nI go makin' my cash and baby\nThat's fa sho-c'mon they got me\nPlatinum In Da Ghetto!\n\n", "album": {"title": "Platinum_In_Da_Ghetto_(2002)&&3712", "genre": "Southern Hip Hop", "year": 2002}}, {"title": "Catch a Square", "href": "Catch_A_Square&&1816", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "If you got plex, we can catch the square\nAnytime any placer, any motherfucking where\nGutter ass niggaz, and we don't play fair\nAnytime any placer, any motherfucking where\n\n(H.A.W.K.)\nAny place anytime, I'll beat a bitch down\nPush his face to the ground, then fill him up with rounds\nSee I don't fuck around, I terrorize the town\nSniff a hater out the pack, like a damn bloodhound\nSee a motherfucking hawk, don't hang with crows\nI hang with the those I chose, who ain't scared to throw blows\nOn that Mike Tyson shit, that'll bite a earlobe\nBloody your nose, then scratch off on your vogues\nI'm on that other shit, you better run for cover bitch\nOr get hit with this, bear lethal fist\nI must admit, that I heard some shit\nThat when you piss, you don't stand you sit\nYou's a bitch, and fucking with a grown ass man\nI don't have to use a gun, I'm pretty good with my hands\nAsk your man's he'll tell you, H.A.W.K. don't care\nAnytime any place, any motherfucking where\n\n(Mussilini)\nLet the flame burn, burn baby burn\nCaught him at that light, saying turn baby turn\nGutter ass niggaz, and we don't play fair\nTake a nigga life, or I pull a bitch hair\nStep to the square, it'll be your last walk\nWho is that Mussili', Lil' Ke and Big Hawk\nThink before you talk, bitch you'll eat them words\nGet hung from a tree, or get flipped off a curbed\nAnytime any place, any spot anywhere\nAt night time in the noon or day, our niggaz don't care\nFlame spit at niggaz we marvelous, to get you nigga ain't hard to us\nThese bitch niggaz be fraud to us, we rich niggaz in God we trust\nWe flip figgas and our broads stay up, step out of line you will get rushed\nCrushed dick in the dust, have your homeboys picking you up\nPlus flush enemies done, I be the one to be sick with the tongue\nAnd the gun, G.I. Texas where I'm from leaving 'em hung\n\n(Lil' Keke)\nNiggaz consistently provoking, me to try to test mine\nCome through your hood, with them killas and have you get down\nCMG, I rep it hard on the streets mayn\nWe bust shit down, like a block of that cocaine\nLet's do it dog, like them gangstas and soldiers\nLet's get scarred up, knuckle up till it's over\nThe game is infected, niggaz must respect it\nWe well connected, up in Texas\nThey better squash plexers, 'cause we never play fair\nDirty South young nigga, boys gutter out there\nHating and bullshitting, will get your family tied up\nTexas and cowboys, the Penitentiary wired up\nGot licks for plenty bricks, the prices are skied up\nCatch the square anywhere, my click the size up\nThis Southside, and it's home of the crooks\nPut my boxing gloves on, and take a look\n\n", "album": {"title": "Wreckin%27_2004_(2004)&&1329", "genre": "Hip Hop", "year": 2004}}, {"title": "Baller In The Mix", "href": "Baller_In_The_Mix&&1389", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "Peep that, feel this, I'm in here with my, ah, Herschelwood Click\nYou know what I'm sayin', we ain't nuttin' but some, uh, ballers\nSteady ballin' in the mix, know what I'm talking 'bout?\n\nBallin'...ballin' in the mix, everything gotten broke,\nLil' Keke gon' fix\n\nI keep ballin', ballin' in the mix\nI'm a pimp, not a trick, hittin' licks for my fricks\nSweets and sticks, equal platinum hits\nRidin' in the Benz, screens on, watching flicks\nCan't forget, Herschelwood Click is so damn thick\nHoes on dick, that ain't shit, I hit the pussy and split\nPeep this game of a real-live baller\nDown in Texas watch the flexin' young shot-caller\nNow how many playas get to live they dream\nCome up in the game and get to start some of that green\nKnow what I mean, if you's a hustler, of course you do\nAnd if you ain't a baller I ain't talkin' to you, cause uh\n\nBallers... ballin' in the mix, everything gotten broke,\nLil' Keke gon' fix\nI keep ballin', ballin' in the mix\nI'm a pimp, not a trick, hittin' licks for my fricks\nBallin'...ballin' in the mix, everything gotten broke,\nLil' Keke gon' fix\nI keep ballin', ballin' in the mix\nHerschelwood Click and we are so fucking thick\n\nWell I'm a baller, deuce-deuce the represent\nI can't count the kilos, the cheese I sent\nFrom the corners and the clerks, for blocks and blocks\nI used to cut up rocks, now I pop them tops\nI gotta watch the cops, I got hoes by the flocks\nAnd the Duke won't stop, until I'm sittin' on top of the world\nOn stacks, and old as a fact\nHerschelwood do the front to side and the back\n\nWell I'm a baller, sippin' server alcohol uh, Corona\nSlangin' keys to the Seoul, uh\nRode deep, Socci down with the fat sweep\n10 g's in the back of my Benz C\nPlaya thing like mary jane when I come around\nMeal tickets bein' made in this H-Town\nLow ratin' niggas hatin' 'cause I'm pushin' bricks\nCan't stand 'cause I'm rollin' with them ballin' niggas SHIT\n\nBallin' in the mix, everything gotten broke,\nLil' Keke gon' fix\nI keep ballin', ballin' in the mix\nHerschelwood Click and you hoes can't forget that we ballin'\nBallin' in the mix, everything gotten broke,\nLil' Keke gon' fix\nI keep ballin', ballin' in the mix\nHerschelwood Click and you niggas can't forget\n\nMe mugs get slugs when you fuckin' with thugs\nI pushed and shoved for ghetto love, affiliated with drugs\nAnd uh, marsh shit don't thrill me, haters wanna kill me\nDon't mess wit' Texas make the whole world feel me\nNow how many ballers wanna ball like me\nAnd how many hoes wanna fuck Lil' Ke\n2 or 3 now black it should be more than that\nI'm sittin' low sittin' phat creemats in the cat\nI grab my gat blugs back while I'm blowin' up bustas\nRecent cut, fourset, bezentine, and gloccer\nHerschelwood it ain't over, mix the serve with the soda\nA 600 Benz with the V-12 motor\nSouth Dakota to Carolina, a nationwide drug smuggler\nRap game got me fame, low key, undercover\nYo brother and their other, whoever stand taller\nSouthside representin' as a baller, yeah\n\nBallin' in the mix, everything gotten broke,\nLil' Keke gon' fix\nI keep ballin', ballin' in the mix\nI'm a pimp, not a trick, hittin' licks for my fricks\nBallin', Ballin' in the mix\nHerschelwood click and you niggas can't forget that we\nBallin', Ballin' in the mix\nIf you don't like my style, straight up suck my dick\n\n", "album": {"title": "The_Commission_(1998)&&1426", "genre": "Southern Hip Hop", "year": 1998}}, {"title": "Hit Em", "href": "Hit_Em&&9527", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(*Talking*)\n7-1-3's finest, CMG\nGhetto Dreams, Presidential\n\n(Hook: Lil' Keke &amp; (H.A.W.K.))\nYou hit 'em high, I'ma hit 'em low (hit 'em low)\nYou hit 'em high, I'ma hit 'em low (hit 'em low)\nYou hit 'em high, I'ma hit 'em low (hit em)\n(And if you hit 'em in the face, I'll give 'em a body blow), oh\nYou hit 'em high, I'ma hit 'em low (hit 'em low)\nYou hit 'em high, I'ma hit 'em low (hit 'em low)\nYou hit 'em high, I'ma hit 'em low (hit em)\n(We wrecking with flow, we in the studio), oh\n\n(Lil' Keke)\nWe gon go up top, and go back down\nI'm quick to make your shit lay down, and close the round\nA nigga going pound for pound, until the blood is found\nSnatch punks off the glass, like a Shaq rebound\nGot more depth young clown, 'cause we rep H-Town\nAnd we beat chumps down, at the lyricists lounge\nI hit 'em high, regroup then go to the bottom\nTo his ass to his ribs, when he fold I got him\nIf he still sitting up, then we work that grill\nBig judge young Don, serving raw and steel\nTo the gate to the finish, this for CMG\nAnother Ghetto Dreams, sponsored by S.U.C\nGot big swoll nuts, and as a matter of fact\nGet off my dick young trick, or get your click looked at\nSpit bombs in the studio, they all atomic\nH.A.W.K. seal him in the face, I'ma catch him in the stomach\n\nOh...\n\n(H.A.W.K.)\nClass is in session, I'ma spit with aggression\nAnd if I feel threatened, you better call witness protection\nStop asking questions, five line connection\nWell connected, jinks, whites, blacks and mexicans\n7-1-3 nigga, armored Texans\nIn the three fo' deep, in my corner flexing\nIntersection, young cats is fucking with veterans\nSouthside legends, killas that'll beat your head in\nPop the lead in, hit you in the stomach and head and\nPop your legs in, then straight leave you for dead and\nEnough is said and, move it on down the field\nLike the Kansas City Chiefs, and that Dick Vermeil\nThis shit is real, fuck how a nigga feel\nWe moving like a freight train, trying to get that scrill\nI'm changing the game, with Don still changing lanes\nAnd with both of our brains, all we see is change\n\n(Lil' Keke)\nThe mic turn on, boy it's duck and cover\nAnother pen getting pimped man, by me and my brother\nNever pimps my hand, 'cause I just don't love her\nWhen I'm in the studio, I do it like nan-nother\nAnd I'm one of a kind, they better find me a clone\nAnd you sure right sticks and stones, they break bones\nRise like grits, when the shit get thick\nBreak 'em down so quick, sit him up on bricks\n\n(H.A.W.K.)\nI'ma hit all his licks, fuck all his chicks\nWondering how I done it, 'cause I flow so sick\nDo the arithmetic, flow equals do'\nAnd dope plus flow, equals the take your hoe\nCMG, is fucking what that Ghetto D\nTrying to see, currency like Master P\nS.U.C., Big H.A.W.K. and Don Ke\nAnd with 20-20 vision, y'all still can't see\n\nOh...\n\n", "album": {"title": "Wreckin%27_2004_(2004)&&1329", "genre": "Hip Hop", "year": 2004}}, {"title": "Throw Your Sets Up", "href": "Throw_Your_Sets_Up&&7444", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(*Talking*)\nWhat what, this for the hood y'all\nYeah what, this for the block y'all\nWhat yeah, this for the set y'all check it\n\n(Lil' Keke)\nOk this Southside, who do it better than me\nDistribution radio, baby and even TV\nWe got the hood locked up, got the watch rocked up\nYou know the game done changed, since the Don popped up\nEveryday all day, can't see it no other way\nFrom the Houston city streets, to the old AK\nWe been blessed mayn, 'cause we the best mayn\nAnd I got loot bulletproofs, on my chest mayn\nWhere your block at, nigga represent for your set\nWe do it quick fast and fly, like a airline jet\nWe getting money baby, because we love to work\nAnd I will stay gangstafied, when I'm put in the dirt\n\nIf you really representing, go and throw up your set\nCause my hood off the chain, every chance we get\nWe some thug niggaz, we ain't no scrub niggaz\nIt's just gangstas, cut throats, man I love niggaz\nIf you really representing, go and throw up your block\nAK's and 45's, with them plastic glocks\nWe some thug niggaz, we ain't no scrub niggaz\nWave your hands in the air, if you love niggaz\n\n(Lil' Keke)\nIt's war time, on the real and you ain't heard\nHit the cuts on fire, moving halfs and birds\nGet my paper route, then pull my stacks out\nI fuck with G's and thugs, that got that street clout\nYou gotta be certified, cause this is Southside\nMy shoes be 22's, when I'm outside\nI gotta get mo' do', mo' dro, I gotta resco'\nGotta stash a ki, when the shit get too slow\nOh no, there go them boys set tripping\nOh no, there go that AR ripping\nTell your whole click, they better clean up they act\n'Cause when the clock going forward, ain't no turning it back\n\n(Lil' Keke)\nIt's the black mack, pushing new Cadillac\nSmoking a fat sack, riding with the roof back\nOk it's CMG, and we gon get it fa sho\nWe trying to touch 60 mill, like them boys in Blow\nI gotta let 'em know, that I'm still a pro\nFreestyle right now, they gon love the flow\nIt ain't no thang mayn, it ain't gon change mayn\nIf it's crack, rap or pimping, it's the same thang\nIt's bout that cheddar fool, this shit is old school\nDirty South representing, like I'm 'pose to\nCause Commission rich nigga, we some dangerous killas\nAnd I wouldn't really give a fuck mayn, I love my niggaz\n\n", "album": {"title": "Street_Stories,_Volume_1_(2003)&&2649", "genre": "Southern Hip Hop", "year": 2003}}, {"title": "Southside", "href": "Southside&&1357", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "Welcome to the uh Southside,\nNo, uh-uh, I said the Southside of H-Town.\nYou gotta peep game, you know what I'm sayin' 'cause um,\nTexas from the south\nAnd Louisiana from the south\nAnd Mississippi from the south\nAtlanta, Georgia from the south\n\nThat's why we doin' the uh\nSouth Side, the South Side, yeah\nThe South Side, the South Side, everybody do the,\nSouth Side, the South Side, yeah,\nThe South Side, the South Side, raise your hands and do the\nSouth Side, the South Side, yeah,\nThe South Side, the South Side,\nShokarock it do the South Side, the South Side yeah,\nThe South Side, the South Side,\n\nH-town is thowin up the duce\nAnd givin' niggas dab\nYou know the Southside actin' bad on the slab, (uh-huh)\nWe're thowin up the duce\nAnd givin' niggas dab\nYou know the Southside actin' bad on the slab, (all right)\nWe're thowin up the duce\nAnd givin' niggas dab\nYou know the Southside actin' bad on the slab, (what?)\nI'm throwin' up the duce, and givin' niggas dab\nYou know the Southside actin' bad on the slab,\n\nI woke up early, jumped in the butta\n(Versace) sace shades pushin blades, let them four burn rubber.\nI swung and I swang, you know that nigga clean.\nHit the Belfort and the (Martin Luther) King, Europeans with the screens.\nBigga fo tank, everything cash\nGlass pop red throw the wood in the dash.\nMashin on the gas is a thug like Green.\nPrompt for a young I see not in the pin\nShowin naked ass and my stories 'bout to kill ya.\nSeventeen hundred west appalova silver.\nHit the school zone, fourteen shoocky,\nCaught that lil duce sideways sittin' crocked\nPulled in Exxon nothin' less then supreme\nNever slippin but I'm trippin' candy red on the scene.\nFlossin on the hoes, tossin on them women\nGotta pop the trunk for that nigga pad lemon\n\nAll right we're thowin up the duce\nAnd givin' niggas dab\nYou know the Southside actin' bad on the slab, (uh-huh)\nWe're thowin up the duce\nAnd givin' niggas dab\nYou know the Southside actin' bad on the slab, (all right)\nWe're thowin up the duce\nAnd givin' niggas dab\nYou know the Southside actin' bad on the slab, (what?)\nI'm throwin' up the duce, and givin' niggas dab\nYou know the Southside actin' bad on the slab,\n\nAshes to ashes dust to dust,\nLead in the bus, sweets and tusk\nMobbin heavy in a Chevy,\nBreaking concrete, Polo on my body and Nikes on my feet.\nHold ya horses these is choices in the presence of a playa\nBuckle up the belt threw the Southern Himalayas\nRaise up off the dick, because you see ya nigga glowin'\nOver seas blowin' trees with a long esa mowin'.\nMary Jane on the plane ain't a damn thing changed.\nPeace a chain, diamond ring, 'cause I'm thowed in the game.\nBack in nine-five I was broke catchin cabs.\nFuck 'em all I'm a ball. Chop it up on the slab\n\n'Cause I'm thowin up the duce,\nAnd givin' niggas dab.\nYou know the Southside actin' bad on the slab.\nAll right we thowin' up the duce,\nAnd givin' niggas dab.\nYou know the Southside actin' bad on the slab.\nWe do the Southside, the Southside, yeah.\nThe Southside, the Southside, everybody do the,\nSouthside, the Southside, yeah.\nThe Southside, the Southside, yeah.\n\nRaise yo hands, so so high, rub ya head, and do the Southside.\nDo the shockin' and the rockin', from left to right,\nLook fly, get high with ya swisha rolled tight.\nI might just do, the Southside with you,\nIt's easy and new, break it down and jam it screwed.\nDraws stankin curls if that's the way you hit 'em\nMovin' side to side with ya motion and ya rhythm,\nYou still in move, stay in the groove\nKeep your high and you really can't lose\nI'm a lift my head, and keep my pride\nAnd let the whole world do the damn Southside.\n\nWe doin' the Southside, the Southside, yeah\nThe Southside, the Southside, everybody do the,\nSouthside, the Southside, yeah,\nThe Southside, the Southside, raise your hands and do the\nSouthside, the Southside, yeah,\nThe Southside, Southside,\nShokarock it do the Southside, the Southside yeah,\nThe Southside, the Southside\nIt feel good to do the Southside,\n\nThe Southside ain't threw.\nThe Southside it's here new and it's screw.\nAnd it's me Lil' Ke' and the Hershalwood click.\nIf you don't like it get up off the Southside dick.\nSmoke another blunt,\nPull another stunt.\nJammed down in the front on a million dollar hunt.\nSo raise your hands,\nAnd open up wide,\nAnd get yo ass fucked the whole Southside.\nYeah\n\n", "album": {"title": "It_Was_All_A_Dream_(1999)&&8844", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Make Em' Break It", "href": "Make_Em%27_Break_It&&495", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(Lil' Keke)\nWoody, Wodie, Woody, Wodie...\n\n&lt;Verse 1&gt;(Juvenile)\n\nMy nigga, my motherfuckin', my wodie-May'ron\nMy people like used to be runnin' with up in uptown\nWhat I see now the game ain't for me to be in\nSo I'm pretend cause niggas can't (?) (?)\nNow I'm pretend in the middle of the projects it stings\nCause niggas trippin' they really think that they could win\nI ain't wit dat, I'ont even want em' around\nI'm a 2x loser, one more time they go around me\n\n(Baby) (Lil' Keke)\n\nWodie, platinum pieces increases\nNigga we the Denver Broncos of this rappin' season\nFuck dapters, Clappin season\nNigga wanna be a baller... playboy in nappy season\nI'm the motherfuckin' shot caller\nCMB be the reason we toting they heads makin' money\nWe cooking bacon, fuck the bullshit we money makin<i>\nBitch nigga daughter breakin'\nPut yo money on the table playboy\nYou can't fake it (Wodie)\nHow we luv that?\n\n&lt;Hook&gt;(Metalic Voice)&lt;In Background Lil Keke&gt;\n\n&lt;Woody, Wodie, Woody, Wodie...&gt;\n(These are the Hot Boys if not they'll make it, shake it\nThese are the Hot Boys if not they'll take it, shake it\nThese are the Hot Boys if not they'll make it, shake it\nThese are the Hot Boys if not they'll make em, break it)\n\n&lt;Verse 2&gt;(Turk)\n\nI just don't give a fuck either I live or I die\nUntil then I'm going all out and don't ask why\nUntamed guerilla, hard head and don't listen,\nMagnolia soldiers standing black two pistols by myself\nWhen I come and get ya\nWhen I'm full of that dope nigga, I'ma split ya\nLil' Turk bout gun play and any day nigga whatever\nLight or daytime it really don't matter\nI'm a Hot Boy fo' sho'\nI'm bout' riding, I leave yo head bust nigga\nWhen I start Firing\n\n(Lil' Keke')\n\nWodie, Woody, Wodie\nAll the playas in th club-try to bounce to dis\nThrow yo roley in the air-smoke an ounce to dis\nIts Lil' Keke commission out so lonely CMG's\nAnd now Cash Money, now you hoes feeeling me?\nIt's going now from Michi to Uptown wit clowns\nSmoke a pound e-ve-ry these haters they buying out\nWhen I come around, I know a scene wit bassment\nStrictly paper chasing\nIndo we raising, for info we wrote it in pens wit green letters\nWith tha tasting its (?) Blue or Gold or better its whatever\nCreeping the pen-a freestyle\nThat's a block on fire wit Turk and Juvenile\nIf the gold is mine and Safaris hard don't you ever mistake\nLil' keke and the Hot Boys\nWe some worldwide players from the dirty south\nDiamonds, Gametes and rocks all up in my eye\nThis fo' real-violence it takes, we get paid\nAnd the drop-top Twista Rosa-Let the sun hit the face... nigga\nWoody Wodie Woody...\n\n(Shake it mama\nShake it papi 4X)\n\n(This is Lil' Keke feature the Hot Boys, Hot Boys 8x)</i>\n\n", "album": {"title": "It_Was_All_A_Dream_(1999)&&8844", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "We Did That", "href": "We_Did_That&&8847", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(*Talking*)\nSouth-Sive, the young Don\nYou motherfucking right, I'm back man\nH-A-W-K, my motherfucking big brother\nThis for the late great Fat Pat\nDJ Screw baby, you did it\nYou started this monster man, ha-ha\n\n(Lil' Keke)\nWe did that, just to prove a point\nWhen we in the vocal booth, we'll crash the joint\nAnother callabo, reaching for mo' do'\nGeeking and spitting flow, teaching a weak hoe\nLet me go, I drop raps a mile a minute\nDone six hundred thousand, local and independent\nBoys see me flow, but they can't see me do'\nCutting out the middle man, when you the CEO\nI mash and get crunk, and do it for Corey Blunt\nTake a two week trip, throw fifty up out the trunk\nMastermind, take it to another level\nBasically I'm saying, that I'm platinum in the ghetto\nFuck a major deal, we get nine a pop\nPressing up seventy thousand, every time we drop\nRelease six a year, you do the math\nI'ma stay in the studio, and let you hear the slab\n\n(Hook: Lil Keke &amp; (H.A.W.K.) - 2x)\nWe did this, just to let you niggaz know\n(Mic check straight wreck, when we come with the flow)\nRepresenting, for the S.U.C\n(Coldest lyricists, in the 7-1-3), hey\n\n(H.A.W.K.)\n7-1-3, is the area code\n7-45, is how I hog the road\n24/7 nigga, I stay blowed\nAnd all the hoes say H.A.W.K., is thoed\nIt's the great one, brother of the late one\nThe straight one, when I bust with this gun\nDon't hate son, cause the flow is polish\nNever went to college, but still blessed with knowledge\nNever had a major deal, and don't even want it\nI just flex my skill, and crush my opponent\nHowever you want it, I bring it hard to the rack\nAnd y'all must forgot, I got platinum placks\nAnd that's a fact, the next best thing to crack\nTo hear one of my songs, you gotta ring it back\nRewind that shit, get off in your mind and shit\nThe kid is sick, and I love the way he spit\n\n(Lil' Keke)\nWe spit this rap, and drive this map\nThen I kick this flow, and go for mo'\nThen I let you niggaz know, that I don't play\nSmoke this light green, everyday\nI'm on my way, me and my nigga Big Hawk-y\nAcross the water, alert the Nextel walkie\nYoung Don, and they just can't see\nAnother cold nigga, from the 7-1-3\n\n(H.A.W.K.)\nKe hit me on the walkie, so I hit him back\nDid you hear what we did, to that Worm track\nWe did that, boys better back on back\nOr I'll react, and dominate just like Shaq\nH.A.W.K. and the Don, really we don't barre none\nWe the shit, and y'all mo'fuckers the runs\nHere we come, so y'all better move around\nIt's the 7-1-3, bout to shut shit down\n\n", "album": {"title": "Wreckin%27_2004_(2004)&&1329", "genre": "Hip Hop", "year": 2004}}, {"title": "Bounce and Turn", "href": "Bounce_And_Turn&&729", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "Everybody knows that Bounce and Turn\nEverybody know that Bounce and Turn, yeah\nEverybody knows that Bounce and Turn\nThat Bounce and Turn, yeah, that Bounce and Turn\n\nWe're bouncin', 'n everybody knows that Bounce and Turn\nWe're bouncin', 'n everybody knows that Bounce and Turn\nWe're bouncin', 'n everybody knows that Bounce and Turn\nWe're bouncin', 'n everybody knows that Bounce and Turn\n\nFor the early my concernin', Yokohamas we're burnin'\nRippin' woodgrain, stunnin', while we're flossin' and turnin'\nYo body got me yearnin' as we floss away together\nAnytime, any weather, watching screens on the leather\nWherever you are, and whoever ya be\nThere'll be a fucking and a sucking, same time blowin' trees\nCan you see what I see, let your soul be free\nKilluminati to the body, try to feel Keke\nI'm on switches for the riches as I sit sideways\nPut your body in a phase and your mind in a maze\nYou finish your part, made you scream and shout\nYour rapture I caught, now you drank the dripped out\nLet it begin before it end with your beautiful skin\nIt don't stop, drop the top, put your hair in the wind\nYou lookin' you listen, and a lesson you will learn\nPuffin' weed puffin' sherm as we flossin' we turn, we're bouncin'\n\nWe're bouncin', 'n everybody knows that Bounce and Turn\nWe're bouncin', 'n everybody knows that Bounce and Turn\nWe're bouncin', 'n everybody knows that Bounce and Turn\nWe're bouncin', 'n everybody knows that Bounce and Turn\n\nWell Chef Boyardee, is through cookin' ounces\nLyrical thesis side pieces sittin' crooked on my posses\nIt's a hot summer day, no time to play\nMix the serve with Alize now the business on its way\nOf the strip, chrome blaze I'ma tip\nBig o' mothership on a Southside flip\nLet's rip, the streets, and then rip the sheets\nIn between I'ma be when I'm gone off them sweets\nThat's me, a kunda, keep it on the under\nBody shake like thunder, I know your brain cells wonder\nWhy we rollin' and strollin', no more in I'm holdin'\nBig paper I'm foldin', ain't a damn thang stolen\nYou're showin' your love, cause you know what it's made of\nRubber doves, full shrub, from the back and the tub\nWe can play parlay, cause this lesson will be learn\nAnd Herschelwood Texas is still bouncin' and turnin'\n\nWe're bouncin', 'n everybody knows that Bounce and Turn\nWe're bouncin', 'n everybody knows that Bounce and Turn\nWe're bouncin', 'n everybody knows that Bounce and Turn\nWe're bouncin', 'n everybody knows that Bounce and Turn\n\nOur weather's a river, and weather's so late\nNo mistakes I ain't a fake, watch the front-end break\nTrunk pop it don't stop, rollin' round make it hop\n3-wheel and kill when you come out to shop\nCause the serve got my thirsty, niggas wanna verse me\nRaise up I'm on buck, and the place eh Hersche'\nWe was lost, now we found, thanks to Jam Down\nWatch the whole click clown representin' H-Town\nTogether foreva, we be swatchin' chit chat\nBreakin' niggas hats same time going plat'\nSo whether haters hate I got my papers I'm earnin'\nFuck 'em all, we gone ball, while we flossin' and turnin',\nWe're bouncin'\n\nWe're bouncin', 'n everybody knows that Bounce and Turn\nWe're bouncin', 'n everybody knows that Bounce and Turn\nWe're bouncin', 'n everybody knows that Bounce and Turn\nWe're bouncin', 'n everybody knows that Bounce and Turn\n\n", "album": {"title": "The_Commission_(1998)&&1426", "genre": "Southern Hip Hop", "year": 1998}}, {"title": "On the Come Up", "href": "On_The_Come_Up&&4087", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(*Talking*)\nCheck the game, we gon do it like this\nFor the 2 triple 3, all right\n\n(Lil' Keke)\nHold up a minute, and let me mash it\nGive me a check, and I'll cash it\nIt's all about the cream, and getting paid you see\nI'm from the fourth largest city, called 7-1-3\nThis is O Town, where niggaz be getting smoked down\nCatch me next summer, I'm chilling down in your town\nFor real, signing a major deal\nAll I wanna do is relax, and make my mills\n\nHow many niggaz, be getting they crush on (crush on)\nWhen the FED's is coming, you get your rush on (rush on)\nLife is gravy, I'm on the come up (come up)\nIf you think it's a game, then go on run up (run up)\n\n(Lil' Keke)\nWhere them go-getters, not them bullshitters\nTalking certified soldiers, them lick hitters\nYou know every year, we gonna roll new whips\nGangstas, thugs and them Bloods and Crips\nWe on the bottom, trying to make it to the top\nShaking the FED's, trying watch out for crooked cops\nI'm loaded, full of Hen and dank\nGoing 80 on the freeway, I'm wasting my drank\nI need a Hotel, with a woman to match\nIn a 600 Coupe, when it's time to scratch\nSo I'm crawling, and the rain is falling\nOne thing fa sho mayn, forever we balling\nWe stay fly, and we stay high\nGot the answer to the game, like that A.I\nIt's the come up, so don't run up\nAnd the ki's in the kitchen, man they done up\n\n(Lil' Keke)\nLast but not least, bank accounts increase\nTrying to get to the cheese, to my life deceased\nOn the cool, when it's time to swing\nGot them bricks to the ceiling, stand tall as Yao Ming\nHow you like that, better get back\nStash and put away, for some mo' stacks\nThis the street game, are you ready my man\nGet your bread get your money, get a hell of a plan\nPoetic 1, yeah this your nigga Lil' Ke\nAvarice representing, with that CMG\nWe could never stop, with no motherfucking plexes\nAll respect due, to the city Houston Texas\n\n", "album": {"title": "Street_Stories,_Volume_1_(2003)&&2649", "genre": "Southern Hip Hop", "year": 2003}}, {"title": "High Come Down", "href": "High_Come_Down&&2224", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(*Shima singing*)\n\n(Hook: Shima)\nHigh come down\nWhy do you make my high, come down\n\n(Lil' Keke)\nPut the Crys on ice, let the lights dim bright\nPut your best dress on, 'cause we fucking tonight\nLay your hair down, cause you a beautiful star\nGot the laced thong on, with the matching bra\nHad a sip of hypnotic, now you feeling erotic\nWanna get up under me, and start touching your body\nI make your high come down, up and down\nGive me some leeway, head on the freeway\nSlide the roof back, put the square in the air\nDamn you looking good, with everything you wear\nYou my sugar brown round mound, you take it downtown\nEverywhere we go, for real it's going down\nI'm the young Don, you got it tatted on your back\nLove the way I hit it, from the back in the Lac\nLike that, round and round to H-Town\nI know what to do, to make your high come down, come on\n\n(Hook: Shima)\nHigh come down\nWhy do you make my high, come down\nHigh come down\nTell me why do you make my high, come down\n\n(Lil' Keke)\nI can't wait to hit the interstate, doing 150\nThrow the weed out, 'fore the law come get me\nI'm on my way, to the place you stay\nAnd don't worry 'bout the Benz, 'cause it's a-ok\nI'm in a drop top 5, put it in six\nBuckle up your belt, we gon scratch to the mix\nYou're my boo it's true, you make my high come through\nGon jump in the hot tub, do what you do\nCause tonight's your night, and tomorrow's your day\nI'ma hit the hot spot, with no time to play\nIn the Lex-O, and your homegirl's hating\nStop at the light, 22's rotating\nCall up the cellular, business on the regular\nFirst class strips, if I wanna get next to you\nOakland, on back to H-Town\nAnd I got what it takes, to make you come down, come on\n\n(Hook: Shima)\n\n(Lil' Keke)\nOk let's do it again, before the sun rise\nCome over and let me touch up, on your thick thighs\nLet me squeeze your chest, let me caress your breast\nWe can see the whole world baby, east to west\nWell yeah don't forget, I'm a thug nigga\nUndercover low key, I'm a mob figga\nBut let me take you to the zone, going one on one\nWe getting mesmerized, we going half on the sun\nCatch you on the weekend, and we freaking\nBut I see you next week, and we probably not speaking\nPlayas, you know we play that way\nBut I'ma ride off baby, it's a beautiful day\nOn the low-low, we smoking do-do\nWe at the bachelor pad, we doing the freak show\nSay I see you next time, when I'm back in town\nBest believe, I'ma make your high come down, what\n\n(Hook: Shima - 2x)\n\n(*Shima singing*)\n\n", "album": {"title": "Street_Stories,_Volume_1_(2003)&&2649", "genre": "Southern Hip Hop", "year": 2003}}, {"title": "Mr. D.J.", "href": "Mr._D.J.&&7547", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(Lil' Keke)\nIt's all gravy, we don't stop cause baby we keep rocking\nCause baby we keep rocking\nWe don't stop cause baby we keep rocking\nCause baby we keep rocking\n\n(Chorus: Z-Ro - 2x)\nThis is for the radio Mr. D.J.\nMe and the heavy rotation all damn day\nMechanical boys is what the way to make a living\nLooking for love so turn it up and keep it spinning\n\n(Lil' Keke)\nI'm the ghetto superstar from the city of H-Town\nRugged smile to this prepare to bow down\nI thank the lord for giving a slice of the pie\nCause that's the M-O the N-E and don't ask Y\nIt might be different time zones connections and situations\nBut what would this world be without a heavy rotation\nI turn it up, ain't this a bitch, Hot 96\n97-9, I'ma shine count down on time\nI'm in your city and state, and in your hood\nIn your face once again forever it's understood\nState to station, and we wrecking the radio\nWe cooking the airwaves to Don and Z-Ro\n\n(Z-Ro)\nToo many haters be offending me\nI'm not gone let them get to me, Z-Ro forever meant to be\nSo cold I'm a igloo cool up as hot as a fire\nAnd ain't gone never retire, stay active like a live wire\nOne of the Southside soldier from across the bricks to boulder\nWe gone get you if we owe you, again I already told you\nReady to roll the real, giving us something they gone feel baby\nNo rotation but minorities blame me daily maybe\nI just might not stop because we keep on rocking\nMight be drought season round here but see we keep on clocking\nWe done got our hands dirty now we resting them down\nRadio friendly got the whole listening now\n\n(Lil' Keke)\nWent gold in two weeks, I'm on a spinless spree\n'Cause it's R-E-S-P-E-C-T for Lil Ke\nNow to garuntee, with the more satisfaction\nSipping, smoking relaxing a player stay maxing\nWhat's happening, they want to hear it back to back\nFor the pimps in the back still dig us they push lacs\nFor the niggas riding benz, the thugs that flip trucks\nDouble deuces on them thangs popped up with new bump\nThis the episode, where CMG crawling down\nNiggas clear the road, this whole thang gone explode\nNow do it live, and all the lyrics I be spitting it be Texas pride\nYou know it's world wide, so won't you keep it crunk\nAnd energy bring it back but you can put this in your trunk\nThe radio ain't play enough you know that's what they want\nAnd give it up, on the game, and I just don't, and I just won't nigga\n\n(Lil' Keke)\nWe don't stop cause baby we keep rocking\nCause baby we keep rocking\nWe don't stop cause baby we keep rocking\nCause baby we keep rocking\n\n(Z-Ro)\nTurn it up and keep it spinning till you kissing baby\nPersonal time it turn to grind so I'm busy daily\nOut of my mind trying to shine like the sun in the sky\nIt's just because I want attention when I'm sliding by\nMedium heavy guess I'm ready to rotate like skittles\nThe album Z-Ro up in this game, punk I'm not a beginner\nI'm a veteran, exceteran ain't stopping a head rush\nWhen I'm letting my lead bust, you getting your head bust\nVerbally rappers don't worry me I'm holding my own\nLike a drug when I steal them leave them fuck high and stoned\nThat boy Z-Ro and Lil Ke, we be working the mouth piece\nWhen I throw this focus from up north they down to south east\nMo City and Hershewood we hooked up to get paid\nFlipping a target dropping the musical bomb rolling deflate\nIs it the payola that they looking for\nTrying to keep me in the kitchen rather see me selling dope\n\n", "album": {"title": "Platinum_In_Da_Ghetto_(2002)&&3712", "genre": "Southern Hip Hop", "year": 2002}}, {"title": "No Matter What", "href": "No_Matter_What&&4065", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(*Talking*)\nSouthside, the land of milk and honey baby\nReal niggaz getting money baby, respect that\nBroke niggaz, get somewhere only the strong survive\nAll about that paper baby, we want it\n\n(H.A.W.K.)\nMoney by the tons, weed in my lungs\nSwitch blades and guns, niggaz don't want none\nThis is the Dirty, the land of the birdie\nHustlers up early, getting they hands dirty\nYou heard me, yeah we get that do'\nSell out and resco', and then get some mo'\nAnd also, we spit that amazing flow\nAsk me what I'm hitting fo', I want ten a show\n\n(Lil' Keke)\nNiggaz up in the gutter, they do it for white and butter\nThey stretching it like it's rubber, the ghetto a motherfucker\nDucking the undercover, FED's they trying to smother\nGot taps up on your mother, your sister and baby brother\nWorking in closed do's, walking on tip toes\nAnd these zeros, processing these kilos\nScratching for chips and cheddar, making a cookie buck\nGangstas up in the hood, we get it no matter what\n\nWhen it's on in the hood, you feel it deep in your gut\nGangstas gon hold it down in the streets, no matter what\nPackages by the hour, my nigga we get it early\nGrind and get your cash, this how we do it in the Dirty\n\n(H.A.W.K.)\nThis right here, gon squash all the rumors\nSatisfy consumers, and cause some brain tumors\nOur boy's a late bloomer, but now of excel\nLocal to worldwide, expanding like Nextel\nNiggaz hoping I fail, but I raise hell\nIn the shit I sell, quickly moves off the shelves\nI'm a hood nigga, up to no good nigga\nHood nigga, I wish you would nigga\nEleven-nine-eleven, nigga that's what's up\nI'm strolling the cut, pinky suits and all black Chucks\nYou gotta have nuts, cause gangstas gon hold it down\nSaturating the town, white tan or brown\nBricks of pounds, you bumping get hit with rounds\nKicked around, fuck around and get beat down\n'Cause it's money to be made, on my side of town\nIf you ain't getting money, you better move around\n\n(Lil' Keke)\nNiggaz out here faking, and hating on my ability\nAll type of weapons and guns, in facility\nNiggaz out here bumping they gums, it's really killing me\nGangstas representing in the hood, I know you feeling me\nOff top, this how the work gon get handled\nSnatching from the po', when they cross the ship channel\nQuick nigga, and I ain't got time to think\nOnly dates matter now, it's the first and fifteenth\nAnd it's casualties in war, ain't no friends in money\nEverybody's all good, when the days is sunny\nBut I'm a G-A-N-G-S-T-A\nMultiply and add, trying to raise up my pay\nThis one for the fam, so I hold shit down\nWorldwide round the globe, but it's still H-Town\nThis is for the hustlers, I know you heard me\nWrecking 2K4, straight up out the Dirty\n\n", "album": {"title": "Wreckin%27_2004_(2004)&&1329", "genre": "Hip Hop", "year": 2004}}, {"title": "Where My Dog At", "href": "Where_My_Dog_At&&2347", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(*Talking*)\nWhat uh yeah, come on\nKe' keeping it hot what uh, Ke' keeping it hot yeah\nUh, Ke' keeping it hot\n\n(Lil' Keke)\nI need some'ing jazzy, sophisticated X-rated\nFreaky and dedicated, highly anticipated I'm just so thugged out\nI'm living life, as a G\nHit the pad and turn it up, and try to smoke a QP\nWatch them space age broads, 'cause they think they slick\nGet to running they mouth quick, trying to catch 'em a trick\nI like 'em super-duper fine, with they g-string tight\nCouple squares of flight, and she gon work it all night\nThis the pimp zone, where niggaz get lynched on\nAnd all that chatter just don't matter, 'cause I've been gone\nI'm trying to get high mayn, you know I gotta stay lit\nFull of that sticky-icky shit, that them white boys get\nYou can catch me on the highway, cause it ain't no joke\nMe manish and Appy Scappy, in a cloud of smoke\n\nWhere my dogs at, and where you cats at\nWe roll it up and twist it fat, because it's like that\nWe get our smoke on, keep some'ing to choke on\nWe hit the club and get a broad, and then get straight gone\n\n(Lil' Keke)\nI get my blaze on, as I'm playing for competition\nSmother the opposition, till I'm done with the mission\nI stay fired up, to keep the stress off my mind\nHustling and making runs, trying to dodge doing time\nMy lifestyle, consists of dirt and bad habits\nMurder money and tragic, killer weed and magic\nThis a different page, I'm tal'n bout really in a rage\nFuck minimum wage, getting twenty for the stage\nOn a paper hunt, getting gritty for mo'\nSix figgas is all right, but it be coming too slow\nI put my soldier rag out, when my times gets tough\nI gotta stay with some'ing to puff, because this world is rough\nSo get your groove on, then try to move on\nAnd let 'em know that you for real, and you gon come strong\nGo on rock it go on drop it, girl that's all on you\nI call the shots on this track, like a real pimp do\nSo save the drama for you mama, or you riding or not\n'Cause if you ain't that lil' mess, then go take your spot\n\n(Lil' Keke)\nSay you hot girl, I saw you peeping from afar\nLet me see you do your thang, in the presence of a star\nShe don't give a damn, she just wanna bite the bar\nStrip and skinny dip, up in the bubble bath spa\nSmoke on light green rolled up, out the jar\nJump in the king sizes, take a thug to war\nI'm on cruise control, for the rest of the night\nJust a mack of all trades, with his shit locked tight\nWhere my dogs at, they got this motherfucker jumping\nWhere my hogs at, 'cause we ain't got time for the bumping\nIndependent black owned, standing tall and strong\nGot bout five or six cars, two or three cell phones\nThis is mob status, 'cause we some young tycoons\nTrying to have mo' money, than silver spoons what\n\n", "album": {"title": "Platinum_In_Da_Ghetto_(2002)&&3712", "genre": "Southern Hip Hop", "year": 2002}}, {"title": "Bad Man", "href": "Bad_Man&&8249", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(Muhammad Ali's voice)\nI'm a bad man - 4x\n\nI'm a bad man, ain't no way for me to stop\nCall me a bad man, I'm tyring to take it to the top\nI'm just a bad man, you really want some of this\n'Cause I'm a bad man\n\n(Lil' Keke)\nGot out the gate, they better pack up and run\nWatch your step, oh lord, there he go here he come\nNow surpriiiise, 'cause we back on the grind\nI Capit-a-lize and make rookies apologize\nNow feel this, if you's a player you can keep it\nHouston we so throwed, I'm the best kept secret\nThis game funny, but I'm just looking for the money\nConstantly riding dubs dropping tops when it's sunny\nThey say we country, they better check us again\nCause the truck, lex and benz they shipped without the ends\nWe did that, whether it's gold or plat\nWe gucci and iceberg like the rest of you cats\nOne of the biggest on the map, they call us clutch city\nHard in the paint, we killers like Frank Nitty\nBut back to the lecture at hand\nLil' Keke the Don and I'm a bad bad man\n\nI'm a bad man, ain't no way for me to stop\nCall me a bad man, I'm tyring to take it to the top\nI'm just a bad man, you really want some of this\n'Cause I'm a bad man\nI'm a bad man, you know I'm ready to rock\nCall me a bad man, trying to keep the blocks on hot\nI'm just a bad man, you really want some of this\n'Cause I'm a bad man\n\n(Lil' Keke)\nI'm a bad man, I need a bad woman\nI need a super bad broad that's gone keep it coming\nIt's time to hit it up, so she could eat it up\nShe on the floor, she acting bad it's time to beat it up\nBecause it's super-califragilistic expe-alidoshious\nThe game is sick, off the chain, ferocious\nLike Roy Jones, the best pound for pound\nIf you want to test your skills I promise it's going down\nA thug to be brought, guess who's turning it out\nWhen I step up in the spot, I'm the shit no doubt\nSouthside we be ripping, 20 inch flipping\nRiding with plenty tools 'cause we always tripping\nLike Playstation 2, I just got more graphics\nThe measures that we play baby it's always drastic\nCommission Muzic Group, prepare to straight suit\nSit fat, all plat, hop in a brand new coupe\nBelieve none of what you hear, and half of what you see\nCause right before your eyes it's a certified g\nGetting paid on boys like according to plan\nComing straight up out of Texas I'm a, bad man\n\n(Lil' Keke)\nYou really want some of this then bring it on, say what\nStop talking that shit and heaven boy on the phone\nI go in the booth, then I change like Clark Kent\nCome out a super man and be ready to represent\nTook the game by storm, talking cold or warm\nNow I'm hotter than a fire that's bringing the 3 alarm\nA bad man, you know we rugged and tough\nCall me a bad man 'cause I keep on bringing it rough\nUh, perfect destination, platinum situation\nMy everyday life is like a weekend vacation\nA savage, fool you know my click above average\nGet out of line we so quick to let you have it\nWe hard hitters, with no cowards and no quitters\nAnd stand that way, until the lord come get us\nI told you before, that I'm a rhyming apparatus\nLil' Keke the Don hell yeah I'm the baddest\n\n(Muhammad Ali's voice)\nI'm a bad man - 5x\n\n", "album": {"title": "Platinum_In_Da_Ghetto_(2002)&&3712", "genre": "Southern Hip Hop", "year": 2002}}, {"title": "Still Pimping The Pen (Screwed)", "href": "Still_Pimping_The_Pen_(Screwed)&&8240", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(DJ Screw)\n9-7, Screwed-Up Click\nSoucie Folea'\nBallin' in the mix\nPimp the pens\nBall slow party on\nAh, the Screw and the Lil' K-E\nKnow what I'm sayin' cause uh...\nHerschelwood if ya hoes that know\nLil' Keke's on the rack and I'm mixed to flow\n\n(Lil' Keke)\nI'm still dranked up and dripped out, reclining to top\nStraight up, outta H-Town and the funk don't stop\nWatch the trunk just pop, and the front end hop\nI'ma swang on these bopples, I'm a clown on these cops\nCandy red out the shop, I'm leaving paint on the street\nSippin' serve, slangin' birds, smokin' indo sweets\nI done stay low in places, cause the playas hate Texas\nTV screen, Young and The Restless, in my G.S. Lexus\n&gt;From Atlanta to Virginia through the Sunset Valley\nHouston, all the way to Cali, got them fought in a rally\nRemember that bitch Sally? They didn't like her walk\nBut she still gone get fucked by Keke in the hou'\nFat Pat and Mike Drew, what about punkin' the Screw\nWe gone bring her to the South and let the click run through\nIt's real easy to see, there ain't no fuckin' with me\nI pimp the pen, once again, this is Lil' Keke\n\n(DJ Screw)\nKnow what I'm sayin' Southside?\nLet's get a drink up and dripped out pimp the pens\nKnow what I'm sayin'?\nPuttin' it down, representin' to the fullest\nKnow what I'm sayin'?\nL-i-l, go on let that boy go again\n\n(Lil' Keke)\nIt's time to lay it down, like cards on the table\nBig crib, watching gorgeous gal lickin' my navel\nWho's the man? And who's the G?\nL to the I to the L to the K to the E to the K to the E that's ME\nHeart of a hustler, mind of a g\nPunk-ass niggas can't fuck with me\nGive me cocain in reglerity\nPimps on all these hoes and jet\nBreak a nigga neck if he don't respect\nLet me pimp right down effect\nGone of the drank, got' make a bank\nPlaya haters niggas don't want tryin' to take my pad\nI'ma have to kill, when I come down, chrome in blazin' wood wheel\nPop another pill, careful, better chill\nSouthside Houston Texas won't you tell me how you feel\nMake another mill, while I pack my steel\nBreakin' boys off with my freestyle drill\nHigher than a hill, land of the trill\nPimpin' pens, hittin' skins, show another skill\n\n(DJ Screw)\nKnow what I'm sayin'? Pimp the pens, worldwide\nBreak it down Scroofless\nY'all already know what it is, Hollywood\nAin't that right Cardion?\nStraight hoggin', done deal, trick\n\n(Lil' Keke)\nFirst crip to flow, if ya hoes that know\nIn and out the back door 'cause I gots to go\nI'm more time I'ma flow, I'm a freestyle pro\nWalkin' inside the club and dismantlin' the show\nHouston, Texas, is the home of the playas and pimps\nSachi down with a limp, across the sky in a blimp\nI punch in clocks, don't like dumb jocks\nI'm a playa I'm a baller, bagguettes and rocks\nWorst strainer entertainer in the eye of the public\nNiggas love me try to dub me, 'cause I stick to the subject\nAgain and again, nothing less than a win\nYour foy, your friend, I'm a keep pimpin' pen, pimpin' pens\n\n(DJ Screw)\nJust chill, and smoke a sweet for a second\n9-7, showin' up, two-timin' on records\nSteady stackin' them dollars, guessing on my Impala\nBlowin' nose of young G don't wanna get swallowed\nToontime in the Soucie, them thangs that nigga need\nThe devil's beneath me, to God ain't no stoppin' me\nIt's serve not hennessy, blowin' up independently\nI done screwed up the industry, got them all wan' be pagin' me\nNiggas be hatin' me, because I make paper, g\nIt's all about the real paper, still ain't no fakin' me\nGirbaud what's up, cause you know I'ma makin'\nL-i-l pimp the pens, I be pimpin' turntables\n\n", "album": {"title": "The_Commission_(1998)&&1426", "genre": "Southern Hip Hop", "year": 1998}}, {"title": "Smoke With Me", "href": "Smoke_With_Me&&5219", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(Chorus: Shima)\nCome and smoke, with me\nLet me put my lips around you, and there's ec-stasy\nAnd I'm oh so glad I found you, each and e-veryday\nGotta have that smoke around me, always want you near me\n'Cause I can't go on, living without you\n\n(Lil' Keke)\nRide in the Bentley with the, top low\nPuffing on Afghan, and not hydro\nWhat the deal, I'm working my wheel and showing skills\nSipping hen on the rocks, floss in the drought\nI'm ripping up my chest, 'cause I'm choking on the best\nSmoking endo nothing less, oh yes I confess\nGuess what's next, I'm squashing the plex, I'm in the Lex\nBought your girl a new dress, just to give me some sex\n'Cause I'm ripping up the mic, and I dress so fly\nSome people they wonder why, that I stay so high\n'Cause I'm a O.G., I know you know me\nYou got some drank up in the glass, go on po' me\nWe getting gone baby, 'cause we got it that way\nAnd we gone fire something up, with no time to play\nAnd it's me you see, on the call at three\nGrab your sack out the car, come and smoke with me\n\n(Chorus: Shima)\n\n(Lil' Keke)\nCome and smoke with me, cause you know it's going down\nOakland to H-Town, hennessy and the crown\nSmoking on a blunt, ain't no time to front\nWatch Commission, Avarice pull a whole nother stunt\nLil' Keke the Don, Poetic 1 it's all good\nMoney coast to coast fa sho, its understood\nCan't nobody stop this thang, that we do\nAnd the world slowed up baby, thanks to Screw\nWe some trend setters, focus on the chedda\nPaying dues in the game, its gots to get better\nWatch the smoke just erupt, let the roof back\nWhen we roll in the trunk\nRoll 'em up fat, and squash the chit chat\nThree piece suit, with matching dob hat\nI'ma get throwed, and let the game be\nTwist one playa, the smoke is on me\n\n(Chorus: Shima)\n\n(Lil' Keke)\nI feel like ecstasy, when you take control of me\n'Cause we rolling strolling hard, and you know its holding me\nGetting high, just like the stars in the sky\nFloating on cloud nine, when I pass you by\n'Cause we ride and slide, until the sun come up\nAnd if you got something to do, then you shit out of luck\nCause this the episode, we just waiting to explode\nAnd breaking the microphone, cause my game is cold\nGo hard in the paint, when I bump the dank\nIt's gonna be a little bit better, when I mix the drank\nLet's get it cracking, pimping and macking with no jacking\nKeep the smoke going, and keep the cash stacking\nFor real, we smoke the best and feel right\nPurple crushed, blue berry and a dash of flight\nIt's going down, and it ain't for free\nEverybody in the place, come and smoke with me\n\n(Chorus: Shima)\n\n(*Shima singing*)\n\n", "album": {"title": "Birds_Fly_South_(2002)&&3993", "genre": "Southern Hip Hop", "year": 2002}}, {"title": "Don't Cry", "href": "Don%27t_Cry&&3330", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "What's up, this our new artist Quest\nCheck him out, sing the hook baby\n\n(Hook: Quest - 2x)\nBaby don't cry, I know you stressed out\nBecause I live the thug life\nDucking dodging cops, and selling drugs all night\nI know it seems hard, but it'll be all right\nOoh, it's all right-i-ight\n\n(Rod)\nSteady paranoid eyes and gray skies, looking at the people in my life\nTrying to read my mind, cause this world ain't treating me right\nBarely sleeping at night, with so much stress and drama on my brain\nCause busting bitch ass niggaz, want me out of the game\nNow ain't that a shame, can't be real with niggaz niggaz ain't real\nCan't put my trust in none of em, cause these niggaz'll steal\nAnd if I show 'em they stealing, they'd think a nigga tripping\nBut yet still they plot to catch a nigga slipping, pistol gripping\nWhen my pockets itching, to stack money\nNever thought my baby mama, would bitch and act funny\nWalking round fat tummy, talking bout she pregnant for me\nThen turn around, and say it's for a nigga named Deep\nBut I ain't tripping 'cause I got what I wanted, and let a head in some pussy\nAlways knew I was gone make it, so she's scared to overlook me\nTherefor, I hope that nigga that you with walking by your side\nBut don't be looking all sad, bitch smile\n\n(Rod)\nI feel this world, is full of envy and greee-eeed\nSuckas and bustas, all wanna witness me bleee-eding\nI paid my dues to become rich, now these folks all up on my dick\nThey wanna hate 'cause we balling, on top of ours and they falling\nI done spent too many pain, from struggling years\nBehind and under, heavy rain blood sweat and my tears\nAll on my lonesome, I've been facing my fears\nI see day to day problems, in the faces of my peers\nNo need to be greedy, 'cause I'm just trying to get what I'm worth\nBefore the people have us the hats, and wipe me off the face of the earth\nAnd place me in dirt, brought up as a problem child\nGoing through so much drama, but I still smile\n\n(Lil' Keke)\nYou know I'm thugging, not for a hobby it's just my life\nIt's gon be a hot minute, 'fore I find me a wife\nI'm into short term relations, switching up situations\nAlways on the go, I hustle for occupation\nGot them people watching, they trying to shatter my world\nYou's a major part of me, that's how I look at it girl\nGet your mind right, it ain't no need for tears\nI've been grinding getting this money, living dirty for years\nWhen we lay chest to chest, you moan and say you love me\n'Fore you fall asleep tonight, say another prayer for me\nIt's one honey, get the stress off your brain\nI'm built to maintain, lil' mama just do your thang\nI'm my own man, and I'ma do just what I can\nStaying inside my character, sticking straight to the plan\nAs for me and you, I'm trying to keep it true\nIt's a struggle on the streets, but you're still my boo\n\n", "album": {"title": "Wreckin%27_2004_(2004)&&1329", "genre": "Hip Hop", "year": 2004}}, {"title": "Here We Go Again", "href": "Here_We_Go_Again&&4081", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "Here we go again, living life on the run\nHere we go again, they got me riding with my gun\nHere we go again, man this shit is a trip\nHere we go, again\n\n(Lil' Keke)\nHow the hell you gon win, looking at ten in the Penn\nLiving in sin, bout to go back again\nDucking the government, and running from the sleigh\nGot money to infiltrate, and I still ain't straight\nIt's a hard life, when you depend on love\nIt ain't no way for you to change, you was born a thug\nYou ain't ready for the war, these streets'll eat you alive\nTrying to get all that I can get, because I wanna survive\nThey say pressure bust the pipes, shit they speaking the truth\nI probably been pulled a trigga, if I didn't have loot\nI'm from the bottom, niggaz and killas baby we got em\nDope fiends and crumb snatchers, that's straight riding\nCouldn't even see myself, trying to do it again\nGotta be ready for whatever, in the places I've been\nThis shit a trip mayn, but I ain't gon even let it worry me\nA soldier for life, true to the game you heard me\n\n(Lil' Keke)\nThese niggaz hating and jacking, so it's official\nEverytime I ride, I'm strapped with fo' nickel\nTimes getting tough, and FED's getting rough\nI stay on the mash, 'cause I ain't never got enough\nTrying to make it through the storm, so I could see the other side\nA nigga be dead, without his nuts and his pride\nThis game worldwide, I take it how it come\nWe living so raw, up in the city that I'm from\nEach and every year, the system is start switching\nSeven out of ten of these niggaz, gon be snitching\nOh you rights done rocked up, you better be glocked up\nCause niggaz go for broke, when the traffic is stopped up\nFor real, I'm talking boys getting shot\nI know your hood off the chain, but these streets is hot\nIt's a mad shame, in this shife dirty game\nWe black and caught up, with nobody to blame\n\n(Lil' Keke)\nI pray to the Lord, for this soul of mine\nI've been chasing down the clock, he got me stuck up in time\nNiggaz living for the fame, I want the money and power\nAnd I promised my old man, I wouldn't be no coward\nSo I'm living my dream, yeah a neighborhood legend\nSteaks on the plate, I ain't got time for the begging\nMy family is fed, with nice sheets on the bed\nArtillery and surveillance, glocks with infrared\nNiggaz want me dead, but I'm far from scared\n'Cause I swear, I'ma come where you lay your head\n'Cause I'm a outlaw nigga, catch the straight feeling\nAll about charges, hustle for a living\nMy testimony, is to never be phony\nLil' Keke the Don, CMG the one and only\nI place a nice bet, that I'm a ghetto vet\nAnd it's Herschel Wood for life, representing my set\n\n", "album": {"title": "Birds_Fly_South_(2002)&&3993", "genre": "Southern Hip Hop", "year": 2002}}, {"title": "Don't Mess Wit Texas", "href": "Don%27t_Mess_Wit_Texas&&8242", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "Put your stones in dust and worn, South Coast raised and born\nHave a place you get broke loose and catch the Texas long horn\nUp that ass, when I blast, claimin' South East H-Town\nBakin' cakes stackin' hate makin' playahaters break down\nIf you're lookin' for an exit, cause Houston on the wreck shit\nT-e-x-a-s is the state you don't mess wit\nCock the tech, spit, and check shit to vest\nWhere respect shit from north to east\nWell connected with the west\nIt's the 3rd Coast creepin' 'round the corner\nRockin' birds, sippin' serb, puffin' marijuana\nScrewed-Up Click roll deep and we kick it Down South\nPop the lip, try to trip, get you with the sawed off\nFind your boy, bring the north twelve Atlant' on the map\nBailin' through the Texas street with my hand on my strap\nEvery hour on the hour born doubtin' bout rexis\nLeaving you chestless if you're vestless, don't mess wit Texas\n\nAshes to ashes, dust to dust\nTexas, that's us, and in glocks we trust, cause uh\nAshes to ashes, dust to dust\nGlock 9's we bust and there's no fucking wit us, cause uh\nMarsh shit don't thrill me, haters wanna kill me\nLil' Keke representin' Texas, so try to feel me\nMarsh shit don't thrill me, haters wanna kill me\nSouthside Houston, Texas, so try to feel me\n\nCross the line at the point, to this lonestar state\nAnd create drastic c's, lil' the kid can't make\nBustin' sounds out in the Talon to this world-wide tower\nTake myself and then I bust, the other 9 don't matter\nAin't no wustle in Calies I used to think that was slow\nIt's automatics that'll catch you at this Texan's front do'\nLifestyles like Frank White, facin' Kapone\nStackin' cheese, takin' my keys, when you went through the zone\nTell your colleage you won't want this\nNorth sides took over\n9 times out of 10 I makin' it out, I doubt it\nFairy tales and riddles, cut you sweet down the middle\nFill in with weed to succeed how I'm plottin' to kill ya\nCowboys and neeyas, gangbangers and dopeslangers\nPull the Southern angle glock 2-1 in the chamber\nSo Lisa Lee, to the publicist who not try test us\nYou find yourself restless tryin' to fuck with Texas\n\nAshes to ashes, dust to dust\nTexas, that's us, and in glocks we trust, cause uh\nAshes to ashes, dust to dust\nGlock 9's we bust and there's no fucking wit us, cause uh\nMarsh shit don't thrill me, haters wanna kill me\nLil' Keke representin' Texas, so try to feel me\nMarsh shit don't thrill me, haters wanna kill me\nSouthside Houston, Texas, so try to feel me\n\nFeel the ill, yield the yield, Texas hands no fear\nStrapped with full metal gear, makin' it loud and clear\nTakin' advantage, you can't manage, I'm a Southside avouce\nSo lay it down, or be found, as the chains of massacre\nI'm askin' ya to chill, better yet try to feel\nStackin' mills down the kilo, gang related for real\nHere's the deal, 9 to 10, everythang I want even\nIf I'm in then you spin, here's the key to the Benz\nFuck a friend in this game, 'cause it's all about greed\nTech 9, red beam, and a murderin' team\nYeah we're close to the border so won't you put in your order\nPound of weed, chug of water, half a chicken or quarter\nPuffin' harder at the bottom 'cause we gainin' respect\nMight check, I select, soly Texas connected\nYou respected Ke to hate, but I set it all straight\nBrain or chest plate, it's the lonestar state\n\nAshes to ashes, dust to dust\nTexas, that's us, and in glocks we trust, cause uh\nAshes to ashes, dust to dust\nGlock 9's we bust and there's no fucking wit us, cause uh\nMarsh shit don't thrill me, haters wanna kill me\nLil' Keke representin' Texas, so try to feel me\nMarsh shit don't thrill me, haters wanna kill me\nSouthside Houston, Texas, so try to feel me\n\n", "album": {"title": "The_Commission_(1998)&&1426", "genre": "Southern Hip Hop", "year": 1998}}, {"title": "Don't You Know", "href": "Don%27t_You_Know&&4201", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "Oh yeah playas it's definitely goin' down\nGirbaud of the Manhattan I see you actin' bad\nJammin' that Lil' Keke \"Don't Mess Wit Texas\" CD\nBut right now I need you to take a... blown big break\nAnd Lil' Keke 780'll do their latest out here 'n' do his thang\nThis called \"Don't You Know\"\nGo on ladies you need to get wet on this one\n\nDon't you know, that I love you so\nDon't you know, that I love you so, baby\n\nDon't you know, I love you so\nI wan' caress you slow, from head to toe\nDeep inside I go, baby scream fo' mo'\nWe can play our way, at this game I'm a pro\nLet you run the show, a queen you will be\nSatin sheets, pat lace, Victoria's Secret\nAnd I know your body need it gotta make your mind believe it\nAll above, all the love, on my purpose is defeated\nYou have cheated on your man to his spirits a g\nWhen you know that he got flicks with a playa like me\nI guess that Lil' Keke has the key to the do'\nAnd I'm lettin' you ladies know that I love you so\n\nBubble bath in the spa, menage-a-trois\nYou a driver for a car, I'll make you a star\nAs I floss Jaguar, to wherever you are\nLong distance in the distance on my cellular\nAnd no way's too far for my private jet\nI'm on a flight, hold tight, keep it nice and wet\nPlease don't get upset, the fun just begun\nWanna want a job done, will you make me a son?\nWill you make me a daughter? Do I need to pump harder?\nTurn the temperature up on the bed so we can heat 'em warmer\nA heart of a villain, a thug-like nigga gets harder gets liver\nMore deeper to the river\nYou shiver you shake, ice cream and candy\nI wonder how it feel when your water breaks\nNo mistakes allowed at the rodeo show\nAnd I'm lettin' you ladies know that I love you so, uh\n\nAs I gaze in your eyes, it's not a surprise\nThat I'm the perfect size bumpin' between your thighs\nJust time to realize, don't need a disguise\nI'm a star on the rise, only out for the price\nDig deep into your soul, then get caught in the rapture\nYo' mind I'ma capture, night before morning after\nFirst chapter Illuminati, beamas and benzes\n7-day vacations, all-paid expenses\nI'm a playa fo' life, thanks to this rap\nI can floss, I can flap, with my salary cap\nH-Town's on the map, and nothing is negative\nI'm the owner of the firm, I make you an executive\nCause just then you will see that you do wanna be\nWith Lil' Keke in the land of free\nDo you wanna, are you gonna? Let's sit in the sauna\nAnd laugh our life away while we blow marijuana\nIt's goin' DOWN\n\nAh... I see the little latest out there acting bad\nOn that one right there\nLil' Keke from that CD \"Don't Mess... With Tex-as\"\nFeaturing Phaz, make sure you look out for him real soon aight? heh\nAight fellas, you took your break. heh\nNow here's something you can bang to, fool!\n\n", "album": {"title": "The_Commission_(1998)&&1426", "genre": "Southern Hip Hop", "year": 1998}}, {"title": "Where Da South At", "href": "Where_Da_South_At&&2816", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "So put your money, where your mouth at\nIf it's cheddar and chips, then we about that\nFraud off in the game, baby I doubt that\nThere go the East and the West, (now where the South at nigga)\n\n(Lil' Keke)\nI wear platinum on the chest, 'cause I just can't rest\nC.M.G. and BBS, nationwide success\nC-Note the big shot, and Lil' Keke the Don\nWe been Houston trend setting, baby since day one\nStart over and do it again, it don't matter to me\nRest in peace to DJ Screw, from the S.U.C\nIt's the year 2-1, we still don't bar none\nFade 'em all when we ball, keep the game on the run\nWe put the lick down, multiplied the ends\nThen put the split down, Southsi' for li'\n\n(C-Note)\nWe from the Southside nigga, we posted at the bar\nMe and Ke' the 'gar, we be shining like a star\nThem deuces on the car, cold drank mixed with bar\nBoys recognize who we are, 'cause we coming with that hard\nI wonder which ride, we gon flip this year\n2002 Escalade, yes we skipped the year\nAbout to jump through the Kappa, the young pro rapper\nThree or four girls in my car, a true macker\nThe young paper stacker, equipped with game\nNigga welcome to the section, where we hog the lane\n\n(Lil' Keke)\nSo put your money, where your mouth at\nCollecting chips and buying new whips, yeah I'm about that\nThis is hardcore, thug life\nTattoos and paying dues, and getting feddy every night\nHoes sweating me, niggaz betting me\nThat the laws behind my Lam', think they could catch me\nI think not, I'ma mash to the spot\nTurning corners hitting blocks, got the sturning wheel hot\nAll right catch a flight, hot-lanta next night\nLooking for some fire green, the price is right\nCome on they say the South, bout to fall off\nIt's the fourth quarter nigga, but the game ain't called off\nWe ain't stopping, till the tapes is hauled off\nEven if it take the glock nine, and the sawed off\nFor real, it ain't no telling where the South at\nQuit bumping your gums, and put your money your mouth at\n\n(C-Note)\nI guess we blowed up, like you thought we wasn't\nSee the double R, rap star on buttons\nShining kinda dim, northstar like nothing\nAnd I'm stomping on the snitches, that be hating and fronting\nFrom the Clover to the Wood, nigga it's all good\nAt the dome out in Miami Florida, it's all hood\nRecognize homeboy, we be South for life\nAnd my boys'll get more, from lifting so much ice\nHome of the piece and chain, diamond teeth and thangs\nHome of the pinky rings, and the raw cocaine\nThese niggaz swanging elbows, and acting all wild\nWhile I'm trying to win a Grammy, like I'm Destiny's Child\nSmoking black and mild, and getting crunk on stage\nFuck in the after Source, nigga we front page\nSee me backstage, strapped with a gauge\nTaking rap to a whole 'nother phaze, dog I'm any ways\n\n", "album": {"title": "Platinum_In_Da_Ghetto_(2002)&&3712", "genre": "Southern Hip Hop", "year": 2002}}, {"title": "Dreamin'", "href": "Dreamin%27&&9106", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(Unknown girl~Lil' Keke)\nDreamin', Dreamin'\nUh I want you, I want you\nCome on yeah I want you\nI want you come on yeah\nDreamin', Dreamin'\nUh I want you, I want you\nCome on yeah I want you\nI want you come on yeah\n\n(Verse One: Lil' Keke)\nI ain't gon' lie girl it must be somethin' 'bout you\n'Cause we ain't knew each other long and you already my boo\nI like your style you try to be mad, I make you smile\nYou lay up under my arms like a new born child\nI'm thinking back to my teenage love, my teenage life\nHow I use to say that I ain't gon' do this twice\nBut I'm a man now it can't get better or worse\nAnd I know its hard to understand that my baby is first\nBut I got family to provide for, put shit aside for\nYou know its people in the world I'd die for\nSo what's you're plan?, I'm not a full time man\nBut I'm doing what I can maybe you'll understand\nBut its all right sugar so let you're feelings hang out\n'Cause when I'm diggin deep inside I know you like it alot\nI got this thug passion to put you in the mood\nAnd then you hear my cell ring, you catchin a attitude\nLets set da record straight you knew what it was from da start\nAnd I'm just the typa nigga that'll mess up ya heart\nWe spent nights together, we took flights together\nAnd if I wanted to see the world you was down for whatever\nI'm ya lover man, can't be ya other man\nAin't no tellings when you ain't gon' find another man\nI'm a be dreamin' so wont you please come true\nCause every time I close my eyes I swear I see you, dreamin'\n\n(Chorus~unknown girl~Lil' Keke)\nIf this is a dream please come true\n'Cause when I close my eyes\nI see you (I see you)\nIf this is a dream please come true\n'Cause when I close my eyes\nI see you (I see you)\n\n(Verse Two: Lil' Keke)\nLet's get ya mind right 'cause I'm on another page\nLooking for quaility time I live on the stage\nThat's ya stress look I want ya best look\nYa long hair, high heels, short skirt, but deep dress\nLook you gotta man so you need to kick back\nAnd you said ya really love him ain't nothin' wrong wit dat\nSo what's the deal? with the sad thing, the mad thing?\nEverytime you see a nigga you talkin' 'bout a change\nYou needa chill, relax, and be cool up on da real\nKeep ya head focused so you know what it is\nBut you been down for a minute tho you ain't da average ho\nAin't no need to lie its gon' be hard to let you go\nLets take it slow and not to fast girl this is thug world\nChocolate, and vanilla that's a hell of a swirl\nHoldin' hands up on the beach you use to love that shit\nShoppin' sprees in New york you know we stayed in a mink\nYou doin' 9-to 5, you know I do it live\nAnd when you layin down and sick that's when I come beside\nThis ain't no perfect match and it might not happen\nJust to give it to you straight I'm in love wit rappin'\nThat's all right though I'm tryna get mo\nI made my way up to the front, and out the back do'\nAnd just to let you know that I'm still the same\nWe was friends from the start it ain't gon' never change, dreamin'\n\n(Chorus till end)\n\n", "album": {"title": "Birds_Fly_South_(2002)&&3993", "genre": "Southern Hip Hop", "year": 2002}}, {"title": "Off Da Chain", "href": "Off_Da_Chain&&867", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(Talking)\nHouston, Texas, the third largest city in the U.S.A.\nWe really off the hook, we off the chain man\n\n(Lil' Keke)\nNo doubt, off the rip, ain't no telling about me\nBusting haters on a mill that like a half a ki\nI come prepared off the block, keeping one in the cham-ber\nBack from no where here comes the black lone ranger\nFrom a rookie to a star, to a certified pro\n'Cause I'm all about my dough so I'm the ceo\nWhen I turn on the corner best believe they look\n'Cause I'm platinum in the ghetto and I'm off the hook\nWhen I jump up in my ride I pack a, concealed weapon\nCause ain't, no, half, stepping\nLesson one my man, go on and do what you do\nAnd you need to get the rifle or you worried bout two\n'Cause I'm hated by many, and loved by few\nBut I kill down fry 'fore I bother you\nI'm no fire, baby I done got me a spot\nIt's the Commission rich man represented by cops\n\nI'm on fire, on fire, that's the name of the game\nThey say we off the hook but we really off the chain\nWrote a rhyme baby we can sure grind\nEast and West coast and the dirty southside\n\n(Lil' Keke)\nThey shouldn't of said ran they mouth say he can't come back\nHe took a year vacation, and he go like that\nI'm sitting swoll like that, you know I'm cold like that\nOff the hook, off the chain you know we roll like that\nI pledge allegiance to the thug society\nI grind all week and act a fool on Friday\nWe click up, dumping the trucks and do the pick up\nIn and out all these freaks just like a stick up\nWho you know, gone be ready to ball\nI'm talking bout let it go, and don't matter the price\nIt might be tailor mo', 'cause I'ma sure get mine\nAnd then do a 3-60 or get left behind\nPush dubs through the city 'cause I like to shine\nSitting tall on boys with the seats reclined\nI'm 25, really trying to live so live\nPraying to reach the top before the day I die\nH-Town, Atlanta, you love it the most\nD-Town, New Orleans represent third coast\n\n(Lil' Keke)\nDon't knock the hustle man it's all the same\nWe all greedy and hungry and want the same damn thang\nT-E-X-A-S let me really represent it\nAlways riding dirty so the windows stay tinted\nHaters frowning up nigga take that mask off\nGod damn right, I'm stunting my ass off\nHouston, is how to get that feel\nMemphis 10, Orange Mile then a trip to the Ville\nBig ups and more props to the big boy flossing\nFellas living gangsta and woke up in Austin\nI'm on a mission 'cause I love to ro'\nHit the stage on fire then the Don explode\nNo pain, no game, that's the price of fame\nGrab the mic and went off and left the place off the chain\n\n(Lil' Keke)\nStreet Port, Lafayette you know they off the chain\nMississippi, Chi-Town you know they off the chain\nAlabama, Arkansas you know they off the chain\nMiami, Terror Rate you know they off the chain\nAtlanta, Cincinnati you know they off the chain\nSt. Louis, Kansas City you know they off the chain\nH-Town, D-Town you know we off the chain\n?Cossence? Santa Tone you know they off the chain\nIt's going down, cause that's the name of the game\nMy nigga D-X got this track off the chain, off the chain\nCause that's the name of the game\nWe really off the hook man we really off the chain\n\n", "album": {"title": "Platinum_In_Da_Ghetto_(2002)&&3712", "genre": "Southern Hip Hop", "year": 2002}}, {"title": "Understand", "href": "Understand&&5250", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "Try to understand, all the shit that I've been through\nTry to understand, I got a life to live too\nTry to understand, I got problems but I feel you\nTry to understand, I'm a man I got bills too\n\n(Pretty Todd)\nI never give the devil the pleasure, to ever take a fella off of his level\nStill, everything's right on schedule\nI had my personal vendettas, but I solved em\nCause all that drama, could stop us from getting dollas\nI take advice from one, and that's my mama\nI made her a promise, my word is my honor\nCause sure enough, I'm a grown up\nJust turned 21 there's money to get, and I'm trying to get me some\nSo get your ass out my path, 'fore you get mashed\nPut a whole new career, in your new acts relapse\nWhat we have, is organized grinding\nIn a mind of real niggaz, our vision's a clear picture\nI'm still with you, you ain't lost me I hope I ain't lost you\nI just, had to get that out fool\nAnd let niggaz know, a lil' something about school\nAnd struggle in this concrete, jungle I walk through\n\n(Scooby)\nI am dog, a grown man dog\nYou don't understand, the plan at hand dog\nYou see the potential, I mash to get cake\nHustle Presidential, like a Bad Azz Mix Tape\nSay I live what I speak, so you best believe\nI grind to what's left for me, is left in these streets\nListen up man, I mean with figgas\nI don't know if it's just me, but all I see is green pictures\nAnd I don't bother, with these in between niggaz\nLoyalty is my back bone, we the team nigga\nG-R-I-T-B-O\nY-dolla sign, chump 'cause we need do'\nRespect is power, and power is money\nMoney is time, money is the reason that I rhyme and grind\nMight I remind you, that I'm designed to\nMove anything out the way, of getting what's mine fool\n\n(H.A.W.K.)\nSee the type of nigga I am, I give a good damn\nBout anything, other than fam\nJust ten years ago, when I didn't have flow\nBefore You Already Know, when I didn't have do'\nMy mom's oldest seed, I had to take the lead\nDreams of making believe, became make believe\nWe was boys but we now men, ask once then you'll ask again\nHow many times, will I have to lend\nYou on the outside, looking in\nYou don't know where I done been, do anything to get in\nI don't know how, some of you think\nBut soon as you blink, they here on the first and fifteenth\nNow see I got bills too, feel me like you I feel you\nGod damn, I got a life too\nGot a kid, and a wife too\nAnd how the hell they gon eat, if I still gotta feed you\n\n(Lil' Keke)\nFollow the vision, and we can walk the road clear\nI hustled and struggled, it was another long year\nI never had a brother, so I turned to the thugs\nNo unconditional love, 'cause we ain't the same blood\nTough guys, most y'all niggaz still bluffing\nI'm thinking while I'm puffing, I don't owe you niggaz nothing\nI'm changing my ways, I'm living my life new\nNigga get your own thang, and see what your hustle do\nI done heard it all nigga, guess I'm chasing a dream\nGot a big family to feed, and I'm the coach of that team\nIf you the shit best believe, all the flies they love it\nWhen the plan going bad, everybody say fuck it\nAnd you recognize game, when the pain is felt\nAnd it's one thang fa sho, I ain't gon lie to myself\nSo you busta ass niggaz, can't see night from day\nUnderstand black man, I got bills to pay\n\n", "album": {"title": "Wreckin%27_2004_(2004)&&1329", "genre": "Hip Hop", "year": 2004}}, {"title": "What I Wanna Do", "href": "What_I_Wanna_Do&&2391", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(Lil' Keke)\nWe had fights and arguments and all the above\nI guess that's the life that comes with true love\nSixteen, probably being too fly\nBut it's a trip girl look how ten years went by\nOn the passenger side when I drove my first car\nWith no, a.c. just praying to be a star\nWe skipped school, and move around on the double\nGo to the crib do it like a married couple\nYou a hot girl, and I wanna be your T\nWe both learned the hard way, that's how shit be\nAnd a lot of drama, and I ain't gone lie, it's cheap\nBut at the end of the day girl you still my boo\nIt wasn't ever 'bout the money or the late night grind\nCause a nigga went broke, and did it three more times\nFrom the lame game, to the fortune and fame\nYour heat still the same, ain't a damn thang changed, c'mon\n\n(Chorus: Liz - 2x)\nYou know what I wanna do\nNothing I could find\nYou know that mine and it's mine\nAin't nothing but love, and ain't a damn thang changed\n\n(Lil' Keke)\nWhen I left girl, I was coming back to get you\nIt was picture perfect, but I could paint a perfect picture\nI've been hard broke, but it's all in your mind\nI use to think about my daddy saying look in time\nCause the media, the public you know how they do it\nWe use to block 'em out the way because we so use to it\nI don't know everything, but I'ma swear I do\n'Cause I be damned if another nigga run through you\nI use to lace you up, I got you right and tight\nNiggas fly as a jet, so don't take that flight\nI ain't the one, Lil' Keke the Don, I bar none\nEverything done changed since the birth of my son\nI'm a different man, whether you see it or not\nIt's gone be hard for another dude to take my spot\nI get my cash baby, because you know it's a must\nBut the money ain't a thang, that ain't nothing on us, c'mon\n\n(Lil' Keke)\nAin't nothing in the world could take the place of you\nYou your daddy's best man, and you just turned two\nI love the way you high five and jab like defeat\nGet dressed and grab your hat cause you rolling with me\nYou turn the music up soon as we get in the truck\nAnd when I turn it down to talk to you turn it right back up\nWhen we jump out, you want the first thing you see\nAnd I can't really say nothing shit you just like me\nYou my heart, you my soul, you my pride and joy\nYou my nigga, you my ace, you my baby boy\nYou throw your dukes up homie like you ready to fight\nWith something new everyday, boy you flying your kite\nAnd you stay motivated, so I keep on strutting\nAnd I swear on my life, I wouldn't trade you for nothing\nYou the best thang happened, couldn't see it no better\nHaving anything you want, you my dog forever, c'mon\n\n(Ad-libs)\n\n", "album": {"title": "Platinum_In_Da_Ghetto_(2002)&&3712", "genre": "Southern Hip Hop", "year": 2002}}, {"title": "Birds Fly South", "href": "Birds_Fly_South&&4986", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "Southside, hot\nWestside, hot\n\n(Lil' Keke)\nOff in the Dirty Dirty, you know we do it with these\nPoetic and Don Ke, known for getting that cheese\nI'm a calculator, calculate my feddy\nIt be sixteen a bird, if your chips is ready\nWhere your cash at nigga, 'cause I stay in the mix\nNextdoor to Mexico, I get it thirteen six\nC.D.'s and L.P.'s, keep it legally true\nI'm a underground king, rest in peace to Screw\nYou know my click on the creep, with no time to sleep\nYou can hit me all night, got them thangs for cheap\nWhere them real hustlas at, where them real ballas at\nGet your grind on playa, for real and live fat\nWe legendary thugs, known for shooting slugs\nSitting in front of clubs, on brand new Dubs\nThe Escaladea, is looking good no doubt\nAnd one thang fa sho, mayn the birds fly South\n\nFrom the East to the West fa sho, that's how we does it\nSouthside for life, won't you tell me how you love it\nYou get it how you live, or you close your mouth\nAnd for the hustlas round the world, mayn the birds fly South\nFrom the East to the West fa sho, that's how we does it\nSouthside for life, won't you tell me how you love it\nYou get it how you live, or you close your mouth\nAnd there's one thang fa sho, mayn the birds fly South\n\n(Lil' Keke)\nI'm bout to touch down, headed to Oak-Town\nA fat sack of smoke, I'm ready to straight clown\nLeave the airport, headed straight to the spot\nAnd my nigga Mr. Changra, he be punching the clock\nI'm a certified G, giving all I got\nThey go South for the winter, cause the tracks is hot\nI be laying low, in the studio writing\nRemember Lil' Ke, like they did the Titans\nIt's a earthquake, from California to Texas\n22's on that thang, don't you touch that Lexus\nGotta get it baby, cause you know I'm a savage\nAnd that Fed-Ex bout to drop off, a beautiful package\nWe some independent masters, causing a disaster\nGet ghost on the FED's, like my name was Casper\nBastard fa sho, when I'm moving in route\nAnd there's one thang fa sho, mayn the birds fly South\n\n(Lil' Keke)\nCommission, Avarice, don't really get us pissed\nSell a quick hundred thousand, is first on the list\nLay it down, 'cause we just some young Hoggs\nThis for real dogs, we doing this for y'all\nI pop up the trunk, let 'em hear the funk\nSetting up the shop, got the neighborhood crunk\nWe slab riding, and everything is thick\nFrom the quarters to the halves, to the whole damn brick\nLet's get this money Pete, cause it don't matter to me\nYou can smoke a gang of hours, have a bag or tree\nWe drop hit after hit, lick after lick\nAll the real gangstas, gonna feel this shit\n\nThey fly South\n\n", "album": {"title": "Birds_Fly_South_(2002)&&3993", "genre": "Southern Hip Hop", "year": 2002}}, {"title": "I Use Rhymes", "href": "I_Use_Rhymes&&9629", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(1 Da Boy)\nI got a little trouble on my chest, right now\nMark ass niggaz, don't wanna let me go round\nWhat's wrong you mad, because I'm on feet now\nFucking around with this, will get you killed uh-huh\nNow that's gangsta, that's the only way I say it\nI say it because I mean it, and I'm meaning what I said\nY'all niggaz don't really want, trouble from me\nI catch you young pimp, and break both of your feet\nMake you sniff paint thinner, till your nose start to bleed\nAnd if you still talking shit, I'll break both of your knees\nI'm a Downtown soldier, from the hood of the 3\nWhere fake niggaz get cut, like a shirt with no sleeves\nCause that's me, pushing a big body U-V\nAnd that's me, keeping the spot H-O-T\nAnd that's me, I represent that A-V-A-R-I-C-E whooo\n\nI use rhymes my nigga, to express myself\nIt all comes to the line, when I'm by myself\nIt's do or die right now, 'cause I'm for myself\nWe slowed it when you jamming this, here by yourself\n\n(Lil' Keke)\nWhere my down South soldiers, lightening up doja\n1 Da Boy, Lil' Ke man I swear we done told you\nThe streets is dangerous, better pack your weapon\nNobody got a gun, then your click half stepping\nTexas Mafia, nobody is stopping you\nYou better slow your role, cause my killas is watching you\nHerschel Wood to the Tre, collecting pay\nHow they ride AK's, stay prepared to spray\nAnd the street sweeper, hits so deeper\nWriting bar after bar, cause the words reach you\nVerbal assassin, you know the flow be blasting\nI wanna get my bread, is all I'm asking\nRespect the G-Code, Lil' Ke so cold\nTrying to get my loot, 'cause it's right up the road\nNo time to be wasting, my bad fa sho\nLike Christopher Wallace, I love the do'\n\n(1 Da Boy)\nBe wise each nigga like me, show up\nI told them boys, that 1 Da Boy gon blow up\nBut them haters didn't like that, true that\nSell a million copies, I lay 'em over blue dat\nI ain't bringing my style, I ain't bringing my skills\nBut I got the skills, to pay my whole click bills\nNow what's the deal punk, you got beef let me know\n1 Da Boy kicking in your front, and your back do'\nI ain't no punk mark, bitch, hater or a hoe\nIf you aggravate my mind, your head slammed to the flo'\n'Cause I'm a hard hitting thug, that's about my scrill\nAlways scheming in my brain, how to make a quick mill\nNow what's the deal, I'm keeping it low but real steel\n1 Da Boy on top, of the world now do you feel\nThe hits that I spit, on this track support shit\nAvarice taking over, ain't no and, if's or misses\n\n", "album": {"title": "Street_Stories,_Volume_1_(2003)&&2649", "genre": "Southern Hip Hop", "year": 2003}}, {"title": "I'm A G", "href": "I%27m_A_G&&3783", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "I'm a G, ain't no telling what you cats might see baby\nCheck me out now, wholay...\n\n(Lil' Keke)\nYou know I'm thugged out, cause that's the way I gotta survive\nYou know I'm dubbed out, on every ride that I drive\nLet me take a moment, to introduce myself\nCause baby girl I see you want it, and I could tell you on it\nIt's the millennium, I'm trying to light up the stage\nAnd I be taking it to the max, because I wanna stay paid\nYou know the album is hot, I'm in the spots you not\nAnd if I pull a gun to shoot, then best believe you shot\n'Cause I'm a soldier a vet, with no time to sweat\nFrom the store to the deck, and checking on internet\nI be going off, girl you ain't heard about Lil' Keke\nFrom the Dirty South, he got a bad mouth\nIt ain't no thang mayn, a bunch of haters in the world\nSay it's a damn shame, but I just maintain no game\nGet your cash and mash, on your plan\nCause the G in my life, stands for gangsta my man\n\nI'm a G, it ain't no telling what you cats might see\nYou know the ladies shake it up, and it's for free\nAnd I be getting my money first, cause that's me\nNigga, and that's me nigga\n\n(Lil' Keke)\nBringing down the rap draft, 'cause I'm a first round pick\nAnd from the booth to the stage, man I love that shit\nYou know the Northside, they say they love it the most\nYou know the Southside, quick to represent for they folk\nYou know the Eastside, they putting it down for the cheddar\nAnd the Westside, you know they down for whatever\nThis another chapter, of the life after\nSelling dope on the block, but now a paid rapper\nI'm not a high capper, but I do get plex\nAm I living like a baller, then the answer is yes\nListen up nigga, I ain't tripping when I tell you I'm about my scrilla\nAnd I ain't tripping, when I tell you I'm a mad killa, but I'm a O.G\nAnd when I'm gunning niggaz running, 'cause they know me\nYou better show me, cause all that chatter don't just matter\nNigga homie, cause you gon owe me\nCause this the damn song, you playing games with my family\nYou get stepped on, so nigga get gone\nThe Southcoast's host, that you love the most\nAnd you done came this far, and you still ain't close\n\n", "album": {"title": "Birds_Fly_South_(2002)&&3993", "genre": "Southern Hip Hop", "year": 2002}}, {"title": "Gotta Be a Way", "href": "Gotta_Be_A_Way&&9739", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(*Talking*)\nHere we go, Southsive\nDirty South, Westcoast, check it what\n\nWill the heat eat me up, man I just don't know\nWill the streets beat me up, man I'm not fa sho\nWill my shop close down, nigga probably so\nBut there's gotta be a way, that I can get that do'\n\n(Lil' Keke)\nI ain't never had nothing, 'less I got it myself\nBeing broke and hungry man, yeah it's bad for your health\nI'm trying to stay out the heat, cause the sun is blazing\nGotta take it slow, I got a son I'm raising\nAin't nothing promised to you, better reach for the sky\nThat's the only limit man, time passing us by\nNow it's do or die, ain't no bowling it down\nYeah it's been a long grind, but I'm holding it down\nAin't no turning it back, so I devour\nAll I know is greed, getting money and having power\nIn this lifetime, I seen it all my man\nI'm trying to stash in the country, with some acres and land\n\n(Lil' Keke)\nIt's been a tough day, so I'ma blow my wig back\nAnd I ain't got time to bullshit man, I stay on a stack\nWhere your nuts at, you ain't shit without em\nTrying to get up to the top, 'cause I come from the bottom\nIt's a sacrifice, that we all gotta make\nGotta get your grind on, come up pounds and cakes\nI'ma get mine on, in the city or state\nI ain't trying to fall short, I'm putting meat on the plate\nI gotta feed shorty, and take care of my boo\nBe there for T. Lady, 'cause she always true\nBut I'ma hold on, everybody stand tall\nAnd just roll on, you know me and my people\nWe staying so strong, and it's like that\nSo if you hit me on the cell, I'll hit you right back\n'Fore I let you go, I gotta let you know\nWill the streets eat me up, man I don't know, what\n\n", "album": {"title": "Street_Stories,_Volume_1_(2003)&&2649", "genre": "Southern Hip Hop", "year": 2003}}, {"title": "When We Ride", "href": "When_We_Ride&&4888", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(*Talking*)\nDirty South, Houston Texas\n4 million strong, CMG, 2003 man\nThe young Don man, representing\nThis how we ride man, Southside\nNorthside, sing it...\n\n(Hook: Z-Ro)\nWhen we ride, it's for the Southside\n(It's for the Southside), it's for the Southside\nIt's for the Southside, yeah\n\n(Lil' Keke)\nThe party over here, the party up over there\nSouthside lighting up, Saturday night I swear\nTake a trip to Richmond, down to Westtown\nWhen your chick driving, I pull up behind her\nLook at the scene, look at the hoes\nLook at the Dubs look at the 3's, look at the 4's\nWe gon wild out, till we fall out\nCatch a freak get on, nigga that's no doubt\nI'm the Dirty South lover, undercover brother\nGetting my chips, don't change for nan nother\nBumping and talking, but that's okay\nHave your weapon loaded up, 'cause we coming your way, hey\n\nWhen we ride, it's for the Southside\n(It's for the Southside), it's for the Southside\nIt's for the Southside, yeah\nAnd we get high, with the Northside\n(With the Northside), with the Northside yeah\nWith the Northside, yeah\n\n(Z-Ro)\nWhen we ride, it's for the South and for the Northside\nBoppers bopping when they see us, they open they mouth wide\nWe them goodfellas, running the city block to block\nHerschelwood to Havistock, Vetapen to Scot\nIt don't stop, we get blowed all day long\nBrothers got two or three Nextels, steady using a pay phone\nCause them people, be tapping into our conversations\nIf they catch us with that herb, we facing incarceration\nIf it's on the low, I love the sound of that\nPlus if it's headbanger, I'ma sco' a pound of that\nZ-Ro the phenomenon, and Lil' Keke the Don\nS.U.C. smoking on cabbage, from dusk till dawn\nThat's for the sets my friend, it's no plex again\nWe all united in my city, like we all Mexicans\nWe all about our bread, candy blue or the red\nForever dangerous we bust heads, our city is FED ha\n\n(Lil' Keke)\nGlock 9, y'all niggaz gon make me pop mine\nBack up lil' daddy, ain't no way you could stop mine\nDrop mine, at the drop of a dime\nOpen up your ear, I'ma drop another line\nIt's bout time, now the road is clear\nGot the tinted up Range, rolling up in the rear\nWe bout six or seven deep, when we pull from the mansion\nHere come big 2, crawling up Avalanching\nBig T, watching out no slipping\nCock the hammer back, if they breathe start tripping\nCMG fall off, nigga it's no never\nCall your boys call your click, we down for whatever\nSuit yourself mayn, but we roll leather\nAir Force 1's, throwbacks in this weather\nH-Town, and it ain't nothing but love\nI get high with the North, say what's up Slim Thug\n\n(*Talking*)\nSouthside yeah, Northside\nThis how we ride man, this how we roll man\nYeah what, CMG nigga, 2000 and 3\nI'ma try and look at you, a little bit out here\nYou understand, check it what\n\n", "album": {"title": "It_Was_All_A_Dream_(1999)&&8844", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Love and Understood", "href": "Love_And_Understood&&2221", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(Billy Cook)\nWhoa-ooh-ooh-ooh\nIt's aaaaaall goooood, yeah\n\n(Hook: Billy Cook)\nThe loving is understood\nBut I never thought, it would feel this good\nThe loving is understood\nBut I never thought, it would feel this good\nBut I never thought, it would feel this good\n\n(Lil' Keke)\nYou've been hoping and wishing and waiting, for so long\nOur love affair is finished, forgotten baby it's gone\nWe've been seeing eachother, I swear for some time\nI told you everything, but you think that I'm still lying\nMy woman my kids my money, it's all there\nMy cards on the table, off jump it's in the air\nYou jazzy you thoed, that's cool it's all good\nBut keep it in your mind, that the loving is understood\nNow how many thugs you know, that go hard\nSexuality, is whatever and don't bar\nSo get your slabs tight, while I get the raps right\nI'll let you know tonight, while I'm sitting on the flight\nMe and you together, now how long will it last\n'Cause I be making major moves, when it comes to my cash\nYou get your heart right, girl you know that you should\nAnd I know you never thought, that it would feel this good\n\n(Hook: Billy Cook)\n\n(Lil' Keke)\nThree in the morning we going hard, nonstop\nI work it and hit it, I'm trying to sho hit the spot\nI let you get on top, so I can rest my back\nYou doing everything I want, I know you like it like that\nBut when you wake up to go to work, you know I'm gon fa sho\nDon't mean to treat you like a hoe, but I got places to go\nOver here right there, you catching me everywhere\nRiding with pretty women, with beautiful long hair\nLet your next move be your best move, that's cool\nThe loving understood, but I'm still a damn fool\nWith the D to the O the N, you can't win\nYour homie your lover your nigga, and your best friend\nDaytime night time, it's the right time\nGirl you looking fine, you got something on your mind\nSince school days, talking back in the hood\nAnd I know you never thought, that it would feel this good\n\n(Hook: Billy Cook)\n\n(Lil' Keke)\nLook at us now, a whole year passed by\nCan't believe girl, that you still looking fly\nAs you can see, I'm still locked in the game\nWent from one mill to two mill, and five and change\nEverything's all right, I got my nigga sitting tight\nMy family living good, just enjoying they life\nBack to you suga, you know the lecture at hand\nA little time done passed, but I'm still your man\nHop in the backdo', I'm a mack though take it slow\nLet's lay it on the line, put it down on the flo'\nTest for test chest for chest, you give it all you got girl\nNothing mo', nothing less\nI love the way you love to love, a young G\nYou know I'm living wrong, but you got feelings for me\nYou gon keep yourself up forever, that's understood\nBut I know you never thought, that it would feel this good\n\n(Hook: Billy Cook)\n\n(Billy Cook)\nI'm talking 'bout the loving, yeah-eeeah\nI'm talking 'bout the loving, because it's all good\nThe loving, the loving, the loving, the loving\nThe loving, yeah\n\n", "album": {"title": "Birds_Fly_South_(2002)&&3993", "genre": "Southern Hip Hop", "year": 2002}}, {"title": "Do You Love It", "href": "Do_You_Love_It&&3557", "artist": {"unique_name": "Lil%27_Keke"}, "lyrics": "(Lil'Keke)\n\nYa love this, ya love that\nYa love this, ya love that\nYa love this, ya love that\nYa love this, ya love that\n\nAlrite just listen up\nAnd let me break it down\nThrough Missi, Tenni, Alanta\nGeorgia, and back to H-Town\nWe still be running thangs\nTryin' to get it for cheddar\nBaby, ain't nuttin changed\nLivin' this life for real\nMan, we top the game\nAnd I ain't never give up\nCause after this I'm just stuck\nTalkin' shit outta luck\n'Cause I'm lovin' this thang\nLivin' it up, Givin' it back\nI'm feeling ??\nLike a pimp in a lac\nI got so many friends\nMy ain't a shit it even funny\nLord, how people change\nWhen a man get some money\nI stay payin' dues\nOn my P's and Q's\nAnd regardless to what they say\nI'm leavin' suckas confused\nNow let me recollect\nTake a minute to breathe\nAnd put the mic in check\nI got some love for real\nBut ain't no disrespect\nBut on the cool, I be flippin\nFollowed by some gangsta ass\nNiggas that be trippin'\nI be breakin bread\nInstead of splittin wheels\nBut ain't no tellin'\nWhat I do, when I see my kids\nSo I stay holdin' on\nInstead of sittin' back\nI don't retreat out from the street\nNow do you love that?\n\nNow do you love it?\nLivin' how you suppose to live\nBank accounts, plenty of cash\nWith some beautiful kids\nNow do you love it?\nBein where you love to be\nThey say, Money ain't a thang\nBaby, It's all on me\nNow do you love it?\nFeelin' how you like to feel\nEverythang is lookin' good\nMan this life is real\nNow do you love it?\nHow much you love that?\nHow much you love this?\nHow much you love that?\nNow do you love it?\n\nTakin' family trips on ships\nEatin that good food\nLeavin' hundred doller tips\nAin't that the life man?\nYou got it all in your hand\nSwimmin pools, jacuzzis\nBlue water, and white sand\nI stay goin' hard\nPut the cash in the bank\nI got the platinum card\nNow it's ATM and checks\nPlus the straight charge\nAnd ain't no sense in me lying\nWe livin' so large\nWe livin' LARGE\nI gotta go get a dog\nIf I wanna live phat\nLike Mr. Boss Hogg\nI could style and fall\nBut I'm gonna ball y'all\nBecause it gots to get better\nGrippin and fittin tight\nLike a Iceberg sweater\nIt's a new raise\nA new day, a new era\nHolding onto the world\nLike a brand new Beretta\nNow I'm bustin' shots\nI'm talkin' bout lyric for lyric\nMakin' the club bop\nYou better get it together\n\nNow do you love it?\nLivin' how you suppose to live\nBank accounts, plenty of cash\nWith some beautiful kids\nNow do you love it?\nBein where you love to be\nThey say, Money ain't a thang\nBaby, It's all on me\nNow do you love it?\nFeelin' how you like to feel\nEverythang is lookin' good\nMan this life is real\nNow do you love it?\nHow much you love that?\nHow much you love this?\nHow much you love that?\n\nI know ya love this\nI know ya love that\nI know ya love this\nI know ya love that\nHow much ya love the mass\nHow much ya love the cash\nHow much ya love ya name\nHow much ya love the fame\nHow much ya love it?\n(Till fade)\n\n", "album": {"title": "Platinum_In_Da_Ghetto_(2002)&&3712", "genre": "Southern Hip Hop", "year": 2002}}]