[{"title": "U Can't C Me", "href": "U_Can%27t_C_Me&&9240", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Open your eyes, open your eyes\nYou can't see me\nOpen your eyes, open your eyes\nYou can't see me\nOpen your eyes, open your eyes\nYou can't see me\nOpen your eyes, open your eyes\nYou can't see me\nOpen your eyes, open your eyes\nYou can't see me\nOpen your eyes, open your eyes\nYou can't see me\nOpen your eyes, open your eyes\nYou can't see me\nPeek a boo (peek a boo)\nI see you\n\nI walk into the darkness, if you see me say what's up\nLil' Rob can you rock the mic? All fucking night\nWhat kind of question's that? Homeboy who the fuck you think I am?\nLil' Rob, Chicano, M-E-X-I-C-A-N\nI be the baddest, and I put that on everything I love\nThe hairs on my chinny-chin-chin, my girlfriend, and my bombay chin, and my yesca\nTu familia, primera, la colo&#241;a es mi guerra\nHomegirl just like luggage\nFuck it, stuck with a steelo that you feel though\nOnce it's gotta be true, but it's for real though just like me though\nSee no, hear no, speak no evil\nYou can add it, divide it, subtract and multiply it, there is no equal\nPeople open you eyes, quit looking at the world through a peep-hole\nI'm here, the one you need, the one you hear\nWhat's the matter matter? Can't you see?\nOh I forgot ese you can't see me\nPonle\n\nMira me, mira me\nI'm over here\nMira me, mira me\nI'm over here\nMira me, mira me\nI disappear\nPeek a boo (peek a boo)\nI see you\n\nYou can't see me but I see you\nI see you in the ICU\nBe nice to me and I'll be nice to you\nBut if you got a problem, fuck it\nIt's not the first time or the last time that I've pulled a fast crime\nI pass time, mastermind disaster times all the time\nAfter time you will find it's my way or the highway\nThere's no way it's your way, spit a piece of wood and I'll be there\nIf it's stone then you'll find me, it's over like 1999 be\nMeet me at the crossroads, I'll be chilling by the tree\nDrinking lemonade up in the shade with your family\nLook at your boy, ain't he just the cutest little kid?\nOops, kicked over the fucking crib and got blood up on his bib\nI can do what I want, got you mind wrapped up in confusion\nYou cry like the llorona, shut up it was just an illusion\nSeeing how bad you are, you're not as bad as you claim to be\nYou can't see me, peek a boo (peek a boo), I see you\n\nI love to sin, if I didn't sin I'd have no fun, what fun is that\nWent to church and had no fun so I claim I'm done with that\nNot like that, I don't mean to disrespect no one\nBut if you feel disrespected, fuck you, my life goes on\nWay beyond what your eyes can see\nBeyond what you're imagining\nWhere all the little birds sing\nAnd you love what's happening\nI just chill, I don't spill the wine or drop a dime\nI'll take care of all my enemies, homey it's all in time\nI'm invisible, invinsible, trick you with my visual\nLeave you all miserable, mystical rituals\nBeautiful paybacks, if you were smart you'd stay back\nWay back, on the other side of the train-tracks\nMy imagination gives hallucinations through more situations\nTurn a flicker to a flame, it's insane\nIf you mean that homeboy that you still can't see\nOpen your fucking eyes vato, you can't see me\n\nI'm over here\nI'm over here\nI disappear\nI'm over here\nI'm over here\nI disappear\n\n", "album": {"title": "Still_Smokin%27_(2000)&&4953", "genre": "Hip Hop", "year": 2000}}, {"title": "School Days", "href": "School_Days&&2859", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Up in tha morning and out to school, the teacher is teaching the golden rule\nAmerican history, practical math, studying hard hoping to pass, working your\nFingers right down to the bone, and the guy behind you won't live you alone,\n\"Ring ring\" goes the bell, their cooking the lunches ready to sell, you're\nLucky if you can find a seat, fortunate if you have time to eat, back in the\nClass room open you're books, keep with the teacher you don't know how mean she\nLooks as soon as 3:00 rolls around, you finally lay your burdon down, close up\nYour books get out of your seat, down the halls and into the street, up to the\nCorner around the bend, ride to the juke joint, you go in,\n\n(Chorus) 2 times\nDrop the coin right into the slot, you gotta hear something that's really\nHot, with the one you love, you'll make it romance, all day long you've been\nWanting to dance feelin' the music from head to toe, round and round and round we\nGo\n\n\nHail, Hail rock 'n' roll, deliver me from these days of cold, long live rock n'\nRoll, the beat of the drums loud and gold, rock, rock, rock 'n' roll, the\nFeeling is there, body and soul\n\n", "album": {"title": "The_Album_(2002)&&1990", "genre": "Hip Hop", "year": 2002}}, {"title": "Skit", "href": "Skit&&7540", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "It was cool talking about the school dayz. Now let me do things my way Lil Rob\nStyle this one's called Street Dayz.\n\n", "album": {"title": "The_Album_(2002)&&1990", "genre": "Hip Hop", "year": 2002}}, {"title": "Street Dayz", "href": "Street_Dayz&&9078", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Up in the morning I start with a joint...\nI'm loading my quete with hollow points...\nThis vato says he's coming for me...\nU fucking pussy ill believe when I see...\nAye why do you act like your bad 2 the bone...\nWhen you that your not so just leave it alone...\nRata's run and tell...\nDrugdealers on corners ready 2 sell...\nAye ill take a sack if it got's no seed's...\nNot 2 worry this vato gots bomb ass weed...\nNever in classrooms never in books ...\nHe was out in the calles running from crooks...\nAs soon as night time rolls around...\nI finally laid the bomba down...\nRun into the pad grab something 2 drink...\nIn the troka into the street...\nUp 2 the corner around the bin...\nAnd tell my ruka 2 jump in...\nPut the 4'5 into the box ...\nI gotta hear something that's really hot...\nBut the one I love I'm making romance ...\nIts guarantee that I get in her pants...\nI know its sounds wrong but those were the ways...\nTalking 'bout'em street days...\nRemember when I used 2 kick back with the hommies drink some beers right down\nThe street...\nSmoke another toque, must of smoked about a pound of weed\nTalking about my street days, and all my street ways, keeping it hot like heat\nWaves, listening 2 the guitar that he plays, watching out for 5'0s' on the\nCorners drinking like wino's, there's nothing I would change about my street\nDays...\nPut the 4'5 into the box...\nI gotta hear something that's really hot...\nBut the one I love I'm making romance ...\nIts guarantee that I get in her pants...\nKissing her body from head 2 toes ...\nRound and round and round we go...\nLil'Rob in control...\nDelievering from the days ???..\nControl amos...\nDelievering from the days ???..\nLil'Rob got the roll...\nThe feeling is there body and soul...\nYa 'stuvo...\n\n", "album": {"title": "The_Album_(2002)&&1990", "genre": "Hip Hop", "year": 2002}}, {"title": "No Future In It", "href": "No_Future_In_It&&9294", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Lil Rob, yeah\nIt's kinda fucked up man\nAll these kids wanna be grown up\n\"Gangsta Gangsta\" and all that kinda shit\nYeah I'll be honest wit'chu eh\nYou smoke marihuana dawg but that's about it\nIt's better to cut loose eh y'know?\n\n(Lil Rob)\nChamaco's on the calle livin' la vida loca\nEleven years old, experimenting with drogas\nSmoke a little weed, snort a little coca\nI'll just try it one time homey to see que onda\nIt's so addictive and they get so addicted\nBecomes a habit they gotta have it and they can't kick it\nThere's nothin' funny about bein a druggie\nI know a lot of people fucked up, became a junkie\nUsed to dress clean started lookin' kinda bummy\nTrue what they say you can learn a lot from a dummy\nYou get wrapped up in it, like a mummy\nNext thing you know you're in your hefa'a purse stealin her money\nAnd you got it so bad, if you ain't got it you go mad\nWon't stop until you get a toetag\nSomebody please, gimme just a minute homey\nTo let them know that there ain't no future in it homey\n\n(Chorus: Lil Rob)\nWe like to get all fucked up y'know, homes?\n{\"There ain't no future in it homey\"}\nWe do drugs till we're all sucked up y'know, homes?\n{\"There ain't no future in it homey\"}\nI smoke weed cause it grows from a seed but that other shit\n{\"There ain't, no future, in it\"}\nCauae if it makes you scratched and bleed, twitch and shit\n{\"Homey I ain't fuckin' with it\"}\n\n(Lil Rob)\nHey homes just like Mrs. Jones, we both know\nThat it's wrong but it's much too strong to let it go\nSome do, some don't, the ones that don't are fucked\nAlways end up stuck in a rut\nIn love with the drug, do sick shit for a fix\nToo many good people ended up in that mix\nThey scratch and they twitch, they stand and they sit\nBut they can't sit still, the drug's the chill pill\nThey do what they do, and I'll let 'em be\nCause in reality they ain't botherin me\nEven though it's kinda fucked up to see\nI can only feel lucky, that that isn't me\nBut you know it coulda easily been\nIt's not like it wasn't around all over the town\nPeople lookin' for the drogas, their head in the ground\nAnother overdose, another body was found\n\n(Lil Rob)\nI don't have to prove to you what I been through\nJust lettin you know I seen and what I been into\nWe'd go out, we'd stay late till the day breaks\nWe'd be in Cisco drinkin' and huffin spraypaint\nSparkin it up, pointin the spray plate\nGettin' fucked up till we can't see straight\nHit the calles to go start some havoc\nAnd go gangbangin in my homeboy's Maverick\nI remember, bumpin some ace fly\nMy cuete's loaded and so am I\nAnd you could tell by the look in my eyes\nThat I ain't givin' a fuck homeboy, we live to die\nBut that was just the thing to do at the time\nGet together, get high, and go pull some crimes\nBut the truth is, you've got a fucked up mentality\nBet, you're gonna get a fucked up reality, check\n\n", "album": {"title": "Twelve_Eighteen,_Part_1_(2005)&&2758", "genre": "Hip Hop", "year": 2005}}, {"title": "Representing", "href": "Representing&&1560", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Yeah what's happenin' - wussup homes?\nYeah, it's ese Lil Rob\nRepresentin where I'm from homes\nSan Diego, C.A.\nThat's right... c'mon\n\n(Lil Rob)\nI'm representin where I'm from San Diego, C.A.\nWith my nine treys, vatos that duck the sunrays\nPut 18 on my sleeves, eighty-five degrees\nWith the coastal breeze and got my cuete close to me\nI park my ride, and jump outside\nRoll up a joint, light it up and get high\n'Cause we get lit, bet on pits to get rich\nThey lock jaw, we stand by with break sticks\nI walk through obstacles you might, find impossible\nUnstoppable and lots of flavor like a popsicle\nBrought up in the barrio, medicine man\nLike {?} Caminos from one ol' vato\nThe big bad Cali fast land where it's sango weed\nSmoke the grass and I don't mean the lawn\nI mean the bomb chron', only the best\nFilled up my chest with the mota from the Southwest\n\n(Chorus 2X: Lil Rob w/ ad libs)\nRepresentin where I'm from - where I'm from\nSan Diego, C.A. - all day\nReady or not here I come - here I come\nSo you vatos best stay out of my way - make way\n\n(Lil Rob)\nI always try to stay crisp and clean\nKeep my lowriders lookin' mean\nHomeboy you can read it on my sleeves\nIt say Lil Rob also known as Mr. 1218\nEy let me at 'em let me get 'em hit 'em with a verse\nLet me hit 'em with the truth homes cause that's where it hurts\nI tuck the crossbars under the skirt\nYou think I'm fuckin' bad homeboy it's gonna get worse\nStill givin' neighborhood parties, tumble between the chain link gates\nHit the keg, grab the mic and celebrate\nUno dos, uno dos, mic check one two\nSick like that hour in Tijuana, I'm sick like the flu\nTilt the brown bag, at the same time throw up the brown rag\nIn a brown rag, let it down and let the back drag\nUntil the back alley, {?} la pare\nIt's a little rough por chroma los, homey {?}\nBien {?}, peros construct like a {?}\nAnd when I bust, I bust my pistolero\nToo much of a rush, I don't mean like a tecato\nHeavy gato, Lil Rob's a sick vato\n\n(Lil Rob)\nI love palmetas, que onda Linda, son grisa\nWhen it comes to sex I'm triple X like my camisa\nWhassup mija? Como te llamas?\nMake her hot like a blunt, try lay her down on the calmate\nVollada, nothin' like a fine Me-xi-cana\nShakin {?}, somebody open the ventana\nMira, it's la vida makin' mojidas\n{?}, See you when I see ya\nI'm all for comin' in often, runnin' trippin'\nThe six-three Impala felt like coppin somethin' you popped\nOff at the mouth but you ain't poppin' nothin'\nWhy the fuck you vatos wanna be startin somethin'?\nI'm loco, I'm goin' psycho, but I can't let the mic go\nI can't let the mic go whoa, that was a typo\nSounds tight though homey done spit it again\nI'm in it to win, the reason why I did it again\nI'm representin\n\n", "album": {"title": "Twelve_Eighteen,_Part_1_(2005)&&2758", "genre": "Hip Hop", "year": 2005}}, {"title": "Still Smokin' (Supermix, Part 1)", "href": "Still_Smokin%27_(Supermix,_Part_1)&&6527", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "(Lil' Rob)\nThis is dedicated to the 6-1-9\nThese are the vatos that been, but now it's my time\nTo kick the beat's, move suavecito\nTo all you fine chicana's, Lil' Rob is doing?\nBumping the oldies, It's me Lil<i> Rob\nAnd the Brown Crowd homies, turn up the volume\nYeah, Natural High, a ?? for my friends\nAnd Lil' Rob will cry for la raza\nBecause we killin' off each other, it's sad\nBOOM, there goes another, but we don't need that\nBecause tonight it our night, it's the Brown Crowd night\nAnd everything will be all right\nSo get up, go out, and do the brown thing\nLet's cruise, no need to gangbang\nSo get ready, dress to impress\nBecause you got to make this start your very best\nNot just another night on the town\nIt doesn't brown ?? Chicano, were proud and be brown\nTonight were crusin' in your lowrider\nLet down the back and put the front a little higher\nAnd now your rollin' TJ ?? just be yourself holmes\nNo need to be fake because everybody out here\nIs havin' a good time, Oh what a night... Oh what a night\n\n(Lil' Rob)\nSup ese\nWhat's up ese... what you know me man?\nSimon I'm your best homey and you don't even know me\n\nThis vato came up and said \"hey what's up holmes\"\nI said \"you know me?\" he said \"simon I'm your best homie\nYou were born in September of 1975\nYou're already 20 I'm the reason why you're still alive\nI watch everything you do I've seen everything you've done\nI kept you out of jail because I told you when to run\nYou packed a gun at the age of 13\"\nThis vato knows everything about me but this guy I've never seen\nSo I said \"what you mean?\" and he said \"follow me\"\nI'm going crazy that's exactly what it's gotta be\nHe said \"let's fly\" so we took to the sky\nHe said \"stop, look and listen pay attention\nNow if you have a question then ask\"\nOh by the way where you takin' me?\nHe said \"stop, look and listen and you will see\"\n\nListen hear what I'm saying\nListen hear what I'm saying\n\n1-What's up\n2-I think I saw him standing over there just a minute ago\n1-Who?\n2-Lil</i> Rob, he's pretty bad on the mic you know?\n\nLil' Rob...\nLil' Rob...\nIt's the Wicked wicked\n\nPuto's slip and trip\nI'll rip them open from the heart to the brain\nI'm already insane, and I won't change\nYou can't stop this, so stop this nonsense\nPeople got this, because they want this\nSo watch above this\nLittle cholo, oh no\nLil' Rob comin' with mi stilo\nMy lyrics are like a bullet, out of a cuete\nIt's time to reload (an reload)\nAnd make sure I never run out of ammunition\nUntil I finish my mission, fix it\nAll the mistakes that these puto's make\nGo and grow up, shuttin' door's in your face\nSo that you can't blow up\nYou know who your\n\n", "album": {"title": "Still_Smokin%27_(2000)&&4953", "genre": "Hip Hop", "year": 2000}}, {"title": "Superbad", "href": "Superbad&&5959", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "(Lil Rob)\nMy bad (my bad) my bad (my bad)\nI turned a good girl to superbad...\nThis pretty young thing's a freak\nI know you're mad but that's just too bad, c'mon\n\n(Chorus: Lil Rob) + (Girl)\nAnd if you're down tonight, I know that I can make you feel all right\nTriple X rated baby that's what I'm like, loosen up don't be so uptight\n(Baby I'm down to ride - all night - with or without the lights)\n(Cause you, know just what I like - so I'll be superbad girl tonight)\n\n(Lil Rob)\nI never really been the kind of guy\nTo get up and go hit the club\nBut I was, scrapin by and I was high\nThought to myself I said what the fuck (hey what the fuck)\n(Let me see what's happenin') I walked in with an evil grin\nProceded walkin' over to the bar and there you are (and there you are)\nI had to ask who you were\nWhere you been, then look you up and down again\nLet's get the fuck out baby and, take your friend (let's go)\nI'm a gentlemen, but I get triple X tambien\nI get, sick with it love it and I can't pretend\nWhen I'm up into ya hopin it never ends\nI, don't want to brag, I don't mean to boast\nBut I'm one bad homeboy from the West cooooooooooast\nThere ain't no stoppin' your ass, whoa\nLater on I'll be up in that ass, ho!\n\n(Lil Rob)\nMy bad (my bad) my bad (my bad)\nI turned a good girl to superbad...\nYeah, I know I'm fast I'd hate to waste yo' time\nI'm not tryin' to fall in love, not tryin' to make you mine (hell naw)\nI just think that we can have some fun\nI really want to go and I really want you to come\n(Don't you want to come with me?)\nWhat do you say, don't you like to play?\nIf so, then we can play until the break of day (oh yeah)\nYou look so good, good enough to eat\nI bet you taste so sweet, excuse me I'm just a freak (fo' sho')\nAnd I don't mean no disrespect\nI just really wanna kiss and lick your neck (mm-hmm)\nSend chills up and down your spine\nI can't help myself baby you're just way too fine (uh-huh)\nWhat'chu expect, some kind of pickup lines?\nHelllll no, I just wanna blow your mind (blow your mind)\nCut to the chase, get straight to the point\nLet's escape this place, let me get naughty wit'cha body c'mon\n\n(Lil Rob)\nGirl you gonna tell your mom and dad\nYou went from good girl to superbad? (Don't tell 'em)\nIt all started with a one night stand\nI gave the best sex you've ever had (and now you're superbad)\nIt got hot, you ripped off your clothes\nFollowed me over to the bed (she followed me)\nHit me, just like Mary J\nAnd baby went straight to my head (yes she did)\nShe was, soakin wet and drippin with sweat\nAnd I was, givin' her somethin' that she won't forget\nShe went home with me, somethin' she won't regret\nSex so good it should come with a cigarette (he-heh, yeah)\nThree hours in, baby doll's a 10\nSo I had to lick her up and down again\nShe said your ride have been more than a ride\nHere's my number if you're down for tomorrow night, all right\n\n(Lil Rob: repeat 4X)\nMy bad (my bad) my bad (my bad)\nI turned a good girl to superbad...\n\n", "album": {"title": "Twelve_Eighteen,_Part_1_(2005)&&2758", "genre": "Hip Hop", "year": 2005}}, {"title": "I'm Still Riding Like That", "href": "I%27m_Still_Riding_Like_That&&6502", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Ese Lil Rob's back in the clean black Cadillac\nHittin' the fronts and the back see I'm still ridin' like that\nEse Lil Rob's back in the clean black Cadillac\nHittin' the fronts and the back see I'm still ridin' like that\n\nThis shit is easy it comes natural to me\nBut that's no reason for you to be an asshole to me\nJust because I'm that vato that be bangin' on beats\nI don't wear no jewelry that shit's too fancy for me\nI just wear my t-shirt with my Davis' on\nI'm drinkin' beer even when the Charger game isn't on\nI'm a kick back type vato but they got me on the go go\nEnough to drive me loco, loco in the coco\nLoco in my low-low, scrapin' 'cause it's so low\nHyna's wanna go low meet me at the holo\nWe party like the raza do, don't know what else to do\nDealt with you too many times the first time that I dealt with you\nMore bounce than a trampoline\nBut I stay creased and clean\nHomeboy said I couldn't rap, hasn't hurt me recently\nVato wants a piece of me I'm the one he just can't see\nMake him wish he never did 'cause it's too embarrassing\n\nEse Lil Rob's back in the clean black Cadillac\nHittin' the fronts and the back see I'm still ridin' like that\nEse Lil Rob's back in the clean black Cadillac\nHittin' the fronts and the back see I'm still ridin' like that\n\nLil Rob gots skills now tell me how it feels now\nI'ma blow the fuck up, fucker it's for reals now\nTired of the bullshit, how long can I do this?\nI been bustin' raps since I was 16 with the bullet\nAnd the truth is, I've already done what you did\nBut I'm done acting young, dumb and fuckin' stupid\nPeople talk, can't stop the talk, so I deal with it\nThey're still wicked mad 'cause I got a meal ticket\nReal with it, you don't get real with it\nBut you got skills with it\nFlows so cold when you hear it you get the chills with it\nReal wicked, you don't believe me take a real listen\nLaughin' at them foo's that're disisn'\nOn a mission, mission impossible\nImpossible for me to fall down to where your level is\nLike dogs they think like lil kids\nPaid my dues, paid my debt, silence is kept just like respect\nWhat you expect from this vato?\nI'm bangin' quatros\n\nEse Lil Rob's back in the clean black Cadillac\nHittin' the fronts and the back see I'm still ridin' like that\nEse Lil Rob's back in the clean black Cadillac\nHittin' the fronts and the back see I'm still ridin' like that\n\nStop at St. Marco's for some tacos and some nachos\nI got it it's on me, ey whatchu want holmes?\nMy raps are poppin' homeboy like my glock goes\nGot my people yellin' gritos like my block goes\nHomie hookin' up shows so I rocked those\nPeople didn't believe so I shocked those\nWhere'd all these people come from?\nThey're from the barrio\nHere to represent their lil homeboy on the radio\nQue onda holmes, writin' lyrics when I'm home alone\nRoll a leno I'll get stoned alone\nEse Lil Rob's back in the clean black Cadillac with lots of chrome\nAnd the chrome microphone\n\n", "album": {"title": "Neighborhood_Music_(2004)&&4954", "genre": "Hip Hop", "year": 2004}}, {"title": "Playground", "href": "Playground&&2548", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "(16 second instrumental to open)\n\n(Lil Rob - almost whispering)\nGirl I just wanna conversate\nYou're leavin' wit'cha friends, yeah well they can wait\nThey look cool but I'm into you\nYou look like you're into me too\nYou can do what you do\nLeave with them or stay with me and break some rules\n(Let's break some rules)\nC'mon girl, you're old enough to choose\nWhat's it gonna be, your friends or me?\n(Is it gonna be your friends or me?)\nSee we can have a lot of fun\nWith them the night's over with me the night's just begun\nFinish up that Coke and rum\nI wanna lick you up with my magic tongue\nI saw you, I said she's the one\nHopin you saw me and said he's the one\nFuck it, let's get the fuck on\nBack to the pad and get our fuck on\n\n(Chorus One: Lil Rob)\nWe can have a lot of fun, between the sheets\nLet me get naughty wit'cha body come lay next, to me\nAnd we can share a night of ecstasy, oh how the sex would be\nNow lay back and leave the rest, to me\n\n(Chorus Two: Lil Rob)\nWe can head back to the pad if you want to\nIf you want me just as bad as I want you\nI just wanna show you how it goes down in my playground (playground)\nYou can act as bad as you want to (as bad as you want to)\nGo ahead and scream, I won't stop you\nI just wanna show you how it goes down in my playground\n\n(Lil Rob - almost whispering)\nI lay you down on the cama\nWhen I hit it, I hit it con ganas{?}\nYour eyes look like you're in a trance-ah\nI make your body twitch when I lick your pants-ah\nMake your body shake when I go down lower\nHow much can you take girl before it's over\nSexy how you scream and giggle\nHave you back that ass up with a little wiggle\nOoh girl, you turn me on\nKick your panties off but keep your heels on (keep your heels on)\nForeplay will keep you smilin'\nKeep you wet so I can slide right in\nYou're better than I imagined\nNow turn around and arch your back end\nNo more than physical attraction\nSatisfaction guaranteed with no attachments\n\n(Chorus One) + (Chorus Two)\n\n(Lil Rob - almost whispering)\nWe met deep in the ci-ty, now we're deep in the sheets\nThere's no bet-ter feelin' than when our bo-dies meet\n{?}Parive pavajo{?}, we rocked and we rolled\nComo, dos animales fuckin' out of control\n\n(18 seconds of instrumental)\n\n(Chorus One) + (Chorus Two)\n\n", "album": {"title": "Twelve_Eighteen,_Part_1_(2005)&&2758", "genre": "Hip Hop", "year": 2005}}, {"title": "Can't Keep a Good Man Down", "href": "Can%27t_Keep_A_Good_Man_Down&&6633", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Yeah\nIt's your homeboy Lil' Rob\nIt was once said that you can't keep a good man down\nThat's why I'm back\nSimon\nThat's right\n\nL-I-L R-O-B, remember me, it's me\nThat vato hardcore on your memory\nTemporarily had a commission, now my mission is to keep you wishing\nThat I was gone, what's wrong?\nFear what you know, loco with the flow\nAnd if you didn't know, now you know, oh no\nPelon, chingon, cholo, solo\nAlways rolling in my lowrider ese, how low? As low as it goes\nClothes always creased, dressed up nice and neat\nAlways fucking up my beats and always fucking up my sheets\nTake a seat and learn that I just can't be burned\nThough I'll burn you like a lenio, you can't fuck with me, mental\nEso mero, you better believe it homey\nThey'll be bumping my shit in forty years just like an oldie\nListen over here, over there, what's that sound?\nLil' Rob, can't keep a good man down\n\nListen over here, over there, what's that sound?\nLil' Rob, can't keep a good man down\nListen over here, over there, what's that sound?\nLil' Rob, can't keep a good man down\nListen over here, over there, what's that sound?\nLil' Rob, can't keep a good man down\nListen over here, over there, what's that sound?\nLil' Rob\n\nWhat's up ese\nIt's your homeboy Lil' Rob coming back at you\nLetting you vatos know they can't keep a good man down\nThose who know don't talk and those who talk don't know\nSo remember that shit the next time you're questioned ese\nOrale\n\nThe world is my stage, got you trapped like a cage\nAct your age not your shoe size, where the fucks the truth lie?\nYou act like a shoo-fly, but don't bother me\nYou claim that you're the bomba, but no to me\nIt's a shock to me you'd even want to talk to me, the one you can not see\nTrying to find out everything like Barneby\nChismosa, that's what you are to me\nThey say keep your enemies close but I want you far from me\nFarther than the eye can see like in another galaxy\nLike where another planet be, anywhere but next to me\nLil' Rob got some new shit and I know you won't like it\nLil' Rob got some new shit and I hope you don't like it\nPonle\n\nWhy must it be like this\nP-L-A-Y at your own risk\nYou better stop what you're doing like a breaker when he poses\nBreak your ass like noses\nBetter take the time to smell the roses\nI swear it's magic how I have it, better grab it\nI know the gato's in the bag because I bagged it\nI sell so much shit right off the shelf, homey just relax\nIt's your homeboy Lil' Rob, ese I'll be back\nSmoke another sack and make another track to make my feria stack\nThey only push me forward when they think they set me back\nEven fools that don't know me wanna get me back\nImagine that, even if I'm not wanting it homey I'm having that\nStill live on my Natural High, wickie wicked slick the sly\nFuck it up regularly, ain't nobody better than me\nListen over here, over there, what's that sound?\nLil' Rob, can't keep a good man down\n\n", "album": {"title": "Can%27t_Keep_A_Good_Man_Down_(2001)&&5534", "genre": "Hip Hop", "year": 2001}}, {"title": "Outro", "href": "Outro&&790", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "I wanna know who has the lasts laughs now,\nHa ha ha I do!\n\n", "album": {"title": "High_Till_I_Die_(2000)&&3411", "genre": "Hip Hop", "year": 2000}}, {"title": "Back in the Streets", "href": "Back_In_The_Streets&&9990", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "(Lil Rob)\n{\"I'm back in the streets\"}\nYeah, yeah I'm back in the streets man\n{\"And every girrrrrrrl that I meet\"}\nAnd every girl that I meet\n{\"They ask the same question\"}\nThey're always askin me the same thing\n{\"And I tell them everytiiiiiiiiime..\"}\nAnd I tell them every time, that I'm just gone for a while\nBut I'll always be back\n\nI'm, back in the place where, we get so absurd\nLiquor in a brown bag laid on the curb\nWhere a lot of good things and bad things occur\nI know what time it is, homey what's the word?\nI kick back on the valley with my eyesight blurred\nAll up in the alley, swiggin Thunderbird\nSelling rocks on sidewalks, long walks to detox\nA place where we creep don't sleep and we sweep the street blocks\nMoox on the beats that make the streets, rock\nI'm up in the corner hittin some grifa{?}\nSpittin' some game hopin to hit this weeza\nStill in one piece and I'm back in the streets, I'm\n\n(Chorus: Lil Rob) + {sped up samples}\n{\"I'm back in the streets\"} I'm back in the streets\n{\"And every girrrrrrrl that I meet\"} Every girl I meet\n{\"They ask the same question\"} Always askin me\n{\"And I tell them everytiiiiiiiiime..\"}\nJust gone for a little while\nBut I'll always be back\n\n(Lil Rob)\nI'm, back on the calles, and I'm twice as bad\nI still do the same thing, my bumper still drag\nLay it down on the ground right down on the ave\nAll my homeboys pass, see Lil Rob, got a brand new bag\nStuffin the cuff up, haters watch it watch it jump up\nWhen I cruise by, everybody sayin' whassup\nHey good to see you again - homey where you been?\nI've been around the bend where I ain't got no friends\nBut, I'm back, in town and I love these streets\nBrand new Nikes on my feet, walk on the concrete\nEy girl, I only leave 'cause I have to\nAnd when I'm gone I'm thinkin' I got streets to get back to, I'm\n\n(Lil Rob)\nI, know every shortcut, I know every path\nNo matter where I go I know I'll be back\nAnywhere on the map doesn't really matter where I'm at\nI'll be on the Camino posted up, with my people\nIn a ragtop (yeah), pancake on the blacktop\nImagine this back drop, the lifestyle I can't stop\nHeinas, homies, liquor and oldies\nCan't leave the pad the hurras waitin for me\nI'm buzzed and I'm on drugs - people ask me why I do it\nAnd I tell 'em just because - it's just mari-huana\nI do what I please, no need to be discrete\nIt just feels good, to be back in the streets, I'm\n\n", "album": {"title": "Twelve_Eighteen,_Part_1_(2005)&&2758", "genre": "Hip Hop", "year": 2005}}, {"title": "My Turn", "href": "My_Turn&&3974", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "(Lil Rob)\nYou know everybody's talkin' about me and shit right now\nY'all wonder what I'm gonna do next\nWell check it out\n\nThe more people that love me... the more people that hate me...\nBut I ain't trippin' I just do what I do\nKeep it true to myself, you can't break me\n\n(Lil Rob)\nEverybody wants to know what Lil Rob is soundin like\nThe same way as always, homey, dy-no-mite\nThey say, out of sight well then out of mind\nWell I'm out of sight but I'm in yo' mind and I don't mind\nHomey, I'm just tryin' to keep with the times\nSpit rhymes that are always on time, and try to climb\nThey wanna hate on me for stupid-ass shit\nPay them no mind, can't believe they're doin' that shit\nI can't believe they're even cool with that shit\nSupposed to be crazy homeboys and talk like a bitch\nIf you're not - the kind of homey I could pull a crime with\nThen you're not - the kind of homeboy I could bust a rhyme with\nAnd you're not - the kind of homeboy I associate with\nWhat'chu got bitch, I won't even negotiate with, shit\n\n(Chorus: Lil Rob)\nThe more people that love me... the more people that hate me...\nBut I ain't trippin' I just do what I do\nKeep it true to myself, you can't break me (it's my turn)\nI'm shootin for the top of the world\nCan I make it to the top of the world, hell yeah (it's my turn)\nI'll see you at the top of the world\nI'll be waitin at the top of the world\n\n(Lil Rob)\n- You can't stop me!\nI always continue to do my thing\nNo matter, what you do no matter what you bring\nYou're mad at me, for what? 'Cause I'm tryin'\nTo open the door so you can come up too you stupid fuck?\nCome on homey, I'm as real as they come\nTake a little bit of Pepsi mix it up with some rum\nThe kind of man to offer you a drink\nAnd hold a conversation with you to see how you think\nBut uh, somethin' tells me that you're bluffin me homes\nThat you're not, who you seem to be don't fuck with me homes\nCause nowadays I can see you comin' a mile away\nAnd I don't like your style eh (okay)\n\n(Lil Rob)\n- God damn!\nI gotta deal with everybody else puttin' me down\nI've been puttin' in work for as long as I've been around\nJust because I was brought up on the brown side of town\nI rap with an accent and I got my own sound\nEy fuck it homey, I am who I am\nOne proud Mexican, {?}en mi criste penaten{?}\nLowridin down the avenue, doin' what it is I do\nWhether it appeals to you I gotta keep it real with you\nHow could I expect you to respect me any other way\nCan I get a \"s&#311; mon\" (s&#311; mon), can I get an \"orale\" (orale!)\nAndele, there we go\nShouts out to all my gente from here to Me-ji-co (whoa)\n\n(Lil Rob)\nYou got somethin' to say, keep that shit to yourself mayne\n(It's my turn)\nYou don't like me, don't play it, simple as that\n(And, I, just, don't, stop)\n(See, you, at, the, top) That's right\nYou can do what you do I'll do what I do\n(And, I, just, don't, stop)\n(See, you, at, the, top)\n(And, I, just, don't, stop)\n(See, you, at, the, top) {*fades out*}\n\n", "album": {"title": "Twelve_Eighteen,_Part_1_(2005)&&2758", "genre": "Hip Hop", "year": 2005}}, {"title": "That's When I'll Stop", "href": "That%27s_When_I%27ll_Stop&&7190", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Hey ladies, who you come to see?\nIs it the L-I-L to the R-O- to the B\n\"Lil Rob\", say it for me loud.\nHow come I say my name so much?\nBecause I'm proud like the impressions\nAlong with Curtis Mayfield too ...\nI'm so proud of you\n\nYou know the jam, I'm the oldie man\nSome say that I'm the oldie man\nWho can make a rap jam\nWithout fucking up the oldie jam\n\nI always am, and I always will be\nThat one you love to hate\nLil Rob now still be\nPeople wanna kill me\nOver all this rap shit\nCan't get over that shit\nNow they want me in a casket\nRumor has it, that I'm one of the baddest\nLil vato raperos with rhymes that are massive,\nGigantic, and deeper then Atlantis\nYou wanna be like me homie,\nYou better fucking practice.\n\nWhen the birds no longer use their wings to fly,\nThat's when I'll stop, stop, stop, stop, stop...\nWhen the rain drops stop falling from the sky,\nThat's when I'll stop, stop, stop, stop, stop...\nWhen old Broadway changes to Fifth Avenue,\nThat's when I'll stop, stop, stop, stop, stop...\nWhen mathematicians find that one plus one isn't two,\nThat's when I'll stop, stop, stop, stop, stop...\n\nBeen doing this a long time\nNow I'm busting strong rhymes\nKnow about the thin lines\nTrying to keep shit in line\nAnd I know it's my time\nFor some reason I'm not trying\nBut without my music out\nHomie, I'm slowly dying\nThat's something I know they want\nSomething that I don't want\nLil Rob the nickname\nThe nickname they forgot\n\nYeah he used to bust raps\nAnd make people clap\nEveryone's got their albums out\nBut where's his at\nHe said it'd be out long time ago\nHe said that a long time ago\nWhere'd all the time go\nCan't see that like a blind-fold\nHey have you seen me Mr. Husseiney\nSay that I'll be back\nBut that's my dissappearing act.\n\nWhen the birds no longer use their wings to fly,\nAnd the rain stops falling from the sky,\nAnd old Broadway changes to Fifth Avenue,\nWhen mathematicians find that one plus one isn't two.\nThat's When I'll stop.\n\nWhen the birds no longer use their wings to fly,\nThat's when I'll stop, stop, stop, stop, stop...\nWhen the rain drops stop falling from the sky,\nThat's when I'll stop, stop, stop, stop, stop...\nWhen old Broadway changes to Fifth Avenue,\nThat's when I'll stop, stop, stop, stop, stop...\nWhen mathematicians find that one plus one isn't two,\nThat's when I'll stop, stop, stop, stop, stop...\n\nRemember when I was younger I would hunger\nFor the chance to be a star\nHere we are, how bizarre, how far will a take\nWill I make it, have I already made it\nWhat'd you think about my album after you played it?\nWas it good, was it bad, was it bad, meaning good?\nI could take this to the top ese, I really could.\n\nWe need more Mexicans on CD\nMore Mexicans on TV\nNever forget where I come from\nAnd that's what keeps me\nWho I am, aw man it's you again\nThe man up in the mirror,\nThe only lil vato that I fear\nSometimes I don't like to see you, don't like to be you.\nWishing on a star for all the things that I could re-do\nSee through, all you, are you, who you\nSaid you claim to be last time that you came to me\nOr maybe you just came to see\nIf Lil Rob was still dropping it\nFuck yeah, there ain't no stopping it\n\nWhen the birds no longer use their wings to fly,\nThat's when I'll stop, stop, stop, stop, stop...\nWhen the rain drops stop falling from the sky,\nThat's when I'll stop, stop, stop, stop, stop...\nWhen old Broadway changes to Fifth Avenue,\nThat's when I'll stop, stop, stop, stop, stop...\nWhen mathematicians find that one plus one isn't two,\nThat's when I'll stop, stop, stop, stop, stop...\n\n", "album": {"title": "The_Last_Laff_(2002)&&3882", "genre": "Hip Hop", "year": 2002}}, {"title": "S.A.N. D.I.E.G.O.", "href": "S.A.N._D.I.E.G.O.&&5324", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "What's up ese\nIt's your homeboy\nLil' Rob\nRepresenting my city\nSan Diego, Southern California\nTo the fullest that's right\nThat's where I'm from, simon\n\nS-A-N D-I-E-G-O representado con Mano Lopalo\nMi pa mi lado, Chicano limpio creased down with the wrinkles\nBet you get them tingles when you listen to my singles\nFijate, pelonsito un marijuanito\nGot one hand on my cuete and the other on my pistol\nSiempre listo, me fijo en todo\nI'm one bad motherfucker from the wrong side of town ese, ni modo\nPero no me olles, but I still enjoy this\nLil' Rob controla, fucking up this rola like a bomba on the boulevard\nCruising with the 45's, got my loaded .45's still living this Crazy Life\nI lay low like a Chevrolet, Chevrolet\nAnd I bust my rhymes and they come away, come away\nAnd I been many places but it's not the same though\nL-I-L R-O-B, S-A-N D-I-E-G-O\n\nS-A-N D-I-E-G-O, E-G-O\nSan Diego\nS-A-N D-I-E-G-O, E-G-O\nSan Diego\nS-A-N D-I-E-G-O, E-G-O\nSan Diego\nS-A-N D-I-E-G-O, E-G-O\nSan Diego, Southern California\n\nThough my town ain't what it used to be\nIt still means everything to me\nI used to have dreams to be, something is what it made of me\nNothing like I used to see, drug deals everyday homie\nOverdoses? Yeah usually, but the streets was so damn good to me\nPain the walls with graffiti, all the vatos acting rough with me\nSo rough so tough with me, pinche juras handcuffing me\nThey never left me alone, just 'cause I was pelon\nAnd because of my skin-tone, fuck that must be 'cause I'm chingon\nAnd I tell it like it is, my shit's bad damn right it is\nCan't believe how tight it is, like baby Jennifer Lopez\nLeaving all you fools so please, knowing you can't fuck with this\nSay that you don't like my shit, your fucked and now you're stuck with it\nI know that you're bumping it, on the down low you be loving it\nI'm the baddest one Brown-raggin it, catch me on the street Brown-baggin it\nThis one's for my city where I learned my flow\nS-A-N D-I-E-G-O, San Diego\n\nI always say stay down for the Brown\nBut don't let no one get you down, don't frown\nReady for showdowns, I got more sold than MoTown bumping in your town\nWho's got the flows now? Who's running the shows now?\nThe wicked wicked Lil' Rob gots it all under control now\nGo now, if you know what's good for you\nBut you're one of those vatos that likes to talk away\nIf you had any sense you'd swallow your foolish pride homey and walk away\nThe other way, oh by the way I fly away ddaammnnn to my four corner room\nLike my song 4 Corner Room, tripping out like I was on shrooms\nI sit and look at the colorful things, evil, good or whatever it brings\nSpread my wings and fly away again, Lil' Rob the San Diegan\nLet me know when you want to play again, play again\nMaybe next year on the Fifth of May again, May again\nBut until then keep up with Lil' Rob year round\nAnd I'm promising you the crystal clear sound of a Mexican\nBut it's time for me to go rest again\nIt's time for me to go but I'll be back to flow\nRemember my name, Lil' Rob\nKnow where I'm from, San Diego\n\nThat's right\nThat's the way we do it\nSan Diego, Southern California\nYeah, 1904\nThat's right\nSan Diego\n\n", "album": {"title": "Can%27t_Keep_A_Good_Man_Down_(2001)&&5534", "genre": "Hip Hop", "year": 2001}}, {"title": "I Who Have Nothing (But I Have Respect)", "href": "I_Who_Have_Nothing_(But_I_Have_Respect)&&6578", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "I got somethin' to get off my chest\nIt's a rioting; cause after this, it don't exist\n\n(Chorus 2X: Lil Rob)\nI who have nothing, may have nothing\nBut I still got something that you don't, you don't\nI who have nothing, may have nothing\nBut I'll always have something that you won't, you won't\n\n(Lil Rob)\nEy, what's happenin' Primo, long time no hear from\nBut you're all about bullshit and we don't wanna hear none\nSo take your, fuckin' drugs and your wannabe thugs\nAnd your junkie lil' bitch from the strip club and get FUCKED\nStill can't believe what the fuck you did\nFuck my nino, no fuck you, your slutty wife and your kid\nJust a pain in the ass, that was some pains in my neck\nAround here, you ain't feared you get no fuckin' respect\nSo how's it feel not to be real, Mr. Big Man with the plan\nBut the first to run when shit hits the fan, c'mon\nWho you tryin' to kid with that gangster shit?\nLil Primo, you can't even be a gangster bitch\nYou must be {hiiiiiiigh} on your own supply\nGet some sick fuckin' vatos, they done boned you dry\nYet on you cry, because we both know why\nYou don't, you lie, sparks flyin like 4th of July, goodbye\n\n(Chorus) w/ ad libs\n\n(Lil Rob)\nEy check this out\nEven if I could I don't wanna cruise the hood in Mercedes Benz\nRather cruise a six-three convertible\nHoppin down the block with all my friends\nThe ones that don't care, whether or not I'm makin' ends\nThe ones that were there and never scared and down to do it all again\nI call you \"The Great Pretender\" cause your life is just pretend\nI like the movie \"Scarface\" too but remember, he dies in the end\nAnd you're no Tony Montana either, you must have a fever or some shit\nYou went crazy, you're sick, you just a dumbshit\nFuck it, fuck you, fuck him too\nFuck everyone who knows what you do, fucker is stuck with you\nWhat must I do? I thought your hermana was cool but fuck her too\nAnd this is all because of you\nSad but true, talk shit about your dad\nBoy your kid's gonna be real fuckin' glad to have a dad like you\nHate to see him grow up, to be a man like you\nOr maybe I do, so he can fuck up your family too, man fuck you\n\n(Chorus) w/ ad libs\n\n(Lil Rob)\nI continue, to rap in the booth, guaranteed you're gonna be havin' the blues\n'Cause when someone's havin' to lose it has to be you\nI drive the Caddy but I fuck with my baller ride\nWear button-ups but I don't, pop my collar\nI pop all lies like it's nada in the calle, not the Range\nIt's not the same, you went insane, you ain't Gonzalez, changed yo' name\nThe fuckin' clique you claim is lame\nMy shit is so heavy and true that you, couldn't pick it up with a crane\n\n(Chorus) w/ ad libs\n\n(Lil Rob)\nAnd that's familia\nYeah I can only tell it how I see it ese\nCause after this you don't exist\nEither you respect that or you can step back\nCause after this you don't exist\nWe'll be a riotin\nCause after this you don't exist\nThe last thing I do, take care of the familia man\nCause after this you don't exist\nYou can't come back no more\nYou ain't welcome here man\nYou brought it wrong ese\n\n", "album": {"title": "Twelve_Eighteen,_Part_1_(2005)&&2758", "genre": "Hip Hop", "year": 2005}}, {"title": "It's My Life", "href": "It%27s_My_Life&&8968", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "(Chorus: David Wade (Lil' Rob))\nNever mind what I do, stick to you.\nLet me live. It's My Life.\n(It's My Life. It's My Life.)\nIt's what I go through everyday.\n(I'm just an average man tryin' to do the best I can.)\nNever mind what I do, stick to you.\nLet me live. It's My Life.\n(It's My Life. It's My Life.)\nIt's what I go through everyday.\n\n<b>Lil' Rob:</b>\nLet me tell you the type of things that we go through, you know?\n\n<b>Lil' Rob:</b>\nI rap about what's real and what I go through on the daily\nIt's crazy, like my neighborhood back in the 80's\nI've seen shit, I lived it, I know it, so I give it\nI can't stop &amp; I won't stop until I'm finished\nIn the 90's you could find me on Hernandez with the homeboys\nLookin' out for the chota, livin' la vida loca\nLook in my pockets, someone always had a fusca\nYou know how it is, you rollin' through you keep trucha\nBullets flyin' I ain't lyin' I got hit by one\nJefita cried, I almost died and it was just for fun\nWe're never doin' what we oughta be\nRest in peace to my homeboy Peewee got shot by a cop in a robbery\nAnd honestly, that part of our lifestyle is unsuitable\nDon't act like you don't know how it feels to go to a funeral.\n(Silencio)\nThat's how we're livin' though\nAnd then we wonder why they look at us like we're some fucking criminals\nYou know...\n\n(Chorus: David Wade (Lil' Rob))\nNever mind what I do, stick to you.\nLet me live. It's My Life.\n(It's My Life. It's My Life.)\nIt's what I go through everyday.\n(I'm just an average man tryin' to do the best I can.)\nNever mind what I do, stick to you.\nLet me live. It's My Life.\n(It's My Life. It's My Life.)\nIt's what I go through everyday.\n\n<b>Lil' Rob:</b>\nI never left the pad without shavin' my head\nGettin' cleaned up, creased up, takin' a joint to the head\nNever been to Juvie hall, never been to the pen\nBut to my homeboys, I'm someone you could depend on\nI used to use Crylon to write on fences and walls\nBig block, Old English letters standin' 10 feet tall\nUnited we stand, divided we fall\nTighter than some 1218's 2 sizes small\nSmile now cry later, fuck it. Why cry at all?\nAnd if we ever got busted homeboy, deny it all\nWe didn't do shit, they can't prove shit, even if they could\nYou never pulled rat or your not welcome back to the hood\nYour known as no good, that's how it was, that's how it is\nFuck the predicament get your ass killed for that shit.\nYou don't believe me? I don't care if you do, or if you don't\nI'm just sayin' what the fuck I've been through\nAnd it's no joke.\n\n(Chorus: David Wade (Lil' Rob))\nNever mind what I do, stick to you.\nLet me live. It's My Life.\n(It's My Life. It's My Life.)\nIt's what I go through everyday.\n(I'm just an average man tryin' to do the best I can.)\nNever mind what I do, stick to you.\nLet me live. It's My Life.\n(It's My Life. It's My Life.)\nIt's what I go through everyday.\n\n<b>Lil' Rob:</b>\nI get the smallest wires, wrap 'em with the smallest tires\nBlaze more trees than the San Diego wild fires\nI get higher to inspire rhymes\nSay some shit to inquire minds and make sure they admire mine\nMake 'em wonder what the fuck goes on in this mind of mine\nI'm a cool dude, we can blow up for the final time\nIt's all the same, ain't nothin' changed, it's still this style of mine\nNeighborhood Music, talkin' about how we do shit, we cruise it\nWe sometimes lose it and act foolish. But who doesn't?\n'Cause a ruckus, fuck it, that's what you're stuck with\nProducts of the barrio, got nowhere to go but we gotta go\nThey ask me where I'm goin'. Shit, I don't know.\nAround the town, see who's around, see who's down\nTo get a 12 pack &amp; a pound\nI'm lookin' for the answer at the bottom of a bottle\nIt's just my luck I gots no luck\nNo California Lotto.\n\n(Chorus: David Wade (Lil' Rob))\nNever mind what I do, stick to you.\nLet me live. It's My Life.\n(It's My Life. It's My Life.)\nIt's what I go through everyday.\n(I'm just an average man tryin' to do the best I can.)\nNever mind what I do, stick to you.\nLet me live. It's My Life.\n(It's My Life. It's My Life.)\nIt's what I go through everyday.\n\n<b>Lil' Rob:</b>\nI'm just an average man.\n\n", "album": {"title": "Neighborhood_Music_(2004)&&4954", "genre": "Hip Hop", "year": 2004}}, {"title": "Str8 Jackin'", "href": "Str8_Jackin%27&&7048", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Featuring: mr.shadow\n\n\nFirst Verse:Lil'Rob\n\nStr8 jackin', still warein' all blue\nKillin' haters, hackin' and knockin' up bitches to\nStill doing drive by's and doing 'em old school\nWhatcha gonna do\nHomie you got something to say\nCalifas Westside Gang\nWill jack you in tha face\nTurnin' corner blockshitin' switches everyday\nHitin' my bass up and you can hear a mile away\nStill smokin' cronic\n'Cause I want it\nMakes me fill good 'cause I'm still brown and smokin'\nSparks flyin' open\nFrom tha gat that I'm holdin'\nThis is for tha homies\nAnd all tha others that know me\nIn this world you can't get by with luck\nYou got to get money, big ball motherfuck\nStr8 jackin' to tha ones who doubt me\nI'll pour a glass of henessy and say it loudly\n\nHook: I'll jack y'all up\nStr8 jackin', str8 jackin'\nWhat, what\nY'all can test me but you ain't getin nothin' x2\n\nSecond Verse :(Mr. Shadow)\n\nStep a lil closer, 'cause I ain't scared\nI'll laugh like a joker, and tear you up to shreads\nTha homie all in blue\nThat be me what it to you\nI'm str8 up jackin' killin' fools that even new you\nLil' Rob in tha lac\nMe in tha back\nNight ridein' tryin' to find bitches to collect\nStr8 jackin' to tha apacalyps\nWhatcha gonna do\nLil' Rob all in blue\nBack beside ya house with a nine milli to\nBought a couple of spray cans to spray this place down\nTha way we spray and grind you can give us tha Royal crown\nStr8 jackin' from tha caddilac sound\nTha shadow in tha street\nTha shadow that you see\nMy homie right beside me lil' R-O-B\nDon't fuck wit me\nI'll jack you up\nYour not tha kind of vato to ride wit us you see\nNo llores pinche puto I'll bring tha westside Heat\n\nHook;(Mr.Shadow): I'll jack y'all up\nStr8 jackin', Str8 jackin'\nWhat, What\nY'all can test me but you ain't getin' nothin' x2\n\nThird Verse Lil'Rob and (Mr.Shadow)\n\nI won't give up shit (I'll just give you a glare)\nStr8 jackin' without a cause (Bustin' nines 'cause I ain't Scared)\nYou hear me in your dreams\n(You hear me in tha streets)\nYou here tha Sound of my shot guuun\n(You here tha sound of my Shot guuun)\nBackground:Str8 jackin' for fuuun x2\n\nHook:(Mr.Shadow and Lil'Rob Together)\nI'll jack y'all up\nStr8 jackin' str8 jackin'\nWhat, What\nY'all can test me but you ain't getin' nothin' x2\n\n(Bridge) You can here tha sound\nTha sound from my gun\nYou can't runaway, can't Dodge, can't jump\n'Cause I'll jack y'all uuup\n\n", "album": {"title": "Still_Smokin%27_(2000)&&4953", "genre": "Hip Hop", "year": 2000}}, {"title": "Naughty Boy", "href": "Naughty_Boy&&7928", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "(Lil' Rob (Talkin'))\nHey what's happenin'\nYeah it's me, Lil' Rob\nA.K.A The Naughty Boy\n\nN-A-U-G-H-T-Y, aqui estoy\nLittle Rob aka naughty boy\nYou don't wanna play house\nPos ya me voy N-A-U-G-H-T-Y\n\n(Lil' Rob)\nNow when it comes to rockin' rolas, I got the connecta\nLil' Rob, all up in tu area, neta\nDon't mistake me for no gaga or no clicka\nAin't no man in this world who can fill these sneakers\nI'm N-A-U-G-H-T-Y, let me take you home, girl I love to bone\nLet me do you doggy style so we can both watch TV\nL-I-L-R-O-B, from S-D, that's me\nA.K.A Naughty boy, aqui estoy\nEvery where I go all them hynas yell, \"rock me boy\"\nI'm toppin out on my cylinders\nAnd when it comes to money (yeah)\nI'm makin' feria like millionaries\nA hundred spoke daytons as I roll down the calle\nIn my 6-3 hop 33 down the valle\nPlus I got some yerlba, leva wanna smoke?\nFuck you, remember you kicked me down when I was broke\nYou just got broke\n\nN-A-U-G-H-T-Y aqui estoy\nLittle Rob aka naughty boy\nYou don't wanna play house\nPos ya me voy\nI got to go baby doll I gots to go\nN-A-U-G-H-T-Y aqui estoy\nLittle rob aka naughty boy\nYou don't wanna play house\nPos ya me voy\nN-A-U-G-H-T-Y\n\n(Lil' Rob)\nI like to sleep all day until the sun goes down\nThat's when I hit the town and fuck it up till the sun comes up\nSome times I'm drunk some times I'm high\nI'm always wicked, I'm always slick, I'm always sly\nLeave a little bit of room and I'll slide by\nAnd fuck up your program just like a drive by\nAin't it funny how time flies my my\nTime for you to say night night bye bye\nHavin' naughty dreams of naughty things\nEverybody loves everything that the boy that be naughty brings\nSpit my verses like a viruses\nMake you sick like my style is\nSplit your wig like a stylist\nI've got my list and I'm checkin' it twice\nCheckin' which hynas been naughty or nice\nYou only live once so you can't do it twice\nSo make bein naughty a part of your life\n\nN-A-U-G-H-T-Y aqui estoy\nLittle rob aka naughty boy\nYou don't wanna play house\nPos ya me voy\nI got to go baby doll I gots to go\nN-A-U-G-H-T-Y aqui estoy\nLittle rob aka naught boy\nYou don't wanna play house\nPos ya me voy\nN-A-U-G-H-T-Y\n\n(Lil' Rob)\nI love to hear your body talk\nLove your little naughty walk\nLove the way you fall\nInto your naughty crawl\nMy eyes open wide\nCan't believe what I saw\nFine ass baby doll\nPanties and a bra, that's all\nNaughty girl, naughty world\nAqui estoy, naughty boy\nYou can play with me\nBut naughty boys not a toy\nMischeiveious, disdisobedient\nSo when your needin it\nI wanna be the one whos givin' it\nBecause your radiant\nThough improper, baby doll you're a show stopper\nThe show must go on, naughty boy live in concert\nN-A-U-G-H-T-Y B-U-Y the ultimate\nConsider yourself fortunate\nI'm someone who you won't forget\nSomeone who you won't regret\nNo one's ever told me yet\nClaim your naughty like me\nBaby you havent showed me yet\nI can make you soakin wet\nPut my lips upon your neck\nFellins why they call me naughty\nTingles all through out your body\n\nN-A-U-G-H-T-Y aqui estoy\nLittle rob aka naughty boy\nYou don't wanna play house\nPos ya me voy\nI gots to go baby doll I gots to go\nN-A-U-G-H-T-Y\nLittle rob aka naughty boy\nYou don't wanna play house\nPos ya me voy\nN-A-U-G-H-T-Y\n\n(Lil' Rob (talkin'))\nWoof, que perro\nYeah,\nNaughty boy\nThat's how we put it down\n\n", "album": {"title": "Can%27t_Keep_A_Good_Man_Down_(2001)&&5534", "genre": "Hip Hop", "year": 2001}}, {"title": "What Am I Saying", "href": "What_Am_I_Saying&&2967", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Baby tell me what's up, because I'm feelin' you, I'm lettin you know, I'm makin' my move, I know the love shows, you got me talkin' like this, I can't believe you got me talkin' like this, whoa, whoa... girl tell me what's up, because I'm feelin' you, I'm lettin you know, I'm makin' my move, I know the love shows, you got me talkin' like this...\n\nSee I don't wanna be just another one of them guys who feed you lies, 'cause your too fine, as for my mind, well you blew mine, you got me feelin', I'm walkin' on cloud nine, one of a kind, hard to find, but I found mine, lose track of time, all I think about is you, On the tip of my tongue, all I speak about is you, and the way you do, the things you do, (whoa, whoa), beautiful thoughts of just me and you, you say you see it too, do you dream like I dream, 'cause my dream is to be with you, when I close my eyes at night, all I see is you, and can't wait to wake up next to my dream come true, you see I know all I need is you, I'll never find no one as sweet as you, Look what you made me do... I can't believe that you got me like this, talkin' like this, got me caught up, lost in your mix...\n\n...I want you, I need you, I think I love you, damn what am I sayin', I can't believe yu got me talkin' like this,...\n\nBut then I heard you takin', all you can take, that your through with men, after your last heartbreak, but I don't wanna be the one you hate, I want you waking up every morning and feelin' great, so great, that you can't wait to go tell your friends, that you just found a happiness that never ends, I wanna tell my friends the same things too, how you make me feel brand new, you changed my view, I was fallin' off weak, but now I'm right on que, see I've been living for the love of you, look what you made me say, look what you made me do...\n\n(Chorus 1 + chorus 2) Twice\n\nI never let nothing keep me from what I want, can I pick you up tonight, on the weekend or what, just let me know when you got some time, until then, you'll know that you'll stay on my mind, I like what I know, I definitely like what I see, especially when I see you with me, there I go again, I can't believe that you got me like this, talkin' like this, got me caught up in, what a bitch...\n\n(Chorus 1 + chorus 2)\n\nGirl tell me what's up, because I'm feelin' you, I'm lettin you know, I'm makin' my move, I know the love shows, you got me talkin' like this, damn girl I can't believe you got me talkin' like this, (whoa, whoa), I want you, I need you, I think I love you, Damn, what am I saying, I can't believe you got me talkin' like this,(whoa, whoa), I want you, I need you, I think I love you, damn what am I saying, damn girl, I can't believe you got me talkin' like this...\n\n*End*\n\n", "album": {"title": "Twelve_Eighteen,_Part_1_(2005)&&2758", "genre": "Hip Hop", "year": 2005}}, {"title": "Front Back Side to Side", "href": "Front_Back_Side_To_Side&&3632", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Hey homeboy remember cruising down the avenue in the Regal\nWe thought we were all bad with McLeans and a lowered car\nBut nowadays if you don't got hundred spokes\nHomey don't even bring you car out\nAnd if you ain't switched up, forget about it\nLet me tell you about me ride ese\n\nMy carrucha got four pumps and four square dumps\nHydraulics, custom paint, rims and bump bumps\nEverything I need in my low-low\nI go hook it up with them vatos who can hook it up\nWrap it up from the bottom up, homeboy tear it up\nWhen I'm done juice them up, go back out and use some up\nFront, back, side to side, corner and pancake\nPeople trip out when they see my carro shake like a Southern California earthquake\nI take, many chances on this carrucha that dances\nLike a ruca, ass up, titties down\nSo many Chevys you would think we're in the 60's\nNow I'm through, grab a tissue from my dispenser\nGrab another 45 for me and change the record\nMy neck hurts from hitting all day\nYou play you pay but that's ok, I'll hit my switches till the day I pass away\n\nFront, back, side to side, corner and pancake\nPeople trip out when they see my carro shake shake\nFront, back, side to side, corner and pancake\nHop that motherfucker till the AR's brake\nFront, back, side to side, corner and pancake\nPeople trip out when they see my carro shake shake\nFront, back, side to side, corner and pancake\nShaking like a Southern California earthquake\n\nI hit my switches up, I hit my switches down\nI put the top up, I put the top back down\nNo matter where I go they say my tire's the glow\nAnd next time tell me something I don't know, I like to roll low\nI'm a lowrider rolling on hundred-spoke wires\nGotta be thirteen inch Daytons wrapped with small white-wall tires\nYou say that you three wheel, I bet you I three wheel higher\nGot a chrome extinguisher just in case I catch fire\nAnd if I do I'll get myself a '62 or have some fun in a rag-top '61 and it's done\nThat's Q-Vo, Q-Vo, I got the itches to hit the switches\nPeople tripping, how I lit this, street up with sparks\nListen to my perros bark, slam it to the ground every time I park\nBut when I leave I raise it up again\nHit the front down, hit them up again, down, then I get them up again\n\nHey homey that's a pretty bad ass convertible you got there ese, '63?\nSimon\nHey homey that's a pretty bad ass Cadillac Fleetwood you got there homeboy, '93?\nSimon\n\nI start my car up and gas her every time I dance it I break something\nDon't worry, it's nothing that we can't fix\n'Cause I don't stop until the pumps bust or I get a head rush\nOr until some hynas get in the mix\nI hit my switches, the jura gives me tickets\nHynas blow me kisses, throwing me their digits\nLooking all exuisent when I get explicit\nBecause I got a lowride that looks like it slow rides\nDon't be surprised when I'm hopping next to your ride\nSee saw, front, back, side to side\nThree wheel around the corner as I get ghost\nCheck the chrome behind the spokes, homeboy you can't get close\nAll you see is six tail-lights as I leave the scene\nCarrucha looking clean, and my ruca's looking mean\nTime to head home, another night to ascend\nCome back next weekend and do the same shit again\n\n", "album": {"title": "The_Last_Laff_(2002)&&3882", "genre": "Hip Hop", "year": 2002}}, {"title": "Intro", "href": "Intro&&9976", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Well my name's Roberto Flores \nBut my homeboys call me Lil' Rob\nWell my name's Roberto Flores\nBut my homeboys call me Lil' Rob\nI'll drop these lyrics on your mind\nWith this crazy unic style of mine\nNow some may say I'm bad\nAnd some may say I'm cool\nEither way it's all okay\nI do this just for you\nWell my name's Roberto Flores \nBut my homeboys call me Lil' Rob\n\n", "album": {"title": "High_Till_I_Die_(2000)&&3411", "genre": "Hip Hop", "year": 2000}}, {"title": "Forever Live My Name", "href": "Forever_Live_My_Name&&9070", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Hey you know what homey\nI'm sick and tired of these fools homey, yeah\nTalking about how they're keeping it real, you know\nWell then keep it real ese, you know\nFuck all that bullshit your talking about homeboy\nNo one wants to hear that shit\nKeep it real homeboy\n\nI walk up on the scene with my white sneakers\nMy big ass Levis, my big ass t-shirt and look around to see who I see\nThe same fucking people who can't see me\nYou can close your eyes, it's getting kind of rough\nYou can open your eyes, ese not wide enough\nTo even catch a sneek peek or Peek A Boo of what the Lil' Rob is all about\nWhen I leave they all follow out\nLil' Rob be the one of a kind\nWith the one of a kind mind, most of the time I can't find mine\nYou ask me how I'm doing and I still say that I'm fine\nWalking on that fine line, no time on my time line\nWho left the door open? Your time just ran out\nAs for patience, well mine just ran out\nAnd I got nothing left to do but to sit back patiently\nTo make sure you continue hating me\n\nLil' Rob, forever live my name\nLil' Rob, forever live my name\nLil' Rob, forever live my name\nYou wanna be like me but it's just not the same\n\nHey holmes, I heard a lot about you ey\nWell was it good shit or bad shit?\nI bet you twenty bones it was some bad shit\nBut that doesn't even matter though\n'Cause any publicity is good publicity, that's why they mention me\nI must be doing something right\nBut they ain't doing nothing right, I'm making sure that I'm busting tight\nNow everybody wanna be\nHey holmes you heard Lil' Rob's new jam? He's talking shit about me\nWhoa, whoa, whoa, don't flatter yourself\nLater on you're gonna look back at yourself, and be all mad at yourself\nFor acting like a little girl, chavala\nRoll the fuck up, you try too much, you need to slow the fuck up\nHold the fuck up, shut the fuck up\nSilence is golden like the Daytons that I'm rolling around the town that I'm patrolling\nThe town I live in is lonely, it's lonely but I still won't cry\nIt's just me, myself, and I\n\nBack in the days when I was young, I'm not a kid anymore\nBut some days I sit and wish I was a kid again, I remember whistling\nIf I could go back in time and do things different\nI probably wouldn't do anything different\nI learned a lot, seen a lot, that's why these streets mean a lot\nI got shot down the block at the stop\nTrust you? Fuck you\nI've know people for seven years that I don't trust, and you think I'm gonna trust you\nI gotta do what I must do, with or without you\nThere's something about Lil' Rob, but there's nothing about you\nCan't keep a good man down ese, but you keep on trying\nTake to the sky on my natural high, 'cause I'ma keep on flying\nHere's a little something for your brain to cause the pain\nWhen I'm done then my son will forever live my name\nLil' Rob, and when he's done then my son will forever live my name\nAnd when he's done then my son will forever live my name\nAnd when he's done then my son will forever live my name\n\n", "album": {"title": "Can%27t_Keep_A_Good_Man_Down_(2001)&&5534", "genre": "Hip Hop", "year": 2001}}, {"title": "Still Smokin' (Supermix, Part 2)", "href": "Still_Smokin%27_(Supermix,_Part_2)&&1393", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "(Lil' Rob)\nThis is dedicated to the 6-1-9\nThese are the vatos that been, but now it's my time\nTo kick the beat's, move suavecito\nTo all you fine chicana's, Lil' Rob is doing?\nBumping the oldies, It's me Lil<i> Rob\nAnd the Brown Crowd homies, turn up the volume\nYeah, Natural High, a ?? for my friends\nAnd Lil' Rob will cry for la raza\nBecause we killin' off each other, it's sad\nBOOM, there goes another, but we don't need that\nBecause tonight it our night, it's the Brown Crowd night\nAnd everything will be all right\nSo get up, go out, and do the brown thing\nLet's cruise, no need to gangbang\nSo get ready, dress to impress\nBecause you got to make this start your very best\nNot just another night on the town\nIt doesn't brown ?? Chicano, were proud and be brown\nTonight were crusin' in your lowrider\nLet down the back and put the front a little higher\nAnd now your rollin' TJ ?? just be yourself holmes\nNo need to be fake because everybody out here\nIs havin' a good time, Oh what a night... Oh what a night\n\n(Lil' Rob)\nSup ese\nWhat's up ese... what you know me man?\nSimon I'm your best homey and you don't even know me\n\nThis vato came up and said \"hey what's up holmes\"\nI said \"you know me?\" he said \"simon I'm your best homie\nYou were born in September of 1975\nYou're already 20 I'm the reason why you're still alive\nI watch everything you do I've seen everything you've done\nI kept you out of jail because I told you when to run\nYou packed a gun at the age of 13\"\nThis vato knows everything about me but this guy I've never seen\nSo I said \"what you mean?\" and he said \"follow me\"\nI'm going crazy that's exactly what it's gotta be\nHe said \"let's fly\" so we took to the sky\nHe said \"stop, look and listen pay attention\nNow if you have a question then ask\"\nOh by the way where you takin' me?\nHe said \"stop, look and listen and you will see\"\n\nListen hear what I'm saying\nListen hear what I'm saying\n\n1-What's up\n2-I think I saw him standing over there just a minute ago\n1-Who?\n2-Lil</i> Rob, he's pretty bad on the mic you know?\n\nLil' Rob...\nLil' Rob...\nIt's the Wicked wicked\n\nPuto's slip and trip\nI'll rip them open from the heart to the brain\nI'm already insane, and I won't change\nYou can't stop this, so stop this nonsense\nPeople got this, because they want this\nSo watch above this\nLittle cholo, oh no\nLil' Rob comin' with mi stilo\nMy lyrics are like a bullet, out of a cuete\nIt's time to reload (an reload)\nAnd make sure I never run out of ammunition\nUntil I finish my mission, fix it\nAll the mistakes that these puto's make\nGo and grow up, shuttin' door's in your face\nSo that you can't blow up\nYou know who your fuckin' with\nLil' Rob con Coneta (neta)\nLeva you can bet cha bottle\nDel la hando puente can I follow as I lead the way\nAnd I'll say no to the bottles that you meet some day\nNever fuck with the calm one, the one who like's to kick it\nIt's me the sly, the slick, the wicked wicked wicked wicked\n\n", "album": {"title": "Still_Smokin%27_(2000)&&4953", "genre": "Hip Hop", "year": 2000}}, {"title": "Ooh Baby Baby", "href": "Ooh_Baby_Baby&&1250", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "(Lil Rob)\nI hope you don't mind\nBut I'd like to steal a moment of your time\nI just wanna get to know you\n\nAnd all it took was just one look and, I was hypnotized\nMesmerized by your pretty smile, and your pretty eyes\nYou're so, captivating, definitely soul shaking\nBreathtaking (breathtaking) got me craving for your lovemaking\nI'd, like to get together to get to know you a little better\nWhat kind of things you like, if you like me too, y'know, whatever\nI'll pick you up for a date I promise that I won't be late\nIn fact, I'll be early cause to be honest with you I just can't wait\n\n(Chorus: sung)\nOoh, baby, baby (baby)\nOoh, baby, baby (ooh, baby)\nOoh, baby, baby\nOoh, baby, baby\n\n(Lil Rob)\nI'd love to take you out, maybe we can hit the town (would you like that)\nDinner, and a movie, I mean, we can go dancin, or cruise around\nHow's that sound? (How's that sound?)\nLike to show you a good time if you wouldn't mind\nIt would be my pleasure, see I can't think of nothing better\nOr, anything I'd rather do, what could beat the time I had with you\nShare a couple of thoughts, share a couple laughs with you\nThat'll do (that'll do)\nI just know, that I can have a blast with you\nLet the good times roll, I'd like to make 'em last with you, let's go\n\n(Singer)\nWhat must I do, to be alone with youuuuuuu\nOoh baby, tell 'em Rob\n\n(Lil Rob)\nWhat'chu think? I just need the opportunity\nGirl you don't know what you do to me (just give me the chance)\nIf I was yours, I'd be yours exclusively\nTo enjoy any way you want to, I don't only want you\nBut I need you, and I'd do anything to please you\nYou could teach me things and there's some things I could teach you\nI don't mean to jump the gun, I'm just happy I got to meet you\nJust one touch from your, fingertips\nJust one kiss from your sweet sweet lips\nWould make me flip and be like\n\n", "album": {"title": "Twelve_Eighteen,_Part_1_(2005)&&2758", "genre": "Hip Hop", "year": 2005}}, {"title": "Rough Neighborhood", "href": "Rough_Neighborhood&&3624", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "I got somethin' to get off my chest\nIt's a rioting; cause after this, it don't exist\n\nI who have nothing, may have nothing\nBut I still got something that you don't, you don't\nI who have nothing, may have nothing\nBut I'll always have something that you won't, you won't\n\nEy, what's happenin' Primo, long time no hear from\nBut you're all about bullshit and we don't wanna hear none\nSo take your, fuckin' drugs and your wannabe thugs\nAnd your junkie lil' bitch from the strip club and get FUCKED\nStill can't believe what the fuck you did\nFuck my nino, no fuck you, your slutty wife and your kid\nJust a pain in the ass, that was some pains in my neck\nAround here, you ain't feared you get no fuckin' respect\nSo how's it feel not to be real, Mr. Big Man with the plan\nBut the first to run when shit hits the fan, c'mon\nWho you tryin' to kid with that gangster shit?\nLil Primo, you can't even be a gangster bitch\nYou must be {hiiiiiiigh} on your own supply\nGet some sick fuckin' vatos, they done boned you dry\nYet on you cry, because we both know why\nYou don't, you lie, sparks flyin like 4th of July, goodbye\n\nEy check this out\nEven if I could I don't wanna cruise the hood in Mercedes Benz\nRather cruise a six-three convertible\nHoppin down the block with all my friends\nThe ones that don't care, whether or not I'm makin' ends\nThe ones that were there and never scared and down to do it all again\nI call you \"The Great Pretender\" cause your life is just pretend\n\nI like the movie \"Scarface\" too but remember, he dies in the end\nAnd you're no Tony Montana either, you must have a fever or some shit\nYou went crazy, you're sick, you just a dumbshit\nFuck it, fuck you, fuck him too\nFuck everyone who knows what you do, fucker is stuck with you\nWhat must I do? I thought your hermana was cool but fuck her too\nAnd this is all because of you\nSad but true, talk shit about your dad\nBoy your kid's gonna be real fuckin' glad to have a dad like you\nHate to see him grow up, to be a man like you\nOr maybe I do, so he can fuck up your family too, man fuck you\n\nI continue, to rap in the booth, guaranteed you're gonna be havin' the blues\n'Cause when someone's havin' to lose it has to be you\nI drive the Caddy but I fuck with my baller ride\nWear button-ups but I don't, pop my collar\nI pop all lies like it's nada in the calle, not the Range\nIt's not the same, you went insane, you ain't Gonzalez, changed yo' name\nThe fuckin' clique you claim is lame\nMy shit is so heavy and true that you, couldn't pick it up with a crane\n\nAnd that's familia\nYeah I can only tell it how I see it ese\nCause after this you don't exist\nEither you respect that or you can step back\nCause after this you don't exist\nWe'll be a riotin\nCause after this you don't exist\nThe last thing I do, take care of the familia man\nCause after this you don't exist\nYou can't come back no more\nYou ain't welcome here man\nYou brought it wrong ese\n\n", "album": {"title": "Twelve_Eighteen,_Part_1_(2005)&&2758", "genre": "Hip Hop", "year": 2005}}, {"title": "I'm Still Here", "href": "I%27m_Still_Here&&9750", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "(Lil Rob)\nEy this one goes out to my raza on the Eastside\nWestside, Northside and Southside\nI wear a brown bandana homeboy, representin brown pride\nYou've never met me, so why in the fuck would I have a problem with you?\nBut if we do, I guess we gotta do what we gotta do\nShit, other than that, I'm cool\nTu sabes ese? I'm not tryin' to be somethin' I'm not\nAin't got nothin' to lose, every nothin' I got I'm takin' with me\nWhen I rest in peace in my lot\nLately I've been thinkin' a lot, drinkin' a lot\nEven gave tweakin a thought, I keep with the pot\nBe sleepin' a lot, wake up confused\nI don't even know if it's the weekend or not\n\n(Chorus - samples)\n\"It's been a lonnnng, long long tiiiii-iiiiime\"\n\"But I'm still here (I'm still here, I'm still here)\"\n\"Yes I am, yes I am!\"\n\"And I'm glaaaaad, to be arooooooooounnnnnnnnnd\"\n\"Through all the blood sweet and tears\"\n\"(I'm still here, I'm still here) Yes I do!\"\n\n(Lil Rob)\nI smoke weed to get me by, why lie?\nI smoke weed to get me high, so high\nWrite rhymes, tight rhymes\nLowriders, beautiful women and High Times\nAddictions, to street prescriptions\nPerfect fix to get you back in the mix\nLil' homey kickin back on the street corner packin a six\nAnd the glock with extra clips with hopes to get rich\nAin't that a bitch? Lil' homey has no clue what else to do\nGot kicked out of school, well me too, but who knew\nI'd be writin rhymes to get me through, but it's cool\nIt's a lot of hard work not to mention a lot of blood sweat'n'tears\nIt didn't happen overnight, the first time I picked up the mic\nIt's been over 15 years but I'm still here\n\n(Lil Rob)\nI'm still around, I still put it down\nShit, I ain't goin' nowhere\nEse Lil Rob's back, continue to make that \"Neighborhood Music\"\nAs long as you're there\nSomethin' to play loud, be proud of\nSomethin' to bump to, get drunk to\nSomethin' to fuck to, make love to\nEven got a lil' somethin' for the clubs too\nAll-in-all it's feel good music\nReal good music, real hood music\nEither you respect that or you can step back\n'Cause I won't let that be a setback I meant that\nSi mon I've tried, been denied\nMaybe even died inside\nPeople say I died but they lied but when I do die\nThey can say that I died with my brown pride\n\n", "album": {"title": "Twelve_Eighteen,_Part_1_(2005)&&2758", "genre": "Hip Hop", "year": 2005}}, {"title": "Drinking on My Driveway", "href": "Drinking_On_My_Driveway&&5856", "artist": {"unique_name": "Lil_Rob"}, "lyrics": "Its summer time and I'm, drinking on my drive way\nIts summer time and I'm, drinking on my drive way\n\n(Its summer time ey, and we drinking on my driveway)\n\nGet bumped with that hard liquor\nI'm back to my cerveza\nPacifico with no lime\nA six pack and a show time\nDrinking in cantinas\nOr drinking in my driveway\nEither way its ATM\nA toda madre\nYou wanna party\nPues caile\nBut B-Y-O-B\nBring your own beer ese\nAnd bring some for me\nDon't forget about my primos\n'Cause they all drink too\nDon't forget mis amigos\nHey what you think foo\nI know you didn't think that you can kick it for free\nAnd I know you didn't think that all the beer is on me\nIf you got some good yerba\nThan you can bring that\nIf you got a gang of rukas\nThen they can kick back\nI'm always down for a drink out\nDon't know nothing\nNothing leeks out\nCan't handle your liquor\nYou gost to go\nHome boy peace out\nDrive careful\nAnd keep an eye out for the jura\nIf they getcha\nYou never knew me\nI never knew ya\n\nBorracho,\nBeing macho\nYou besta split\nDon't ask why\nJust go unless you want a fat lip\nShut up\nDon't say nothing\nNo one want to hear that shit\nNo one cares what you say\nYou get the fuck on with your fit\nI'm lid\nHey why you wanna fuck with my high\nYou blow my mind like driving the convertible in July\nIll drink some beers\nWhatever kinds you wanna get me\nPacifico, coronas, so, gordos equis\nLets party every day\nCelebrate like cinco de mayo\nCarnitas, frijoles, arroz, pico de gallo\nGuacamole and salsa\nJose cuervo, cazadores, patron\nHornitos or zalsa\nSome one go get the mariachis\nFrom down the street\nTell 'em not to make no plans\n'Cause they ain't gonna leave\nEl mariachi loco\nQuiero bailar\nY volver volver\nNo se ban a callar\nIts summer time and drinking in my driveway\nChillin' bout my '63\nIts summer time and drinking in my driveway\nDon't you wanna drink with me\nIts summer time and drinking in my driveway\nChilling bout my '63\nIts summer time and drinking in my driveway\nWont you have a beer with me\n\nSome people drinking bud\nThe others lighting it up\nI'm one of the ones lighting it up\nTo life in it up\nHey leave it to the chota\nTo fuck my night up\nYou know the partys over when juras drive up\nAttention\nEverybody let me make myself clear\nYou ain't gost to go home\nBut get the fuck outta here\nBut leave the beer\nBelieve me\nI'll be watching you too\nI've got friends watching you too\nSo watch what you do\nI'm talking to you\nThe fools that be acting a fool\nIf you know what's good for you\nThan you would stop what you do\nI'm losing my cool\nWhen this is start catching the cool\nIs desstined to lose\nHis walking with that one of the shoes\nIt happends all the time\nWhy is it always happened to me?\nSome people over for some beers\nAnd then they don't wanna leave\nCome back tomorrow\nAnd don't be such a light weight\nIts summer time ey\nAnd we drinking in my drive way\n\n", "album": {"title": "The_Album_(2002)&&1990", "genre": "Hip Hop", "year": 2002}}]