[{"title": "One Night Stand", "href": "One_Night_Stand&&3993", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Oobie:)\nI'm sliding me on top of you\nDoing things that lovers do\nBut I don't belong to you\nWhat's a girl suppose to do\nI only need one night with you\nTo make all our dreams come true\nYou could never be my man\nYou can be my one night stand\n\n(Oobie/Chorus)\nBoy I know you got a girl\nAnd you know I got a man\nSo lets both respect the game\nAnd have a one night stand\nEverybody wanna know\nBut they wouldn't understand\nSo lets keep it on the low\nAnd have a one night stand\n\nWell it's about a quarter to three\nNo one's lookin'\nIts just you and me\nYou know I'm down for whatever\nAnd I aim to please\nBut its only for this one night\n\nBoy I hope you came well prepared\n'Cause I want you to know that\nI ain't never scared\nYou just got to RSVP\nAnd I'll be there\nBut its only for this one night\n\nBoy I know you got a girl\nAnd you know I got a man\nSo lets both respect the game\nAnd have a one night stand\nEverybody wanna know\nBut they wouldn't understand\nSo lets keep it on the low\nAnd have a one night stand\n\n(Lil Jon:)\nShawty, let me know what's uo wit it (wit it)\nWon't you let a real thug hit it (hit it)\nStop playin' with these lames\nAin't got no shame\nThe liquor is to blame (you know it)\nI just go to tell you this (what's up)\nThose lips I wanna kiss (yeah yeah)\nThat ass I gotta grab (grab)\nYo' shit I gotta stab (stab)\nI got my baby mama, (mama)\nYou got your baby daddy (daddy)\nWe got all night\nLook lil mama, get it right\nYo' shit is good and tight (tight)\nI ain't 'bout them games shawty (nah)\nYou know my name shawty (yeah)\nJust use yo' brains\nIf you know what I'm sayin'\nIt's a one night stand shawty\n\nBoy I know you got a girl\nAnd you know I got a man\nSo lets both respect the game\nAnd have a one night stand\nEverybody wanna know\nBut they wouldn't understand\nSo lets keep it on the low\nAnd have a one night stand\n\n(Oobie/Two Times:)\nIf you know how to keep a secret\nYou can get it fo' sure\nJust make sure you get enough\nCause you can get it no more\n\n(Big Sam:)\nCome and ride wit cha boy Big Sam filled with almond joy\nLike I told you\nI'm something just like a freak (like a freak)\nSo keep the games fo the mentally weak (mentally weak)\nDamn you look so pretty (so pretty)\nWith yo' big ol' ass\nAnd tig ol' bittys\nRed bone, 5'7, 5'9 (5'9)\nFor one night, I gotta make you mine (make you mine)\nYeah I know you gotta a man shawty (shawty)\nAnd you know I got a wife shawty (shawty)\nSo lets strap it up\nI hope the pussys tight\nWe only got one night shawty\n\n(Oobie:)\nI'm not tryin' to be your girlfriend\nJust want a one night stand\nAnd you can't never be my boyfriend\nJust want a one night stand\n\nBoy I know you got a girl\nAnd you know I got a man\nSo lets both respect the game\nAnd have a one night stand\nEverybody wanna know\nBut they wouldn't understand\nSo lets keep it on the low\nAnd have a one night stand\n(2x)\nYou'll be my man, only for one night\nAnd I'll be your girl\nBut only for one night\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "I Don't Give A Fuck", "href": "I_Don%27t_Give_A_Fuck&&7255", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Feat. Mystikal and Krayzie Bone)\n\n(Lil' Jon) okay... okay... okay... okay... okay... okay... okay... WHAAA! OKAY!\n\n(Chorus (Lil' Jon and The Eastside Boys))\nYou ride up to the club nigga, I don't give a fuck!\nShakin' yo' ass in the club bitch, I don't give a fuck!\nDrinkin' Cris in the V.I., I don't give a fuck!\nTalkin' shit 'bout me bitch I don't give a fuck!\nYou gotta pocket fulla money nigga, I don't give a fuck!\nYou drinkin' off with them ho's bitch I don't give a fuck!\nIn the club wit yo' pussy click, I don't give a fuck!\nSecurity on my dick bitch, I don't give a fuck!\n\n(Verse 1 - Lil' Jon)\nDrop dem bow's on dem muthafuckin' pussy ass niggas,\nDrop dem bow's on dem muthafuckin' pussy ass niggas,\nI got that Eastside wit me, I don't give a fuck!\nGot that Westside wit me, I don't give a fuck!\nDrop dem bow's on dem muthafuckin' pussy ass niggas,\nDrop dem bow's on dem muthafuckin' pussy ass niggas,\nI got that Northside wit me, I don't give a fuck!\nI got that Southside wit me, I don't give a fuck!\nWe rollin' deep in this bitch so fuck y'all niggas,\nWe rollin' deep in this bitch so fuck y'all niggas,\nI got that dirty south wit me, I don't give a fuck!\nI got that midwest wit me, I don't give a fuck!\nIf security step up we'll crush dem niggas,\nIf security step up we'll crush dem niggas,\nI got that east coast wit me, I don't give a fuck!\nI got that west coast with me, I don't give a fuck!\n\n(Verse 2 - Mystikal)\nMan (Man) I do this in spite, my mom ain't married, bitch I'm a bastard!\nNigga I fuck over me, you know what I do to these rappers?\nThey come in here huffin' and puffin' and screamin' and cussin' and bustin' me\nFirst\nNigga you betta calm yo' ass down unless you excited to see me in person,\nI'm rollin' with thugs and felons uh, that's 'cause it's on killaz,\nWe gon' teach you ol' punk ass niggas to respect us authority figures,\nYour goin' down boy when we be pourin' up in the club,\nYou're going down boy too bad fuck ya, sorry for ya,\nListen let's not get shook,\nBut I ain't the one to come lookin',\n'Cause all I can tell the police is, I am not a crook,\nI fuck big fine bitches, my dick get hard, watch it grow,\nThen gimme fine head, blow my shotgun, good good don't,\nNow tell me that ain't the life,\nTellin' me my niggas ain't for life,\nNow tell me that shit ain't tight,\nTell me that y'all wanna be just like me,\nI beat these bitches down, I watch these powers up,\nNigga you talkin' shit (huh?!) Ho you better POWER UP!\n\n(Verse 3 - Krayzie Bone)\nY'all niggas ain't ready for this,\nMuthafuckas ain't steady for this,\n'Cause y'all still ain't learn,\nNigga got a 4-4 cocked, and a flow so hot make a muthafucka feel that burn,\nNiggas ain't workin' wit an earn,\nYou stay up off my dick don't back talk my nigga finna' get up in 'em,\nBack up off my dick, if you don't wanna get fucked up then shut up the talkin',\nBarkin' betta block 'em off the nigga talkin', sparkin',\nBetta watch and dodge and nevermind me call it,\nWhere da thugs at up in this bitch,\nFuck a nigga up y'all represent,\nGimme some gin, gimme some hen,\nNaw just gimme both and I'll mix it all in,\nWho wanna take a lil' sip of this sin,\nLet me get ya twisted man,\nNiggas on fire,\nDon't stop droppin' dem that's a lie,\nWe just won't die,\nWe come back flyer than ever, higher than ever this time,\nWe feelin' this rhyme,\nSo any nigga wanna get involved, what you think you can fuck wit my dogs?,\nNigga you thinkin' you rubbin' us while we're thuggin' this,\nDid you think you can fuck wit us, BONE, BONE-BONE-BONE-BONE,\nYou ready to do this the hell with the song,\nWe ain't gotta tell you it's on,\nYou know it's poppin' the glock to put a stop to the ho shit,\nY'all still can't fuck wit us and never will because,\nWe too fuckin' bold, too fuckin' cold,\nWith too many soul-jahs ready to roll with the god damn bones\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Grand Finale", "href": "Grand_Finale&&1838", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Feat. Nas, T.I., Bun B, Jadakiss, Ice Cube)\n\n(SIREN sounds)\n\n(Intro: Lil' John talking)\n\"Yeah! (Yeah!) It's been a long journey getting' to\nThis motherfuckin' point of this Crunk Juice shit. (What?!)\nBut we done got to the last motherfuckin' song niggaz\n(Last shit niggaz!) And I got five of the hottest motherfuckin'\nEmcees in the world, givin' you that gangsta shit!\nIt's the motherfuckin' grand finale!\"\n\n(Verse 1: Bun B)\nWe growin' doja in the basement in that underwater garden (Okay)\nWhen hereon in the bank shed, dry it till it harden\nMake it hash up in the oven (Man), put yayo in the hot plate\nDrain and dry in the freezer, it's obvious we got weight\nI said hard work, that's soft work even with wet work\nBuilt-in clientele so we ain't gotta network (Let's go)\nWe always got work, so we ain't gotta get work\nAnd if you ain't gettin' your work from us you bound to get jerked\nWe yayo experts, we been whippin' the yola since the crackas decided to\nTake the coke from Coca-Cola\nHold the rollers, the king of the Trill\nThe underground as well, you can step in the ring when you feel\nNigga just sound the bell\nCan't sound the heaters in this game, but the grind I'm lovin'\nNigga we passed all that pushin', man it's time for shovin'\nI got the mask, I got the strap, soon as I find the gloves\nWe gonna start exposin' off like Farhrenheit 9/11\n\n(Verse 2: Jadakiss)\nI'ma speak clearly 'cause I don't think they hearin' me\nA nigga only fear's gettin' charged with conspiracy\nI'ca get it right to ya, sticky green white to ya\nWear whatever you want, bullets goin' right through ya\nIf you stressin' to get buried\nMy niggaz'll send you back to the essence in a hurry\nSippin' Crunk Juice, blowin' Dutchies in the Chevy\nTry to figure me out dawg, I'm light but I'm heavy\nYellow lemonheads in the bezzie of the presi'\nAnd yeah, anybody'ca rock but D-Block rock steady (D-Block!)\nFED's don't need no warrants 'cause y'all all informants\nSo I get higher than New York insurance\nTry to keep shit clean like Florence\nMoved on up on the East side 'cause I never lost endurance\nAnd it's all real niggaz, if I ever get a license to carry\nShit, that's a license to kill niggaz\n\n(Verse 3: T.I.)\nI refuse to lose, I rather give these weak dudes the blues\nAnd separate them from they jewels, teach 'em don'ts and do's\nI raise tools, make crews make decisions confused\nAll spectators can say is, \"This lil' nigga's a fool\"\nA short fuse with some loose screws, some unscrewed\nBetter prove, you niggaz pussy as the Moulan Rouge\nSo who guardin' who, you know who to you know what\nTo you know where, goin' 'gainst 'em's too unfair\n'Cause everywhere you do a show he got kinfolk there\nNow you know I ain't no ?, I got ten folk there\nThey ain't powerful as the one at the end of your prayer\nGot you runnin' for your life without a minute to spare\nCatch you dead to the granite, melt the grease in your hair\nWhen I go, them boys is gonna be indecent affair\nGuarantee you nah a real nigga breathin' accounted\nAt your funeral, just your parents and the preacher was there\nHollow, television name-dropper reachin' for help\nSo I ain't gotta say a word, pimp you beatin' ya'self\nYou gon' get what you deserve for disrespectin' the game\nAny nigga with the nerve to say another man name\nWhen that other man ain't even present\nAnd deny it when somebody ask him about it\nThat nigga's a lame, you like to lie on the mic\nHide behind fame, I was a G when I came\nThat's the way I remain\n\n(Verse 4: Nas)\nWho besides the Egyptian-walker, fuckers have a conniption\nMy existence persistent to bring foes misfortune\nI dazzle 'em, like the alderman, Billy Dee in Mahogany, minus the perm\nFrom the tiniest sperm that the mightiest The Almighty can muster\nProject prophet, chronic blockage gives Alzheimer's to youngsters\nAmongst them is me, can't remembers my beefs\nWith who? For what? They screw-face me up, my boo laced me up\nBolinsiaga, flimsy condo with bimbos in south of Kalan Gro in pimp mode\nThe inf' glow on his clothes and you know it's over\nHammer hit pin, pin hit shell, from the shell the slug gonna chew ya\nTry not to lose me, I try not to lose'ya\nMamma say mamma sa mu makasa, fly to Cuba\nTo chill with some politi-kill niggaz who ill\n'Cause y'all niggaz are losers, don't get comfortable nigga\nSay hello to Mr. Bad Guy, get that cash par, I'm the last don\nYou'll ever know so, here you go y'all can take these thoughts\nAnyway I'm chargin' emcees a late fee cost\nSo when y'all done with my style, please break me off\nBut never make Nas mad just in case cross\n'Cause ah, lately y'all don't make me happy\nTo calm my nerve I need the herb GNC don't carry\n\n(Verse 5: Ice Cube)\nWho the fuck is that? It's Ice Cube motherfucka\nHe's a maniac, no I'ma fool motherfucka\nOld school motherfucka, blow through a motherfucka\nWhat you heard about a nigga so true motherfucka\nSee I'm ugly and prettay, I'm polished and grittay\nShoot better than that nigga that tried to kill 50\nSee, niggaz get shittay when I come to their cittay\nWhen I hit the spot that bitch they like -- she cummin' with me\n'Cause I got an ego big as TO, but I'm not an Eagle\nBitch, I roll with Rigo 'cause gangstas don't dance we boogie\nI told you motherfuckas Kobe didn't take that pussy\nGet money, get paid, you can beat that shit\nEven if the DA is a piece'a shit\nColorado got movatos, don't eat that shit\nAnother White bitch lyin' on thee Black dick\nI keep it flippin' like flapjacks, pimpin' like black 'Lacs\nGive niggaz flashbacks, they sweaty as ass cracks\nWhen I hit the tar mat, it feel like a carjack\nNiggaz get out and vanish like Star Treks\nSo fuckin' incredible, I'm so fuckin' credible\nNo matter what happen, I'll never turn federal\nAnd that's my report comin' straight from Cali\nIce Cube is the shit on this motherfuckin' Grand Finale\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Play No Games", "href": "Play_No_Games&&2203", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "I ain't really here to play no games (girl)\nYou already know my name (girl)\nFreaky deaky 'cause it ain't no thang (girl)\nAll fa luuuvvvvvvvvvvv\n\nI ain't really here to play no games (girl)\nYou already know my name (girl)\nFreaky deaky 'cause it ain't no thang (girl)\nAll fa luuuvvvvvvvvvvv\n\nAin't no tellin' what a bitch cha do\nFor the doe she'll probably get on four and fuck the crew\nDown south, up north be the same as bitches\nMan locked up her momma watchin the children\nTalkin' bout my neck my back\nBitch you better learn how to chop rocks if yo wanna get with Crack (uh)\nI been in love once, least I thought that, till I fucked around and hit a draw back\nGot burnt, now you figure the rest. Dick hurt like a pissin beggats\nNow I'm living depressed. Should of known better than to trust a hoe\nEspecially if she wanna know how much doe you hold\n'Cause there ain't too many real bitches, if you got one hold on. You don't wanna be\nNobody's meal ticket (right)\nAnd you know it don't mean shit to me 'cause you know bitches ain't shit to me\n\nI ain't really here to play no games (girl)\nYou already know my name (girl)\nFreaky deaky 'cause it ain't no thang (girl)\nAll fa luuuvvvvvvvvvvv\n\nI ain't really here to play no games (girl)\nYou already know my name (girl)\nFreaky deaky 'cause it ain't no thang (girl)\nAll fa luuuvvvvvvvvvvv\n\nYou see the problem with them busta ass niggaz you was fuckin' with\nAlwayz watchin shit but neva taugtcha shit\nDid he eva tell you some thangs that a playa do\nThat made you wether life was more than a hair do\nBoy I tell you, you better deal with them real niggaz and stay far away from\nFuck niggaz\nDon't be a sucka hell at least not for nothin'\nSuckin and fuckin' well a bitch betta have somethin'\nI need something that's competible, not nothin' young and dumb, but full\nOf cum\nAnd one that's edible or better\nA nigga like t double get it wetter\nSuck and fuck her better than the average nigga\nI need a girl that's into tryin' thangz so I can put it her mouth\nAnd one that ain't into mind games\nI know she's a mommas girls and I'm a street nigga\nAnd once we get together I be that she will sleep better\n\nI ain't really here to play no games (girl)\nYou already know my name (girl)\nFreaky deaky 'cause it ain't no thang (girl)\nAll fa luuuvvvvvvvvvvv\n\nI ain't really here to play no games (girl)\nYou already know my name (girl)\nFreaky deaky 'cause it ain't no thang (girl)\nAll fa luuuvvvvvvvvvvv\n\nATL nigga shawty pimpins how I put it down\nGridin hard at the gate\nSteady ridin' through yo town\n23 on yo truck, ask me if I give a fuck\nRallys on that 75 rollin' up 85\nLookin' for some cut like you tryna see what you gon do\nShawty I ain't playin' no games\nI ain't tryina be yo man\nI just wanna cut you up\nSlice you up like cold cut\nLay you down and eat you up\nShawty, slow up in the butt\n\nNow its something like a freak\nPart time pimp\nBig block cheavy rider all through Decatur\nWanna know my name, well its Big Sam\nAnd I play no games with these hoes, 'cause that lame\nLet me break it down\nTell you right now\nIf you see me in yo town believe its goin' down\nAnd all I wanna do is cut you and you crew\nSo let me know what's up with yo girl and u\n\nI ain't really here to play no games (girl)\nYou already know my name (girl)\nFreaky deaky 'cause it ain't no thang (girl)\nAll fa luuuvvvvvvvvvvv\n\nI ain't really here to play no games (girl)\nYou already know my name (girl)\nFreaky deaky 'cause it ain't no thang (girl)\nAll fa luuuvvvvvvvvvvv\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Real Nigga Roll Call", "href": "Real_Nigga_Roll_Call&&2630", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Lil Jon talking)\nYeah!\nRight about now (what's up)\nIt's time for the real nigga role call\nNow when you hear your city or state being called\nYou put your motherfuckin' middle finger up in this bitch\nATL, St. Louis, Alabahma, Chicago, The Carolina's, Nep Town\nDC, The Bay Area, VA, Miami, New York niggaz, Texas, you know!\n\n(Lil Jon) (Ice Cube)\nY'all niggaz can't fuck wit my niggaz ho! (4X)\n(Pussy Nigga)\n(Lil Jon and Ice Cube)\nMotherfuck that nigga! (4X)\nMotherfuck that bitch! (4X)\n\n(Lil Jon)\nY'all bitches!\nCome on flexin' ass flauntin' ass niggaz!\nMy niggaz!\nBe some real ass trill ass niggaz!\nYour niggaz!\nBe some ho ass pussy ass niggaz!\nMy niggaz!\nBe some head-bustin' gangsta ass niggaz!\nYour niggaz!\nBe some runnin' and scary ass niggaz!\nMy niggaz!\nBe some Roy Jones beat ya ass niggaz!\nYour niggaz!\nBe some cake and handcuffin' ass niggaz!\nMy niggaz!\nBe some \"Send them hoes out!\" niggaz!\nYour niggaz!\nBe some tricking \"Don't pay them hoes!\" ass niggaz!\nMy niggaz!\nBe some Don Juan pimpin' ass niggaz!\nYour niggaz!\nBe some 22 havin' ass niggaz!\nMy niggaz!\nBe some chopper street sweepin' ass niggaz!\nYour niggaz!\nThem ol' half ounce sellin' ass niggaz!\nMy niggaz!\nBe some dirty bird movin' ass niggaz!\nYour niggaz!\nBe some kissin' security ass ass niggaz!\nMy niggaz!\nFuck them hoes and let 'em know ass niggaz!\n\n(Ice Cube)\nSee I'ma mean nigga\nYous afraid nigga\nOl' pretend nigga\nSmile and grin nigga\nI hate a false nigga\nDiana Ross nigga\nSo if ya lost nigga\nMeet the boss nigga\nHe's a super nigga\nWit a groupa nigga\nAct stupid nigga\nI'll fuckin' nuke the nigga\nCause yous a happy nigga\nAnd I'm a nappy nigga\nFuckin' scrappy nigga\nMeet ya pappy nigga\nIts Ice Cube nigga\nAnd Lil' Jon nigga\nSo if ya drunk nigga\nKeep it crunk nigga\nTill you punk nigga\nFeel the bump nigga\nGet yo testifying ass in the trunk nigga\nYou wanna tell nigga\nI'll dump a shell nigga\nSend a frail nigga\nStraight ta hell nigga\nThat's ya shelter nigga\n\"Heltah-a-Skelta\" nigga\nAnd when I belt a nigga\nThey ain't helpin' nigga!\n\n(Lil Jon Talking)\nYeah!\nI see you and your lil click up in the club nigga\nI see y'all niggaz over there talkin' that shit\nBut you know what nigga\nBitch niggaz get dealt wit motherfuckin' real quick!\n\n(Ice Cube)\nHere we come boy\nReal niggaz shoot ta kill betta run boy\nOr you can tell me how I feel as a\nReal nigga\nWhich nigga\nGo get a bitch nigga\nNo better\nHoes better do what I say\n'Cause I'm \"Insane in the Brain\"\nBitch I got Rick James in my veins\nReal niggaz never change\nWe just let it bang\nRoll through the gutter lane\nDaddy said let 'em hang\nAnd cut 'em like its butter mayne\nSkeet skeet skeet - naw that's the other mayne\nCause my skeet never leak out this rubber manye\nT&amp;A ain't worth a niggaz DNA\nThat crazy bitch'll have ya ass off E&amp;J\nFake niggaz got these real bitches bein gay\nTill my peoples come around it's like night and day\nNow she wanna change her God and the way she pray\nAuthentic niggaz all know that's the playa way\n\n(Lil Jon)\nWe runnin' this bitch\nY'all niggaz ain't shit\nWe runnin' this bitch\nY'all niggaz ain't shit\nWe in the club gettin' crunk\nYou in the club gettin' stomped\nWe in the club gettin' crunk\nYou in the club gettin' stomped\nWe in the hood on the block\nYou in the hood gettin' shot\nWe in the hood on the block\nYou in the hood gettin' shot\nWe quick ta show you what we bout\nYou quick to run ya fuckin' mouth\nWe quick ta show you what we bout\nYou quick to run ya fuckin' mouth\nReal niggaz from the east\nAnd we act a fucking beast\nReal niggaz from the east\nAnd we act a fuckin' beast\nWe gangsta niggaz from the west\nPuttin' holes in ya vest\nWe gangsta niggaz from the west\nPuttin' holes in ya vest\nMy midwest niggaz hard\nQuick ta pull ya fuckin' card\nMy midwest niggaz hard\nQuick ta pull ya fuckin' card\nAnd down south we set if off\nBlow ya fuckin' face off\nAnd down south we set if off\nBlow ya fuckin' face off (real nigga role call!)\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Get Crunk", "href": "Get_Crunk&&9815", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Once again up in that south from my motherfucking mouth\nAnd creeping up on y'all niggas like a motherfucking mouse\nStepping on these tracks like fags and drag queens\nAnd shitting on you busters like I ate some bake beans\n\nBuster me and me's clicks, always making those hits\nWe never straight jam with no busters our no tricks\nGetting in trouble from the sounds of my trunk\nAnd keeping it crunk, keeping it crunk\n\nChorus: What, What (in background)\nNow drop dem bozs' on 'em &lt;repeat 16X&gt;\n\nNigga bozs' bout to turn out the show\nCrankin' up yo' dance flo' screaming GA hoe\nFlipping rhymes and gripping pines with haters looking round\nIt's time lay it down putting it all up on the line\nAin't no love for haters, smoking doug's potatoes\nAll these niggas what they made us from dem' boz and craters\nWhile lame done dipped out, we gained the flip flop\nUnderground where we dwell, the hell with hip hop\nSouthside just reckless, from GA to Texas\nAnd next it's gone be me flexing in a suburban or lexus\nBut it seem like the bigger I be, mo' figures I see\nThe mo' hating niggas try me\nBig baby trick crazy thinking he bout' to fade me\nBetter sit and wait in consequences fo' you feel you can play me\n&gt;From a place called T-town be down in the south\nWhere dem' players throw dem' boz and gold teeth in they mouth\nAnd dump dump if ya' jump jump\nThe club crunk off the funk that we bump bump and pump pump\nThrough yo' speaker when it reach ya' now you tweaking like Beaker\nAll the people out there hype as hell, I guess it Lil' Peter\n&gt;From T-town to Atlanta all the way to Savannah to Alabama\nI be damn a club ain't crunk in this manner\nI can't stand a weak buster\nFor all the freaks, hustla's, to the clothes\nY'all gotta get it crunk and drop dem boz, drop dem boz\n\nI can't afford bigger, how ya' figga'\nThat you gone stop me from stacking six figures\nNow you hating on me, because my game so tight\nAnd could you be mad because I fucked ya' wife\nWell it's true, that's the price nigga check that hoe\nI'm from the ATL player, wear that reckland ro'\nSo stop talking all that shit, and trying to buck\nI'm popping off at the mouth, we get cha' fucked up, now what's up\n\nNow ladies are you tired of trick bitches in yo' mix\nActing like they want, to lick on yo' shit\nCritizing, everything that you do\nAnd telling ya' who, and who not to screw\nNasty hoes, that ain't clean and shit\nThey go around sucking on every dope boys dick\nNow is these hoes really yo' friend or yo' foes\nYou tell me, while ya' drop dem' bozs'\n\nNow if the club packed y'all from wall to wall\nAnd everybody trying to ball, 'cause sizing all\nAin't nothing but love in the air, we geeing and macking\nSome haters off in there, but at least they ain't macking\nYou got cha' cup filled up, ya' niggas is crunk\nPut cha' hands in the air represent where ya' from\nI'm from the GA baby, where freaks is shady\nMan it can be so crazy, so we burn trees daily\nWhen the beat a drop, everybody just lock ya' boz and shake dem' hoes\nAnd proceed to rock, from the front to the back\nWith the blunts and gats, on the hunt for some cat or a fat ass sack\nTear da' roof off the club, show you niggas some love\nAnd fill a swishe up with bud for my g's and thugs\nNow dem' haters keep watching, dem' freaks a jockin'\nThe beats is rockin', so partner want you keep on dropping\nFor my thugs\n\nNow right now I want all my hard niggas to follow me, follow me\n\nBridge: what (until fade)\nThat's how these motherfuckers die, they with the shit talk\n(Repeat 7X)\n\n", "album": {"title": "Certified_Crunk_(2003)&&4582", "genre": "", "year": 2003}}, {"title": "Keep Yo Chullin Out the Street", "href": "Keep_Yo_Chullin_Out_The_Street&&3578", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Big Gipp talking)\nHello what's happening world?\nYo this Big Gipp I've been called down\nBy Lil' Jon and The Eastside Boyz\nTo tell you what's really happening\nOn these streets in the A-town man\nCause you know a lot of shit going on\nA lot of flaw, a lot of people moving up\nA lot of people moving down\nYou know what I mean, but after this\nI'm a tell you the truth now\n\nNow after these 12 bars the world is gonna know a few facts\nAnd after these 12 bars you might get your shoulders in your laps\nSee the neighborhood boys and the economy getting worse\nThe candy lady jumping fifties outta Easter purse\nBill Kammer gone, Shirley Franklin in\nThe GC closed down, Mike Chiles got ten\nThe feds locked the pimps up for pimpin' in the south\nYou may control her mind, but you can't control her mouth\nAnd these R&amp;B stars having sex with the kids\nNeed to be chopped up and castrated and served to the pigs\nOh yeah homeboy, you big time in yo state\nBut around here sucker, you get squeezed like grapes\nThis a word to the wise, the gravy get chunky\nSomebody will pull that steel, throw it up an get funky\nI got that Wayne rims, Winnie the Pooh and Mr. Miyagi\nAnd horse tranquilizers that will fuck up your body\nThe wolves out hunting they looking for new meat\nBetter gather up your guns and keep yo chillin' out the street\nI said the mutant's out hunting, he looking for fresh meat\nBetter gather up your guns and keep yo chillin' out the street, nigga\n\n(Big Gipp talking to end)\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Throw It Up (Remix)", "href": "Throw_It_Up_(Remix)&&7492", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Feat. Young Buck and Pastor Troy)\n\n(Lil Jon)\nLet's go, let's go\nYeah! (yo, yo)\nLil Jon and the motherfuckin' East Side Boyz\n(Ayo), ok, (ayo), Pastor Troy (come on) Yeah!\n(D-S-G-B, come on), we represent for everybody, everybody\nAll the real niggaz in America (come on)\nWhere you at or where the fuck you from (come on)\nWe represent for y'all (come on), who (come on), we represent for\n\n(Lil Jon)\nT-A, throw it up, Naptown, throw it up\nTennessee, throw it up, St. Louis, throw it up\nJ-Ville, throw it up, Mississippi, throw it up\nAlabama, throw it up, V-A, throw it up\nDetroit, throw it up, D-C, throw it up\nDallas, Texas, throw it up, the Carolinas, throw it up\nHouston niggaz, throw it up, Louisianna, throw it up\nThe Bay niggaz, throw it up, let's go\n\n(Lil Jon)\nThrow it up motherfucker, throw it up\nThrow it up motherfucker, throw it up\nThrow it up motherfucker, throw it up\nThrow it up (where you from), throw it up\nIf you scared to throw it up get the fuck out the club\nIf you scared to throw it up get the fuck out the club\nIf you scared to throw it up get the fuck out the club\nIf you scared to throw it up get the fuck out the club\n\n(Lil Jon)\nBack up bitch, get the fuck out my way\nHey, move the fuck back bitch, move the fuck back\nBack up bitch, get the fuck out my way\nHey, move the fuck back bitch, move the fuck back\nWhat you looking at nigga, what you looking at nigga\nNot me or my click, we too trill my nigga\nWhat you looking at nigga, what you looking at nigga\nNot me or my click, we too trill my nigga\nWe too deep off in this bitch, we too deep off in this bitch\nIt's more of us than it is in the club stupid bitch\nWe too deep off in this bitch, we too deep off in this bitch\nIt's more of us than it is in the club stupid bitch\nY'all niggaz over there, y'all niggaz ain't shit\nY'all hoes over there, y'all hoes ain't shit\nWe run this, what, we run this, what\nWe run this, what, we run this, what\n\n(Lil Jon)\nThrow it up motherfucker, throw it up\nThrow it up motherfucker, throw it up\nThrow it up motherfucker, throw it up\nThrow it up (where you from), throw it up\nIf you scared to throw it up get the fuck out the club\nIf you scared to throw it up get the fuck out the club\nIf you scared to throw it up get the fuck out the club\nIf you scared to throw it up get the fuck out the club\n\n(Pastor Troy)\nThe last nigga is the Pastor\nReady to blast ya\nYou know (come on), I don't play no motherfucking games\nD-S-G-B, you know the name\nWood grain in the motherfucking Dooley truck\nGot the black and red seats with the Georgie tuft\nAnd I got my helmet hanging out the window\nReady to bust the head of a fucking pretender\nNigga as soon as I enter you know I'm making noise\nPastor Troy and the East Side Boyz\nA-K bustin', I ride the whole clip\nI cock that hoe and let it motherfucking rip\nTo sank ship is what I live for\nFuck him (haha), fuck her (come on)\nI'm representing, put some more Yak in my mug (come on)\nSo I can throw it up\n\n(Lil Jon)\nThrow it up motherfucker, throw it up\nThrow it up motherfucker, throw it up\nThrow it up motherfucker, throw it up\nThrow it up (where you from), throw it up\nIf you scared to throw it up get the fuck out the club\nIf you scared to throw it up get the fuck out the club\nIf you scared to throw it up get the fuck out the club\nIf you scared to throw it up get the fuck out the club\n\n(Lil Jon)\nYeah, ok, ok, hold the fuck up, hold the fuck up, yeah\nI'm looking round this bitch, aha\nI see a lot of niggaz ain't throwin' up shit, what\nY'all niggaz must be scared to represent your shit, you scared\nYou must be scared nigga, you scared\nFuck that shit, fuck it\nAll my real niggaz, what's up, that's proud of they hood, yeah\nAll my real ladies, yeah, that's proud of they hood, yeah\nAnd they ain't never been scared, yeah\nSay this shit, yeah\n\n(Lil Jon)\nBitch I ain't scared, bitch I ain't scared\nBitch I ain't scared, I ain't scared motherfucker\nBitch I ain't scared, bitch I ain't scared\nBitch I ain't scared, I ain't scared motherfucker\nBitch I ain't scared, bitch I ain't scared\nBitch I ain't scared, I ain't scared motherfucker\nBitch I ain't scared, bitch I ain't scared\nBitch I ain't scared, I ain't scared motherfucker\n\n(Young Buck)\nBorn in the dirty, dirty, stop and they still spinnin'\nThey tried to hit me like 50 but bitch I'm still livin'\nFlinch and I get ya hit, do it like them Georgia boys\nThe A-K with the rubber grip, it's something they ain't seen before\nLook Jon I think they scared, let's bring them down south\nAnd show 'em how the Chevy's look and how our hoes bounce\nShorty don't want no trouble, shorty don't wanna fight\nBut let him keep talkin' I bet ya shorty gon' die tonight\nI planned on gettin' put out the club before I came\nMy hood down for whatever, we all ride with them thangs\nBreakin' bottles across niggaz heads, fuck what a hater said\nThem gangstas don't live long as the ones that ain't breakin' bread\nI tried to keep it up, just quit and let my man's get it\nDon't see no bricks but I still got my hands in it\nCash then I turn a key, I told y'all I'm a blow it up\nG-Unit soldier, my nigga, now come and throw it up\n\n(Lil Jon)\nThrow it up motherfucker, throw it up\nThrow it up motherfucker, throw it up\nThrow it up motherfucker, throw it up\nThrow it up (where you from), throw it up\nIf you scared to throw it up get the fuck out the club\nIf you scared to throw it up get the fuck out the club\nIf you scared to throw it up get the fuck out the club\nIf you scared to throw it up get the fuck out the club\n\n", "album": {"title": "Part_II_(2003)&&1881", "genre": "", "year": 2003}}, {"title": "BME Click", "href": "BME_Click&&3437", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Lil Jon)\nYeah! Yeah! Yeah! Yeah! Check this out (What's Up?)\nIt's your Motherfucka Boy Lil Jon (That's Right)\nBME Click (yeah!) represent right (yeah! Yeah)\nNow IIIIII just got to get some shit out my chess (let it out)\nIt's a lot Fuck Nigga been talking shit 'bout me,(fuck)\nFuck but you know what?\nPussy Nigga I Don't give a fuck\nI'm a Real Nigga, Real Nigga Handle His Motherfucka bizness like my nigga about to do right now\n\nVerse 1: (Bezel)\nWhateva Bezel give ya goin' be fi yi yi\nDrop some acid in ya drink make ya see ta da\nI don't care if my girl just a leg n' a thigh\nShe better spread her thighs let me hear her ayi yi yi\nThey say if you wait a little while good things'll come\nDrink come get yours but you blink and it's gone\nPatient dude I really can't wait that long\nBeen layin fools down way before that 8ball song\nI Like that benze go ahead and run that man\nBoy you'ze a ho I think you jwanna man\nIt's not your boy from D12\nIt's ATL\nOne of the sickest dudes out they like ain't he well\nAdamville ain't changed\nIt's still the same\nThey thought knockin' ??? would stop the cane\nBoss the plane they livin' on fantasy island\nDouble move if a quake made Atlanta Island\n\nVerse 2: (Don P)\nThis ya boy Don P\nAKA get away from me\nI don't play I just ride\nHow they gon' see nigga I don't hide\nNever had a watch so I never had the time\nAlways had money but I stayed on the grind\nGirls give me head so I gotta million miles\nWorld's most wanted I done did a million crimes\nGotta be (established?) that I'm twice platinum\nGimme some space nigga back back some\nAin't really smart but ain't that dumb\n????? Nigga you can keep it crunk\nI don't drop hits nigga I drop bombs\nForget bein' a star nigga I'm a fuckin' sun\nNigga lookin' at me talkin' 'bout it's all good\nKings of crunk nigga comin' through yo hood\nBitch\n\nVerse 3: (Black Boi)\nSee I ain't come to play\nI came to spit bars inside cars\nTo let you niggas know where I stay\n285 way don't miss the byway\nOn my high way\nEastside we on that remi and that purple 'round my way\nOkay boy now let me spit it's Black Boi\nOn this here and boy I'm real wit this shit\nI rip drawers off take yo balls off\n'Cause you knew before you came in my room girl you was so sawed off\nWas I wrote off? Oh No\nI was strapped at it bitch\nBefore you close the door now dats fa sho\nWe on that dro when you get up out my car bitch don't slam my door\nMotherfucka\n\nVerse 3: (Dirty Mouth)\nATL is my home\nAnd know my hip keep that chrome\nFor the ones who talkin' shit\nThey better leave me alone\nI ain't playin' no games\nI'm just out for this fame\nGettin' this money is how I see ya gettin' blow from the jane\nKeep your distance I'm 'bout to start movin' this chain\nThis hollow tip gon' be rainin' on the top of ya brain\nHot like lava I'm loadin up this chrome problem solva\nSo watch ya back 'cause here I come dropin' bodies like bombers\nThis smith 'n' wessen is gonna teach you haters a lesson\nAll you niggas keep on stressin how we smoke up the essence\nThis herbal session just keep a nigga full of confession\nSo while I'm diggin' in your purse I keep that heat for protection\nNow gimme your loot\nThis motherfucka gon' make me pimp shoot\nThis motherfucka think I'm plannin' think I'm roody like poo\nYou think I'm gravy I told you boys don't play me for lame\nThis motherfucka that wanted to listen I took his ass out the game bitch\n\nVerse 4: (LA)\nT-R-Y M-E pussy nigga\nLil LA off in this bitch\nReady to bust yo fuckin' shit\nBitch rich nigga if you wanna talk that bullshit\nGon' hate I ain't stun ya runnin' up I'll get ya split\nFrom the bottom to the top\nTop to bottom you will go\nNaw ho I ain't the nigga to be fuckin' wit fo\nSic 'em git 'em split 'em hit 'em\nTear that nigga ass up\nI kill for fun mayne and\nI ain't jokin mayne\nWhat's up back up fuck nigga\nWho you takin' to\nYeah scary ass nigga we comin' for you\nIf you wanna talk shit better be prepared\nTo live and die in the motherfuckin' ATL yeah\n\nVerse 5: (Yo Gotti)\nAin't nothin' like a good ass whoopin' to set it off\nCome how you want it bitch and ya pussy ass off\nThem little niggas ain't gon' fight\nSo I'ma shoot first\nBig nigga wanna tustle so put them hands to work\nDecatur want it Decatur ready Decatur dead in the end\nHo click mo bitch than a?\nChyna and fate wishin yo bitch ass dead\nCrunker then a dog in the south west gate\nI got h*** shakin they ass I got it made\nReal bed bust head with a work and the mail\nWhat's that smell ya dead ass in a hotel\nNo evidence 'cause the gun in the chair\nCramp in my leg from sittin' in the car and waitin\nLil Jon and the esb finna put they hands on ya\nGot claim on yo life the hitman I be\nYou want the job done just holla at me, yeah\n\nVerse 6: (Bo Hagon)\nI can't feel the ground the beneath me\nOne of these hoes is down to freak me\nHaters they shoot rounds to leak me\nHave my family sittin' 'round to weep me\nLife as a hustla an everyday struggler tryin' to double up\nAnd I ain't a fuckin' juggler if you ever try to trouble us\nBetter knuckle up\nThe streets they know what it is\nThey know what the fake they know what the real\nThey go for the kill do what you feel hop in the 'lac flash ya grill\nShow your gold throw your bows\nStay on ya toes and don't trust these hoes\nPlay ya part and do ya thang\nAlways put money before the fame\n\nVerse 7: (Lil Bo)\nY'all niggas don't wanna see me\nRunnin' 'round here hatin' on me\nWanna know what I do wit my cheese\n'84 Silerado Chevy\nNow I can buy that nine eleven\nAnd I can get that Escalade\nBout to hit the corner pop the trunk and let that thang spray\nReppin that GA decatur's where I stay\nNothin' but real niggas and bitches out here 'round my way\nLil Bo I be that nigga quick to pull a trigger\nAn' put some lead in the head of a fuck nigga\n\nVerse 8: (Big Sam)\nWoke up this mornin nigga\nWith a pump and my hand on the trigger\nHad a dream last night I was bein' hated on by a bunch of these fuck niggas\nThese niggas done made me slip now into my alias now\nCoup de gras SWAT officers and all these haters and these niggas right now\nFrankly I'm hot and pissed\nThis shit is ludacris\nSame niggas you grew up wit nigga\nSame niggas get they wig split\nSo keep flexin' and talkin' and get your ass whipped\nMotherfucka you must not know who you fuckin' wit\nI'm DJ 64 that nigga XL\nBig Sam sayin' this shit to let you know what's real\nYou bitch bitch ho ho\nAss ass nigga nigga\n\nWe Ain't Playing\nMoney Slingin\nJustifying Gangsta ridin'\nMore Rich them shit\nI'm just singin' ATL ain't fucking playing\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Lovers & Friends", "href": "Lovers_%26_Friends&&2714", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Intro: Usher (Lil Jon))\nUsher\n(Lil Jon, Ludacris!)\nYeah man, once again its on (It's on)\nYou know we had to do it again right\n(We had to do it again boy!\nI want you to sing to these niggaz man)\nUh Oh Oh Oh\nI guess I'll go first\nLet me at em\nCheck me out\nLet's get em\n\n(Usher)\nBaby how you doing? hope that you're find\nWant to know what you got in mind and I\nGot me feeling like Jodeci girl I can't leave you alone\nTake a shot of this here petron and its gon' be on\nV-I-P done got way too crowded\nI'm about to end up callin it a night\nShe should holla at your girl tell her that she came to see\nPulled off beep beep shotgun in the GT with me\nShe said Ooh! I'm ready to ride\n(I was like) yeah\nCause once you get inside you can't change you mind\nDon't mean to sound impatient but you gotta promise baby\nOoh!\n\nTell me again (Tell me again my baby)\nThat we'll be lovers and friends\n(Oh! I gotta know baby, oh yeah)\nTell me again\nMake sure you're right oh before we began\nThat we'll be lovers and friends\n(Ooh! oh it's a good look baby)\n\n(Ludacris)\nTalking: (Really good look baby, look here)\n\nSometime wanna be your lover sometime wanna be your friend\nSometime wanna hug hold hands slow dance while the record spins\nOpened up your heart cause you said I made you feel so comfortable\nUsed to play back then now you all grown up like Rudy Huxtable\nI could be your +Bud+ you could beat me up\nPlay fight in the dark then we both make up\nI do, anything just to feel yo butt\nWhy you, got me so messed up\nI don't know but you gotta stop tripping\nBe a good girl now turn around and get these whipping\nYou know you like it like that\nYou don't have to fight back here's a pillow bite that\nAnd I'll be setting separate plays\nSo on all these separate days your legs can go they separate ways\n\nTell me again (Tell me again my baby)\nThat we'll be lovers and friends\n(Oh! it's a good look baby)\nTell me again (Tell me over and over and over we can)\nThat we'll be lovers and friends\nMake sure you're right before you choose\n\n(Lil Jon)\nI's been knowing you for a long time (shawty)\nBut fuck it never crossed my mind (shawty)\nBut tonight I seen something in you (shawty)\nThat made me wanna get with you (shawty)\nYou ain't been nothing but a friend to me (shawty)\nAnd a nigga never ever dreamed it be (shawty)\nUp in here kissing, hugging, screaming, touching (shawty)\nUp in the bathtub rubber dubbing (shawty)\nAre you sure you wanna go this route (shawty)\nLet a nigga know before I pull it out (shawty)\nI would never ever cross the line (shawty)\nShawty let me hit you tell me one more time\nOne more time\n\nTell me again (Tell me again my baby)\nThat we'll be lovers and friends\n(Oh! it's a good look baby)\nTell me again\n(Make sure you're right oh before we leave)\nThat we'll be lovers and friends\n(Tell me over and over and over we can)\n\n(Usher vocalizing)\n\n(Ludacris (Lil Jon)) 3x\nPlease tell your lovers and friends\nThat Ursher, Jon and Luda had to do it again (Hey!)\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Where Dem Girlz At", "href": "Where_Dem_Girlz_At&&6781", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Hey,\nLil Jon and the East Side Boys (what)\nWhere dem gurls,\nWhere they at,\nWhere dem gurls at,\nWhere thay at Where they at,\nWhere dem gurls\nWhere y'all at\nAll y'all ladies represent to this thing all right\nCome on come on\n\nWhere dem gurls at (oh)\nWhere dem gurls at (I'm lookin' for them gurls)\nX4\n\nYou got a job (yeah)\nYou ain't no slob (no)\nYou got them benefits (yeah)\nYou don't take no shhhhh (no)\nYou stack your chips (yeah)\nYou drive in brand new wheels (yeah)\nYou ridin' on dubbs (yeah)\nYou don't mess with scrubs (no)\nYou keep your hair tight (yeah)\nYou go home at night (yeah)\nYou got them pretty toes (yeah)\nWithout no dough (yeah)\nYou wear them 3-inch heels (yeah)\nYou can cook a good meal (yeah)\nYou like to have sex (yeah)\nBut not unless they get it wet (HEY)\n\nYou like to like that thang (yeah)\nYou ain't got a man (no)\nYou can drop it down low (yeah)\nAll the way to the floor (yeah)\nYou smoke that green (yeah)\nYou a sexy thing (yeah)\nYou got you belly pierced (yeah)\nYour jaws aren't fearse (NO)\nYou keep ice around your neck (yeah)\nFour can be next (yeah)\nYou like them thugs (yeah)\nThe ones that spend g's in the club (yeah)\nYou wear GG Harmer (yeah)\nYou take trips in the summer (yeah)\nYou gots them little heals (yeah)\nYou spend big face bills (yeah)\n\nOkay, Okay check this out,\nWere going to break the beat down right now,\nNow everybody listen to me\nNow this dance, this song ain't for everybody\nAll those sexy ladies (all those sexy ladies)\nSo only the sexy ladies make some noice for me right now (where y'all at make some noise Whoo)\nCheck this out\nAll the sexy ladies in the place\nI need y'all to sing along with me one time\nI love myself\nI love myself\nI love my sexy self\nAll right All right, Hey\nX2\n\nHey Hey Hey\nSay wer lookin' lookin' for them girls\nHey Hey Hey\nWhere them girls at Where they at Where they at\nHey Hey Hey\nLookin' for them girls\nEast side world wide\nHey Hey Hey\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "Chris Rock Let's Be Friends", "href": "Chris_Rock_Let%27s_Be_Friends&&9862", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Look I hate when a Bitch says lets be friends\nYeah I wanna be the friend that's fuckin' you in the ass bitch\nThat's the type of friend I wanna be\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Knockin' Heads Off", "href": "Knockin%27_Heads_Off&&5211", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Feat. Jadakiss, Styles)\n\n(Lil' Jon)\nCome on, yeah OK\nMotherfucker, y'all know who it is\nLil' Jon, them motherfuckin' East Side Booooyz\nI got my nigga Jadakiss with me too (D-Block, live son)\nWe gon' do this for all the real motherfuckin' niggas\n(Uh uh uh uh yo)\nHolla at them niggas J, come on\n\n(Jadakiss)\nYeah, Kiss name known, matter fact, Kiss name blown\nAnd bitches always wanna hit me like I just came home\nBut I still put the tools in ya mouth\nNiggas know that I'm a monster on the East, but I'm huge in the South\nThis is evil in the trenches and everybody starvin'\nSo to get the money right we put the deisel on the benches\n\"Down Bottom\" feel like the ol' days\nFuckin' with the corn liquor ridin' around listen to O'Jays\nWhen we loadin' the clip every slug gotta catch\nWhen you goin' to war every thug got his match\nSS baby, blue Impala with the mack in it\nBig gold cup with rhinestones with my pack in it\nIt's like the jungle but the broads is fine\nAnd if they ain't puffin' crippie, then this Georgia fine\nListen, I'm the wrong nigga to style with\nMy motherfuckin' problem to reconcile with\nNigga what\n\nWe knockin' heads off, yeah\nWe knockin' heads off, yeah\nWe knockin' heads off, motherfuckin' heads off yeah\nWe knockin' heads off, yeah\nWe knockin' heads off, yeah\nWe knockin' heads off, motherfuckin' heads off yeah\nYou wanna go nigga\nLet's go ho\nYou wanna go nigga\nLet's go ho\nYou wanna go nigga\nLet's go ho\nYou wanna go nigga\nLet's go ho\nWhat... what... what... what... what\n\n(Lil' Jon)\nPussy... niggas... lay it... down\nMe and my... niggas... fixin'...clown\nPussy... niggas... lay it... down\nMe and my... niggas... fixin'...clown\nWe throw our... fuckin'...click up\nWe give a fuck if you don't... like us\nWe throw our... fuckin'...click up\nWe give a fuck if you don't... like us\nDon't... like... them... niggas\nCan't... stand... that... bitch\nDon't... like... them... niggas\nCan't... stand... that... bitch\nWe'll... shut the... club down\nIf y'all... niggas... wanna clown\nWe'll... shut the... club down\nBitch... say... something now\n\n(Lil' Jon)\nWhaaaat... Whaaaaat\nY'all know when the beat breakdown and shit\nWhat's up, what's up\nIt's time to get motherfuckin' buck wild in this biiiitch\nNow this what I want y'all niggas to do, what's up\nAll the real niggas and ladies out there, OK\nY'all need to repeat after me, right now\nI ain't scared of no nigga, I ain't scared of no bitch\nI ain't scared of nobody in ya motherfuckin' click\nI ain't scared of no nigga, I ain't scared of no bitch\nI ain't scared of nobody in ya motherfuckin' click\nMan fuck that shit nigga, fuck that shit man\nMan fuck that shit nigga, fuck that shit man\nMan fuck that shit nigga, fuck that shit man\nMan fuck that shit nigga, fuck that shit\n\n(Lil' Jon)\nYeah, BME ho, we up out this bitch\nRuff Ryders ho, what's up\nBut before we leave\nI gotta let my nigga tell you his name\n\n(Styles)\nI'm Holiday Styles, where the fuck you thuggin' at\nI knock off ya head with a Louisville Slugger bat\nP'll go to war and ain't never have to bring a nigga\nMy gun is armed and my bullets like a finger nigga\nCall up Lil' Jon and them East Side Boyz\nAll I need is a lil' bomb and them East Side toys\nYou can catch me in the Dirty South, I got a dirty mouth\nSittin' on the roof with the fuckin' 30-30's out\nI told you I'm a menace y'all\nI got enough guns to fill up the Lennox Mall\nIn the front parking lot, coke still movin' good\nGuns still sparke a lot\nHustlin' with family, partyin' with murderers\nD-Block and everything, shit you probably heard of us\nYeah I'm a Ryder nigga, you ain't got a gun\nOr a motherfuckin' knife, you ain't even gon' try us\nI'll leave you with a hole daddy\nAnd for the fact that I'm in the Dirty South\nI'll be bouncin' in the old Caddy\nWhat - motherfucker\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Nasty Girl", "href": "Nasty_Girl&&8755", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "I hate Shoshona with a passion.\nShe's in bed with Cory and Michael Jackson.\nShe's a hoe but she's our chaperone.\nShe lied to Nina's parents on the telephone.\n\nI hate Shoshana, she has no cares.  \nShe's not good for children.\nShe has a fake tan, she's a Fake and Baker.\nShe works out at the gym so nobody can take her.\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "Who U Wit", "href": "Who_U_Wit&&2436", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Computer Voice)\nIght, Ight, Ight, Ight, Ight, Ight, Ight, Ight,\nIght, Ight, Ight, Ight, Ight, Ight, Ight, Ight\n\n(Come in after 7th Ight)\nWuz up, wuz up, wuz up, wuz up, wuz up, wuz up, wuz up\n\n(Eastside Boyz with shout outs)\n\n(Chorus: (Shake sumethin'))\n(In background)\nWho you wit', who you wit', who you wit',\nGet crunk, who you wit (repeat 4x)\n\nTo the flo', to the flo', to the flo', to the flo', to the flo',\nTo the flo, let's go, let's go, to the flo', to the flo', to the flo',\nTo the flo', to the flo', to the flo', to the flo', let's go\n\nGet 'em up (repeat 16x),\nJust bounce, just ride (repeat 8x)\nJust ride (repeat 15x)\n\nGrab shawty (repeat 16x)\nNow hump, now hump, now hump, just hump (repeat 4x)\nAy, Ay, Ay, Ay, Ay, Ay, Ay, Ay, Ay, Ay, Ay, Ay, Ay, Ay, Ay, shawty\n\n(Hook 4: (suup in background))\nJust drop (repeat 15x),\nAh, Ah, Ah, Ah, Ah, Ah, Ah, Ah, Ah,\nAh, Ah, Ah, Ah, Ah, Ah, Ah, like this\n\nFreak sumethin' (repeat 7x)\nShawty (repeat 2x)\nLittle lower now (repeat 8x)\nGet higher now (repeat 8x),\nAy! (repeat 15x), shawty\n\n(Hook 6: (ight in background after 10th wuz up!))\nWuz up! (repeat 16x)\n\nJust bounce (repeat 16x)\n\nEastside playa's don't give a what\nWestside playa's don't give a what\nSouthside playa's don't give a what\nSo put 'em up, so put 'em up (put 'em up)\nHighclass playa's don't give a what\nEastside playa's don't give a what\nWestside playa's don't give a what\nSo put 'em up (put 'em up), so put 'em up\n\n(Hook 9: (ight in background))\nGet Crunk (repeat 10x)\n\n(Chorus: (until fade))\n(Ight in background)\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "Da Blow", "href": "Da_Blow&&4940", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Da blow\nDA pills\nDa yak\nDa herb\nDa blow, Da blow, Da blow, Da blow, Da blow\n\n(Lil Jon)\nDA dro, Da purp, da ounce, get Pushed.\nGet back, no halfs, no wedge will give ya hash.\nI'll join ya two, but do ya niggas smoke a blunt of this.\nYou wanna smoke wit me, don't bring no bullshit.\nDa blue dolphin, white spinners, tha green nickles.\nThat red superman, that peach butter fire, that white rolex.\nYou'll have them hoes hotter than a box of stolen checks.\nThe snow, the white, in Miami get crunk.\nWhen I see 'em in tha club they be sniffing up that skunk.\nGimme 1g o' white, Gimme 2g o' white, Gimme 3g o' white, an eight ball for the night.\nIf you wanna get cha lean on there's nothing but that yella.\nI done heard down in Texas them niggas got whateva.\nOne bottle of that moon, gally gally of that henna, mix it wit that crunk juice, we'll have a nigga spinnin like that.\n\nDa blow\nDa pills\nDa yak\nDa herb\nDa blow, Da blow, Da blow, Da blow, Da blow\n\n(Gangsta Boo)\nYeah I got that weed for the low.\nThose pills for tha low.\nThat blow for tha low.\nYoung nigga you ain't know.\nWhen I ride I roll high.\nMan an I ain't telling no lie.\nWhen this shit get in my brain, I grip the grain and fly by.\nSay dawg you got that good up in tha hood we calling mint.\nRight another thing we do, some call it blow, some call it cocaine.\nFuck head nah nigga, I've been on that beans, beans, hard bouncing front to back.\nWatch me change the lane lane.\nCause don't be talking that shit, the shit that I get, you bitches can't get.\nFrom Memphis to A the north the south is on the ground and will not quit.\nThe under under ground rep.\nSmoked out, fulla green, fuck what cha heard bitch yeah I'm back up on tha scene.\nIf you wanna get high, you should fuck wit gangsta boo, I be turning niggas out.\nWatch how quick I turn you into a smoked out, loaked out, freaky motherfucker, on that exed out passed out.\nWhile I put another on da...\n\nDa blow\nDa pills\nDa yak\nDa herb\nDa blow, Da blow, Da blow, Da blow, Da blow\n\n(Lil Bo)\nI been getting in that work.\nI got pounds on this purp.\nI'm a pimp bitch fuck you pull up your own skirt, skirt.\nWe don't give a fuck, 26's on the truck,\nFuck around until you show up, we gon' tear this bitch up.\nI got x, I got weed, I got anything you need.\nWhen you see me in tha street, just holla at me, throw a dolla at me, bitch swalla at me.\nThis ya boy lil bo from tha E.S.B.\n\n(Big Sam)\nSee nig I smoke everyday.\nI'm 'bout to light up sum hay.\nI got that shit that will put your mind up in the day.\nNow I don't fuck wit tha blow, but see I fuck wit sum hoes, that be freaky rubbing theyself on x outta control.\nI remember back in tha day, wit those eights an fours.\nWhen nigga was ridin' the city tryin' to get to the dough.\nBut we the best in this town, and tryin' to shut Atlanta down.\nNigga was slanging nicks, and dimes, quarter, ki's, and pounds.\n\nDa blow\nDa pills\nDa yak\nDa herb\nDa blow, Da blow, Da blow, Da blow, Da blow\n\nUnderground.\n\nUnda-Underground South.\n\nKeep it crunked up.\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Bounce dat Ass", "href": "Bounce_Dat_Ass&&8865", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Get the fuck out the way, cause here they come\nThem hoes shakin' that ass\nGet the fuck out the way, cause here they come\nThem hoes shakin' that ass\n\nBounce that ass hoe\nBounce, bounce, bounce that ass hoe\nBounce, bounce, bounce that ass hoe\nBounce, bounce, bounce that ass hoe\nNow that drop that shit\nDrop, drop, drop that shit\nDrop, drop, drop that shit\nDrop, drop, drop that shit\nDrop that shit\n\nGet yo ass to the floor and shake ya rump\nGet yo ass to the floor and shake ya rump\nGet yo ass to the floor and shake ya rump\n\nShake, shake, shake, shake\nShake, shake, shake, shake\nShake, shake, shake, shake\n\nBounce yo ass to the beat while you touch yo feet\nBounce yo ass to the beat while you touch yo feet\nBounce yo ass to the beat while you touch yo feet\n\nPop that thang and roll with it\nPop that thang and roll with it\nPop that thang and roll with it\n\nBounce that ass hoe\nBounce, bounce, bounce that ass hoe\nBounce, bounce, bounce that ass hoe\nBounce, bounce, bounce that ass hoe\nNow that drop that shit\nDrop, drop, drop that shit\nDrop, drop, drop that shit\nDrop, drop, drop that shit\nDrop that shit\n\n(Chyna Whyte)\nI'ma shake-shake it like I wanna\nBounce-bounce it on the floor make you see I wanna\nWalk-walk it like a dog right there on the corner\nMake you say \"Who that girl with that Thug Life tatted on her\"\nSee people want it ha that's how we do\nScreamin' \"Ah-yah-ya-yah\" me and my crew\nLive in a zoo\nThat why I got a strap too\nTwurk that ass if I want blow a bag boo\nAnd act a donkey, act a monkey\nGet a fifth of gin to see this chick get funky like a junkie\nShow what this raw darlin'\n6 years of hustlin', see where it brought me\nThis ghetto monkey, I'm livin' lawless\nLivin' life is the hardest\nTryin' to live marvelous in a world full of garbage\nI'ma talk it\nIf you don't want it, don't start it\n'Cause I'ma put it down the way you want it\nNigga\n\nBounce that ass hoe\nBounce, bounce, bounce that ass hoe\nBounce, bounce, bounce that ass hoe\nBounce, bounce, bounce that ass hoe\nNow that drop that shit\nDrop, drop, drop that shit\nDrop, drop, drop that shit\nDrop, drop, drop that shit\nDrop that shit\n\nGet the fuck out the way, cause here they come\nThem hoes shakin' that ass\nGet the fuck out the way, cause here they come\nThem hoes shakin' that ass\nGet the fuck out the way, cause here they come\nThem hoes shakin' that ass\nGet the fuck out the way, cause here they come\nThem hoes shakin' that ass\n\n(Lil' Jon)\nPop that pussy hoe\n(Repeat 3x's)\nGrab that pussy hoe\n(Repeat 3x's)\nButterfly hoe and let that pussy breathe\n(Repeat 3x's)\nPop, pop, pop that thang girl\n(Repeat 3x's)\nShake, shake, shake that ass girl\n(Repeat 3x's)\n\nBounce that ass hoe\nBounce, bounce, bounce that ass hoe\nBounce, bounce, bounce that ass hoe\nBounce, bounce, bounce that ass hoe\nNow that drop that shit\nDrop, drop, drop that shit\nDrop, drop, drop that shit\nDrop, drop, drop that shit\nDrop that shit\n\nB-B-Bounce that ass hoe (Shake, shake, shakin' that ass)\nB-B-Bounce that ass hoe (Shake, shake, shakin' that ass)\nB-B-Bounce that ass hoe (Shake, shake, shakin' that ass)\nB-B-Bounce that ass\nB-B-Bounce that ass\nB-B-Bounce that ass hoe\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "Weedman (Skit)", "href": "Weedman_(Skit)&&3523", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Meanwhile, at another part of the studio...\n\n(Man): Feel like who been in dis muthafucka fo' a week.\nGot damn! I gotta shit! We ain't got no mo' weed,\nGot 1 blunt left... Ay, Jon?!\n\nLil' Jon: Yo!\n\n(Man): Man, I gotta shit! You need ta call da Weedman an'\nTell him ta bring some weed an' some inscents!\n\nLil' Jon: Heh heh... aight, lemme hit da nigga ri' now\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Nothin' On", "href": "Nothin%27_On&&3280", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Oobie Sings)\nAs the night aproaches I, decide that I'ma call my favorite guy\n'Cause I don't wanna be at home alone, I wish that you would hurry home\nSo baby trust me It's going on, better hurry home to me\nGotta surprise for you... there's nothin' that I won't do... for you so\n\n(Chorus: Oobie) 2x\nTonight I'll sleep with nothing on\nSo make sure that you hurry home\n'Cause I'll be waiting for you, waiting for you, waiting for you\nWith nothing on\n\n(Rap by Chyna Whyte)\nI'm hittin you on the two-way, shit, 'cause I want it bad\nAnd I ain't thinkin' 'bout nothing but\nYou and me blowing hash in the midnight hour\nI know you thugging in the streets bout your money\nBut best respect this pussy got the power\nYou can't deny the way I twurk this here\nI'm talkin' freaky on this here come one and work this here\nAnd bust it open like I'm bout to get burnt in here\nI do my dirt in here, you know what I'm workin with\nThese titties perky, I ain't a virgin you ain't gotta worry 'bout a thing\nJust lay back 'cause I'm on a mission to please\nAnd I got plenty doe whodie so I ain't lookin' for cheese\nNot tonight I got a quarter pound of that weed\nAnd we can go to the verge, come one put it all in me\nI like it real deep, wit no rubber so that you can feel me, you feel me?\nI got your bitch wantin to kill me behind the snapper\n'Cause I fucks like a master, and suck like I'm dracula\nAnd I ain't caught up in the rapture\n\n(Chorus: Oobie) 2x\nTonight I'll sleep with nothing on\nSo make sure that you hurry home\n'Cause I'll be waiting for you, waiting for you, waiting for you\nWith nothing on\n\n(Rap)\n(SHAWTY!) My baby momma sleeping (yeah) so tonight I'm creeping (uh huh)\n20 west, to where you rest, your heads the best (that's rite)\nI bust on your chin (skeet skeet motherfucker) you rub it in (hah)\nYou make a preacher man sin\nNow we butt naked fucking all on the floor (uh huh)\nI got you screaming louder than a 2 doller hoe (uh huh)\nI'm beating that pussy up like a heavy weight fight (uh huh)\nYa came 3 times, how that dick girl (oobie whispers: TITE)\n\n(Rap)\nGirl I hit the door with nothing in my mind\nSo when you feeling freaky baby call me anytime\nYou say tonight, no small talk or foreplay\nOn that purple 'dro, allassy, and hennessy\nAll the freaky things you do got me going crazy\nGot me thinking to myself can you be my lady\nBut hell naw, 'cause I can't fall in love wit the cut\nJust stop by to hit it quick and get enough, a-get enough\n\n(Chorus: Oobie) 2x\nTonight I'll sleep with nothing on\nSo make sure that you hurry home\n'Cause I'll be waiting for you, waiting for you, waiting for you\nWith nothing on\n\n(Oobie sings) 2x\nTonight I'll sleep with no clothes on\nSo make sure you hurry home\nI'm waiting aa-all alone\nDon't make me, wait too long\n\n(Rap by Bo Hagon)\nI'll beat the pussy up and leave you in bed legs shaken\nWake up alone by 2 in the morn' like damn, Hagon\nCareful what you ask for cause you just might get it\nAnd once I came would you swallow or spit it\nI know you freaky you don't have to admit it\nI take 'em petite, or thick in the thighs\nI like to fuck 'em while I look in they eyes\nSo go on, cut up, girl toot your butt up and do your thang\nSad but I knew your pussy before I knew your name\n\n(Chorus: Oobie) 2x\nTonight I'll sleep with nothing on\nSo make sure that you hurry home\n'Cause I'll be waiting for you, waiting for you, waiting for you\nWith nothing on\n\n(Oobie) 2x\nOoh nana nana, ooh nana nana\nOoh nana nana, ooh nana nana\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "What U Gon Do", "href": "What_U_Gon_Do&&1673", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Feat Lil Scrappy\n\n(Lil' Jon)\nYeah\nWhat... What\nCheck dis out right (Yeah)\nLil' Jon and the motherfuking East Side Boyz\nThe Kings of Krunk\nBack at you with some new shit\nNow just because we went platinum and shit don't mean we gone change nigga\nWe the muthafuking Kings of Krunk and we gon' always keep this muthafucker krunk\nNow let's talk about some more music\n\nIf you roll up in the club and them niggas wanna fuck\nWhen you step up to they face what they gon' do shit\nIf you roll up in the club and them hoes aren't acting up\nWhen you step up to them hoes what they gon' do shit\nWhat they gon' do shit (repeat 8 times)\n\n(Lil' Jon)\nPussy nigga what's up,\nHell nah you ain't gon' fuck all that poppin' at the mouth gon' get you fucked up...\nPussy nigga what's up,\nHell nah you ain't gon' fuck all that poppin' at the mouth gon' get you fucked up...\nYou don't came in the club wit yo muthafucking click...\nWe don't give a fuck hoe, y'all pussy like bitches\nYou don't came in the club wit yo muthafucking click...\nWe don't give a fuck hoe, y'all pussy like bitches\nIt's some East-side niggas and they keeping this bitch,\nAnd they step the ass nigga that be talking that shit\nIt's some West-side niggas and they keeping this bitch,\nAnd they step the ass nigga that be talking that shit\nIt's some North-side niggas and they keeping this bitch,\nAnd they step the ass nigga that be talking that shit\nIt's some South-side niggas and they keeping this bitch,\nAnd they step the ass nigga that be talking that shit\n\n(Lil' Scrappy)\nMy brains is taking in too much pain\nI'm bout explode first and then take aim\nBut its cool lil' shorty don't be so alarmed\nI learned to bruise nigga without jabbing the arm\nI don't play wit muthafuckers cause this shit be real\nMake ya hold ya breath longer than a navy seal\nAnd them hoes will leave yo ass dead in the path\nLike the way you came nigga yo dick from yo ass\nI break bones with my niggas\nFuck hoes with my niggas\nHow the fuck you think I feel bout deforming yo figure\nIt's a close casket\nFor them hating basket\nIts some g's that's real and some messed up fagots\nWho you talking to bitch?\nWhat you gon' do trick?\nWhen its obvious to see that you ain't gon' do shit\nLil' Scrappy the Prince and I ain't taking no chump\nI'm a quiet krunk nigga and fuck being a punk\n\nYeah... Yeah... Yeah\nI'm looking round dis muthafuking club (What)\nThem niggas still muthafuking looking over here and shit (looking over here and talking and shit)\nThink we gonna get some muthafucking straightening in the muthafuker (Yeah)\nDis what we gon' muthafuking do (What's up)\nWe gon' walk over to dis muthafucking niggas (Yeah)\nAnd talk to their ass like dis\nOnly bitches' talk shit (What)\nOnly bitches' talk shit (What)\nOnly bitches talk shit that's why we bustin' yo shit\nOnly bitches' talk shit (What)\nOnly bitches' talk shit (What)\nOnly bitches talk shit that's why we bustin' yo shit\nWe real niggas (what) y'all hoes (y'all hoes)\nWe real niggas (what) y'all hoes (y'all hoes)\nWe real niggas (what) y'all hoes (y'all hoes)\nWe real niggas (what) y'all hoes (y'all hoes)\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Throw It Up", "href": "Throw_It_Up&&6249", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Let's Go! (Let's go)\nYeah!\nLil Jon and dem muthafuckin Eastside Boiz! (okay) (hay yo)\nPastor Troy! (Come On!)\nWe repersentin' for everybody (everybody) (come on)\nAll the real niggas in America (Where you at?) (come on)\nOr where the fuck you from\nWe repersentin' for y'all (who)\nWe repersent for:\nT.A. (throw it up)\nNAPTOWN (throw it up)\nTennessee (throw it up)\nSt. Louis (throw it up)\nTre. Ville (throw it up)\nMississippi (throw it up)\nAlabama (throw it up)\nV.A. (throw it up)\nDetriot (throw it up)\nD.C. (throw it up)\nDallas, Texas (throw it up)\nDa Carolina's (throw it up)\nHouston Niggas (throw it up)\nLouisana (throw it up)\nDem Bay Niggas (throw it up)\nWell Let's Go!\n\n\n(4x) Throw it up Mother fucka throw it up\n(4x) If you scared to throw it up get the fuck out the club\n\n(Lil Jon) (Eastside Boyz)\n(2x) Back up bitch get the fuck out my way\n(Aye move the fuck back bitch, Move the fuck back)\n(2x) What you looking at nigga, what you looking at nigga\n(Not me or my click, we too trill my nigga)\n(2x) We to deep off in this bitch, we too deep off in this bitch\n(Its more of us than it is in the club stupid bitch)\nY'all niggas over there (y'all niggas ain't shit)\nY'all hoes over there (y'all hoes ain't shit)\n(4x) We run this (what)\n\n(Pastor Troy)\nThe last nigga is the pastor (the pastor)\nReady to blast ya\nYou know I don't play no mothafuckin games\nDSGB you know the name\nWood grain in the mothafuckin Dooley Truck\nGot the black and red seats with the Georgia tuft\nAnd I got my helmet hangin' out the winda\nReady to bust the head of a fuckin' pretender\nNigga as soon as I enter you know I'm makin' noise\nPastor Troy and the Eastside Boyz\nAK bustin' I ride the whole clip\nI cock that hoe and let it mothafuckin rip\nTo sank shit is what I live for\nFuck him, Fuck her\nI'm representing. Put some more Yak in my mug\nSo I can throw it up\n\n(Chrorus)\n\n(Lil Jon) talking\nOk ok hold the fuck up hold the fuck up\nI'm looking round this bitch\nI see a lot of niggas ain't throwin' up shit (What)\nY'all niggas must be scared to represent yo shit (You scared)\nYou must be scared nigga (Scared)\nFuck that shit\nAll my real niggas that proud of they hood\nAll my real ladies that's proud of they hood\nAnd they ain't never been scared\nSay this shit\n\n(4X)\nBitch I ain't scared\nBitch I ain't scared\nBitch I ain't scared\nI ain't scared mothafucka\n\n(Pastor Troy)\nI'm gon represent where I'm from\nIn the back of the club my tommy gun\nThough when I chill\nFuckin' burn one\nLeave up out the club it's me and little Jon\nBallin in the Benzes\nSwitchin up lanes\nTalkin' much shit 'cause we deep in the game cocaine\nAll white fuckin' S fucking six\nYoung ass niggas I guess we filthy rich\nMy whole click ready to bust some heads\nImma throw it up bitch and I ain't scared\nPastor Troy mothafucka\nYou know the routine\nRepresent for the home team\nThrow it up\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Bia Bia", "href": "Bia_Bia&&5705", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Bia Bia, why ya actin' like a - like a\nBia Bia, why ya fussin' like a - like a\nBia Bia, why ya lookin' like a - like a\nBia Bia, why ya frontin' like a - like a\n\n(Lil' Jon)\nWell get cho' hands up, get cho' hands up\nStop actin' like a bitch and get cho' hands up\nWell get cho' hands up, get cho' hands up\nStop actin' like a bitch and get cho' hands up\nWell throw yo click up, throw yo click up\nStop actin' like a bitch and throw yo click up\nThrow yo click up, throw yo click up\nStop actin' like a bitch and throw yo click up\nWell what chu' lookin' at nigga, what chu' lookin' at nigga\nWhat chu' lookin' at nigga, what chu' lookin' at nigga\nWhat chu' lookin' at nigga, what chu' lookin' at nigga\nWhat chu' lookin' at nigga, what chu' lookin' at nigga\nNow what chu' wanna do, what chu' wanna do\nGot damn it, fuck nigga what chu' wanna do\nWhat chu' wanna do (You scared), what chu' wanna do (You scared)\nWell nigga fuck you, fuck you, fuck you, fuck you\n\n(Too $hort)\nWell pour me some Bombay and fire up that bomb\nIt's about time somebody checked you, you bitch ass punk\nI heard you slapped ya woman 'cause she told ya the truth\nReal niggas, bring out the ho in you\nUs pimp niggas get a foul ho, we chin check her\nAll you do is play the role nigga, you just an actor\nWon't let a bitch breathe, if she wanted with your's\nYou just a weak motherfucker, so insecure\nHow come she can't leave home without gettin' cussed out\nEvery time you get mad, you say get the fuck out\nBut I told her, I said it's cool, get at me\nCome by the house and get nasty\nI spit the real game\nI rolled her in my Caddy when she yelled my name\nI told her call me daddy\nTrick nigga if you tell me you's a playa, you's a lie\n'Cause you'll never be like Willie Dynamite and Super-Fly\nYou just a...\n\n(Chyna Whyte)\nBump, bump, bump, bump lettin' off shots\nDouble glock, glock, ch-ch, nigga pop pop\nIt don't stop in that Dirty South\nBurn up this whole block, that's what this be about\nNiggas livin' lawless, niggas labeled hardest\nGonna see who's life is shortest\nRegaurdless this whole world to me is garbage\nTryin' to reap my harvest\nI'm starvin' livin' a life of ballin'\nI'm still tryin' to find my callin'\nAnd make a change, look into my eyes all you see is pain\nLook up in the sky all I see is rain, ain't no sunshine\nCall me a monkey, but look I got Kay Nine bloodlines\nWith P-9's and semi-autos, ain't guaranteed tomorrow\nMaintain my burrow\nI represent the slums, ate the crumbs\nNow I'm reachin' for a new height\nNothin' but love and we glued tight\nPlayed and renew sight\nHustlin' for food type\nWho the dopest on the planet BITCH, Chyna Whyte\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "T.I.P.", "href": "T.I.P.&&3046", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Aye was happnen mayn?\nDis ya folk T.I.P da Bankhead Ambassodor, dig dis hea mayn\nMe 'n' my folk, Lil Jon, man ya no wat I'm sayin'?\nWe been puttin' it all da way down since da muthafuckin'\nPhillip's Arena wit da Obney, ya no wat I'm sayin'?\n\nBacc when niccaz wanted ya to cut skool and go kicc it\nIn da muthafuckin' Goldmine, ya no wat I'm sayin'?\nKick it in front of da muthaufuckin' Undaground\nYa no snatch chainz when da sun go down, ya undastand dat?\n\nSo you ain't fuckin' wit no fake nicca\nAye, I'm da muthafuckin' Bankhead Ambassodor\nI rep da West side, he rep da East side to da fullest\nSo we put it all da way down\nDa king of da South and da Kingz of Crunk\nNicca how it get betta den dat, keep it pimpin', I'm serious bitch\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "White Meat", "href": "White_Meat&&3227", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "<b>8Ball</b>\nYa, Full of all kinda drugs high as a giraffe pussy nigga\nBetta not get too close nigga betta not try to push me\nWe got them thangs I mean them thangs that go bang bang\nDon't give a fuck who you is don't give a fuck if you got some change\nTake yo niggas, take yo watch, and take yo diamond ring\nWay back in the game when the niggas used to have to sell rock cocaine\nRight now today, ima grab the mic and bring the pain\nGo fuckin' insane, eveything I say goes straight to yo brain\nLil jon on the beat bout to tear this bitch up out the frame\nYou betta leave if you think you just a little lame\nTuck yo chain don't get caught when this song here come on\nLook at my face that's gon' tell y'all niggas somethin' wrong\n\nI heard you niggas don't like me, like me\nI know you boys wanna fight me, fight me\nI know where yo kids and yo wife be, wife be\nBust a nigga head to the white meat, white meat\n\nI heard you niggas don't like me, like me\nI know you boys wanna fight me, fight me\nI know where yo kids and yo wife be, wife be\nBust a nigga head to the white meat, white meat\n\n<b>MJG</b>\nReal killas jump niggas loud mouth\nRough niggas can't stay outta handcuff\nNiggas ain't enough niggas toughen up\nNiggas some are artillery specialist\nNever the fuckin' less I get pimpin' naturally\nEverly's commin up out of regions\nWhere muhfuckas is needin MJG\nTo speak for 'em prentendin to see for 'em\nI've ran the street with 'em concrete to feet with 'em\nI made them hoes pick up I made them go\nStick them pimp tight MJ fuckin' G em\nLuckliy married to this .45 under my fuckin' seat\nTalkin' bullet pistol solid shootin never shook me\nYou boys can't hook me, listen to what the hook be\n\nI heard you niggas don't like me, like me\nI know you boys wanna fight me, fight me\nI know where yo kids and yo wife be, wife be\nBust a nigga head to the white meat, white meat\n\nI heard you niggas don't like me, like me\nI know you boys wanna fight me, fight me\nI know where yo kids and yo wife be, wife be\nBust a nigga head to the white meat, white meat\n\n<b>Lil Jon</b>\nWe ain't scared of fucked niggas, we ain't scared of whole clicks\nFuck them niggas take they hoes and they motha fuckin' shit\nWe ain't scared of fucked niggas, we ain't scared of whole clicks\nFuck them niggas take they hoes and they motha fuckin' shit\n\nYou think you bad nigga, You thing your hard nigga\nUh, yo click ain't shit we'll pull yo card nigga\nYou think you bad nigga, You thing your hard nigga\nUh, yo click ain't shit we'll pull yo card nigga\n\nWe shoot a bird at a pussy nigga, We roll on a pussy nigga\nI don't give a fuck, Nigga stoll on that pussy nigga\nWe shoot a bird at a pussy nigga, We roll on a pussy nigga\nI don't give a fuck, Nigga stoll on that pussy nigga\n\nI heard you niggas don't like me, like me\nI know you boys wanna fight me, fight me\nI know where yo kids and yo wife be, wife be\nBust a nigga head to the white meat, white meat\n\nI heard you niggas don't like me, like me\nI know you boys wanna fight me, fight me\nI know where yo kids and yo wife be, wife be\nBust a nigga head to the white meat, white meat\n\n<b>Lil Jon</b>\nUh, we some headbussas, Uh, we some headbussas, Uh, we'll crack a niggas skull we some headbussas\nUh, we some headbussas, Uh, we some headbussas, Uh, we'll crack a niggas skull we some headbussas\nUh, we some headbussas, Uh, we some headbussas, Uh, we'll crack a niggas skull we some headbussas\nUh, we some headbussas, Uh, we some headbussas, Uh, we'll crack a niggas skull we some headbussas\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Bia' Bia' Check In", "href": "Bia%27_Bia%27_Check_In&&3935", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Big Kap\nAy yo check this out, supreme figga nigga Big Kap\nRockin' with Lil' Jon, Eastside Boyz, Chyna Whyte &lt;Ludacris nigga&gt;, $hort Dogg\n&lt;Ay tell them niggaz what's up though&gt;\nIf you scared, get the fuck out the club nigga\n\nBia Bia &lt;Get 'em up, get 'em up&gt;\nWhy you actin' like a - like a &lt;Push 'em off, push 'em off&gt;\nBia Bia &lt;Get 'em up, get 'em up&gt;\nWhy you fussin' like a - like a &lt;Push 'em off, push 'em off&gt;\nBia Bia &lt;Get 'em up, get 'em up&gt;\nWhy you lookin' like a - like a &lt;Push 'em off, push 'em off&gt;\nBia Bia &lt;Get 'me up, get 'em up&gt;\nWhy you frontin' like a - like a &lt;Push 'em off, push 'em off&gt;\nRepeat\n\n::Verse 1:: Well get 'em up &lt;Get 'em up&gt;\nPut 'em up &lt;Put 'em up&gt;\nStop actin' like a bitch and get yo hands up\nWell get 'em up &lt;Get 'em up&gt;\nPut 'em up &lt;Put 'em up&gt;\nStop actin' like a bitch and get yo hands up\nWell where you from nigga &lt;Where you from&gt;\nWhere you from nigga &lt;Where you from&gt;\nGod dammit motherfucka where you from &lt;Where you from&gt;\nWell where you from nigga &lt;Where you from&gt;\nWhere you from nigga &lt;Where you from&gt;\nGod dammit motherfucka where you from &lt;Where you from&gt;\nWell represent yo shit - represent yo shit\nSay fuck that clique - say fuck that clique\nRepresent yo shit - represent yo shit\nSay fuck that clique - say fuck that clique\nWell you scared &lt;You scared&gt;\nYou scared &lt;You scared&gt;\nStop actin' like a bitch you scared &lt;You scared&gt;\nYou scared &lt;You scared&gt;\nYou scared &lt;You scared&gt;\nStop actin' like a bitch you scared &lt;You scared&gt;\n\nChyna Whyte\nChyna Whyte don't suck no dicks or lick no nuts\nBitch I hit licks and flip bricks\nEvery two hours switch whips to keep the peoples off me\nWhat you know about that No Doze and coffee\nNo sleep, I 'm lookin' 40\nWith three bricks in a 740\nBitch I ain't got time to party\nI'm breakin' bread with Dominican niggaz\nOver a hot Benigan's dinner\nThinkin' how I'ma cop the 6 at the beginnin' of winter\nChrome it out and then fit it with timber, that's wood grain\nWhat you ain't know, this a hood thang\nAll my thugs let ya wood swang\nBitches make ya ass clap\nI'm takin' all y'all ASCAP and BMI\nCatch me drivin' DUI\nLook 'cause I don't give a fuck nigga I'm livin' or die\nWho on this track fuckin' with me, y'all is willin' to try\nChyna Whyte the thug bitch with no feelin's inside\nMotherfucka\n\nLudacris\nWell pour out the Henn and Coke and fire up that dro'\nIt's Ludacris off Old National and Godby Road\nThe block is sold\nClear then I shot the globe\nI clock the hoes, lock do's and drop the bows\nI rock the shows\nPop, lock, and knock yo nose\nYou Bia Bia, I grab my .44 and mob the flo'\nI mop and glow\nThe Feds tryin' to stop my dough\nThey claim they caught me at the docks with a flock of snow\nI bring the pain\nCock back and swing the thang\nYo girl mad 'cause she told me don't even bring the thang\nAnd then I told her - I said it's cool, get at me\nAnd then my voice got raaasty\n'Cause I was smokin' on some Cali and my eyes were dazed\nI was in the zone, coulda thrown up them tre's\nAnd if you lost, Lil' Jon's got some Eastside ways\nSo stop actin' like a Bia if yo ass ain't blaze\n\nToo $hort\nBitch niggaz in the house tell me what's up\nA nigga slapped you in the mouth and told you shut up\nSomebody holler get 'em and now you just a victim\nShorty tried to stick 'em, told the pit bull to sick 'em\nI know he wanna run but he can't he assed out\nPunched him in his chin and then he passed out\nWoke up with his pockets turned inside-out\nAlways hit them weak motherfuckaz right in they mouth\nYou better stay out the way and act like you ain't havin' shit\nCause niggaz will run up in yo ass like you a nasty bitch\nYou little bitch, that's what the callin' you\nYou'd be a damn fool to act like you ballin' dude\nMindin' yo business, they grabbed you by yo collar\nYou feel like Marvin Gaye 'cause they make you wanna holler\nBut since you can't run, you might as well fight\nQuit actin' like a bitch and live a real life\nYou just a\nBia Bia\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "Bia' Bia' 2", "href": "Bia_Bia_2&&7648", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Bia Bia, why ya actin' like a - like a\nBia Bia, why ya fussin' like a - like a\nBia Bia, why ya lookin' like a - like a\nBia Bia, why ya frontin' like a - like a\n\n(Lil' Jon)\nWell get cho' hands up, get cho' hands up\nGot damn it motherfucker, get cho' hands up\nWell get cho' hands up, get cho' hands up\nGot damn it motherfucker, get cho' hands up\nWell throw yo click up, throw yo click up\nGot damn it motherfucker, throw yo click up\nThrow yo click up, throw yo click up\nGot damn it motherfucker, throw yo click up\nWell what chu' lookin' at nigga, what chu' lookin' at nigga\nWhat chu' lookin' at nigga, what chu' lookin' at nigga\nWhat chu' lookin' at nigga, what chu' lookin' at nigga\nWhat chu' lookin' at nigga, what chu' lookin' at nigga\nNow what chu' wanna do, what chu' wanna do\nGot damn it, fuck nigga what chu' wanna do\nWhat chu' wanna do (You scared), what chu' wanna do (You scared)\nWell nigga fuck you, fuck you, fuck you, fuck you\n\n(Too $hort)\nWell pour me some Bombay and fire up that bomb\nIt's about time somebody checked you, you bitch ass punk\nI heard you slapped ya woman 'cause she told ya the truth\nReal niggas, bring out the ho in you\nUs pimp niggas get a foul ho, we chin check her\nAll you do is play the role nigga, you just an actor\nWon't let a bitch breathe, if she wanted with your's\nYou just a weak motherfucker, so insecure\nHow come she can't leave home without gettin' cussed out\nEvery time you get mad, you say get the fuck out\nBut I told her, I said it's cool, get at me\nCome by the house and get nasty\nI spit the real game\nI rolled her in my Caddy when she yelled my name\nI told her call me daddy\nTrick nigga if you tell me you's a playa, you's a lie\n'Cause you'll never be like Willie Dynamite and Super-Fly\nYou just a...\n\n(Chyna Whyte)\nBump, bump, bump, bump lettin' off shots\nDouble glock, glock, ch-ch, nigga pop pop\nIt don't stop in that Dirty South\nBurn up the whole block, that's what this here we bout\nNiggas livin' lawless, niggas labeled hardest\nGonna see who's life is shortest\nRegardless this whole world to me is garbage\nTryin' to reap my harvest\nI'm starvin' less than a life of ballin'\nYet still tryin' to find my callin'\nAnd make a change, look into my eyes all you see is pain\nLook up in the sky all I see is rain, ain't no sunshine\nCall me a monkey, but look I got King Nine bloodlines\nWith P-9's and semi-autos, ain't guaranteed tomorrow\nName all I borrow\nI represent the slums, ate the crumbs\nNow I'm reachin' for a new height\nNothin' but love and we grew tight\nPlayed and renew sight\nHustlin' for food tight\nWho the dopest on the planet BITCH, Chyna Whyte\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "Push That Nigga, Push That Hoe", "href": "Push_That_Nigga,_Push_That_Hoe&&6414", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Lil' Jon)\n\nYeah! BME hoe\nYeah! a' Lil' Jon hoe\nYeah! Big Sam hoe\nYeah a' Lil Bo' hoe\n\nCheck dis out right...\nI think alot of y'all muthafucka's don' forgot who we is (yeah)\nSo right about now we gon' let you know who the fuck we are (okay)\n\nKings of crunk muthafuckaaaaaaaaa\nAy, ay\n\nPush that nigga!, Push that hoe\nPush that nigga!, Push that hoe\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\n\n(Lil' Jon and The Eastside Boyz)\nMEAN-mug a nigga, MEAN-mug a nigga whuut\nMEAN-mug a nigga, MEAN-mug a nigga whuut\nWhat'cha gon' do nigga?, What'cha won' do nigga?\nWhat'cha gon' do nigga?, What'cha won' do nigga?\nAy MEAN-mug a nigga, MEAN-mug a nigga whuut\nAy MEAN-mug a nigga, MEAN-mug a nigga whuut\nWhat'cha gon' do nigga?, What'cha won' do nigga?\nWhat'cha gon' do nigga?, What'cha won' do nigga?\nTry again nigga (Biyaaa)\nTry again nigga (Biyaaa)\nWe still deeper than yo' muthafuckin' click nigga (Biyaaa)\nTry again nigga (Whut, whut)\nTry again nigga (Whut, whut)\nWe still deeper than yo' muthafuckin' click nigga\nWe shut da club down (Biyaaa!) and start a fight up in dis bitch\nWe shut da club down (Biyaaa!) and start a fight up in dis bitch\nJust keep talkin' shit (BITCH)\nJust keep talkin' shit (BITCH)\nIf a nigga talkin' shit we start a fight up in dis' bitch\n\nPush that nigga!, Push that hoe\nPush that nigga!, Push that hoe\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\n\n(Lil' Jon and The Eastside Boyz)\nIt's goin' down in dis bitch, so nigga guard'ja grill\nIt's goin' down in dis bitch, so nigga guard'ja grill\nYOU ain't crunk nigga\nYOU ain't crunk nigga\nYOU ain't crunk nigga\nYOU ain't crunk nigga\nIt's goin' down in dis bitch, so nigga guard'ja grill\nIt's goin' down in dis bitch, so nigga guard'ja grill\nYOU ain't buck nigga\nYOU ain't buck nigga\nYOU ain't buck nigga\nYOU ain't buck nigga\nEastside in dis bitch, and you know we for real\nWestside in dis bitch, and you know we for real\nYOU ain't crunk nigga\nYOU ain't crunk nigga\nYOU ain't crunk nigga\nYOU ain't crunk nigga\nNorthside in dis bitch, and you know we for real\nSouthside in dis bitch, and you know we for real\nYOU ain't BUCK nigga\nYOU ain't BUCK nigga\nYOU ain't BUCK nigga\nYOU ain't BUCK niggaaaaaaaah\n\nPush that nigga!, Push that hoe\nPush that nigga!, Push that hoe\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\n\n(Lil' Jon and The Eastside Boyz)\nLame ass niggas get-da-fuck out da club\nPussy ass niggas get-da-fuck out da club\nHoe ass niggas get-da-fuck out da club\nAll you fuck niggas get da fuck out da club\nY'all ain't nuttin' but some hoes\nY'all ain't nuttin' but some hoes\nY'all ain't nuttin' but some hoes\nY'all ain't nuttin' but some hoes\n\nPush that nigga!, Push that hoe\nPush that nigga!, Push that hoe\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\nGet crunk\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Move Bitch", "href": "Move_Bitch&&8688", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Feat. Chyna Whyte, Three 6 Mafia, Youngbloodz)\n\nHere we come - here we come hoe - here we come\nHere we come hoe - here we come - here we come hoe - here we come\nHere we come hoe - here we come - here we come hoe - here we come\nHere we come hoe - here we come - here we come hoe - here we come\n\n(Hook - 2x's)\nMove bitch, get out the way hoe\nFuck that shit, get out the way hoe\nMove bitch, get out the way hoe\nFuck that shit, get out the way hoe\n\n(Lord Infamous)\nNigga Three Six Mafia burn inside the southern territorial\nLeavin' a memorial page in editorial\nWhen ? watch yo back go front ?? Scarecrow\nLeave 'em stiff and froze my foes and hit 'em like Rose in China snow\nWanna see the costs of the bosses comin' to toss it\nAin't no losses, ain't no crosses, leave you dead in a closet\nFamily recked from yo death-death, from yo early death\nPackin' some in jars, sendin' two off for the chef\n'Cause I melt them with medicine\nI'm perscription called death when?\n\n(J-Bo)\nOh there she go, old triflin' bitch\nStraight take a hoe nigga, always out to lick\nAnd when shit is gettin' thick\nOut the door she split\nShe straight slick\nBut I'm slicker than that bitch gon' get\nSo now move bitch, get out the way hoe and lay low\nSo say hoe, you just another stank hoe\nTrickin' on the dance flo'\nLookin' kinda slutty though\nI'm all about my money hoe when I bump on yo stereo\nAnd everywhere I go, it's the same old shit\nJumpin' drawz just like a broad, so bitch fuck this now\n\n(Sean Paul)\nThey know me from my Lac's and my creases, I'm Sean Paul (Sean Paul)\nSlap the fuck out of each and all y'all (all y'all)\nI done seen niggaz fall, I done seen niggaz ball\nI done seen big girls shake with lil' bitty drawz (bitty drawz)\nAnd uh, the other day this bitch got smacked in the jaw (in the jaw)\nI done seen a whole lot, niggaz ain't seen what I saw (yeah)\nI'm in it too deep, I could never come flaw (come flaw)\nIf ya talkin' bout that pistol my nigga you better draw\nOkay, always sayin' shit that I mean\nPelle Pelle, A-Town nigga gotta come clean\n\n(Gangsta Boo)\nWhat's up motherfucka what's up\nTime to get real crunk, time to tear the club up\nAll these sissy ass hoes talkin' shit about this lady\nWhy you tryin' to doubt me baby\nI'm the shit, you can't fade me\nNow look what done happened, we done hooked up with Eastside Boyz\nBringin' noise\nMakin' moves like the fuckin' U-Haul boys\nGangsta Boo be groovin' always choosin', what's up with you nigga\nGangsta Boo be makin' nothin' but hits increase to bigger figures\nNigga don't play with the muthafuckin' don't play lady\nOn the way, God damn what you bitches say\nNigga\n\n(Lil' Jon)\nAh, Ah, Ah-ha-ha-ha\nWe comin' through like the Rock bitch\nKnock you out yo motherfuckin' socks bitch\nDroppin' bows like nothin' wrong bitch\nBitch I'll break yo motherfuckin' nose bitch\nDidn't we tell yo ass to move bitch\nNow yo head busted ? two fuckin' bricks\nSo get yo fire and dip hoe\nCause a nigga gone off that Quevo\nWhy you still runnin' yo mouth bitch\nYou must've not known who you fuckin' with\nWe'll leave you dead in a fuckin' ditch\n'Cause we runnin' with the Three Triple Six\nAnd them guns for them young hoes\nWe'll leave ya firm like a dildo\nAll my niggaz doin' Fed time\nWe'll leave yo belly filled with that iron\n\n(Hook 2x's)\n\n(Juicy J)\nI'm lookin' for them big butts\nNothin' but them quick sluts\nSomething kinda freaky like skinny hoe givin' up\nMaybe a nigga'll take the camp\nProbably let her ride my lap\nMade playaz from the Memphis Tenn, bitch I'm on the map\nI'm the kinda nigga bro' push a 450 hoe\nDown the strip, Hennessy I sip on the low-low\nHit me on my ? horn\nCan record, make a porn movie\nDon't be choosy with this nigga Juicy\nReady to?\n\n(Chyna Whyte)\nWhat y'all know to be part of this\nYou gotta be on some heartless shit\nAnd whether it's legal or dirty, I'ma ball regardless trick\nAnd I don't give a fuck if you the tallest or the smallest bitch\nDon't none of you hoes know about this order shit\nChyna Whyte I live that street life\nAnd I ain't gon' be happy till I got my momma eatin' right\nStill the one to grip that motherfuckin' heater tight\nAnd I'm still tryin' to find a motherfuckin' key to life\nYa heard me\n\n(Hook 2x's)\n\n(DJ Paul)\nI might not be the freshest nigga up in the club\nBut shoulda seen when I walked in the hoes said \"What the fuck\"\nThey saw me VIP in the VIP y'all\nWith these Rollies and the ? they be wonderin' \"Who are y'all\"\nWe be steppin' no less than 30 deep and thinkin' we some stars\nMy enterage spendin' no less than 80 G's on they cars\nIf I took you to my crib you probably wouldn't believe or think I'm liein'\nCheck my soundscan hoe, if I'm liein' or dyin'\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "Diamonds", "href": "Diamonds&&8579", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Diamonds in my peace of chain\nDiamonds in my piece of\nDiamond diamonds in my piece of chain\nDiamonds in my piece of\nDiamonds diamonds in my piece of chain\nDiamonds in my piece of\nDiamond diamonds in my piece of chain\nDiamonds in my piece of chain\n\n(Lil Jon Talking)\nYeah\nThis shit right here (what's up)\nFor all my niggas in the south (ok)\nMakin' big dough (know what I'm talking bout)\nMakin' big long dollars\nAll my niggas in H-Town\nNew Orleans, Dallas Texas\nMississippi All over the south\nShit of course the ATL (All over the south)\nAll my niggas rockin' those diamonds and pieces in there chains\n\n(MJG)\nNow we done talked about the pinky ring\nAnd talked about the gold grill\nSo tell me\nWhat's left to give really yo spine a cold chill\nWe call some call 'em diamonds\nWe call 'em ice\nIt varies in the sizes the shape\nThe color and the price\nFrom canary yellow, ruby red to baby blue\nOne stone or maybe two\nFuck it 'cause we all can't be babies fool\nSome of its jazzy\nSome of it can't be real\nNigga say its sittin' platinum\nKnowin' its stainless steel shit\nI seen all kinds of medallions\nOn the necks of rappers\nDrug dealers, Marks, ball players and stallions\n?? Shit they buy them hoes by the dozen\nO.G. nigga get a new piece\nPass the old down to his cousin\nSpell out your name, your corner, your clique\nI know a pimp that got a piece with a bitch sucking his dick\nSo what you waiting for you shy men?\nCome join the fly men\nThat'll push like hymens for (diamonds)\nWith perfect timing\n\n(Bun B.)\nSome folks'll kill to have a real diamond\nYou get some grade A rocks and in 20years they still shining\nNo need to worry, women will find em\nBut if they gaze at yo karrots for to long it will blind em\nCubic Zirconia helped the whole hood fine\nNow that everybody can bling we having good times\nI'm writing clever rhymes feeling like forever grindin\nA diamond in the rough\nBuff me up and hear me shine\nI used to hit these streets and slang\nHussling in these peoples game\nNow its just for piece 'n' thang\nI ain't tryin' to preach you man\nI ain't tryin' to heat your flame\nI just wanna teach your brain\nI'm so full of flavor I'm give some to the weak and blang\nM-J- fucking G\nTouch me I'm in reaching range\nLets hit the beach and hang\nFor pimpin' I'll be the blame\nA ?? droppin' this knowledge will help me explain\nAbout my Diamonds, my pimpin' and my piece of chain\n\n(Chorus (2xs))\n\n(Lil Jon)\nYeah Yeah\nYeah\nBitch I'm coming down\nComing down tough\nBitch I'm coming down with them diamonds I'm my cup\nI'm shining so hard\nMy pinky ring done\nRuby in the middle\nGot yo baby mama frozen\n25 karrots in the BME piece\nTo many karrots in my mother fucking teeth\nIn my chain\nThem thangs\nBig like boulders\nMy rocks cutting up like Taliban soldier\n\n(Big Sam)\nCause down in the dirty it ain't no drama or no beef\nIt's all about them diamonds in yo piece I guarantee\nMan I know a nigga wit a mouth full of gold\nOn the top he had the SOUTH\nAnd on the bottom LIKE Whoa\nBig Sam with 36 off in my chain\n4? off in my wood a woodgrain\nAnd my piece I'm bout to precious cut them thangs\nWith 200 thousand to make that hoe blang blang\n\n(Chorus (5xs))\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Put Yo Hood Up (Remix)", "href": "Put_Yo_Hood_Up_(Remix)&&5672", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Feat. Jadakiss, Petey Pablo, Chyna Whyte and Roy Jones Jr.)\n\n(Intro - Roy Jones Jr.)\nYeah this Roy Jones Jr.\nPound for pound the baddest thing throwin' down\nThe undisputed light heavyweight champion of the world\nWe about to knock niggas heads off with this put yo hood up remix\nLil' Jone and the East Side Boyz\nJadakiss, Petey Pablo, Chyna Whyte\nRepresent y'all in the hood tonight\nYeah, yeah, uh uh\n\nPut yo hood up\nPut yo hood up\nPut yo hood up\nPut yo hood up\nPut yo click up\nPut yo click up\nPut yo click up\nPut yo click up\nRepresent yo shit motherfucker\nRepresent yo shit motherfucker\nRepresent yo click motherfucker\nRepresent yo click motherfucker\n\n(Verse 1 - Jadakiss)\nI hold a 44 from the side angle\nGunshots below the waist'll make ya thigh dangle\nUh you know Kiss, all I do is puff hem all day\nGettin' money in the Bluff or on MLK\nSince they brough gold back\nI bought me a gold mack\nTo explode I leave ya back on Old National\nI'm in a gentlemen's club with gentlemen thugs\nBut they call my hood pool dog 'cause we swimmin' in drugs\nGet high, get drunk, and we get shit crunk\nViolate you might die or just get jumped\nJadakiss, Lil' Jon and them Eastside Boyz\nD-Block, every nigga got at least five toys\nDouble R till they put me in the ground\nAnd I come back as a bullet, nigga put me in the pound\nStop actin' like a bitch you scared\nWhat up niggas the remix, put yo hood up niggas\n\n(Verse 2 - Petey Pablo)\nIt's the dirty boy's home town, yeah bitch I'm on now\nAct any motherfuckin' way I want cause shit I'm in my own house\nMusic - extra, extra loud\nShorties - extra, extra out\nMy flows - four mics, get The Source bitch and check it out\nI came to knock this bastard down\nJuic - ya bleedin' now\nYou be it - the Petey style\nWhy - hit the curb man I got 'em\nWith the open mouth\nAll I hear is oohs and awes\nWhat ya mama said, damn Petey king now\nPow, I'm on they tails now\nHelicopter well now\nFrom Carolina to the ATL, it's hell now\nAh, simmer down, simmer down\nBefore they kick our ass out\nLil' Jon thanks for the sixteen, yeah now\n\n(Verse 3 - Chyna Whyte)\nHa ha, keep the fame nigga I'm in it for the dough\nFuck the glow, what's the sense if you ain't got cash to blow\nI had to shift my gears from fast to slow\nAnd get it past they time\nHopin' that when I call home they dead or press the nine\nI bet yo hood can't fuck with mine\nOoh the language I speak when them people roll around\nAnd niggas just don't crack they leak\nAnd they too quick to quack they beak\nYou hungry nigga's ribs touchin' what\nNow you want half my meat\nYou know the narrow\nNigga I still run with the four pound metals\nStill lacin' the tracks with the pain of the ghetto\nYou boys livin' a dream like the Cosbys\nAnd I'm tell ya one mo' time, no that ain't me on Foxy\nDon't get it twisted I got hitters that'll do you in\nAnd if the Feds come I got hitters that'll do my ten\nWith no problem, on every song I plant my flow blossom\nFrom guns to gospel, Chyna Whyte AKA The Apostle\n\n(Verse 5 - Lil Jon and The East Side Boyz)\nBia bia - put yo click up and shout it out loud\nBia bia - put yo click up and shout it out loud\nBia bia - get buck in the motherfuckin' crowd\nBia bia - get buck in the motherfuckin' crowd\nWe run this bitch, yo click ain't shit\nWe run this bitch, yo click ain't shit\nWe run this bitch, yo click ain't shit\nWe run this bitch, yo click ain't shit\nSay nigga fuck you - fuck you\nNigga fuck you - fuck you\nNigga fuck you - fuck you\nNigga fuck you - fuck you\nNigga fuck you - fuck you\nNigga fuck you - fuck you\nNigga fuck you - fuck you\nNigga fuck you - fuck you\nNigga fuck you - fuck you\n\n", "album": {"title": "Part_II_(2003)&&1881", "genre": "", "year": 2003}}, {"title": "The Weedman", "href": "The_Weedman&&7544", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "We smoke everyday\nOn an average 9,10,11,12 even 13 blunts\nBut when we on our last\nAnd we ain't got no mo grass\nIts time to re up\nGot to hurry up\nGo and re up\n\nSo we just looking for the weedman\nThe weedman the weedman\nAnd we just wanna smoke (smoke)\nWe just wanna smoke (smoke)\nWe just wanna smoke (smoke)\n\nHey I'm getting closer\nTo the weedman\nI think he's somewhere close\nSmell it on his clothes\nLook! There he goes\nNow you don't got to smoke with me (with me)\nBut if you wanna smoke my tree (my tree)\nJust reach into that right (right)\nPocket on yo thigh (thigh)\nAnd show a nigga five\n\nWe don found the fucking weedman\nThe weedman the weedman\nAnd we about to smoke (smoke)\nWe about to smoke (smoke)\nWe about to smoke (smoke)\n\nYeah this yo boy Lil Jon\nWith them Eastside Boyz\nThis yo boy Big Sam and man I'm High\nAye man hold on this yo boy Lil Bo man (smoker)\nAnd I hear music man\nAye we gon take dis shit to 12 play\nFor the blunt\nOnly for the real smokers\nAye got damn fire some shit up to this\nLets go\n\nOne come on nigga pass me the blunt\nTwo I got to cop a sack or two\nThree I got a fluffy bag of this weed\nFour just watch me as I open it and pour\nFive I'm about to role up the nine\nSix we smoking on some real good shit\nSeven watch me as I get high as the heavens\nEight all my niggas smoking real great\nNine getting kinda jiggy in my eyes yeah\nTen I think I wanna smoke some again\nEleven I'm trying to get back to the heavens\nTwelve damn this weed good as hell yeah\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Heads Off", "href": "Heads_Off&&2145", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Big Sam)\nAight, motherfuckers\n\n(Lil' Jon)\nBitch niggas run and hide!\n(Ha, Yeah) I'm doing this for my niggas!\n(Nigga!)\n\n(Big Sam)\nC'mon, C'mon\nC'mon, C'mon\nLil' Jon, C'mon, C'mon\n\n(Lil' Jon)\nM.o.p motherfuckers!\nLil' Jon, Eastside Boyz Bitch!\n\n(M.O.P (Lil' Jon))\n(My Nigga!)\nYou send 'em will bend em\n(My Nigga!)\nYou Call 'em will sprawl em\n(My Nigga!)\nYou cut 'em will bust em\n(My Nigga!)\nTake them niggas heads off!\n\n(Billy Danze)\nAll day nigga, Broadway\nYour man Bill Danze back on the highway\n9-5 way, do or die way\nSince were all gangstaed up we gonna do it my way\nHomicide way, grown wit a metal fist\n(BK!) Home of the chrome deader list\n(Oh Yeah!) Willie Dynamite drop bombs\nNow who wanna conflict wit the conflict\n\n(Lil' Jon)\nWe don't give a fuck you actin' like a bitch motherfucker!\nGet some nuts and be a man motherfucker!\nPussy ass niggas get fucked motherfucker!\nAnd you's a chicken nigga gettin' plucked motherfucker!\nDroppin' dimes snitchin on your whole (was sup) Eastside\nCause nigga you soft like macaroni!\nYou don't wanna see a nigga pull the nine!\nCause you did the crime, now it's payback time!\n\n(Lil' Fame)\nYou's a check one, two turn my mic up nigga\nI'm a semi-automatic load the pipe up nigga\nB-Ville crime boss, I'll knock your top off\nGet ya moms, it be a hell of a story for John Walsh\nBIA BIATCH! Look nigga look into to this\nWhat a ridiculous, conspicuous, son of a bitchuous\nLil Fame's a rude bastard; I left my manners at home\nYou fucked up when you left your hammers at home\n\n(Big Sam)\nWe gonna kick in the door and get buck my nigga\nSlice your ass up like a piece of meat my nigga\nRide ya 'round the town in the fuckin' trunk my nigga\n'Fore we dump your bitch ass in the creek my nigga\nOr we might duck tape your ass to the toilet nigga\nThen turn the iron on high and burn it nigga\nDie at da door and your ass probably highly fryin nigga\nAnd your tombstone will read, \"Here lies a bitch nigga\"\n\n(Billy Danze)\nRide or die nigga, first fam\nMe and mind niggas, will still stand\nI come through this BITCH, with two CLIPS\nFull of blue TIPS to show them who I am\nStop doin' sucka shit, watch who you fuckin' wit\nStill put it down in the town on some other shit\n(Not that undercover shit), that's not me\nI bring grips and raise hell for M.O.P\n\n(Lil Fame)\nWhat the fuck (fuck) y'all (y'all) niggas (huh) want with\nFamster (Famster!) Gangster (Gangster!)\nWe can send your whole platoon\nBehind these men loom\nFame and Bill Danze, Siamese twins\nWho probably wanna be like (boy)\nM.O.P (twins) and Lil' Jon and The Eastside Boyz\nGo ahead lie nigga, hope you try nigga\nBut you gonna die nigga, fuckin' wit live niggas\nMy nigga!\n\n(Lil' Jon)\nWe bout to shut this motherfucker down real quick!\nI got my motherfucking Brownsville niggas wit me!\nNew York in this bitch, ATL in this motherfucker!\nDirty South let's ride on it!\n\n(Lil' Jon and The Eastside Boyz)\nThere they go my nigga let's get em!\nThere they go my nigga let's get em!\nIf you thought shit was over my nigga we never sleep!\nIf you thought shit was over my nigga we never sleep!\nWe gonna sneak a motherfucker like niggas on the creep!\nWe gonna sneak a motherfucker like niggas on the creep!\nLike that goddammit y'all niggas get got!\nLike that goddammit y'all niggas get got!\nWe gonna break a nigga down like keys on the block!\nWe gonna break a nigga down like keys on the block!\n\n(Billy Danze)\nMy God\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "Let My Nuts Go", "href": "Let_My_Nuts_Go&&9281", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Feat. Nation Riders, Quint Black, Too $hort)\n\n(Too $hort)\nYou couldn't be a better playa than me\nEven if you fucked every day of the week\nI know you think you got it like?\nI be fuckin' hoes every day of the week\nYou never could be a better playa than me\nEven if you rolled in luxery\nI know you sport-coatin' that top knotch freak\nYou never could be a better playa than me\nWhen I first got to the club it was cool to fuck\nWalked passed these hoes and they looked me up and back down again\nRecognize a pimp\nNext thing I know, I'm tellin' lies again\nSellin' dreams to hoes from everything I know\nGrab the microphone then I spit these flows\nI came in this muthafucka with my niggaz\nI plan on leavin' here with yo bitches\nAnybody feel they got a problem with that\nYou need to take off yo pimp hat nigga\nAnd get the fuck out my way\n'Cause I don't fuck with scrubs on any day\nI can't buy her no drink, she can't ride with me\nI don't know her and she can't stand beside me\nBut yo bitch, I might fuck her\nJust because I know you's a sucker\n\nLet my nuts go - bitch\nLet my nuts go\nLet my nuts go - bitch\nDo you like the way they swang\nLet my nuts go - bitch\nLet my nuts go\nLet my nuts go - bitch you keep rappin' in my ear and got me mad as hell\n\nLet me hit that weed, ? what you drinkin'\n6 months ago, hoe yo ass wasn't speakin'\nNow I see yo face in every bad way stop\nTryin' yo plots since the CD dropped\nI went nuts 'cause I'm like that with Too $heezy\nGot no time for you triflin' ass broke breezies\nJon ? doin' thangs, now that's so true\nAnd you bad news bitch I ain't fuckin' with you\n\nPunk bitch think she real smart, runnin' that G\nBut talk is cheap hoe, spend some cash money with me\nLook up when I pull up and come runnin' to see\nIf $hort Dog is in the car, Murder 1 is with me\nYou heard Nationwide was ballin', we make 100's and G's\nTakin' trips to the islands, smilin' under the trees\nWhen I step up, all these heffers start comin' for me\nLet my nuts go chickenhead you gets nothin' for free\n\nLet my nuts go - bitch\nLet my nuts go\nLet my nuts go - bitch\nDo you like the way they swang\nLet my nuts go - bitch\nLet my nuts go\nLet my muthafuckin' nuts go\nBitch, you keep rappin' in my ear and got me mad as hell\n\nNow we gettin' hell of looks soon as we pimped through the door\nAnd we seen hell of freaks we ain't fucked before\nThey got some bitches on the prawl of gold-diggin' missions\nAnd my folks is livin' foul, they whoopin' ass with precision\nFallin' back at the club, smoked up\nGettin' scoped by a hoe with a nigga, I know she tryin' to fuck\nBut her hommie wanna play G.I. Joe\nHommie you better check yo hoe before yo big ass hit the flo'\nLet my nuts go\n\nNigga when I step in the club\nCause y'all blowin' stress and we blowin' bud\nI showed him love once and let him come with my crew\nNow every fuckin' time he tryin' to jump in line\nYellin' out, \"?? can I get in with y'all?\"\nI ain't feelin' sorry for him, so I tell him, \"Hell naw\"\nNow $hort Records in the VIP\nI'ma sock you if you don't get off my N-U-T's\n\nLet my nuts go - bitch\nLet my nuts go\nLet my nuts go - bitch\nDo you like the way they swang\nLet my nuts go - bitch\nLet my nuts go\nYou better let my nuts go\nBitch, you keep rappin' in my ear and got me mad as hell\n\n(Lil' Jon and Eastside Boys)\nWhat the fuck my nigga what the fuck (What the fuck)\n(Repeat 3x's)\nBack up bitch nigga back (Back up)\n(Repeat 3x's)\nNow if you want some (What), come and get some (Get some)\nIf you want some nigga come get some (Come get some)\n(Repeat)\nWhy you all on my nuts like a trick\nI heard you was a jailhouse bitch\n(Repeat)\nNigga\n\nLet my nuts go - bitch\nLet my nuts go\nI told ya let my nuts go - bitch\nDo you like the way they swang\nLet my nuts go - you bitch\nLet my nuts go\nLet my muthafuckin' nuts go\nBitch, you keep rappin' in my ear and got me mad as hell\n\nUh, the word is Dollar ain't the same\nEver since I started Nation ridin', got a lil' change\nSurrounded myself by game, niggaz sayin' I'm counterfeit\nAin't that a bitch\nRe-evaluate and stop ridin' my dick\nLeave that to yo main bitch, let her live once\nNiggaz always surround when I burn my blunts\nGive me 3 feet and let me eat\nNiggaz some bitches, used to be too good now they can't speak\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "Chris Rock Get Lower", "href": "Chris_Rock_Get_Lower&&5823", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Chris Rock)\nYO this is Chris Rock\nWith Lil Jon\nBeing corrupted\nI think its time for the bitches to get a little lower\nLower than last time that's right\nI want you bitches to be unda unda that's right\nIf you see unda be unda that mutha fucka that's right\nLow low bitch lower than a fucking pregnant ants stomach bitch\nLower WHAT YOU DOIN' STANDING BITCH\nGet down fucking incoming bitch incoming get low\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Get Ya Weight Up (Remix)", "href": "Get_Ya_Weight_Up_(Remix)&&7258", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Feat. T.I. &amp; 8ball)\n\n(Verse One: T.I.)\nCall me Rubber Band Man, get as high as I can\nTote a hundred grand in my case\nAnotha five in my pants\nIn dat new LI sedan, bout da size of a van\n155 on 85, I be flyin my man\nAnd ain't no catchin T.I.P. silly\nBut you can try if ya can\nGet ya ass laid out, right beside ya man\nSprayed out da clip, left ya wit ya face in da sand\nSent da DA on a cruise, den do a day in da can\nTwo in da hand I'm jukin, I'm too cool ta dance\nI got a bad bitch in Paris, I cut a fool in France\nCool as a fan, betta ask some body who da man\nShut da bout down, clown when I choose to man\nI'm da Bankhead ambassador, Atlanta my land\nWhether I'm rappin', actin', or trappin, haddlin grands\nI give a gotdamn, not nan niggaz advance\nOn da crown, to get anything less da laid down\nI stay down\n\n(Chorus) (2X) T.I. &amp; (Lil Jon)\n\nWe ain't playin' dat shit (GET YA WEIGHT UP)\nAnd we don't play dat shit (GET YA WEIGHT UP)\nNigga fuck dat shit (GET YA WEIGHT UP)\nWell nigga buck den shit (GET YA WEIGHT UP)\n\n(Verse 2: 8Ball)\nI see you lookin' at me, wit yo lookin' ass\nYou wanna light it up, you betta pull it fast\nI'm not ya homeboy, I'm not ya kinfolk\nI got my own drink. I got my own dough\nI got my own slab, wit Michael Jordans on it\nIf you don't know da lingo, den 23's hommie\nYou wanna ride on em, you gotta hustlin baby\nSome niggaz dying fo em, out here actin' crazy\nI saw dem niggaz buckin, at da club spennin\nBuyin hoes drinks, gettin' at all da bithes\nDey got dey bling on, chains and rings on\nDey will stunt until da DJ play da wrong song\nNow dey on da flo, head split in two\nAll dey ice gone, and all dey bitches too\nDats why we roll deep, dat's why we hold heat\nDat's why we own streets. Fuck up and you will see...\n\n(Verse 3: Lil' Jon)\nPussy nigga, wut's up, gotdamn dat shit\nAll dat yappin at da mouth'll getcha fucked up quick\nI'ma ATL nigga, and BME's da clique\nCrunk Juice in my glass, always givin' me lip\nI hit dese hoes like boes wit dis platinum dick\nMy magnum always stay locked, cocked, ready ta hit\nI give a gotdamn nigga who we rollin' wit\nGet ya weight up hoe, den approach me bitch\n\n(Verse 4: 8Ball)\nGet ya weight up nigga, get ya weight up bitch\nI went from hustlin on da corner, to hustlin legit\nFrom ridin' 84's ta new school 4-doors\nFrom smokin' on dat Reggie to smokin' on dat Dro\nNo mo 18's, niggaz ride 24's\nOn anything new, ta old school 4-doors\nYou might be ridin' nigga, but dat ain't shit\nIf you ain't got no feet, be da candy bitch\n\n", "album": {"title": "Part_II_(2003)&&1881", "genre": "", "year": 2003}}, {"title": "I Like Dem Girlz", "href": "I_Like_Dem_Girlz&&7409", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Repeat 2x's)\nIt's some hoes in this house\nIt's some hoes in this house\nIf you see them point them out\nIf you see them point them out\n\nI like them hoes with them golds in they mouth\nThat be them hoes from the motherfuckin' south\nI like them hoes with them big ass butts\nThat be them hoes that'll let a nigga cut\nI like them hoes with them tats on they thigh\nThat be them hoes that love to get high\nI like them hoes with them piercings in they tongue\nThat be them hoes that suck dick and swallow cum\n\n(Chorus: Repeat 8x's)\nI like them hoes\n\nSome call them hoochies\nSome call them breezays\nSome call them bitches\nBut we call them hoes\nThat's how it goes\n\nI like them hoes with them colored ass wigs\nThat be them hoes with two or more kids\nI like them hoes that'll help a nigga fight\nThat be them hoes that'll fuck with a dyke\nI like them hoes with they own damn car\nThat be them hoes down for menage a trois\nI like them hoes with them six inch heels\nThat be them hoes that'll let a nigga drill\n\n(Chorus: Repeat 8x's)\n\nI like them hoes with them diamonds in they nails\nThat be them hoes that ain't scared to go to jail\nI like them hoes with that weave in the front\nThat be them hoes that can roll a fat blunt\nI like them hoes with them tight capri pants\nThat be them hoes that put you in a three point stance\nI like them hoes that be tooting that dust\nThat be them hoes that don't really give a fuck\n\n(Repeat until fade)\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "Pitbull's Cuban Rideout", "href": "Pitbull%27s_Cuban_Rideout&&7467", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Como?! Yeah! Yeah!\nLil Jon! Eastside Boyz! (Que Vuelta!)\nThat little cuban from Miami, Pitbull!(Como?)\nI appreciate y'all giving me the oppurtunity to spit on this shit\n(Go headdddddddd!)\n\nWhen it comes to these hoes\nY'all know we on some halloween shit\nStart trickin' 'n' treatin'\nBut I'm on some halloween shit too\nGettin' messed up for the radication BOOM!\nFrom the palm trees to the red clay\nWe get down the same way\nLil Jon's from Scott but this little cuban's\nFrom the county of Dade\nPitbull is here to voice his opinion\nAnd y'all gone hear it\nAll up and down the eastside\nI'm'a show y'all how dirty we ride\nFrom Dade to Decatur\nOnly difference is y'all blow dro\nAnd we blow crip\nBut reall there's is no differecne\n'Cause they're both green and sticky\nI don't mean to be picky\nBut Jon, tell your boys from the Eastside\nTo put me down with one of those\nRedbone who has a pretty face, n waist\nAnd thick thighs\nFrom the M-I-A to the A-T-L\nWe been connecting on work\nBut keep that on the DL\n\nHA! Asi mismo brode! Como?!\nYeah, Lil Jon, Eastside Boyz\nP-I-T slash Q-BON. Get it right baby\nFrom the bottom, to the ATL\nHa! Decatur, Swat, College Park\nHa! Wynwood, Hialeah, Saweseraaa!\nLiberty City, Carol City, Opa-Locka, this for y'all\nLil Haiti, Sao Pa Sai!\nAll my cubans, Que vola? Que vuelta? Que volon?\nHa! Yeah!\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Bo Hagon's Phone Call", "href": "Bo_Hagon%27s_Phone_Call&&9014", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Caller)\nMan like everything fina workout like this shit fina jump 'cause this shit fina jump like a trampoline I promise You feel me?\n\n(Bo Hagon)\nI already know boy I'm talkin' 'bout this fina go down though,\nBut shit yeah my dog I'ma holla at you man you be cool out there though\n\n(Caller)\nShit gotta be cool gotta be cool 'cause gotta stay down like you know what I'm sayin' like you my nigga you love you feel you feel me I know you feel me.\n\n(Bo Hagon)\nI feel you dog you know\nI love you nigga\nI been ya nigga since day one\nI'm talkin' from day one\nNigga I been right there beside ya\nBut hell yeah but uh you be cool dog and I'ma fuck wit you in a minute\n\n(Caller)\nYeah in minute 'cause like you holla at me in one minute anytime you want to holla at me one minute is one minute my minute is yo one minute we gotta stay down this shit man we gotta stay strong in this shit man fuck these niggas hatin' on us man\n\n(Bo)\nFuck these niggas man\nI'm tellin' you boy a nigga gotta stay strong dog but hell yeah you be cool I'ma probably hit you like tomorrow or some time\n\n(Caller)\nBut hell yeah man\nCause like I was tellin' my got damn wife like niggas gotta make this bread 'cause like niggas think we playin' out here like I don't know what tha fuck the fuck the rest of these niggas out here doin' I'm tryin' to make this money nigga you feel me I know you feel me\n\n(Bo Hagon)\nNigga I feel you if any nigga in the world feel you nigga I feel you but you be cool my nigga and U'll holla at ya in a minute all right I'ma probley holla at ya tomorrow or some shit so you be cool\n\n(Caller)\nKnee high from the tree house my nigga I'm trying to tell ya like that how it go down knee high from the tree house 'cause you my nigga we gon stay down my nigga I'm gon holla at ya and you gonna holla at me and we gon just stay...\n\n(Bo Hagon)\nDamn nigga get off the mutherfucking phone nigga bye!\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Crunk Juice", "href": "Crunk_Juice&&8366", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "BME Click!\n\"Yeah, yeah\"\nWe back mothafuckas (We Back) *Lil Jon Laughs* \"Yeah\"\nKings of MothaFucka Crunk (Kings Of Crunk)...Yeah, yeah\nLil Jon, Lil Bo, Big Sam, the BME click\nIs time for some Mothafucka Crunk Juice (Crunk Juice)\nGet some Crunk Juice in yo system, ((Hell yeah))\nNow this is about to be (what) the\nMost incredible (what) experience,\nYou ever felt in your fuckin' life \"yeah\"\nSo sit back (Sit Back)\nSmoke a Blunt (Smoke a blunt)\nAnd Turn this shit up (Turn this shit up)\nYeah,\n\n(3x)\nHey\nLet's go\nLet's go, ye\n\nStop that shit, Let's go right now...\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Stop Fuckin Wit Me", "href": "Stop_Fuckin_Wit_Me&&4086", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Ladies and fuckin' gentlemen (Whassup)\nIt's the kings of fuckin' crunk (You know it)\nMe, your boy Lil Jon, Lil Bo, Big Sam\nOn the motherfuckin track, Rick Rubin (Yeah)\nI don't think y'all ready for this shit (y'all ain't ready nigga)\nNothin' but some real gangsta shit (gangsta shit)\nFor them niggaz and bitches out there (Yeah)\nNow I'm havin' a hard fuckin' life right now (a hard life)\nAnd I'm gunna give y'all some of my fuckin' pain\n\nWhy you fuckin' wit me?\nStop fuckin' wit me!\nDon't be fuckin' wit me!\nStop fuckin' wit me!\n\nYou know, it seems like no matter, no matter how hard I fuckin' try\nI can't do the right motherfuckin shit\nLike I be tryin' and shit and shit always be turning out fucked up\nLike my bitch always on my fuckin' back talkin' bout I need to get a fuckin' job\nTalking bout how I need to pay my fuckin' child support and shit\nBitch I'm out here tryin' to do all that shit and that shit don't go my fuckin' way\nSometimes you need to get the fuck up off my back\nAnd let me learn how to get this shit right on\nI want you to stop fuckin' wit me\nWhy don't you stop fuckin' wit me\n\n(Verse One)\nBitch I'm tryin' to get a job, but it just don't work\n(Bitch I'm tryin' to get a job, but that shit don't work)\nSoon as I walk through the door, on they face is a smirk\n(Soon as I walk through the door, on they face is a smirk)\nCan't hire no nigga like me in that bitch\n(Can't hire no nigga like me in that bitch)\nTattoos, gold teeth, nigga dreads and shit\n(Tattoos, gold teeth, nigga dreads and shit)\nMan, fuck these niggaz, I'll go back to sellin' dope\n(Man, fuck these niggaz, I'll go back to sellin' dope)\nNow my baby mama callin bout that child support\n(Now my baby mama callin bout that child support)\nBitch back the fuck up, and let me smoke my weed\n(Bitch back the fuck up, let me smoke my weed)\nMotherfuck you bitch, stop screamin at me\n(Motherfuck you bitch, stop screamin at me)\n\nSeem like no matter what the fuck I do, my bitch, she always on fuckin' top of me\nI'm out here tryin' to make fuckin' money and shit\nAnd every time I motherfuckin come home this bitch always got something to say\nI'm cheatin' on her and shit, I ain't doin' nothin'\n\nI'm tryin' hard as I can bitch, leave me alone\n(I'm tryin' hard as I can bitch, leave me alone)\nYou better back your ass up, before you catch it to your dome\n(You better back your ass up, before you catch it to your dome)\nI've been out all day, all I want is a beer\n(I've been out all day, all I want is a beer)\nNow here yo ass come with bullshit in my ear\n(Now here yo ass come with bullshit in my ear)\nI ain't been with no bitch, been tryin' to make this money\n(I ain't been with no bitch, been tryin' to make this money)\nKeep pushin' a nigga, and shit gunna get funny\n(Keep pushin' a nigga, and shit gunna get funny)\nYou mad cause you heard that a girl like me\n(You mad cause you heard that your girl like me)\nYou better check that bitch before you come and check me\n(You better check that bitch before you come and check me)\n\nKnow what? I'm just gunna leave the motherfuckin house\n'Cause if I stay in this motherfucker, I'm gunna end up fuckin' yo ass up\nAnd I ain't tryin' to motherfuckin go to jail\nI'm just going to jump in my motherfuckin shit get on the highway\nFind me some dro, and get the fuck away from your motherfuckin ass\nBefore I lose my motherfuckin mind\nBye bitch\nOh shit\nWhat the fuck... the motherfuckin police behind me\nShit\n\nHad to get out the house far away from my bitch\n(Had to get out the house far away from my bitch)\n'Cause if I stay any longer it might be some shit\n(If I stay any longer it might be some shit)\nAnd now I'm on 85, wit my pedal to the flo'\n(Now I'm on 85, wit my pedal to the flo')\nAnd a nigga just fired up a blunt of that dro\n(And a nigga just fired up a blunt of that dro)\nThe police pulled me over on some seatbelt shit\n(The police pulled me over on some seatbelt shit)\nThat's when he finds out my license and my tag ain't legit\n(That's when he finds out my license and my tag ain't legit)\nHope he don't pop my truck cause in there is some shit\n(Hope he don't pop my truck cause in there is some shit)\n'Cause I got bout three or four bricks in that bitch\n('Cause I got bout three or four bricks in that bitch)\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Kings of Crunk (Intro)", "href": "Kings_Of_Crunk_(Intro)&&9228", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Lil' Jon)\nBme click!\nYeah!\n\n(Big Sam)\nIt's goin' down!\n\n(Lil' Jon)\nIt's the motherfuckin' Kings of Crunk motherfucker!\nGet back niggas!\nYou tuned in to yo boy Lil' Jon!\n\n(Big Sam)\nAnd them East Side Boyz!\nYo boy Big Sam!\n\n(Lil' Bo)\nYo boy Lil' Bo!\n\n(Lil' Jon)\nWe representin'the ATL ho!\nIn case y'all niggas didn't motherfuckin' know! (oh! oh!)\nThis album what number 4 'n' shit?\n\n(Lil' Bo)\nNumber 4 boy!\n\n(Lil' Jon)\nNow, this goin' to be some unexpected shit for a lot of y'all fucked niggas.\nBut this is, some hot shit about to go down on this motherfucker you understand me?\nSo y'all niggas strap up yo seatbelts\nGoddamn get yo asses drove some control\nAnd get ready to burn to this shit a'ight?! (yeah!)\nLet's do it! (Let's do it!)\nLet's do it! (Let's do it!)\nLet's do it! (Let's do it!)\nO-OK!\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Stick That Thang Out (Skeezer)", "href": "Stick_That_Thang_Out_(Skeezer)&&7548", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Ying Yang Twins in background w/ ad-libs)\n\n<b>Pharrell Williams</b>\nTurn me up, turn me up, turn me up! turn me up!\nYo! turn me up, turn me up! up some more!\nUp - up some more! Up - up some more!\nYeah, up up some more!\n\n<b>Pharrell Williams</b>\nI walk in the club so dashin, in the latest BBC fashion\nThe light from the strip club flashing\nKeep the sparkle in my ear rings dancing\nWe're hundred G makers till they cremate us\nSkateboard P in the lime green gators\nWhite chinchilla, million dollar neck glitter\nYeah I got security, see that gorilla\nWhen you got money, it's hard to hide it\nTook my hand out my pocket and watched her eyes get\nBig, took a million to supersize it\nAll the bitches saying 'Hey' like my name was Issac\nWhy you put me on blast like that?\nShit why you shaking wit an ass like that?\nBesides I wasn't really trying to smash like that\nI got a girl - bitch I ain't fast like that\nThis Miami, time's wasting, bet that bass line keep you shaking\nLook, end of the night all my niggas is waiting\nUh uh, not me ma, told ya I'm taken\n\n<b>Pharrell Williams and Lil Jon</b>\n(Stick that thang out!) Some more\nUh! uh! some more, skeezer!\n(Stick that thang out!) Some more\nYeah - uh! uh! some more\n(Stick that thang out!) Some more\nUh! uh! some more, skeezer!\n(Stick that thang out!) Some more\nHold it! Yeah - uh! uh! some more\n\n<b>Lil Jon and The East Side Boyz</b>\nI said ain't nothing but tutti fruity\nGet on the floor if ya got that booty\nShake what ya momma gave ya, shake what ya momma gave ya\nI said ain't nothing but tutti fruity\nGet on the floor if ya got that booty\nShake what ya momma gave ya, shake what ya momma gave ya\nDance, too much booty in your pants\nDance, too much booty in your pants\nI said dance, too much booty in your pants\nDance, too much booty in your pants\nWell shake that ass bitch and let me see what ya got\nWell shake that ass bitch and let me see what ya got\nHey! hey! hey! I said shake it, don't break it\nIt took ya momma 9 months to make it\nI say shake it, don't break it\nIt took ya momma 9 months to make it\nWell scrub the ground, scrub the ground, scrub the ground\n\n<b>Pharrell:</b> Hold it! (okay)\n\n<b>Pharrell Williams</b>\nHey! She really likes to party\nShe really likes to dance\nShe really likes to dance, dance, dance...\n\n<b>D-Roc</b>\nI like a fine ass bitch, a down ass bitch\nA money getting bitch, I love that shit\n'Cause she danced in the club, and yes she gon call\nIf you got a little money she taking her clothes off\nShe dance like a muhfucking dance machine\nTaking her ass to the beat for me\nNigga ain't spending more money than a lil bit\nBut I really love that shit, I love that shit!\n\n<b>Kaine</b>\nYeah! thick bitch wit a drive to fuck\nGet her off in the truck and she bound to suck\nThe ho love to bump, she don't like knee pads\nShe scrub 'em up, her legs that is\nFat puddy cat wit a head that's trill\nThe type of bitch have a nigga not paying bills\nFo reeeaaalll... by our God damn selves\nFuck thirty niggas and she don't need help\n\n<b>Pharrell Williams and Lil Jon</b>\n(Stick that thang out!) Some more\nUh! uh! some more, skeezer!\n(Stick that thang out!) Some more\nYeah - uh! uh! some more\n(Stick that thang out!) Some more\nUh! uh! some more, skeezer!\n(Stick that thang out!) Some more\nHold it! Yeah - uh! uh! some more\n\nHey! She really likes to party\nShe really likes to dance\nShe really likes to dance, dance, dance...\n\n<b>Outro - Lil Jon</b>\nDance! DANCE! Oh!\nI like the way you dance girl\nJust bring that shit over and dance on a nigga like me\nKeep shaking that thang girl! Keep popping that thang girl!\nShaking that thang girl, popping that thang girl\nKeep shaking that thang girl! keep popping that thang girl\nKeep shaking that thang girl! Keep popping that thang girl!\nKeep shaking that thang girl! Keep popping that thang girl!\nKeep shaking that thang girl! Keep popping that thang girl!\nKeep shaking that thang girl! Keep popping that thang girl!\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Rep Yo City", "href": "Rep_Yo_City&&8109", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Ah! Ah! Ah! hah hah! (4X)\n\n(Hook: Lil' Jon + (Petey Pablo)) - 2X\nRep yo city! Rep yo city! (Rep yo city!)\nRep yo city! Fuck that shit! (Rep yo city!)\n\nMy niggaz run this bitch! Nah hoe! (Hey)-4X\n\n\n(Lil' Jon) - 2X\nCut loose motherfucka, go bad go hard!\nIn the club motherfucka, go bad go hard!\nIn the truck motherfucka, go bad go hard!\nThrow it up motherfucka, go bad go hard!\n\n(E-40)\nWe 30 deep (30 deep) we bleed the block (bleed the block)\nWe milk the Ave. for damn near e'rythang the Ave. got (Ave. got)\nWe do the fools (do the fools) we act a nut (act a nut)\nWe set it off up in this bitch and tear the club up\nWhat it do? What it is pimp juice?\nWe got a car with the cups in the trunk\nFor the thugs and the broads with the G-string drawers\nUp in here straight break it all off (break it all off)\nWhere the big dawgs at? What city or set ya claim?\nFame, X.O., several drinks of champagne\nHustlers in the game tryna maintain, lost ya chain\nOutta control, we so cold (so cold)\nI'm on another level (another level)\nWent head up with the devil (with the devil)\nI never been a sucka (been a sucka)\nI always been a rebel (been a rebel)\nWhat's your stompin ground? (stompin ground)\nWhat turf you from? (turf you from)\nWhat's you city playboy (what's yo city?) mine 9-4-5-9-1\nVallejo! That's all I yell (that's all I yell)\nSpeakin' of yeah' I hope I never have to go back to slangin yeyo (slangin\nYeo)\nWe fuckin' around (fuckin' around) like my niggaz out there in Oak Cliff D-Town\nPuttin' it down from my house all the way to yo' house\nBack to the fuckin' south!\n\n(Petey Pablo)\nCould it be the way that I be reppin (WHYYY!) for my niggaz?\nCould it be the way that Petey Petey (RIIDE!) for my niggaz?\nShowin niggaz love (love) raise up motherfucker!\nYou need to be reachin' down pullin yo God-damn shirt up, that's love!\nWherever you live, wherever you from, wherever you call your home\nWherever you lay yo' God-damn Kangol down motherfucker!\nWherever you cheddar cheese, churn cream, lick that butter\nWherever yo' ass got lots of fat for all that God-damn trunk\nY'all niggaz don't understand the seriousness of what Petey be sayin'\nI took a unknown piece land (and planted) a God-damn flag!\nSay I didn't (DID!) motherfucker I'd die for this\nI done my God-damn thang, I brought my folks in this somma bitch\nHot Atlanta! The Bay Area!\nY'all niggaz don't want no noise (noise!) with Lil' Jon and The Eastside Boys\n(Boys!) Y'all niggaz don't want no shit (shit) with E-40 and The Click\n(The Click) And you can say whatchu want homeboy\n(Homeboy) I'll always be the one that iz!\n\n(Bun B)\nFrom the land of the trill, where the vanity's real\nAnd yo man'll be peeled or at least branded, God-damnit we ill\nMore horror than \"Amityville\", no sorrow; hand me the steel\nYour tomorrow I can't even feel - oughta be plannin ya will\nUGK ain't dropped in a while, but still we stoppin' ya smile\nKeepin' boppers in file, standin on top of the pile\nAnd you'll get popped with a smile, this ain't bout shoppin' and style\nThis bout syrup and candy paint, you see us choppin for miles\nOut the black and the 'Lac, swingers clap and if they take yo' flax\nYou'll get smacked for your packs, paper stacks and you'll crack-back yo' back\nHold up, they got game to sell ya, from drugs to paraphernalia\nGun that'll never fail ya, ask Rollie B, he'll tell ya\n\n(Eightball)\nMemph', Tenn representer (uh) Orange Mile nigga (yeah)\nSymbol of the south, legendary rhyme spitter (uh-huh)\nFrom Memphis to Mississippi, deep off in the woods (uh)\nFrom A-T-L to M-I-A, deep off in the hood (yeah)\nTwankies on coupes (yeah) money-makin' sluts (what)\nYou trippin' if ya ain't got 22's on ya trucks\nDogs in the yard (yeah) pistol on the seat (uh)\nSticky rolled up for them blunt monkey freaks\nMy nigga Earl hollered (whassup) big Ball got it poppin' (that's right)\nSmoked me a couple, hit the studio and dropped it\nFor all my dawgs who keep it G and keep it crunk\nRepresent yo' city, let 'em know where you from\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Nothin's Free", "href": "Nothin%27s_Free&&2837", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Oobie)\nThere's something, that I want to tell ya'\n'Cause I know that a brotha's got needs tonight\nI ain't trippin' on ya' pimpin' 'cause that shit's tight\nBut ya' gotta pay tonight - tonight - tonight\n\nI know you wanna get laid tonight\nBut I'm try'na get paid tonight\nWe ain't even gotta fuss and fight\nJust hit me right, it's on all night\nI know you wanna get in bed wit' me\nBut you gotta come correctly\nNothin' in life is free\nEspecially not me\n\n(Oobie)\nI hope you - can feel me - when I say pay before you play wit me\nWanna taste this - but it's priceless - it might be somethin' you ain't never done before\nBut I'm not your ordinary ho\n\n(Lil' jon)\n\nI fell off in the club (shawty)\nNot lookin' for love (shawty)\nBut I'm lookin' for a gul (shawty)\nNow I could cut (shawty)\nLike lil mama in the blue (shawty)\nShe so \"got damn\" cute (shawty)\nBut she said she need cheese (shawty)\nBefore she get wit me (shawty)\nWell let me see (shawty)\nWhat it might be (shawty)\nAnd what's ya' fee (shawty)\nFor my fantasy (shawty)\nNo, I ain't rich (shawty)\nBut I'll spend a lil bit (shawty)\nSo who you wit (shawty)\nLet's do this shit (shawty)\n\nThere's something, that I want to tell ya'\n'Cause I know that a brotha's got needs tonight\nI ain't trippin' on ya' pimpin' 'cause that shit's tight\nBut ya' gotta pay tonight - tonight - tonight\n\n(Lil jon)\nWhat you talking 'bout (shawty)\nThat didn't come out ya mouth (shawty)\nSay you want some cash (shawty)\nBefore I hit that ass (shawty)\nBut not yo boy (shawty)\nI ain't no toy (shawty)\nDon't play no games (shawty)\n'Cause I ain't lame (shawty)\nBut fo' my girl (shawty)\nI'll give her the world (shawty)\nAin't no thang (shawty)\nTo give up that change (shawty)\nI ain't rich (shawty)\nBut I'll spend a lil bit (shawty)\nSo who you wit (shawty)\nLet's do this shit (shawty)\n\n(Oobie)\nNow I'll get with you if you want me to\nAnd I'll be by your side if the price is right\nTake care of me and I'll take care of you\nNothin' in life is free yeah\n\nOh, yeah\nI gotta get paid, ooh\n'Cause if you want me come correctly might be something you ain't never done before but I'm not your ordinary ho\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "Outro (Chynalude)", "href": "Outro_(Chynalude)&&6602", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Lil Bo - Talking)\nAww yeah ya know it was real hanging out wit y'all motherfuckers\nOn this here album right\nBut this motherfucker bout over and uh\nTime for me to get the hell on\nBeen in the studio, the motherfucking sun coming up\nIn this bitch, motherfucker, been in this motherfucking studio\nWorking hard on this motherfucking album\n{*Background vocals from Lil' Jon and Big Sam come in*}\nWhat up B-leech, goddamn Sleet as usual in the motherfucking studio\nKit, all the boys higher den a motherfucker\nWe got Tim over there fucking up shit\nHa, ha, but like I said time to get up out this album knowhaimsayin\nHope y'all enjoyed this motherfucker\nIt was a lot of hard work putting this bitch together\nGo look out for them, LG's, my girl Chyna Whyte\nAnd who knows what else to motherfucking expect\nFrom the motherfucking BME ya little Biatch\n\n(Chyna Whyte)\nIt's one time for my soldiers on the front line\nStrapped with AKs, and car bombs\nWith K-nine blood lines\nIt's one time for my killers on the front line\nStrapped P-nines and semi-autos\nActin' like it's no tomorrow\n\n(Chyna Whyte)\nTo survive in this world makes me a soldier\n'Cause I wear Reeboks, nigga why, 'cause they colder\nEvery 3 years I battle my fans thug years\nNow I shed tears, nigga, I ain't happy here\nLike pot, so I blow herb thinking it'll stop the pain\nWhen I come down I'll still be left with the strain\nSo I stay high so my eyes can stay dry\nAnd I don't give a fuck why\nNigga I was born to die\nIn the club head tight off of gin and kiwi\nCamouflage and dimes so the niggas can't see me\nTellin' 'em my name Le-Le or Lisa\nBreaking them walls the Visa 9-millimeter\nSha-sha click, cock it, rock it\nNothing but the Reeboks and poppin'\nNuttin but motherfucking nines and\nBump, bump, you be running like Forrest Gump\nKnock you on yo ass like Humpty Dump\nChyna Whyte leaves niggas in a slump, serial\nDeadly like disease venereal\nGame as be RD imperial\nPumpin through your stereo, nigga what you know\nAin't no log when that fo'-fo'\nEjaculate up in your fo' door\nBitch die slow, lyrical calico\nPurple tablets I flow\nNone want war, Gambino\nEmptyin clips, I rips\nMotevl I flips\nWords comin' off the lips like Teflon's hips\nIt's one time!\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "In Da Club", "href": "In_Da_Club&&6917", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "In Da Club Lyrics\n\n(R. Kelly)\nHey, hey, boom boom boom, hey hey, boom boom boom\nHey hey, boom boom boom, hey hey, boom boom boom\n\nWhat are we doing tonight baby?\n'Bout to roll up to this club\n'Bout to step off in this club\n'Bout to get bent in this club\n'Bout to get wild in this club\n(2x)\n\n(Verse 1 - R. Kelly)\nNow I'm about to show ya how wild it get\nWhen a girl at the party when she backin it\nNow this girl dance freaky 'cause she passionate\nIf I hand her some chips, then she stackin it\nShe don't need no introduction, she's a diamond a doe\nY'all don't need no janitor the way she moppin the flo'\nTattoo on her back say I'm ready to go\nMan this girl must be the pimp the way I'm ready to hoe\nI wanna take you out the ghetto girl around the globe\nGetting freaky in the kitchen somewhere round the stove\nIn the chumps we chilling in some hotel robes\nI put hot towels on your body and massage your toes\nThere ain't nothing like some sex on a Friday night\nBut then again nothing like some sex any night\nAfter that gotta go got appointments girl\nI'm a doctor, I got other clients girl\nNow listen up close, I won't say it again\nSkip a dog your cat is a man's best friend\nLil' Jon and Luda on the first test flight?\nFrom ATL we about to get it crunk tonight\nWhere we going?\n\n'Bout to roll up to this club\n'Bout to step off in this club\n'Bout to get bent in this club\n'Bout to get wild in this club\n(2x)\n\n(Verse 2 - Ludacris)\nHey Kelly!\nOh damn! There go expensive \"Cris\"\nAt the bar buyin all the most expensive shit\nAnd his car always got the most expensive kit\nSo his gun always got the most expended clip\nHey! Luda Luda, I'm built to last\nNicknamed double barrel I'm build to blast\nSaid your girl ain't a freak, well you gotta convince me\n'Cause I'm all up in the pimp getting straight Lewinsky\nAnd smoking some of that kill bill\nTen mill mutha fucker I'm still thrill\nCan't part with the women that like the dick\nRefuse to cut my hair like Michael Vick\nDirty bird even judges say the birds is dirty\nWe the reason that the clubs start closing early\nWalk up and watch the crowd start moving quick\nAnd I ain't gotta pay the DJ to play my shit\n\n'Bout to roll up to this club\n'Bout to step off in this club\n'Bout to get bent in this club\n'Bout to get wild in this club\n(2x)\n\n(Verse 3 - Lil' Jon)\nYeah, hey, hey, hey\nWhen the bull pimp come man I'm sloppy drunk\nI done broke in the club it's the king of crunk\nLet the 8-0-8 bang, and the woofers blow\nThrow some ass in my lap and I'm good to go\nI spray the Chaun Don bottle, crack a beer\nWhile the ladies all rubbin my nappy beard\nNo need to even ask it, who's the boss?\nWhen the dreadlocks swing and the roof come off\nThe crunk juice got me up all night and shit\nAnd it last still? making that bite and shit\nNow the esses calling me Lo Dinero\nStunned with my hell day, Oaklezero\nFresh by the front and I'm ready to play\nAsk them girls for they number and they like (OK)\nBME turned millionaires, and we all like 'what what, yeah'\n\n'Bout to roll up to this club\n'Bout to step off in this club\n'Bout to get bent in this club\n'Bout to get wild in this club\n(2x)\n\n(Verse 4 - R. Kelly)\nNow any other time I would say it's over\nSince the party so loud, Fuck it, keep it goin'\nShit don't stop till 6 in the mornin\nCome 7 o'clock a nigga still ain't yawnin\nBaby girl leaving now on her toes\nHangover, wait a minute girl you leaving your clothes\nAnd tickets go on sale for a major show\nIf yousa hater at the booth then the booth is closed\nAnd move out the way I'm a Luda fan\nUp north, dirty south, west eastside man\nAll strippers in the club stand up right now\nWe wanna see you shake your booty in the place right now\nWhere we going?\n\n'Bout to roll up to this club\n'Bout to step off in this club\n'Bout to get bent in this club\n'Bout to get wild in this club\n(2x)\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Ohh Na Na Naa Naa", "href": "Ohh_Na_Na_Naa_Naa&&7010", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Feat. Oobie and Devin the Dude)\n\n(Intro/Chorus: Oobie)\nOoh Na Na Naa Naa; I'm so horny and I want you to fuck me\nI'm tired of masturbating got my body shaking no orgasm faking with me\nOoh Na Na Naa Naa; I'm so horny and I want you to fuck me\nI hope you're ready for love, 'cause I got more than enough\nCome bust a beautiful nut up on me\nNow I'm just sitting in my lingerie, sipping on some Alize\nTrying to figure all the ways I can make you say\nOoh Baby, right there, don't stop\nPut it in you're mouth, twirl it round till you make it pop\nNow I'm gonna make you sweat, when you go down in between my legs\nYou gon be fantasizing bout these lovely thighs\nIt's gon' be hypnotizing won't you come on and see\n\n(Devin the Dude)\nI see your pussy lips smiling\nBeen grinning like they want something up in 'em\nI been wanting to ask you for some but didn't want to offend you\nBut now I see you bout as freaky as me\nI busted two nuts already now you waiting for number three\nYou ask me what will it take to get me hard again\nI say saliva but see you ain't down for swallowing\nYou'd rather have it on your skin you wanna rub it in\nMove your tongue like that once more girl I'm bout to nut again\nFuck your friends in your business ask me why I call everyday\nAnd why your face is so clean just tell 'em oil of olay\nI thought I could girl you could do miles\nLay on your side raise up ur legs let me see that beautiful smile\nAwww yeah, I'mma put it all in there\nAnd you relax but then you ask me to pull ur hair\nAnd I'll do it you'll scream but the nut won't last\nCause right before you know it Splash!\n\n(Lil Jon)\nDick suck my dick suck\nShawty want you to put it on me\nRough sex, fuck fest\nLet me put ya to test\nUp and down in and out\nPut that dick back in yo mouth\nYou take the cream I'mma make you cream\nYou dick fiend I'mma pussy fiend\nRole play, fantasy, Hennessy, ecstacy\nHard fast not slow after this they ain't gon want no mo'\nLay you down, pick you up, speed it up you wit me boy\nDoggy style buck wild I'll leave yo ass screaming ah!\nGoddamn don't stop cum rising to the top\nGirl you suck dick so good make me wanna call the cops\nAnd it don't make no sense the way you suck the dick\nThe way you lick from the shaft to the dome of the dick\nGoddamn can't lie girl I love the shit\nStrap up, get head fuck the shit I don't ??\n'Cause I'm big Sam baby, I'll rock yo world baby\nI lay the kinda pipe that make yo turls curl baby\n\nOoh Na Na Naa Naa\nI'm so horny\nOoh Na Na Naa Naa\nSo touch me baby\nI know that you want me\nOoh Na Na Naa Naa\nSo come on bust one for me\nOoh Na Na Naa Naa\nI'm so horny\nOoh Na Na Naa Naa\nAnd I want you baby\nOoh Na Na Naa Naa\nI see it's nice and hard for me\nOoh Na Na Naa Naa\nSo come and skeet it on me\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Put Yo Hood Up", "href": "Put_Yo_Hood_Up&&2756", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "Put yo hood up! (4X)\nPut yo click up! (4X)\nRepresent yo' shit muthafuuuucka (2X)\nRepresent yo click muthafuuuucka (2X)\n\nWell shake yo' drink up and spray the muthafuckin' crowd (2X)\nThrow yo' click up and say it muthafuckin' loud (2X)\nNow drop yo' bows on em' and get buck ass wild (2X)\nYou supposed to act up with a black and fuckin' mild (2X)\n'Cause them eastside niggas don't give a fuck\nThem westside niggas is quick to buck\nThem northside niggas will cut you up\nAnd them southside niggas will put you in a trunk\n\nNow jump jump jump nigga\nStomp stomp stomp nigga\nJump jump jump nigga\nStomp stomp nigga\n\nIf you scared to throw it up get the fuck out the club (2X)\nIf you don't give a fuck then throw that muthafucka up (2X)\nI'm wit my niggas in this bitch, and you know we fucked up (2X)\nWe clicked up 30 deep and we always strapped up (2X)\nWho you wit nigga? Who you wit nigga?\nWho you wit get crunk, who you wit nigga? (2X)\nWell who run this bitch? We run this bitch! (4X)\n\nAye, check dis out I need all my real niggas and bitches\nTo look around the muthafuckin' club\nIf you see a nigga and he throwin' up a set and it ain't yo' set\nOr it ain't yo' click\nI want chall niggas to tell dem' niggas like dis\nI want you to get up in that muthafucka' face\nAnd do dis shit...\n\nHea we go (x6)\nSay nigga fuck you!\nNigga fuck you (x7)\n'Cause you don't wanna fuck wit' me\n'Cause my niggas in the club will heat (2X)\n\nWe some eastside niggas (2X)\nWe some westside niggas (2X)\nWe some northside niggas (2X)\nWe some southside niggas (2X)\n\n", "album": {"title": "Put_Yo_Hood_Up_(2001)&&7692", "genre": "Crunk", "year": 2001}}, {"title": "Bitch", "href": "Bitch&&5949", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "We run dis (Bitch, bitch, bitch, bitch) 4x\nU ain't fuckin' wit me (Bitch, bitch, bitch, bitch, bitch)\nU ain't fuckin' wit me (Bitch, bitch, bitch, bitch) 3x\nStart a roit in this (Bitch, bitch, bitch, bitch) 4x\nStart a riot in this (Bitch, bitch, bitch, bitch, bitch)\nStart a riot in this (Bitch, bitch, bitch, bitch) 2x\nOr get the fuck out this bitch\n\n(Lil' Jon)\nU be actin' like a bitch\nSo, we treat you like a bitch\nU be actin' like a bitch\nSo, we treat you like a bitch\nWe beat you like bitch\nKick yo ass like a bitch\nWe take yo fuckin' shit and live you stuck like a bitch\nU wearin' panties like a bitch\nU pussy like a bitch\nU sound like a bitch\nU talkin' like a bitch\nU cryin' like a bitch\nU whinin' like a bitch\nI hate you fuckin'bitch, We'll kill you bitch\n\n(Big Sam)\nSo back up off of me in this (Bitch)\nOr get fucked up in this (Bitch)\nMy niggas real in this (Bitch)\nSplit yo wig in this (Bitch)\nCrack yo head in this (Bitch)\nBeat yo ass in this (Bitch)\nSo, keep poppin' at the mouth and get fucked up like a (Bitch)\nSmack you up like a (Bitch)\nStump you out like a (Bitch)\nSnap yo neck like a (Bitch)\nBeat you down like a (Bitch)\nTake yo money like a (Bitch)\nOn yo knees like a (Bitch)\nWe don't like you fuckin' bitch, We'll kill you bitch\n\n(Chyna White)\nAin't no hoes fuckin' wit this bitch\nI put years in this shit\nI shed tears fo this shit\nBitch I'm real wit this shit\nDon't push me\nCause ain't a fuckin' thing 'bout me pussy\nAccept this red shit that drip from me\nI get money\nIn my hood, bitch ain't nothing funny\nBut a faggot nigga nut huggas and big hoops\nWe tussle over who got juice\nWho living a lie\nWho speakin' the truth\nWho gettin' that loop\nU get on the mic wit that bullshit bitch (Bitch) then it's all on u\nHangin' rap labels\nI ain't dealin' wit fables\nI only fuck wit niggas that do business up under the table\nThey mad shawty\nU hoes can't make it in the game\nUnless yo titties and ya ass out\nNow fuck wit me\nSo I can show you who really ballin' in this bitch\nTurn it from sweet to sour in this bitch\nLike 0 to 60 mph\nIt's a thin line between love and hate\nAnd fuck the world 'cause I ain't hear to stay, Beyotch\n\nEh, check this out, right (Wussup?)\nAll y'all club managers (uh huh)\nAnd club owners (yeah)\nIts bout ta get real ugly up in yo mothafuckin club (fucked up in that bitch)\nI'ma tell ya like this (wussup?)\nGet your motherfuckin security ready (fuck em)\n'Cause I think some shit about to go down nigga (what's goin' down)\nIts lil jon, eastside boys\nY'all check this shit out!\n\nLet me see you get kruck\nLet me see you get puff\nLet me see you tear the muthafuckin' club on up\nLet me see you get kruck\nLet me see you get puff\nLet me see you tear the muthafuckin' club on up\n\nMan, fuck dem muthafuckin' pussy ass niggas\nMan, fuck dem muthafuckin' pussy ass niggas\nMan, fuck dem muthafuckin' pussy ass niggas\nMan, fuck dem muthafuckin' pussy ass niggas\n\n(Too Short)\nTold you once lil nigga\nSaid it twice lil bitch\nHang around us niggas all night and you'll get yo lil ass whoop\nFo actin' like a bitch\nBack slap you like a bitch\nWay you snapping' a flick\nBitch\nIt's Short Dog\nI ain't went no where\nStill spittin' real game fo all the pimps and players\nAnd you bitches\nDon't try and front fool\nIf you don't leave soon\nDem niggas bout to jump u\nU just a\nBitch, bitch, bitch\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Get Low", "href": "Get_Low&&9110", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "<i>Unfortunately, we are not licensed to display the full lyrics for this song at the moment. Hopefully we will be able to in the future. Until then... how about a <a href=\"/wiki/Special:Random\" title=\"Special:Random\">random page</a>?</i>\n\n", "album": {"title": "Kings_Of_Crunk_(2002)&&8040", "genre": "Crunk", "year": 2002}}, {"title": "Contract", "href": "Contract&&5636", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Intro: Pimpin' Ken)\nYeah, Yeah, Yeah, like I said this is your boy Pimpin' Ken dot net\nSell the bitch pussy till it's drip drop wet\nYou know what I'm saying, the vet, not the pet\nDig this here man\nLike my nigga Cashball, you know what I'm saying, me and DeAnte say\nMan, it's \"stacks, tracks and contracts,\" you know what I'm taking about\nOnly time a bitch get off is when a bitch run off, you know what I'm talking about\nHey man, you understand me\nMaster constitution for the prostitution\nAnd let prostitution be the only solution\nPlease believe it, you understand it, bitch, you know my choosing fee bitch\nIt's a lifetime, bitch of ho crime, believe that ho you know what I'm talking about\nYeah, bitch you know what I'm talking about\nDon coochie hole bitch, better known as pimp coochie hole\nPimpin' Ken the Don in this shit ho\nYou know what I'm talking about, yeah\nMilwaukee, Wisconsin you fuck-ass bitch\n\n(Dirty Mouth)\nAs I pull up to the club\nJumping out of the Jag\n24's still spinning with a dealership tag\nBrand New\nBright leather guts and pearl blue\nThese hoes they choosing like a lucky horseshoe\nBut that's all right 'cause I don't pay these hoes no mind\nAs I stroll to the front of the VIP line\nStraight in I go, headed straight to the bar\nI got a superstar status, so I guess I'm a star\nHaters checking me out\nNow tell me what's that about?\nI'ma chill to the point haters checking me out\nSipping on the Crystal\nBitches wanna get wild\nPopping X and smoking dro' on the verge of my style\nThese bitches calling, asking where the after party\nThe Embassy Suites downtown, room 112, my darling\nBring your friends so we can let this party begin\nAnd bring a box of Magnum rubbers so we can fuck till the end\n\n(Jazze Pha)\nHey bitch, sign your name on the dotted line (well)\nCause you belong to me (you belong to me, yeah)\nHey bitch (hey bitch) sign your name on the dotted line (well)\nCause now you're mine\n\n(LA)\nJust pulled up at the club\nI'm flyer than a motherfucker\nDamn, why they staring? ho, shit I'm the motherfucker\nNot the front door\nWe better go through the back\nSee, that was back then, now look where we at\nStraight to VIP, my niggaz, man we deep\nYou gonna go through 2 or 3\nBefore you get to me\nThe bitch, and she a G and said \"what's up for later?\"\nI said \"I'm 20 East, I'm headed to Decatur\"\nAnd motherfuck the hater\nIt's about this making paper\nAnd while she choosing hard, guaranteed I'ma take her\nSo shake the saltshaker, the dro' is the vapor\nI ain't got love for niggaz cause all they try to do is cake her\nI ain't sippin on no chaser, that's what we tell the waiter\nYou goddamn right, I'm a motherfucker player\nSo tell me how you want it\nYou riding? Get up on it\nI ain't fucking with the ho if she don't know how to donut, for real\n\n(Jazze Pha + Lil Jon)\nHey bitch (hey bitch), sign your name on the dotted line (well)\nCause you belong to me (you belong to me, yeah)\nHey bitch (hey bitch) sign your name on the dotted line (well)\nCause now you're mine\n\n(Lil Jon)\nHey, hey bitch\nHey bitch get up it's time to go to work\nTime to go to work bitch, it's your boy Lil Jon\nNever will I love a bitch\nWhy would I trust a bitch?\nAlways gonna dog a bitch\nThey only good for sucking dick\nOr riding on a nigga cock\nTrying to get a nigga stock\nI'm never gonna break bread\nNot even for a little head\nI'm a player, not a cake-a-ho\nAlways gotta break ho, down to the fucking floor\nYou step up, I'll let you know\nIt's MOB, BME\nP to the I to the M P\nNo, I'm Southside\nSorry, bitch, you better pay me\n\n(Big Sam)\nOld school white Lac pimpin' like I'm Don Juan\nWhen I pull up on the track, I toot-a-loo my horn\nMake these hoes come running like Mike for travs\nAin't got my money ho, you bound to get slap\n'Cause I don't love a bitch and won't save a bitch\nIf it ain't about money, then it don't make sense\nI'll mack a bitch and I'll pimp a bitch\nAs long as she making me filthy rich\n\n(Don P)\nJust up off the pill, drinking on my beer\nSitting on a mill, but I'm pimpin' still\nRiding round the track, like Goldie in the Mack\nStill I'm Don Coreleone pimping hoes from my realm\nMesmerized by the words coming out my mouth\nSo I'm flushing money quickly out these bitches' bank accounts\nAfter that I bounce\nTo another ho, in a totally different city\nFor a whole other show\nThey say, \"why you don't call?\" I say, \"bitch, where my dividends?\"\n\"You always out of town\" I say, \"bitch, where my dividends?\"\n\"You probably in the club\" I say, \"bitch, where my dividends?\"\nYou bout to make me break your neck, I have to ask your ass again\nI'm Don a.k.a \"stay pimpin' hard\"\nThat mean hoes gonna march winter, summer, spring and fall\n'Cause I have to ball, there's no other way\nEven if the bitch's pregnant, there's no Happy Mother's Day\n\n(Jazze Pha + Lil Jon)\nHey bitch (hey bitch) sign your name on the dotted line (sign right here)\nCause you belong to me (you my bitch now)\nHey bitch (hey bitch) sign your name on the dotted line (right here)\nCause now you're mine (you mine, ho)\n\n(Lil Jon) Get your ass up\n\n(Jazze Pha (+ Lil Jon))\nIf you get out line, I'm a slap you out\nI'm a slap you out\nI'm a slap you out\nBetter have my money (you better have my money, bitch)\nCause you signed your name on the dotted line\nSo get off your ass and get on the grind\n(Get up, get out there and make my motherfucking money, right now)\nForgot what I am, bitch? What am I?\nI'm a pimp in every inch of the word\nEvery inch of the verb\nEvery inch of the curb\nI'm a hit it, like the lottery baby\nBetter believe it (please believe it)\nHey, yeah\nIf it's pimping you wanting (what), pimping you needing (what)\nEveryday from me (from a real motherfucking pimp)\nBut bitch that's all I can see\nAny day of the week, when you fucking with me\n\n(Lil Jon)\nIf you fucking with me, you better get your ass out there\nAnd make that motherfucking money\nRain, sleet or snow\nRob, steal and kill for a motherfucking pimp like me, ho\n\n(K. Sanchez)\n\"Say, I'm comin' at you with lines, think they lies\nJust because I don't match your compatible sign\nI'ma let the world see, other boos can't relate\nLet you walk in front, make the other dudes hate...\"\n\n", "album": {"title": "Crunk_Juice_(2004)&&5018", "genre": "Crunk", "year": 2004}}, {"title": "Get Low (Remix)", "href": "Get_Low_(Remix)&&6759", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Feat. Elephant Man, Busta Rhymes and Ying Yang Twins)\n\n(Intro: Elephant Man)\nEastside Boyz (Yep! Atlanta Georgia) mayday!\nGood to go (The dirty south again!)\nElephant Man, Likkle Jon, Busta Rhymes\nAll right, weh we fi do wid di dance!\n(Give dem di dance now, buss di dance now)\nShizzle, Jamaica, New York, Eastside Boyz (You know come on!)\nAiyyo Likkle Jon, Busta! Oonu ready fi tek di dancefloor, all right\nThis a now fi do then, do then\nDance and tek it to dem, to dem\nSignal di plane now fi do then, do then\nDance and tek it to dem, to dem\nPon di river yuh fi do then, do then\nDance and tek it to dem, to dem\nDi higher level yuh fi do then, do then\nYuh dance and tek it to dem, to dem, come on!\n\n(Chorus: Ying Yang Twins) + (Elephant Man)\nThree, six, nine, damn your fine\nMove it till you sock it to me one more time\nGet low, get low (Get Low) get low (Get low) get low (Get low)\n(Elephant Man: Come on!)\nTo the window (EM: Give dem di dance now) to the wall (To the wall) (EM: Buss di dance now)\nTill the sweat drop down my balls (My Balls!)\nAll these bitches crawl (Crawl)\nY'all skeet skeet motherfuckers (Motherfuckers)\nY'all skeet skeet god damn (God Damn!)\nY'all skeet skeet motherfuckers (Motherfuckers)\nY'all skeet skeet god damn (God Damn!)\n\n(Verse 1: Lil' Jon)\nHey! Hey! Let me see you get, a get low (You Scared!)\nTurn your body yo the, to the flo' (You scared!)\nLet me see you get, a get low (You Scared!)\nTurn your body to the, to the flo' (You scared!)\nShake that ass girl, shake it fast girl\nShake that ass to the left to the right girl\nShake that ass girl, shake it fast girl\nShake that ass to the left to the right girl\nLet me see you just, back, back, back it up (Awww shit!)\nBack, back, back it up (Awww shit)\nBack, back, back it up (Awww shit)\nBack, back, back it up (Awww shit)\nLet me see you just stop (Oh!) wiggle with it (Yeah!)\nStop (Oh!) wiggle with it (Yeah!)\nStop (Oh!) wiggle with it (Yeah!)\nStop (Oh!) wiggle with it (Yeah!)\n\n(Verse 2: Elephant Man)\nGal shake up yuh booty, when yuh shake it up yuh get mi rudey\nWouldn't mind fi see yuh get nudey\nMiss cutie cutie, love di way yuh wine and how yuh movey\nDem gal deh can wine trust me and dem waistline groovy\nWine around like a blue movie\nTek it to dem Keisha and Susie\nHey! Do di pon di river do di pon di river hey!\nDo di higher level do di higher level hey!\nSignal di plane signal di plane hey!\nAll right give dem a run just give dem a run hey!\nShake yuh booty yuh fi shake it slow\nRotate like di tire dem a Texaco (Whoa)\nEverywhere yuh go man just step pon yuh Kso\nJust fi get yuh ting dem a promise yuh peso\nDem a seh yuh hype and wonder how yuh stay so\nMake monkey face, gal go down slow\nTic tac toe we got dem all in a row\nGet rich and get mad nuh bodda hold him Joe\nBig up Danger Voo dem a tornado\nDo di dance, all right, come on\n\nChorus: Ying Yang Twins (Elephant Man)\nThree, six, nine, damn your fine\nMove it till you sock it to me one more time\nGet low, get low (Get Low) get low (Get low) get low (Get low)\n(Elephant Man: Come on!)\nTo the window (EM: Give dem di dance now) to the wall (To the wall) (EM: Buss di dance now)\nTill the sweat drop down my balls (My Balls!)\nAll these bitches crawl (Crawl)\nY'all skeet skeet motherfuckers (Motherfuckers)\nY'all skeet skeet god damn (God Damn!)\nY'all skeet skeet motherfuckers (Motherfuckers)\nY'all skeet skeet god damn (God Damn!)\n\n(Verse 3: Busta Rhymes)\nAiyyo! Check it!\nI'm comin' through with a thick crew playa (Waddup!)\nYou can't believe I'm on the shit too playa (Waddup!)\nI'm a sit and watch your girl put it on me (Waddup!)\nI love it when you got your ass clappin for me (Waddup!)\nYour big ass cover the back of my harley (Waddup!)\nAss from the front to the back of the party (Waddup!)\nThat's right (Yeah girl) that's it (Come on!)\nGet low shorty shake that shit (Come on!)\nIf you ain't got learned get it down packed mami\nWith all that ass you got sittin' on your back mami\nNow all my shorties need to get in line\nI said because I'm only gonna tell you one more time\n'Cause if that ass kind of stocky and fat\nPick it up, pick it up, pick it up bounce (BACK!)\nWhile I, get dough (Get dough!) smoke dro (Smoke dro!)\nGet low because I fuckin' said so\n\nElephant Man: Come on!\n\n(Chorus: Ying Yang Twins) + (Elephant Man)\nThree, six, nine, damn your fine\nMove it till you sock it to me one more time\nGet low, get low (Get Low) get low (Get low) get low (Get low)\n(Elephant Man: Come on!)\nTo the window (EM: Give dem di dance now) to the wall (To the wall) (EM: Buss di dance now)\nTill the sweat drop down my balls (My Balls!)\nAll these bitches crawl (Crawl)\nY'all skeet skeet motherfuckers (Motherfuckers)\nY'all skeet skeet god damn (God Damn!)\nY'all skeet skeet motherfuckers (Motherfuckers)\nY'all skeet skeet god damn (God Damn!)\n\n(Outro: Elephant Man)\nThis a now fi do then, do then\nDance and tek it to dem, to dem\nSignal di plane now fi do then, do then\nDance and tek it to dem, to dem\nPon di river yuh fi do then, do then\nDance and tek it to dem, to dem\nDi higher level yuh fi do then, do then\nYuh dance and tek it to dem, to dem\nYeah, Elephant Man, Lil Jon, Busta Rhymes, Eastside Boyz\nJamaica, New York, L.A. shizzle, do di dance now (Come on!)\nDo di dance now, give dem di dance now\nMiami Florida, shizzle, it's summer, come on!\nSummertime give dem di dance summertime buss di dance\nGive dem di dance now, give dem di dance\nGive dem di dance a dat di girls want\nGive dem di dance Likkle Jon give dem di dnace\nGive dem di dance Busta give dem di dance\nBuss di dance Likkle John buss di dance\nElephant Man, tell, what more you want\n\n", "album": {"title": "Part_II_(2003)&&1881", "genre": "", "year": 2003}}, {"title": "One on One", "href": "One_On_One&&3188", "artist": {"unique_name": "Lil_Jon_%26_The_East_Side_Boyz"}, "lyrics": "(Feat. Ying Yang Twins)\n\n(Intro: Lil' Jon)\nThis your boy Lil' Jon\nI'm here to tell you\nWith another one\nHere we go, here we go\nWell, I got DJ Smurf, D-Roc and Kaine\nHere to tell you this is gangster music and booty shakin' music\nWhat we call it is that gangster party\nIf y'all ready for that gangster party, let me see you put your hands together\nPut your hands together for D-Roc and Kaine and DJ Smurf\nNext time a red neck put a pistol down...\n\n(Verse 1: D-Roc, Kaine)\n\n(D-Roc)\nNigga killer, bitch you ain't heard of the Ying Yang Twins soldiers\nNigga I tried, I told you\nWe put it down coming right back, 'cause it's like that, on a phat track\nWith a fat sack\nD-Roc and Kaine, ready for combat\nYing Yang, Inglewood, that's our home\nIt could be on, we ready for war so let's get it on\nPlus we maintain, put one in your brain\nWe keep shit real, DJ Smurf straight thuggin' and knocking out grills man\n\n(Kaine, (D-Roc))\nHere we come so fuck the whole flow\nYing Yang Twins kicking in your door\nEverybody better hit the floor\nGive me the weed and out you'll go\nBad kids on a dead-end street\nTold Smurf to get the keys to the Jeep\nThree niggaz only goddam free\nIf you fronting, get put to sleep\nInfrared beam over your skull\nGive me the shit - I won't kill your girl\nFuck that bitch and fuck the world\n(Man, what you saying nigga?) fuck the world!\nMan, I'm down 'cause it's all in the game\nD-Roc and Kaine, that Ying Yang Twins\nThen go bring some pain\nNigga gone tilt it down on they brain\n\n(Chorus: Ying Yang Twins (repeat 3x))\nFuck that one\nI got my Nina gun pistol!\nDown on they brain\n\n(Verse 2: D-Roc)\nI make you wanna pop that thing girl when the bass drop\nThe D-Roc make you wanna pop the glock, it don't stop\nSmurf be an alcoholic\nI love these hoes, thank God for hydraulics (woo!)\nThat's the sound of the ghetto\nArrive down here, be darker than the cattle\nOh no, nigga watch your nose\n'Cause you'll get hit by hoes that spit flows and prose\nStrictly coming niggaz that hoe\nA thug that tight is what your boy chose\nThe niggaz I sell the drugs\nThe ghetto type hold the world it's for thugs\nSo all my flows, yeah, your boy loves\nCollege Park in the house watch 'em up\nWhen shit hit the fan we fight dirty\nAnd send y'all weak motherfuckers to bed early\n\n(Chorus: Ying Yang Twins)\n\n(Verse 3: Kaine, (D-Roc))\nNigga fuck it, quit it before you get put on your back with a pistol - down\nOn your brain\nRecognize the Ying Yang Twins (in the game, cocking in)\nYing Yang Inglewood soldiers only cocking in\nFuss or that one on one 'cause I got my pistol\n(Ying Yang don't take shit!) we make this motherfucker whistle\nD-Roc, Kaine, DJ Smurf, we bring it straight pimping\n(Fuck that one on one!), put the pistol down on they brain\n\n(Chorus: Ying Yang Twins)\n\n", "album": {"title": "Certified_Crunk_(2003)&&4582", "genre": "", "year": 2003}}]