[{"title": "Gangsta Shit", "href": "Gangsta_Shit&&4888", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne talking)\nUh-oh, uh-oh\nYou know how we do it\nWeezy and Petey, baby\nYa'know\nThis here is 500 Degreez\nHolla at 'em dogg\n\n(Petey Pablo)\n'Cause I know I ain't dreaming\nI swear to God it sound like Petey Pablo on that track with Lil Weezy\nSwitching it up\nFuck it put them things on the truck\nWhat's the name of y'all jeweler tell 'em freeze me up\nHating me kinky licks talking so much\nLemme give these sons of bitches a reason to keep it talking\nYou want to\nYou ain't built to squabble with us\nI come to your show with heat homes and run on your bus\nI drink your water up\nCool off I'm leaving with something\nThey leaving you something crop stolen\nAn asshole heard it\nHip on purpose\nDre I did what you told me\nI been acting like I don't hear ya but that shit been working\nKeep me a burner\nPoison that I grab in the morning\n'Cause I know that that's what's gon hold me down on this earth\nA real nigga trill nigga pull out and get debated\nI keep waiting\nI hear your name in the papers\n\n(Hook) (Lil Wayne and Petey Pablo)\nThey call me young as Weezy\nI'm gon round up the whole uptown\nWe gon burn this bitch down to the ground\nPeople understand that you're fucking with some motherfucking soldiers\nCrazy-ass Petey\nI'ma tell a nigga just like this\nIf you want it boy you sure can get it\nYou ain't heard\nIt's Cash Money and that Carolina nigga\n\n(Lil Wayne)\nThey call me gangsta gangsta\nWeezy, Weezy\nLil Birdman junior\nHolla at ya nigga\nI fuck around and throw a bottle at you nigga\nI'ma big pimp I throw a model at you nigga\nSquad-ad squad up throw up the motto at you niggaz\nYou can mind up I throw a hollow at you nigga\nAnd I'm so high\nNo I'm too high\nBut a little work on a few blocks\nAnd I put a few skirts on a few blocks\nIf you dirt you feel the burst from my fuse box\nOh lordy there nobody like me shortie\nI hold Cash Money myself it's me money\nOld cats wants to test come see shortie\nI got it all hot it in the pocket I'll pop it\nI riding in a 'Rarri where the top is in my pocket\nThat's young Weezy baby\n\n(Lil Wayne)\nYou see it's young Wayne\nGame is ashamed and they say he's a pain\nHe is crazy deranged\nPut them blades on his thing\nJust like 80 to summer\nSo, when the sun hit it look like Baby or something\nSo, when I come through the ladies praise me or something\nLike, Weezy's the man\nIf you be's where he be's then you leaves with a tan\n'Cause he's 500 Degreez\nI need a fan, whew\nCool me off wipe me down\nDaddy is back in town\nWith the back of my Caddy slanted down\nAnd the mack goes +black+ if you ask around\nPut some hash in that grass that you pass around\nThen I stash a pound by my ave with rounds\nI'm a gangsta until they put my casket down\nYou can ask around\nAnd they tell you like me\nThere ain't nobody like me\nIt's Weezy baby\n\n(Lil Wayne talking)\nAiiyo see this is right here is Young Weezy nigga\nDon't get it tangled and twisted\nI'm in the studio right now nigga\nWith my boy\nMy nigga Boo in this bitch\nMy nigga hot boy album ya'know what I mean\n500 Degreez\nThey all riding with ya boy\nFi-Fi\nThey gotta feel me\nBirdman junior, number one stunna my partner\nYou know the name, bitch\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Not Like Me", "href": "Not_Like_Me&&2663", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Paparue)\nOriginal roughnecks, hear (laughing)\nCheck!\n\nNobody burn them blocks like-a we\nNobody bust them heads like-a we\nNobody could outshine we\nTha whole CMR, CMR family\n\n(Lil Wayne)\nLook, it's little rhymecholy\nLegendary like Bob Marley\n17 ward superstar, feel me\nI tell ya, shorty million dollar, nigga\nDon't test, 'cause lil' shorty is a rider, nigga\nGot my click behind me... every step of tha way\nHit your wards, with tha pump, with your chest and your face\nI'm a bloodhound... I ain't lyin', I'm thugged out!\nI'm from uptown... and that ain't no Beverly Hills\nYou wan' know what that be like? Well, curiousity kills\nSend chills up my trigga finger, blast tha dummy\n'Specially if it's a drought, I got ta have tha money\nTake tha hit, even if it's below tha average money\nGot to make it through tha week, and feed my family uppy\nI'm just a lil' thug, what\nBelt-buckle fall down to my cuffs, what\nAnd police don't even matter, they can suck what\nTha price right if I catch ya slippin', nigga, what what... what\n\nNobody burn them blocks like-a we (nawww)\nNobody bust them heads like-a we (hmmmm)\nNobody could outshin we\nTha whole CMR, CMR family ((Baby) What!) ((Pap.) For real!)\n\n((Baby) What! What!) Nobody burn them blocks like-a we ((Pap.) nawww)\nNobody bust them heads like-a we ((Baby) Say it, say it) ((Pap.) hmmmm)\nNobody could outshine we\nTha whole CMR, CMR family (For real!)\n\n(Mannie Fresh)\nEeh, what, what\nWhat, you got a (?), 'cause of tha threats that you sendin' me?\nLil' boy, I got so much money, I know who killed Kennedy\nI hear you tellin' people 'bout tha people you done\nBut look, every time I brought me to ya, you all about fun\nWhat made you bring a knife to a gun fight... now that's not right!\nWhy your bitch-ass even showed up tonight?\nNigga, we use ta kick it like Tai Bo\nI don't know... what made you go sideshow, turn jive whore\nKickin', trifling, dirty, and low\nWe use ta split chicken... ride ta Texas and back\nI drive tha rental car while you drive tha Cadillac\nShakin' like a pair of hot dice\nDoin' 55, duckin' feds, law enforcement, and police\nNiggas turn like fake gold... sell they soul\nTreat'cha like Chicago in tha winter: ice cold!\n9-karat 44's, and Calicos\nKeep a clean nose\nAnd tight Teflon bullet-proof clothes\n\nNobody burn them blocks like-a we ((B.G.) What? What?)\nNobody bust (Stop!) them heads like-a we (What? What?)\nNobody could (Stop!) outshine (Stop!) we (What?)\nTha whole CMR (What?), CMR (What?) family (What?) ((Pap.) Uh-huh!)\n\nNobody burn them blocks (Stop!) like-a we (Stop!) ((Pap.) nawww)\n((B.G.) What? What?)\nNobody bust them heads (Stop!) like-a we (Stop!) ((Pap.) hmmmm)\n((B.G.) What? What?)\nNobody could (Stop!) outshine (Stop!) we (What?)\nTha whole CMR (What?), CMR (Stop!) family (Stop!) ((Pap.) For real!)\n\n(Baby)\nNigga outta line, get smoked\nI don't kidd, or joke\nFuckin' with my B.G., off top I'm goin' broke\nI don't play with these niggas\nI get... low down and dirty\nAnd have niggas' brains coverin' tha ground\nI'm tha number-one stunter, you don't want my trouble\nI'll have four niggas in your hood in my hummer\nI'm from back in tha game, but ain't a damn thing change\n\n(B.G.)\nYa get a whole thing for ten, nigga, tha price tha same\n\n(Baby)\nMy money long, but it don't run with tha airport\nI just bought a Hotel Cash Money Resort\nHos love my grill, hos love my crib\n\n(B.G.)\nThese hos just love tha way that... Baby live\n\n(Baby)\nBut I'm a thug-ass nigga, arms full of some taps\nGot a Cash Money Millionaires 'cross my back\nYou don't want funk with me... I don't think you do, nigga\n\n(B.G.)\nWe'll put ten-a-piece on your whole crew\n\n(Baby)\nWhat!\n\n(Fading out begins in 4th)\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "Realized", "href": "Realized&&7249", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nWhat?!\nWhat?!\nLook-\nOkay, let's cut the crap\nI'm straight gangsta - forget the rap\nI only stick with that 'cause my ma don't wan' see me flip the crack\nAnd I'm quick to click and spit the gat\nI be dipped in black\nSip the Coke mixed with Jack - Calico, clip to match\nLike: where them cats who trippin' at? - Point niggas out\n'Cause right now I'm full of that spinach that'll knock Lennox out\nThe Mack-10 is out, as well as the gauge and the pump\nYou turn the page on the newspaper, see my face in the front\nI lock it down for all my niggas that still caged in the dump\nSo if I come, nigga, just save me a blade and a pump\nI'm raised in the slum where the bad grow\nUnlike no other, I'm real gutta like bag 'Bauds\nI stash O's in the drawers of my trash hoes\nI flash dough at the laws when they pass slow\nI mash low in a stolen hot RAV-4\nThe Macks blow bullet holes for my cash flow\nIs that so?\n\n(Hook (Lil Wayne))\nI don't think you realize what's happenin', dog\nThat lil' boy's 'bout to come 'round here blastin' at y'all\nIf you don't get the hell when he swervin' by\nThat's your issue - God bless ya - you deserve to die\n\n(Lil Wayne)\nLook,\nWhich one of these niggas playin' with me?\nI'ma strap up and slam his parent's street\nWhen I blast, bullets spit faster than MC Hammer beats\nI be damned if he get a chance to sleep\nI clamp the magazine in my gun and cut his family tree\nI flash the piece at your lil' woman and make her dance for me\nThen jam the freak with a broom - blood leak from her panty crease\nThere has to be some explanation for this insanity\nYeah, y'all niggas faker than that boy (fill in the blank)\nNow give me the dank\nNiggas claim they want war when I suggest you live in a tank\nWhat's your kid gonna think?\nCome home and find your wig in the sink\nI dig in the bank, and pull out eighty, then cruise to Haiti\nFor fifty G's I get ten keys and straight out weight it\nI lock my area down - you can ask these boys\nThey know Wheezy got more white than the Backstreet Boys\nNever catch me UNPACK without them plastic toys\nIt get drastic, boy\nNiggas that's askin' for it\nWheezy, nigga\nIt's Wheezy, nigga\nWho? Wheezy, nigga\nIt's Wheezy, nigga\n\n(Hook (Lil Wayne))\nI don't think you realize what's happenin', dog\nThat lil' boy's 'bout to come 'round here blastin' at y'all\nAnd if you don't get the hell when he swervin' by\nThat's your issue - God bless ya - you deserve to die\n\n(Lil Wayne)\nI hope y'all niggas understand that I ain't playin' or jokin'\nBust shots, make you think the Grand Canyon open\nLeave a busta bandana smokin' from hot hollows\nMe and my niggas flip your coke, then cop hot hoes\nTwo pistols, desperado gun busta\nPump one under your chest and knock a lung from ya\nHung under them killers and duck the pigs\nAnd all of our diamonds shine, and our trucks are big\nAnd, nigga, I don't really care if I don't sell a million quick\n'Cause right now I'll quit and go and sell a million bricks\nI sticks to what I love, and that's the street\nAnd stay away from what I hate, and that's police\nAnd I keep a trigga somewhere on me to start blowin'\nAnd leave a nigga somewhere lonely with his heart showin'\nWhen we all knowin' that Wheezy have never been fake\nThe metal will spray and let the bullets tear up your face\nWho is Wheezy, nigga?\nWho is Wheezy, nigga?\nWheezy, nigga\nLil Wheezy, nigga\n\n(Hook-2x (Lil Wayne))\n(Lil Wayne)\nSay, I don't think you realize what's happenin', dog\nThat lil' boy's 'bout to come 'round here blastin' at y'all\n\n(Lil Wayne (talking))\nIt's Wheezy, nigga - Lil Wheezy, nigga\nDon't tangle it, nigga\nIt's time to step down, ya heards me\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "On The Grind", "href": "On_The_Grind&&7255", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nWhaaat\nYou can find me on the corner with stones, quarters and zones\nOr dope and powder broke, and our sale's soap and flour\nAnd most of our customers come up to us daily\nYet and still I cut this stuff crazy - a hustler, baby\nWhat can I give you? I distribute ki's to the kings\nAnd z's to the fiends, and ecstasy and weed to the teens\nYou need to see Wheez - anything you like and I have 'em\nFrom crack to Viagra, and Vicadins valiums\nI'm the nigga they point to when you hit my av\nSo get all your money together, come and get my slabs\nI get my cash, put some aside, and flip like half\nAnd still enough for me to TV and deep-dish my Nav'\nAnd you can tell the law that I say they can kiss my acid\nFor the white people,\nWhen I get two bricks for ten, I know the right people\nAnd I keep a nine on my waistline\nAnd I'ma be right on the corner, wodie - I'm gonna grind\n\n(Hook (Lil Wayne))\nI tell 'em, \"Whaaat!\"\nYou see me hustlin' on the block all the time\nSittin' at the table, breakin' ki's down to dimes\nSooner or later this neighborhood gon' be mine\nNigga, I'm tryin' to grind\n\nI tell 'em, \"Whaaat!\"\nYou see me hustlin' on the block all the time\nSittin' at the table, breakin' ki's down to dimes\nSooner or later this neighborhood gon' be mine\nNigga, I'm on the grind\n\n(Lil Wayne)\nNigga, y'all gon' respect Wheezy, or else the tec squeezin' shots\nI have your chest steamin' hot, and your sis' screamin', \"Stop!\"\nI hang out on the block, nigga, with rocks and weed\nOn the corner till the mornin', see the cops and flee\nAnd if we beef, we don't beef long 'cause we gon' creep all night\nSo I hope you don't sleep all night - we on your street all night\nSay, aw aw, I don't want your boy to get me shoes\n'Cause I spit tools, and put him tissues in his shoes\nAnd the bricks move every followin' week\nSo if you need to get it, too, then holla at me - got powder or d\nAnd I shower your streets until your av pass out\nMore bricks than \"The Three Lil Pigs'\" last damn house\nStack crack and lay back, and just laugh at droughts\nAnd issue work for half and just grab that south\nFor real, nigga - Wheezy Whee tryin' to shine\nFrom daybreak to nightfall I'm gon' grind\n\n(Hook (Lil Wayne))\nTell 'em, \"Whaaat!\"\nYou see me hustlin' on the block all the time\nSittin' at the table, breakin' ki's down to dimes\nSooner or later this neighborhood gon' be mine\nNigga, I'm on the grind\n\nI tell 'em, \"Whaaat!\"\nYou see me hustlin' on the block all the time\nSittin' at the table, breakin' ki's down to dimes\nSooner or later this neighborhood gon' be mine\nNigga, I'm on the grind\n\n(Lil Wayne)\nStart from grams to ounces to quarters to halves to ki's\nTakes seconds to minutes to hours to days and to weeks\nGotta grind, work, hustle, struggle, and get it\nGotta buy, cook it, cut it, sell it, and flip it\nAnd I flight everyday and night from the corner to the avenue\nAnd I'll sleep next week, man, I got yay, dope, and crack to move\nAsk them dudes when Wheezy open shop, I ain't got a bag to lose\nEspecially if I don't like who sent 'em to me and I'ma tax a dude\nDuck the Feds and drama like I duck my baby momma\nSometimes I play it sour - what you thought was yay was flour\nI pull whatever for the cheddar - nigga gotta flash and floss\nDrought come around, then it's jack the cost or jack the boss\nCock the gun, then I push rocks till I spot the sun\nAll day I hung the block, I see the cops and run\nI'm tryin' to get rich 'cause I wan' shine\nYou can find me on the block, nigga, all the time\n\n(Hook-4x (Lil Wayne))\nI tell 'em, \"Whaaat!\"\nYou see me hustlin' on the block all the time\nSittin' at the table, breakin' ki's down to dimes\nSooner or later this neighborhood gon' be mine\nNigga, I'm on the grind\n\n(Lil Wayne)\nLook,\nWhaaaaaa\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Fireman", "href": "Fireman&&5490", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "I'm the Fireman\nFire, Fa, Fireman\nI got that fire I'm hollering\nI got that fire come and try me and\nYou can spark it up and I'ma put you out\nYou can spark it up and I'ma put you out\n\nAin't nobody fuckin' with me man, Heatman\nSki Mask spending next weeks cash, he fast\nAnd I don't even need a G pass I'm pass that\nI'm passing 'em out now and you can't have that\nAnd my chain Toucan Sam\nThat tropical colors you can't match that\nGotta be abstract\nYou catch my gal legs open betta smash that\nDon't be surprise if she ask where the cash at\nI see she wearing them jeans that show her butt crack\nMy girls can't wear that why, that's where my stash at\nI put my mack down that's where you lack at\nShe need her candlelit and I'ma wax that\nI rekindle the flame\nShe remember the name\nIt's Weezy Baby January December the same\nMama gimme that brain\nMama gimme that good\n'Cause I'm the fireman\nYou hear the firetruck\n\nI'm the Fireman\nFire, Fa, Fireman\nI got that fire I'm hollering\nI got that fire come and try me and\nYou can spark it up and I'ma put you out\nYou can spark it up and I'ma put you out\n\nFresh on campus it's the Birdman Jr\nMoney too long teachers put away ya rulers\nRaw tune not a cartoon\nNo shirt, tattoos, and some war wounds\nI'm hot but the car cool\nShe wet that's a carpool\nBeen in that water since a youngin you just shark food\nQuick Draw McGraw I went to art school\nYeah the lights is bright but I got a short fuse\nDon't snooze\nBeen handling the game so long my thumb bruise\nYa new girlfriend is old news\nYeen got enough green and she so blue yeah\nCash Money Records where dreams come true\nEverything is easy baby leave it up to Weezy Baby\nPut it in the pot let it steam let it brew\nNow watch it melt don't burn ya self\n\nI'm the Fireman\nFire, Fa, Fireman\nI got that fire I'm hollering\nI got that fire come and try me and\nYou can spark it up and I'ma put you out\nYou can spark it up and I'ma put you out\n\nRidin' by myself well really not really\nSo heavy in the trunk make the car pop-a-wheelie\nWho? Weezy Baby or call me Young Baby\nMy money 360, you only 180\nHalf of the game too lazy\nStill sleepin' on me but I'm bout to wake em\nYep! I'm bout to take 'em to New Orleans and bake em\nYeah it's hot down here take a walk with Satan yeah\nCome on mama let The Carter make ya\nToss ya like a fruit salad strawberry-grape ya\nThey ball when they can and I'm ballin' by nature\nAddicted to the game like Jordan and Payton\nY'all in a race and me I'm at the finish line\nThey running for too long it's time to gimme mine\nStraight down ya chimney in ya living room is I\nWeezy allergic to wintertime... hot\n\nI'm the Fireman\nFire, Fa, Fireman\nI got that fire I'm hollering\nI got that fire come and try me and\nYou can spark it up and I'ma put you out\nYou can spark it up and I'ma put you out\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Loud Pipes", "href": "Loud_Pipes&&8409", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Big Tymers)\nMannie: Wha, wha, yeah... yeah...\nBaby: Without a doubt...\nMannie: All true...\nBaby: Say it... I mean, since you love to shine...\n(Big Tymers... Fresh..) (Tymers...)\nMannie: Yeah, Yeah, Yeah...\nBaby: (Big Diamonds... Big Tymers...)\nMannie: Yeah, yeah...\n\nMannie (of Big Tymers):\nI put 'Cris stains on private planes, 'cause it's my jet,\nNigga, money ain't shit cause my rottweilers drink 'Moet.\nDiamond baugette bracelets... for my lovers...\nPlaya, I use 'Cristal to lubricate rubbers...\nWho got, shit on his wrist that cost three nickel?\nWho got, the project on lock when that nigga slangin' pickle?\nWho got a, benz, a prowler--playboy--and a 'Vette...\nTell the truth, who fucked ya' on the same night when we met?\nNow, who got baby mama's from N.O. to New York?\nWho got, every bitch attention in this muthafucka' when he talk?\nNow who the fuck we talkin' bout, look--Y'all don't know?\nI'll give you a hint... See that bitch you with? He fucked that ho.\nNow look here, y'all ain't seen my watch? It's like Harlem World video,\nWhite diamonds, red rubies, blue baugettes, I don't know...\nShorty, whens the next time I'm'a be up in your bed,\nI love you? You love me? Well go head on, and give me some head...\n\nJuvenile: (Chorus 2x)\nLoud pipes, Big rims,\nWhodi, that's our life...\nWhen we pull up at the club,\nSorry, that's our night...\nI know a lot of haters out there,\nSayin', that that's not right...\nBut our diamonds are much bigger,\nSo, that's our life...\n\nBaby (of Big Tymers): No doubt, Juve'! Lah-lah...\nI told Sol, \"I need somethin' with some hell of a ice,\" (Ice...)\nNigga came back with a hell of a price... (Price...)\nThat ain't nothin', these ho's doin' hell'a wrong... (Violatin')\nCallin' these niggas on our cell phone, (Violatin')\nBitch ridin' Benz on twenty-inch chrome, (Chrome..)\nGimme the key, the car ho, and the alarm... (All my shit..)\nFor my Prowler, my Jag, my Benz and my home, (Give it here...)\nBitch, you'll never ride twenty-inch chrome... (Neva' Neva' Neva')\nI love to shine, that's why the choppa's mine, (Mine...)\nHit my block in my Benz, ho, with stretch tires, (Tires...)\nBought a new car that I couldn't drive, (Drive...)\nBrought it to 'Tunes before a nigga could sign, (Sign right here...)\nNow put the Bose system right behind my eyes, (Eyes...)\nWith the VC's and TV's, so a nigga could shine... (Shine...)\nLet my ice **Bling Bling** like a nine to five, (Five...)\nAnd tell all my ho's, they don't need no job (No job, whodi...)\n\nJuvenile: (Chorus 2x)\n\nBG: I ride the best...\nFrom a Benz, to a Jag, to a Beamer, to a Lex,\nMight fly first class on Delta, helicopter, or a jet,\nI'm a stunna, I'm a reppa, G'zy like to shine,\nDrink Don, Moet, and Crissy, that's the finest wine,\nTwenty inches is the only thing I'll sit my shit on,\nDon't bring ya' bitch around me, cause my dick she'll wanna sit on,\nAnd I ain't gon' tell her nothin' different, that's ya issha, (Issue..)\nBut after she come back, your best out is not to kiss her,\nHo's sick, sayin' damn, look at Fresh pinky ring,\nLook at BG watch, that bitch bling-aling-aling...\nI'm a ice wearer, trust me, you will never,\nSee me sportin' nothin' that ain't 20 G's or betta,\nMe and Wayne take the left, Juvy and Baby take the right,\nIt's dark in the room, we hold up our watches and it's light,\nCash Money Millionaires livin' a hell of a life,\nLike my nigga Weezy said, \"Surrounded by iceee...\"\n\nJuvenile: (Chorus 2x)\n\nLil Wayne: Whoa... Whoa... Whoa...\nNow, I'm shinin, beamin, glossin, Big Tymin, stuntin, and flossin...\nLamborghini sit on broaders, with two more in my garages...\nPlus, a blue and black Ferrari, with Nintendo and Atari,\nMan, I swear the car is awesome... Vroom! Sorry, we lost 'em...\nI'm back, I pull up smellin' like dimesacks and 'Conyac...\nI leave in a Hummer, hour lata' I'm flyin' back,\nSshhhhh... private jet's about to land,\nThe women fall out when I let 'em touch my hand,\nI get out the plane into a Mercedes-Benz van,\nTV's all over with chrome twenty-inch fans,\nDamn... God - damn... Man - I am... L-I-L... Weezy, off the heezy...\nBut still and all, ice floodin' out my watch,\nAnd in my grill and all, Porche Box', run blocks,\nSKRRT! Peelin' off, Me and Slim in a Rover,\nBeatrice... Brick holder, Cash Money young soldier... Whoa!\n\nJuvenile: (Chorus 3x)\n\nJuvenile:\nMmmmmmmmmmmm... Wheezy-Wee...\nCash Money Millionaires in this muthafucka,\nRespect it, or check it!\nMy nigga, BG'zy, My nigga Mannie Fre'zy,\nMy nigga, Baby...\nFuck y'all rest of y'all niggas...\nYa heard me?\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "Only Way", "href": "Only_Way&&4845", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Baby talking to Wayne)\nAy Wayne\nI know this bullshit that I'm hearing ain't true right\nYa feel me\nThese niggaz out here picking bullshit over money nigga\nBut you know what fuck a nigga\nWe gone keep grinding this shoe box is full\n\n(Chorus: Baby)\nThe only way we get it only way we know to get it\nOff the block, off the clip, off the cain nigga\nThe only way we live it only way we know to live it\nOn the grind tote a nine do yo thang nigga\nThe only way we get it only way we know to get it\nOff the block, off the clip, off the cain nigga\nThe way we live it is the only way we know to live it\nOn the grind tote a nine do yo thang nigga\n\nWell I'm a 17 nigga got that hollygrove in me\nIt ain't coming to me so I gotta go get it\nYou ain't fucking with me I got the hottest flow nigga\nThere ain't nothing to see because I'm not in yo vision\nOn and I'm gone get fed up one day\nPut lead up in the K\nCome and hit up where ya stay so\nBaby momma betta get up out the way\nCause the bullet got no heart\nAnd the trigger man crazy\nLittle man if a bigger man jumps through\nThen I'm in the hood with the pump in the truck looking\nBut if you ain't in them cuts or on them benches\nI'm a park the fucking truck and knock yo door off the henges\nYes weezy baby flow off the henges\nSo off the tempo no pad or pencil\nWell let me go back to what men do\nThrowback Benz purple, Throw back 22's Bitch\n\nWeezy F. Baby hand cocked\nDemand my cheese\nFuck you pay me\nAnd I can't stop\nPlease, what you crazy?\nMan I'm a get it like the man on the chorus\nGot my hand on a fortune\nBang at ya porches, Bang at ya window\nKidnapp ya neighbors, torture ya kinfolk\nAnd tell the cops I murder the infoer\nLeave him on the precinct steps in a pillow\nNiggaz wanna keep they breath then tell 'em get low\nI got ten left in the tech so what they here fo\nNigga you ain't scaring nothin' weezy been a tiger in the jungle since a cub\nWith my paws in the mud, yeah me and my paw in the mud\nInterior mayback like what, Bitch nigga!\nIt's the Birdman and Birdman Jr\nAnd he ain't got to his son a shoot ya blah\n\nHomeboy you gotta know that avenue\nTo get off a bag or two or you just passin through\nTrue true, and we just passed the truth\nPassin through the streets of the murder capital\nWhere you think ya own brothers after you\nSo you ain't got no other brother after you\nDon't let the boys in blue capture you\n'Cause they got pictures of me at it too\nIt's all fucked up\nBossman weezy get y'all touched up\nGat blacked ya face like ya run into a wall or something\nIts cash money all or nothing\nIts Lil Wayne the reverand call it Sunday\nThe congregation know I come with nothing\nBut leave with everything, I ain't come for nothing\nAnd the choir know I come with money\nAnd y'all know I'm Stunnas youngin like dat bitch\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Enemy Turf", "href": "Enemy_Turf&&6228", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Juvenile)\nAh hmmm hmmmm\nHmmmm Hmmm\n\n(Verse 1 (Juvenile))\nWhen I say I don't give a fuck\nI mean that yeah\n?? Brains is getting bust\nI didn't say that yeah\nIf a shipment was comin' in\nI need a ?? wodie\nI need a sixty-forty nigga\nAnd no chargin' that wodie\nYou done heard about Michael Jackson\nAnd shiggidy shit\nBut you ain't never heard about me\nWhen I'm flissin a bitch\nNiggas shoulders gettin' knocked\nClean off of they head\nSee that red dot comin' from\nMe and my girlfriend\n'Cause I wants mine\nI needs mine\nAnd I'm about to get mine\nAt these times\nLook lil' daddy\nYou ain't got to worry about none of these other niggas\nYou needs to be worried about when Juvi comin' to get ya\nLook, I make a phone call to the big dog\nY'all bitches better handle y'all business before I hit y'all\nEven though a nigga rich and I rock ice\nI still bust a nigga head on the block aright\n\n(Chorus 2x (Juvenile and Lil Wayne))\n(Juvenile)\nIt's enemy turf that I'm on\nSo I'ma play it how it go\nCock the hollow points\nAnd tote my black calicoe\nMy lil' brother Weezy\n\n(Lil Wayne)\nMy big brother Juvi\nFour hit the blocks\nStrapped up with the Uzis\n\n(Verse 2 (Lil Wayne))\nWhat, What, La\nGun for gun\nEye for eye\nBetter move yo' wife and son\n'Cause I ride or die\nCashmoney Hot Boy\nBless me when I'm gone\nBut until then load up the chrome 'cause it's on\nI been 'bout it\nPut a ??????\nI drop the top and then I flip I hit his cock and make 'em flip\nAnd I be full of that trash\nI be the first one to jump out the jag bust at 'em fast\nWatch the bullets chop off the head\nAnd make 'em fall in the grass\nOne move they all die\nLil' Weezy small frie\nGuerilla when it's war time\nY'all better learn\nWhen this nigga shoot it'll be all hell\nWell then let 'em burn\n????????????????\nSeven churn and I be damn if I let 'em go\nIf I don't get my dough\nThen hell will be all blowin'\nTill I R.I.P CMR I be\nI put it down for all my peeps\nNigga, I'm HB for real\n\nAll I know is the streets\nAnd how to strap up\nWhen it's time shoot it\nCock yo' heaters\nTie up yo' bags\nIt's time to do it\nBlaze the blunt\nShut off the lights\nAnd cut down the music\nRoll down the windows\nTurn the corner\nAnd let loose with the bbbbrrrrrr\nIf ya don't know now\nThen ya never will learn\nYou ca play with Lil Wayne\nAnd yo' block get burned\nYou must love to go swimmin\nCause tha water gets deeper\nSee I bust you wide open\nAnd take 'ya daughter with me\nHere come the beat boy\nShoot out the street lights\nTime to bring on the heat boy\nIf you ain't really wit it\nThen you better get back\nI open yo' chest\nAnd make it look just like a wet cat\nThis is a death trap\nI'ma a guerilla and I mean it\nLeave ya' head still in a beanin'\n?? On the semen\nCalicoe steamin'\nRed dot beamin'\nDressed up suspicious\nPlay with lil' Weezy you'll be ?? for the vicious\n\nEnemy Turf\nTime to strap up\nWhat\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "Where You At", "href": "Where_You_At&&289", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "All my niggaz if you with me\nWhere you at? (OH!)\nAll my soldiers if you with me\nWhere you at? (OH!)\nAll my hustlaz if you with me\nWhere you at? (OH!)\nWhere you at? (OH!)\nWhere you at? Say (OH!)\nNiggaz if you with me\nLet me hear you say (OH!)\nSoldiers if you with me\nLet me hear you say (OH!)\nHustlaz if you with me\nLet me hear you say (OH!)\nSay, say (OH!)\nSay, say (OH!)\n\nAye (OH!)\nI come and do my thang and hold down my SIDE\nEagle Street man throw my set up HIGH\nWeezy Wee gang call them boys that SQUAD\nThat Squad... SQUAD UP! YOU KNOW\nAnd WE get a lot of dough on the strength of ME\nGet a lot of 'dro for the strength of FEE\nGet a lot of blow\nBut keep that on the D\nD what?...DL! YOU KNOW\nAnd OH you don't wanna fuck with a nigga\n'Cause a nigga might fuck with the trigger\nLeave a nigga on the FLO'\nTruly I don't buck with you nigga\nLet my tooly talk talk to you nigga\nBitch man is an itch to a rich man Whoa\n'20s on the six with the kicks sitting LOW\nSticky in my swish man gasoline FLO'\nFire spit man Weezy is about to BLOW\nYa know!\n\nAye (OH!)\nPass the pine to the pimp old juice killer\nCatch your eye in one glimpse old school with the\nAss up high the front dip drip BAM\nMami like DAMN Lil Wayne STOP PLAYING\nBaby I'm a baller I hustle with my father\nIt's the Birdman and Birdman J.R.\nFlip them birds man eighteen grand just order\nEighty-five for half and forty-five for quarter\nYeah! Tity baby put it in the AIR\nI'm jumping out this atmoSPHERE\nAnd I'm jumping in your bitch if she at a PLAYER\nJumping in the painted thing on that Dang-A-Dangs\nYou see the arm when I pass nigga Bling-A-Ling\nYou now I'm armed we can mash man it Ain't-A-Thing\nYou know I'm calm but I'm a gorilla Ain't-A-Game\nI got a banana clip for all you Orang-A-Tangs\nLet's bang!\n\nAye (OH!)\nIt's young Weezy can't nothing see me DOG\nI get you done easy with one easy phone call\nAnd the sawed off make your arms fall off\nLike a short sleeved polo... wont bother me no more\nIce like strobe light... look like I'm moving slo mo'\n'Rarri look nice on low pro Yokahomas\nWith '20 inch chromes poking out 'em\nChrissy to the dome toke the ganja\nRedbone in the shower\nHello! Pochahontas give a long stroke poke for hours\nFlow in vagina hoe I'ma holla\nSold coke in the nineties I'm honest man\nNothing big maybe ounces, grams\nBut I know how to double... and sometimes it's scams\nBut I know to hustle... and some glocks'll jam\nBut I know how to bust'em... and some drops'll slam\nAll alloy buttons that's all stunting\nThat boy's something Yeah\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Drop It Like It's Hot", "href": "Drop_It_Like_It%27s_Hot&&3626", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nDrop, drop, drop, what what what\nAfter you back it up then stop\nWhat, what, wha, drop it like its hot\nAfter you back it up and stop\nWhat, what, wha, drop it like its hot\nNow drop it like it's hot, drop drop it like its hot\nDrop it like it's hot, drop drop it like it's hot\nMake em' drop it like its hot, drop drop it like its hot\nDrop it like it's hot, drop drop it like it's hot\n\nHehe, listen\n(Verse 1- Lil wayne)\nYou know me girl\nI'm a cash money millionaire look at my Rolie (Rolex) girl\nDrop to your knees top ya hair, ah ah slow me girl\nNow hit it strong, won't be long, now catch it slowly girl\nNo he didn't say that, yes I did girl\nI don't use rubbers, and I don't plan no kids girl\nI don't want your number, I want your trouble, in ya skins girl\nThen after that, you can get it how you live girl\nThat's on the real girl, I'm a pimp girl\nGet it twisted, I'll slam you like Shawn Kemp girl\nI know my neck get it hot like a lighter girl\nI just slap you a couple of times, never fight it girl\nThat's 'cause I likes it girl\nAnd let me tell you somethin' girl, I am a player girl\nSo don't you try to play me 'cause I never save a girl\nDo me a favor girl, and wet the spot girl\nAnd after you back it up, drop it like its hot girl\n\n(Chorus - Lil wayne)\nNow after you back it up then stop\nWhat, what, wha drop it like its hot\nNow after you back it up then stop\nWhat, what, wha, drop it like its hot\nMake em' drop it like it's hot, drop drop it like its hot\nDrop it like it's hot, drop drop it like it's hot\nMake em' drop it like its hot, drop drop it like its hot\nDrop it like it's hot, drop drop it like it's hot\n\n(Verse 2-B.G.)\nFirst time need you to bend both knees\nWobble that ass right, then pop that pussy\nThe left one time, the right two times (whoa)\nShow a nigga somethin', put it on a nigga mind, come on, come on\nNice workin, bitch\nAin't no need to hold it in, what you workin with\nYou want a Hot boy, hear me, work it bitch\nThen break a nigga off, let me hurt you bitch, let me hurt you bitch\nI'm on fire yeah\nI'm nasty and I'ma make you holler yeah\nGirl think I'm playin', I'ma freak ya down\nI'ma show you how we do it on ?VL? Uptown, I'm wanna hear you make the move\nOoh B.g sounds, I wanna hear you say aw boy you laid that down\nAw you laid that down\nI'm hot yeah, people say I'm off the block\nBut I won't stop till you drop it likes its hot\n\n(Chorus-Lil Wayne)\nNow after you back it up then stop\nWhat, what, wha drop it like its hot\nNow after you back it up then stop\nWhat, what, wha, drop it like its hot\nMake em' drop it like it's hot, drop drop it like its hot\nDrop it like it's hot, make em' it like it's hot\nMake em' drop it like its hot, drop drop it like its hot\nDrop it like it's hot, drop drop it like it's hot\n\n(Verse 3 - Lil Wayne)\nI'm a rider boy, the hottest boy, respect me\n'Cause I'm on fire boy, on fire boy\nGot them trees, holler boy, holler boy\nBout my cheese, them dollars boy, dollars boy\nI'm a seventeen survivor boy, with choppers boy\nI got guns that go BLOCK A boy, BLOCK A boy\nY'all runnin' with a monster boy, reason Wayne callin y'all\nAnd I'm a mobster boy, hit it right I get my ball on like soccer boy\nI keep it right I ain't gon thaw it off I'm a Tymer Boy\nGo up in flames blockburner that's my motto boy\nIt ain't a game, I cock that 'cause I'm inside a boy\nI'm a pimp, got a wife that'll holler boy\nCatch her at the house steppin out the shower boy\n(Shhhhhhhh) hehehehehe, got a lotta boys\nClaim to be soldiers but lies boy\nAnd if I catch 'em I'ma bat 'em and make 'em retire boy\n(Mannie Fresh)\nBut a hump in your back and bend your rump\nHey sexy little mama we can do the hump\nAnd you can hurt me hurt me, sex me sex me (what)\n(Lil Wayne)\nAnd after he finished, next me next me\n(Mannie Fresh)\nWork it jerk it pull it hold it grab it (whoa)\nI need it eat it beat it, silly rabbit (ooh)\nHa, I stuffed you in the ass (ooh)\nGot this thang up in ya like a snake in the grass (sss)\nI know you wish you could go home (go home)\nTo a nigga with a dick like a python (python)\nStank bitch ya like a off the hook telephone (telephone)\nGot ya walkin' round with nothin' but a fuckin' thong (wha?!)\nTake the switch out on these freaks because 'cause I'm so wrong\n(Lil wayne)\nSo wrong, so wrong, so wrong\nDrop (wha) so wrong, listen, listen, listen\n\n(Chorus-Lil wayne)\nNow after you back it up then stop\nThen what, what, wha drop it like its hot\nNow after you back it up then stop\nThen what, what, wha, drop it like its hot\nMake em' drop it like it's hot, drop drop it like its hot\nDrop it like it's hot, drop drop it like it's hot\nWe make em' drop it like its hot, drop drop it like its hot\nDrop it like it's hot, drop drop it like it's hot\n(Lil wayne)\nTell em' after you back it up then stop\nWhat, what, wha drop it like its hot\nWe tell em' after you back it up then stop\nWhat, what, wha, drop it like its hot\nWe make em' drop it like it's hot, drop drop it like its hot\nDrop it like it's hot, drop drop it like it's hot\nMake em' drop it like its hot, drop drop it like its hot\nDrop it like it's hot, drop drop it like it's hot\n(Lil wayne)\nThey go wobblety wobblety, wa a wobblety wobblety\nWa a wobblety wobblety, drop drop it like its hot\nMake 'em wobblety wobblety, wa a wobblety wobblety\nWa a wobblety wobblety, wa a drop drop it like its hot\nNow after you back it up then stop\nWha wha wha, drop it like its hot\nThey gotta wobblety wobblety wa a wobblety wobblety\nWa a wobblety wobblety, drop drop it like it's hot\nTell 'em after you back it up then stop\nThen wha, wha, wha, drop it like its hot\nMake 'em after you back it up then stop\nThen wha, wha, wha, drop it like its hot\nDrop it like it's hot drop drop it like its hot\nDrop 'em like it's hot, drop it like it's hot\nDrop it like it's hot drop drop it like its hot\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "Worry Me", "href": "Worry_Me&&5202", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "You gotta walk like a (soldier)\nTalk like a (stunna)\nMove like a (player)\nAnd get it like a (hustler)\nYou gotta walk like a (soldier)\nTalk like a (stunna)\nMove like a (player)\nAnd get it like a (hustler)\nBecause I won't let y'all worry me\nI got something chrome that I carry with me\nIt's Young Weezy Wee y'all ain't scaring me\nI'm the seventeen don till they bury me\n\nEh, it go whoa oh me oh my ay ay\nI'm H-O-T-B-O-Y ay ay\nI'm so fly I'm the Birdman Jaya\nStunting in the gray uh\nShortie play your player\nSlick clean hey ya\nFifteen riding with me spray ya\nYou don't want no drama with me play fa\nKeep low or it's murda she wrote pussy nigga\nI gotta keep it cooking 'cause the streets still hot for a shooking\nPlus my late pops still looking\nBust my tray quick if ya hate the pimp\nThink it's all big fish I don ate the shrimp\nRoll out with the hood 'cause I'm so damn street\nI rep Hollygrove and Hollygrove rep me\nAnd that's how Weezy Wee be\nAnd y'all gon R-E-S-P-E-C-T me\n\nI'm riding and I'm dolo on my way to the stizzo\nKnowing on my waist is the sizzo\nWheezy so hot glock ten and a pistol\nBig rims with the tires thin as a pencil\nMami want me 'cause I got pimping potential\nI stick to my mental\nDon't make me stick my fifth to your temple\nForget I'm getting rich for a cent\nBitch I'm coming get you for my baby mama's rent I will flip you\n90 on the highway seeing what the whip do\nCops get behind me they want see the whip too\nS-Q professor C-M-B alumni\nEverybody else fails except the young guy\nDon't worry bout Weezy for real nigga I done mine\nGot the biggest nuts up in here nigga I swung mine\nThe streets taught me never to fear nigga I run mine\nI can't lose 'cause I won mine\nNow run yourself\n\nI got five drinks with me\nAnd there be four chunks of dro up in my lung pipe\nThree guns\nTwo bitches\nAnd all I need is one knife\nAnd I bet you don't like\nC'mon we only get one life\nAnd if it's done right\nFreak a nigga might wife her\nYou know S-Q galore low chop three striper\nI'm just trying to keep paper\nPlease, don't be a hater 'cause he'll take ya Weeze\nDon't be a major 'cause he greater\nCheese gon feed Nate\nBrother it's keys or emceeing\nAnd I'm a C-O-A 'cause I can move yay\nLike you never thought hard or soft like a duck\nAnd y'all don't starve me\nThat shit could be bad for your heartbeat\nCash'll get you snatched in a heartbeat\nMash in a mad dash in a Cadillac with the alligator dashboard\nDamn whore\nYeah I know\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Biznite", "href": "Biznite&&5613", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Biznite.Biznite... Nothing but it\n\nI'm dippin' in a black milleny benny sittin' on twentys\nTop off when the city's windy me and pretty Cindy\nShe dressed up in pretty Fendi and she sippin remy\nI'm Iceburg nuttin but whenny all the way to my tinny\nI'm hotter than a semi' 'cause this skirt she's wearing mini\nAnd plus my head is spinnin from drinkin' this fifth of Henny\nI stop at any deli cause this freakin with her penny\nAnd ain't no tellin' how many she 'umm already been in.\nWe get inside the room and she gigglin plain grinnin\nSlowly the lights dimmin and I'm slippin on my jimmy\nI'm feelin' with her titties this is only the beginnin\nI stick it in her kitty now she screamin come on gimme\nI'm flippin this chick over and I caught her slowly bendin\nI'm hittin got her twistin this is my ninny you hear me\nAnd when its time to quit I got her soakin wet and drippin\nShe asked me for a kiss ah...\n\nBiznite is you trippin'\nBiznite is you trippin'\nWhat\nBiznite is you trippin'\nWhat\nBiznite is you trippin'\nHe he he Wha...\nYou nothin' but a sack chasin cock tastin biznite\nYour never gonna amount to anythin' but a biznite\n'Cause all I wanna do is hit it raw I don't even wanna talk\nIf your baby come born with braids I ain't the pa\nNope I ain't the pa\nHell no I ain't the pa\nNo I ain't the pa\nHell no I ain't the pa\nNope I ain't the pa\nHell no I ain't the pa\nIf your baby come out saying wha... I ain't the pa\n\nI ride up in a Porsche Boxter see this fox her name was Tasha\nI got her when I stopped her at McDonalds with her partner\nI jocked the way she rocked her lil Versasce and her Prada\nI'm Iceburg (??)\nI jot her my phone number later on gave me a holla\nI popped up by her mamas so her nigga wont know nada\nShe took thirty minutes play me like a some kinda coward\nNow hopped up in my car and started talkin' 'bout her doctor\nShe said she started ridin' it in her babys fathers Honda\nShe wish that he would trade it in and cop a brand new Mazda\nI'm drivin' to the (??) to the back and put the top up\nI roll down all the windows put the car in function \"watch the\"\nI tried to touch her thigh she moved my hand and said ah ah bro\nIt took five minutes to bang then you know she proper\nI'm knockin' out her brains\nWe got the car shakin' and rocklin'\nShe asked me for a kiss ah\n\nBiznite what's your problem\nWha...\nBiznite what's your problem\nWha...\nBiznite what's your problem\nWha\nBiznite what's your problem\nWha\nYou nothin' but a sack chasin cock tastin biznite\nYour never gonna amount to anythin' but a biznite\n'Cause all I wanna do is hit it raw I don't even wanna talk\nIf your baby come born with braids I ain't the pa\nNope I ain't the pa\nHell no I ain't the pa\nNo I ain't the pa\nHell no I ain't the pa\n\nThere was this stoofy name was Lucy came up to me at the movies\nSaid she just saw Balla Blockin and thought that I was cute\nAnd but you and baby too can still come over early Tuesday\nI just bought a new mansion just finished it and my movie\nI knew she was a new from head to shoulder she was Gucci\nAnd me I'm Iceberg Tom and Jerry, Daffy and Goofy\nShe say \"ooh\" it would be so nice and usually she would do it\nBut lately she been cocky she just came from institution\nI say that's cool 'cause I don't really wanna have to shoot him\nI gave the braud the pager number and said that she should use it\nAs soon as I flew by in that navy and baby blue six\nShe beeped and left a message that she come up with a solution\nI scootin a run through straight to my house I won't be foolish\nShe had no bathin suit and then want me to see her booty\nI oozed it in her coochie when she got in my Jacuzzi.\nShe asked me for a kiss ah.\n\nBiznite is you stupid\nBiznite is you stupid\nWhat\nBiznite is you stupid\nWhat he he he what\nBecause your nothin' but a sack chasin cock tastin biznite\nYour never gonna amount to anythin' but a biznite\n'Cause all I wanna do is hit it raw I don't even wanna talk\nIf your baby come born with braids I ain't the pa\nNope I ain't the pa\nHell no I ain't the pa\nNo I ain't the pa\nHell no I ain't the pa\nNo I ain't the pa\nHell no I ain't the pa\nIf your baby come out saying wha... I ain't the pa\nYou're a sack chasin cock tastin biznite\nYour never gonna amount to anythin' but a biznite\n'Cause all I wanna do is hit it raw I don't even wanna talk\nIf your baby come born with braids I ain't the pa\nNope I ain't the pa\nHell no I ain't the pa\nNo I ain't the pa\nHell no I ain't the pa\nNope I ain't the pa\nHell no I ain't the pa\nIf your baby come out throwin' up \"W\"'s I ain't the pa nigga.\nUmmmmm\nUmmmmm\nI ain't the pa\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Look at Me", "href": "Look_At_Me&&7820", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Look At Me\n\n\nBright thing on my hand saying (Look at me)\nI got your girl doing a handstand (Look at me)\nCop them 28-inch Birdman's (Check out me)\nY'all dues money to yung\nBright thing on my hand saying (Look at me)\nI got your girl doing a handstand (Look at me)\nCop them 28-inch Birdman's (Check out me)\nBig thighs with brown-eyes\n\nIt's Lil Weezy for real\nOnly Cash Money Hot Boy that stood still\nI got a good deal\nI'm from a trill hood\nI smoke real good\nSlide on them skinnies in the bike with an ill hood\nPipes, rally stripes and fog lights\nT-shirt white, three stripes with all ice\nWhat that boy name\nBirdman junior, huh\nFool was smile but five is so wild\nI can smoke a green mile\nGot a chrome need a Rolls shined up for you baby\nBling-blao, I rock a throwback Jordan 23\nRolling on hot 23's\nTote a big glock 23\nYou're looking at the seventeen ward of New Orleans\nMy block living me\nI want you to look hard at some easy money\nStop playing this is Weezy company\nUh-huh\n\nI'm the son of Cash Money\nThe fodd of the squad\nAnd Baby bout to buy me a house in the sky\nWhy? 'Cause I'm so fly\nWhen my feet touch the ground sometimes I gotta ask myself why\nCoupe kinda wide but I move sorta quick\nLooking for my roof where it went\nMink on the floor big shoes on the bent\nWindows are the tint more wood than a bench\nWorking in the hood more green than the Grinch\nPlease don't play 'cause I'm connected like Sprint\nLeaves on the tray popping up the back-end\nPeppermint leather with a feather in my brim\nIt's Lil Weezy\nSucking on my wrist real breezy\nAnd this is what I say when you see me\nLook, and leave your broad at home she get took\n'Cause I'm a player hold the game by the book\n\nSome call me Weezy\nBut hoes holla look at Lil Wayne\nIn that booger-green lay like should've been Mace\nSweet, do speak when I should've put trays\nForget it I'ma slam it on bubba-bubba-blaze\nSo move over what you say shortie\nWe could do rent pussy\nNormally I wouldn't but beating through the Texas\nAnd beating went to the A\nEat with JAZZY FAY\nBut yeah I'm on my way\n'Cause I know he got that hay\nHey little mami\nYou a ghetto fire ten\nYou come to my post on the island\nCome on that chronic\nHe-he empty vodka bottles\nI be high he be drunk that my roll model\nI rolls by you with my seat reclining\nWhen I stop rims don't keep spinning they keep shining\nMoney don't stop keep spinning and keep grinding\nCash Money what you hollering, huh\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Jump Jiggy", "href": "Jump_Jiggy&&5584", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "We gone make 'em:\n\nJump, jiggy, jiggy, jump, jiggy, jump, jump,\nJiggy, jump, jiggy, jiggy, jump, jiggy, jump, jive\nJump, jiggy, jiggy, jump, jiggy, jump, jump,\nJiggy, jump, jiggy, jiggy, jump, jiggy, jump, jive\n\nI tell 'em no lie\nI blow by wit the Bentleys wit the O eyes\nI low-ride, 'cause these 20 inch rims just make it so hot\nYou know I, been had Twinkie, look at the pinky\nAnd the link be all the way down to the nuts, diamonds twinklin'\nThey think you need to stop they say it's not called for\nIt's such a small car for it cost more than a ballpark\nSee my life is high priced, a lot a room a lot a bling\nMy ice is like Andrew Dice \"Ba-Da-Boom, Ba-Da-Bing\"\nI'm tryin' to see flying in a Lamborghini\nWit your girl right beside me in a tan bikini\nCut the music down and tell her, \"hey ya man's a weenie\"\nPlus I'm hot and got more iceberg than damn Bananeeie\nAnd I'm just a teenager and I make this dough\nPull out my bankcard and Bill Gates feel broke\nAnd I keep it on a hush but I'm richer than normal\nAnd a frost bit wrist, have me sniffin and coughin\n\nJump, jiggy, jiggy, jump, jiggy, jump, jump,\nJiggy, jump, jiggy, jiggy, jump, jiggy, jump, jive\nJump, jiggy, jiggy, jump, jiggy, jump, jump,\nJiggy, jump, jiggy, jiggy, jump, jiggy, jump, jive\n\nYou know, pistol on my side fully loaded\nI drive slowly, wit televisions watching Kobe\nPull over by some broad; make her hop right in a blow me\nAnd suck a nigga drive, then its, \"slut get out my ride\"\nHave you heard about, shorty be Iceberged out\nGot them birds real affordable, so get the word out\nAnd you still can see the grill wit the lights burn out\nNothin' lil' about the wheels on my bright orange drop\nI'm thuggin' and pimped out, flossin and glissed out\nSit my arm in warm water, I'm thawin my wrist out\nGot quarters in this house, ki's in that van,\nGot ounces in her ride, and G's in that bag\nShhh, You hear that, here come Weezy on his way in a platinum leer jet\nWe gamblin' nigga bet, bet nigga disrespect and he get dampled and wet\nWhole goddamn family get trampled wit that\nI make 'em:\n\nJump, jiggy, jiggy, jump, jiggy, jump, jump\nJiggy, jump, jiggy, jiggy, jump, jiggy, jump, jive\nJump, jiggy, jiggy, jump, jiggy, jump, jump\nJiggy, jump, jiggy, jiggy, jump, jiggy, jump, jive\n\nAll right I bounce for the 17 and jump for the Grover\nJust put TV's and bump in the Rover\nSlump the bitch over, cum on her shoulder\nBet I make the slut eat it up like yogurt\nWrists is ferocious, dick just bogus\nFuck a hoe watch she come back like a chorus\nLife on Ann Deloris met her in a ???\nShe like to snort coke, you should see the size of her nose is\nWe really the ones controllin', no choices\nAnd we got Guns and Roses, Rolls Royces\nBeefin' ain't fake, not to mention\nAll our rides are dubbed like blank tapes\nI really think my jewelry and lights have somethin' in common\n'Cause every time you put them bitches on they start shinin'\nThe shit is mind blowin'\nAs a matter of fact I got a bitch that's mind blowin'\nShe give my head a blow job, I guess she's mind blowin'\n\nJump, jiggy, jiggy, jump, jiggy, jump, jump\nJiggy, jump, jiggy, jiggy, jump, jiggy, jump, jive\nJump, jiggy, jiggy, jump, jiggy, jump, jump\nJiggy, jump, jiggy, jiggy, jump, jiggy, jump, jive\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Fuck You", "href": "Fuck_You&&1498", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nWho that, Weezy Bitch\nLike Sigel, you fuckin' with the young don, people\nPlus I'm tryna make a son, he gon' be the sequel\nMuh'fuckas better be peaceful, fo' sheezle\nI get sums in lumps, like measles\nMy dough sick, on occations I catch seizures\nI treat beef like burgers, just cheese you\nAnd for that cheedar, hungry niggaz'll eat you\nWe breeze through in the twelve with the judo eyes\nBitches yell I wanna do those guys\nAin't that cold, you know shit fucked up when you got banked at fo'\nI'm 19 and I got banked at O\nThat's the Bentley ma, that ain't that Rolls\nBut the price on that muthafucka ain't that low\nGuaranteed that I'll bang that fo'\nIf your fuckin' with the dude\nBig shout from Cash Money Records, Fuck You\n\nFuck you, fuck you nigga, muthafuck you\n\n(Mannie Fresh)\nChains, nines, guns that's us\nThe slogan is \"we will bust\"\nThe rules our this our size\nCross it young nigga and you will die\nPumps, ride guns, even 25's\nCash Money got this, don't even try it\nStay where you from, don't bring no static\nIf not, then semi-automatic\nThis is the payback, pussy bitch stay back\nFuck you, yo' mama, yo' daddy and where you lay at\nWhat's beef, beef is when you fuck with us\nGuaranteed to lay yo' ass up under the bus\nThere's no one quicker, than a hot boy nigga\nThat'll get you with the knife, or pow with the trigger\nThere's no one keaner, with the chrome Sarafina\nMurder ain't nuttin' but a misdemeanor\n\n(Baby)\nFo' sho' nigga\nI'm gon' ride 'round my city and stunt my shit\nIf a nigga don't like it they can suck my dick\nI got a Bentley, Jag, Rolls, Ferrari\nLambo' with no top I'm gon' ride tomorrow\nFuck a cutless, regals, and rams V-12\nGotta have somethin' fast just to get out them jams\nGot a big ass crib with a flow lil fuck\nGot a roof all glass and that bitch split up\nGot a house built look like a Mercedes booth\nFerrari sofa set with the Lambo' wrench room\nLeskitted up kitchen set and Rolls Royce wall\nJaguar floors and fuck all y'all\nBMW lights, projectors to watch fights\nCaddilac Benz, white fox for threads\nChin cheddar for Chi tower, ain't that crazy\nI don't give a fuck homie, that's how I play it\nRefridge designed like a Lexus with legs\nIn the fridge, it's quarters to replace the eggs\nFrom me, Fresh, and Weezy fuck what they say\nI'm Cash Money stunna nigga and that's how I play it\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Walk In", "href": "Walk_In&&7054", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne talking)\nYeah yeah yeah it's the Carter motherfucker I came back around\nIt's the Carter motherfucker I came back around\nIt's the Carter motherfucker\nLet me show you my building man, it's the Carter\nI'ma show y'all the ins the outs the ups the down, know what I'm talkin' bout\nThis is me fourth solo album baby, I came back around\nBy myself this time, back off the wall\nGuns up in the air in the middle of the streets like blak blak blak, welcome\n\nThis is the Carter y'all welcome, hard as Malcolm\nDawg is a vulcan Lord help him but y'all felt him\nThat make you a part of me and pardony\nIf a part of me is what you wanna be what you oughtta be\nDon't worry Carter me I just actin' accordingly\nI give orders to the commander in chief, just the commander in me\nHandlin streets in the mandarin V\nI hear you haters slanderin me I just hand him the P\nAny drama I pace it like Indiana, I take your grandma pacemaker and jus handle the piece\nNot two fingers I simultaneously bout two bangers\nYou do not want anger USDA prime beef, ya dead meat\nI'm so ahead of these trendy rappers speed up\nI'm already hot when another one startin to heat up\nGot Mannie hot wit me 'cause I always beat his beat up\nY'all cats wit y'all feet up startin to look like feet up, I'm G'd up\nOn the V'd up, in the truck I gotta put my seat up\nIn the trunk I got my bass and I ain't speakin' 'bout no speakers\nWhat's leakin up out of yo speaker is the speech of Weezy F. Baby\nNo more no less Baby, so forth and so on\nFront door livin' room young nigga switchin we\nWhat you need, get you crack get you weed\nMake yo way to the back look ahead and see\nWhite bitch in the bathroom givin' head for speed\nBut don't you turn your head at me, the president been doin' it\nDaddy tried to ruin it\nBut I built this building from the ruts\nI own all the corners and the cuts in this motherfucker\nAnd the feds know just what's up in this motherfucker\nMade niggaz so they can't bust in this motherfucker\nSo with that lets keep it movin, on to the kitchen where my witches keep it brewin\nUh huh look at how my bitches do it\nBucky buck naked look at all my bitches booties\nThey handle all my pharmaceutics\nI got it from promethazane to metamucil\nI'm crucial don't mean to spook you\nBut this is New Orleans so my queens do voodoo, ya know\nSo the things just move through\nI feel ya pain I got things to soothe you\nThat fills the cane so wayne the nuetral\nDon't hate the game hate the institution\nThat fills the cane so wayne the nuetral\nDot hate the game hate the institution, fucka\n\n(Lil Wayne talking)\nI came back around, it's the Carter\nShow you the rest of the house later, we gon go upstairs, ya know\nYa know what this is right\nTha Carter... tha Carter... tha Carter\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Inside", "href": "Inside&&1414", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Inside\n\n(Lil Wayne talking)\nI came back around, I came back around, I came back around\nThe Carter muthafucka\nRight now we still in the kitchen man\nYou checkin' out them bitches booties right (I know)\nYeah, but lets move on man, I got plenty more house to shoe to show you man\nPlenty mo Carter to give you\nYou know, let's go man\n\nNow let me show you upstairs\nGot the glass house floor to let me know who up there\nLook down and you see your reflection\nYou ain't gotta know who down here\nYou just know you protected\nHey man, how I don't know you connected\nHere's a little more fiend let me see you inject it\nThat's right little wode respect this\nUnderstand me or get 'cha mammy a death wish\nPart one, part two, part three\nAll the parts of \"Godfather\" all a part of me\nIf you, look to the wall ya' see\nA few, gagged up, tied up scared pricks\nGot 'em, facin the wall like they was on \"Blair Witch\" (yeah)\nI ain't, chasin' at all but it get scary 'bout my chips\nAnd in here is where I keep the bricks\nAcknowledge lil' marley in the hallway\nHe got the clips\n\n(Lil Wayne talking)\nDon't shoot 'em Marley (yeah)\nThis my lil' dude marley man\nHe hold me down, know what I'm talking 'bout\nI'll show you the rest of the house later man\nYou wait right here, I be back\nCARTER... CARter... carter...\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Kisha", "href": "Kisha&&439", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nGot a early call from Kisha\nKisha wanted me to meet her\nShe said she thought it was time to make the relationship get deeper\nSaid cool then l'm gone be there\nWhat would be a good time to reach ya\nShe said what about ten but l thought eleven would be sweeter\n'Cause she wanted me to see her\nSaid l needed a teaser\nBut shit who got the keys to my Beamer\nI rolled me up a blunt and got the Crystal out the freezer\nI hopped in the two seater\nLeft Ne-Ne with Macita\nVroooom speed up run faster than a cheetah\nOnly thing on my mind is how l'm gone get all in this cheap slut\nShould I use a rubber 'cause I heard she was a freak\nThey say she ???\nBut I don't want HIV\n?????\nHer name's on my beeper\nI called her on the Nokia\nAnd told her come pick me up\nAs soon as I got in the house she got on her knees and grabbed my penis\nAte it up like some peanuts\nI said ooh Kisha\nThis what I got to meet her\nShe drunk it like a 2 liter\nShe blow like a pro\nOh no I got to keep her\nTold her l'd be back about eleven I'm gone creep her\nBut don't go to sleep\nI got some more meat to feed ya\n\n(Turk)\nNow I'm hot\nI wonder was up with Kisha tonight\nI'm gone give her a call\nSee if it's all right\nFor me to dip through\nShe said it's all gravy\nFirst I got to get somebody to watch my baby\nBaby it's all good\nI'll be there in a minute\nShe didn't know I knew Wayne was already hittin it\nSoon as I pull up I see my dog runnin' out\nHe saw me dippin in but he didn't know ???\nSoon as he pulled off\nI knocked on the door\nSayin' to myself look at this dog ass hoe\nIts cool what you do\nYou know I like my shit sucked\nFor you to swallow the cum and put ice on my nuts\nCall my nut now I'm up\nI'm gone holla at ya Kittie\nI got through lil tonight me and the H-Beezey\nI can't be late\nI'm gone see ya when I could\nHere's Juve on the hip\nLet 'em know it was all good\n\n(Juvenile)\nOoh Ooh there she go\nOn the way to the corner store\nLil Turk let me know\nWe done fucked the same bitch before\nSay lil mama where you headed\nShe told me for Danny\nHop in the back seat of my car and she spread it\nSay baby slow down I don't wanna fuck ya first\nI want you to suck on my dick until my nuts will burst\nShe was a fool with it\nShe said she had a good teacher she went to school with it\n'Cause she knew what to do with it\nI didn't want the bitch to have my car smellin\nSo I took her in the alley with some K Y Jelly\nPull your shorts and your draws down to your knees\nPut the rubber on the dick handle that please\nI hit it she sucked it\nHit it she sucked it and sucked it\nI got tired of the pussy and now I said fuck it\nSay boo I gotta ride\nMy baby moma beepin me and she stay way on the other side\nI hit B.G. on the celly\nAnd told him that the bitch was all good and you have it not to telly\n\n(B.G.)\nBitch hold on do I know she fucked three of my dogs\nI caught her walkin' out the alley down by the mall\nShe fucked Wayne, Juve, Turk I know she ain't got no walls\nBut she told me she'd do a damn job on them boys\nShe provided the number later on gave her a call\nTold her what I was thinkin' and she was down with it all\nCan't deny it she was a fool kept that dick standin tall\nWhat she'll do to a nigga she'll be against the law\nThat's how Hot Boys play it when we finish we toss\nBaby when you finish Manny Fresh down the hall\nAfter this episode that hoe won't be able to walk\nAfter two or three steps that hoe might fall\nNow you know then Hot Boys sad ha\nGet in the bitch head\nEnd up doing somethin' bad ha\nKisha got did right yeah\nFucked the whole Cash Money click all in one night yeah\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "Oh No", "href": "Oh_No&&2209", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Oh No, No, Oh No, No\nOh No, No, Oh No, No, Oh No, No\n\nI play the bullshit from the backseat champ\nYeah I'm in the backseat still got the seat back\nFeet back stay from where the fake be at\nNiggaz snitch for the shine where the patience at\nNigga make his own brother face his back\nGive love and take it back\nGood grief man this world is quite heavy on my aching back\nCops killing for crack you know the story snakes eat rats\nFace the facts you can't change him can't shoot it if you can't aim it\nCan't miss him if he kill you then you can't blame him\nThat's just how the dice roll when you can't fade him\nGet too deep up in that water and they can't save ya\nMe I come out of that water like I was just bathing\nAnd watch my step on a wet pavement\nYeah I'm from the hood so I rep 'em where I can't take em\nHolly Grove Holly Grove was his last statement\nSo nigga get that look off your face\nAnd recognize you got a crook in the place\nThey call me W-E-E crooked letter Y I'm so high\nI skeet skeet in any nigga dime like she's mine\nStreetsweeper in the back of the hatch make me pop the latch\nLeave you bloody with the cops to match\nBullet holes in ya from the chopper blast\nLike... Ha ha\nThat's bullet holes in your sneakers got you hoppin back\nIt all stop when they hit you in ya top and back\nNo cocking back silly motherfucker you ain't heard bout this\nThe clip sink down to the dick\nThat's a automatic shotty from a drum they call tommy\nGarunteed to get you bitches from by me\nWhen I hit every piece of ya physical body he leakin'\nMortimer is no longer leapin' he sleepin'\nWhile you pussy niggaz is sleepin' he thinkin'\nDeep in thought the boy ain't even linkin\nBob Marley got me stinkin\nStackin figures I'm standin firm life's a slinky\nPipes is filled with crack cocaine\nAnd the dope go inside of the veins from where I came\nThough I bear a name only one call live with\nCoach they won't knock me off my pivot forget it\nI'm sicker with it\nPick a city buy a condo find a fine hoe let some time go chill\nWhat you know about a bongo having her mind goOver a convo about dough\nNothing! Man the four wheelers look so good on the sand\nTee or tanktop pocket fan\nPocket knife no handgun in sight\nJust that rat tat tat tat tat tat tat tat BOOM!\nHa ha tonight I might just boost my feature price\n'Cause to each its own and the lights is bright\nAnd I'm feelin' like Mike at a Tyson fight\nI'm from Cita house big momma's house\nShe told me to shoot ya right after I knock ya out\nAnd he ain't gettin' up after them shots if you hit him in the right spot\nHold up the beat might drop\n\nOh No, No, Oh No, No\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Go D.J.", "href": "Go_D.J.&&8865", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Mannie Fresh talking)\nYeah, yeah, yeah\nGrown ups in between, children and babies\nRight about now its yo boy, ya heard, back again\nDJ Mannie\nFre Fresh Err Fresh\nFre Fresh Err Fresh\nFre Fresh Err Fresh\nFre Fresh Err Fresh\n\nGo DJ, that's my DJ\nGo DJ, that's my DJ\nGo DJ, that's my DJ\nGo DJ, yeah\nWit Weezy We, step up to the mic dude do watcha do, ya heard\n\n(Lil Wayne talking)\nLadies and gentlemen, what you have here is brought to you\nCourtesy of the young man young Carter and the great man Mannie Fresh\nSo what I want y'all out there to do for me is say this\n\nSay go DJ, 'cause that's my DJ\nSay go DJ, 'cause that's my DJ\nSay go DJ, 'cause that's my DJ\nSay go DJ, 'cause that's my 'cause that's my\n\n(Lil Wayne)\nMurder one on one, the hottest nigga under the sun\nI come from under the tummy, bustin' a tommy\nOr come from under your garments, yo chest and your arm hit\nPow, one to the head now you know he dead\nNow you know I play it, like a pro in the game\nNaw better yet a veteran a hall of fame\nI got that medicine, I'm better than all the names\nAy its Cash Money Records mane a lawless gang\nPut some water on the track, Fresh for all his flame\nWear a helmet when you bang it mane and guard yo brain\n'Cause the flow is spasmatic what they call insane\nThat ain't even a muthafuckin aim I get dough boy\nAnd you already know that pimpin'\n18 how I'm livin' young'n show that Bentley\nStunna my Pa so you know that's in me\nGotti my mentor so don't go there wit me\n\n(Repeat X2)\n\n(Lil Wayne)\nAnd I move like the Coupe through traffic\nRush hour GT Bent' roof is absent\nYa bitch present wit the music blastin\nAnd she keep askin, \"how it shoot if it's plastic?\"\nI tell her you'll see if ya boy run up, she sat back and cut the Carter back\nUp, oh fa sho\nAy Big Mike they betta step theys authority up\nBefore they step to a sergeant's son, I got army guns\nYou niggas never harmin young, fly wizzy my opponents done, I'm done talking (shut up)\nAnd I ain't just begun, I been runnin' my city like Diddy ya chump\nI fly by ya in a foreign whip, on the throttle wit a model bony bitch\nPair a phony tits, her hair is long and shit, to her thong and shit\nWell here we go so hold on to this, uh lets go\n\n(Lil Wayne talking)\nHold on let me hit the blunt\nSo go, so go\nThis is the, this is the, this is the\nThis is the, this is the, this is the\nThis is the Carter\n\n(Lil Wayne)\nBirdman put them niggas in a trash can\nLeave 'em outside of your door I'm your trash man\nI'm steady lightin ****UP THE**** hash and ridin' in my jag\nYou will need a gas mask man\nYou snakes, stop hidin in the grass\nSooner or later I'll cut it now the blades in yo ass\nYou homo niggas getting AIDS in the ass\nWhile the homie here tryna get paid in advance\nI'm stayin on my grizzy I'ma bonafide hustler\nPlay me or play wit me then I'm gonna find your mother\nNiggas wanna eat 'cause they ain't ate nothin'\nBut niggas wanna leave when you say you out of mustard\nSo I'ma walk into the restaurant alone, leavin' out\nLeavin' behind just residue and bones\nIn your residence with Rugers to your dome\nLike where the fuck you holdin' the coke, holdin' your throat, choke\n\nSo go, so go\n\nThis, this, this, this, this, this, this, this, this,(y'all say it wit me) this, this, this, this\nThis is the Carter\n\nGo DJ, DJ, DJ\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Get Off The Corner", "href": "Get_Off_The_Corner&&2044", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "The block is hot, the cops is swarmin a neighborhood heavy\nWhile niggas off in the neighborhood sellin, with penitentiary chances\nThe dope roped up in the cup of their pants\nFiends flock like ??? come get this candy\nI got heroin in bundles, them Highland O's\nPlus a cooked slab, chopped up, dimes is swoll\nIf I spot the laws comin', hey its time to roll\nCandy Carter got a line of parole, Outta control\nThe first fell a Tuesday this month oh sweet thang\nPlus it's a sweet day, me next score for three days\nOne time they say what you mean, I gets the green\nBreak up the block like Maurice Green, ya feel me?\nIn my predicament I'm guilty until proven innocent\nHustle ridiculous, I'm tryin' to get this dope continuos\nBall till I fall, one thing, I ain't tryin' to fall\nWant everybody numb like ambasol\nBut he heard\n\nUh oh\nThere go them fuckin' po-po's\nAnd if you know like I know\nYou better get off the corner\n\nI'm a young dog, wild and ecstatic, violent when passin\nHem gangstas doin' time in a parishment, role models\nAnd keep ya cup, we drink whole bottles, and cuss at niggas\nLike fuck that nigga, I let my pump subtract niggas\nYou beef with me I guarantee your mams be missin'\nWith a note behind demandin three chickens or she gets it\nDo not twist because lil man is trippin'\nThey could have ya body in three different places\nAin't nothin' gravy, but save it\n'Cause I'm a ride and hit the nigga street\nWeezy go to war like Sadaam and Clinton disagree\nWhile I'm shitty from the weed\nLike were them bustas be\nI promise ya never fuckin' sleep, I clear the set\nCome outside late at night to your surprise I'm here with Tecks\nTwo shots knock off the niggas necks, it's so realistic\nSo I hope ya get it, or else them shots poke ya fetti\nBe on the block until them souljas hit it\nThat's when he heard...\n\nBlocka\nMe come to tear your block up\nIf you don't want no problems\nYou better get off the corner\n\nAll right, I cook it, cut it, ship and move it\nI make a livin' in this crooked public distributin\nJust take a peek around, the hood is floodin, shit is boomin\nThe hottest D in town lookin' for me hit me Tuesday, like after six\nSee I crack the bricks right down to Z's\nGot pounds of trees, my blocks blazin' qp's to ki's\nGangin' in the cheese, them bricks is comin'\nNo droughts I don't sit on nothin'\nI don't believe I'm frontin\nIf I give you a dime, I leave with somethin'\nThe big dog, Nigga I got the city under siege\nAnd the law don't bother me, I give the pigs a couple of G's\nShit, I hustle strong to push this work through the streets\nI'm tryin' to deal with every nigga, and sell the birds up cheap\nI'm greedy, if there's any money bein made from drugs I need it\nTwenty bricks two weeks completed, you can't beat it\nWhatever you want, holla at me when you need to get it\nDoes anybody else, I'll pay 'em a visit\nThat's when ya heard...\n\nCome here peeps\nI'm hearin that you run these streets\nYou don't want beef\nThen get off the corner\n\n(Chorus 1,2,3,3 repeat 2x)\n\nUh oh, you better get off the corner, skirt\nBlocka, you better get off the corner\nCome here, you better get off the corner\nGet off the corner, Get off the corner\nWhat, uh oh, get off the corner\nWhat, uh oh, you better off the corner\nWhat, uh oh, you better off the corner\nWhat, uh oh, you better off the corner\nLike dat, Get off the corner\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Who Wanna", "href": "Who_Wanna&&31", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Somebody call the slick police\nCapitol W\nWeezy Baby\nThis is the Carter man\nRim low all I can see is the flow now let's go!\nRaj ya bangin' 'em in the... Raj I say ya bangin' 'em in the...\nRaj I say ya bangin' 'em in the head wit this one cut!\nWeezy Weezy say guard ya face bitch\nWeezy say guard ya neck bitch\nWeezy Baby this is the Carter\n\nI move it from a eighth to a slab from a slab to a quarter\nFrom a quarter to a half from a half to a hard one\nYou do the math it's a horror\nWhile I be on the ave gettin' off one nineteen for a soft one\nBricks I loft 'em catch him he hot\nIf I catch you without my scratch I'm stretchin ya out\nIf you catch me without the burna burn me\nI beg of you shoot off the leg of you and kick ya in the ass\nI'm dyin' of doom I say I'm sick with cash\nThese eyes are real see straight through ya liquid ass\nYou see me straight through the glass house picnic wagon\nYou could see it by my bitch face she thick with ass\nGet slick slick I click click blast on ya bitch ass\nSquad up shit click or smash on ya bitch ass\nSmash on ya bitch ass\nNow pick the grass up out ya ass and the caps out ya cap Aye!\n\nWho wanna fuck wit me tell 'em I'm waitin for 'em\nWho wanna fuck wit me tell 'em I'm waitin for 'em\nWho gon fuck wit me I got the blazer for 'em\nWho gon fuck wit me do you wanna fuck wit me Naw!\n\nHustle boy sell a nick to ya mom I'll sell a brick out ya house\nI'll sell a brick to a house nigga\nI'll send a clip to ya mouth back of the gun to ya nose\nFront of the gun to ya clothes I let it rip and I bounce\nLights off young Teddy Pender is out\nMask on scare the fuck out ya but ya ass grown\nI wasn't born with no silver spoon\nBut I can heat it in a spoon and pitch it in a balloon\nTomb sittin' in ya room sing for me\nBut if ya don't gimmie no tune the semi go boom\nBut if ya don't hear me doe fool the semi go boom\nI'm try to make moves but they gimmie no room\nI takes my space I blaze the haze take ya babe to space\nShe gimmie amazing face I sung Amazing Grace\nI was once lost but now I'm found\nFull of them pounds is how I'm found Aye!\n\nOh! Oh! Bang 'em in da head Whoa!\nOh! Oh! Bang 'em in da face Whoa!\nOh! Oh! Bang 'em in da neck Whoa!\nRim low all I can see is the flow now let's go!\n\nI know how to cook so I buy it soft\nI also sell it soft depending the cost\nYou know that's shells they toss defending they boss\nThey wipes 'em well across ya dentures like floss\nYou know I smell ya talk and I swear I knows bullshit and pussy near or far\nY'all niggaz better gear up for the comin' of the boy\nFrom a young'n to a boy to young boy boy\nI dump toys boy at ya punk boy toys\nTake the pump out the trunk take a chunk out a chump\nBaby what have I done I created a monster\nWeezy Baby a gangster no wankster\nHell naw I smell y'all\nDidn't know Jam Master well but I rocks wit my shells on\nAnd the block still a hell zone\nGet a helmet for you and ya gals dome I suggest! Aye!\n\nBang 'em in da head whoa!\nBang 'em in da face whoa!\nBang 'em in da neck whoa!\nRim low all I can see is the flow now let's go\n\nBang 'em in da head whoa!\nBang 'em in da face whoa!\nBang 'em in da neck whoa!\nRim low all I can see is ya hoe now let's go\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Ain't That A Bitch", "href": "Ain%27t_That_A_Bitch&&141", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Hey Hey Hey!\n\nBecause the cops is watchin the streets is talkin'\nYa hoes is unfaithful ya family ungreatful\nYa niggaz ain't loyal you niggaz ain't lawyers\nAnd everybody saw you and ain't that a bitch!\n\nAnd this here is the Carter oh! yo! And this here is the Carter yo! oh!\nThis one here is just to clarify the fact that I'm a muthafuckin mack\nThis one here is just to verify the fact that I got straps on my back\nThis one here is just to clarify the fact that the boy is back! Oh!\n\n(Verse One)\nSlick as I wanna be born to be hustla gonna be rich till I'm gone\nGonna keep spittin' this shit for the hustlaz gonna keep livin' this shit I'm gutless\nBet I'm gonna reap this when I'm gone defeat this while I'm here\nGonna keep beatin' this street shit in ya ear\nGonna speak in every single street this year\nMy shit beat in every jeep on every street this year\nWizzle F Baby y'all niggaz can have the Weezy I'm the Birdman Jr. junior\nI'm a man to another man to a bitch I'm a pimp in the whip I'm a hundred grand\nAnd in the streets I'm a money man\nAnd I'm a hunt it with the streets I get money in the streets like a hundred men\nA hundred proof in my other hand\nIf ever fall spring back like a rubberband know what I'm sayin'\n\nBecause the cops is watchin the streets is talkin'\nYa hoes is unfaithful ya family ungreatful\nYa niggaz ain't loyal you niggaz ain't lawyers\nAnd everybody saw you and ain't that a bitch\nThe cops is watchin streets are talkin'\nHoes is unfaithful ya family ungreatful\nYa niggaz ain't loyal you niggaz ain't lawyers\nAnd everybody saw ya and ain't that a bitch\n\n(Verse Two)\nNow all the bitches got me strollin wit my dick in my hand\nAnd these niggaz got me rollin' with my clip on my hip\nBut this is my land so prick don't trip cause K's don't jam and a nigga don't miss\nThey tellin' me I'm the shit like a nigga don't piss\nBut nigga don't slip 'cause I'll kill a punk bitch Word Up!\nAnd I don't affiliate with niggaz I don't love neither bitches just money and drugs nigga\nLeave ya bitches ya money and drugs nigga\nThree to ya wisdom five more to ya mug nigga\nHow many more do ya love nigga\n'Cause I got plenty more to give out I ain't never been a mouthpiece\nAsk ya reverend 'bout me I'm the young God\nAim the shotgun at ya frame and bust boy\nBrain and guts leak in the drain and such pour\nPlain yuk at a fuck boy. Fuck Boy!\n\n(Verse Three)\nI'm a muthafuckin man so respect me as one or the tech meet ya ass son\nThe tech heat ya ass son put ya fuckin' chest beneath ya ass son\nBlooka blook blap bleep ya ass son (laughin')\nNigga tryin' to see his grandson and we\nGot niggaz in the pen tryin' to see me wit a Grammy\nWanna be me and don't even understand me\nCould'nt see me even if you was standin with me\nI'm that damn convincing not invisible that man's invinsible\nAnd advance a little due to the pine\nMy niggaz call me little Russell Crowe for my beautiful mind\nAnd I let you do the time I do the crime\nWhen the crowd call my name I bring my crew to the line\nNigga that's S.Q. and we fine nigga that's S.Q. and we firrin Nigga!\n\nHa! Wizzle F Baby fa ya muhfuckin neck nigga\nGot Streets in da buildin Gotti in the buildin\nKL, Fee Fee in the buildin Rome, DI, Ceeti...\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Get That Dough", "href": "Get_That_Dough&&265", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Biotch, Biotch\n\n(Chorus - Baby (Cristale))\n(Get that dough)\nLook wipe a bitch down, let's dribble on a hoe, C'mon\n(Get that dough)\nLet's pop a few bottles, smoke a lil dro\n(Get that dough)\nLook wipe a bitch down, let's dribble on a hoe, Woo\n(Get that dough)\nLet's pop a few bottles, smoke a lil dro\n\n(Lil Wayne)\nI pull up slow, chrome flashin\nLil daddy in a long Cabbi\nBig hat pimp strong daddy\nGot my hoes on my arm daddy\nAin't that amazing, specially when I'm blazin' that dro\nEarthly green, purple weed, purple V\nWith purple seats, murck the streets\nAnd I see ya in that Gucci skirt ya sweet\nBut later on I wanna hurt ya so holla back hoe\nI know ya will, get ya ass over here\nAnd take off my polar bear\nI'm the coldest player of most my age\nQuote my age, 19 but my money's much old\nAnd shorty got crazy paper\nCash Money's my army, my navy paper\nUnderstand, Weezy is made of paper\nI got \"Baby\" paper\n\n(Cristale)\nFloss our bitch, or get tossed out\nStunna time criss-crossed out\nBirdman the bad bitches bossed out\nSo fly nigga we don't walk out\nTime to get Nina Rossed out\nI'ma let the heat speak, see I'm talked out\nWhat's the muthafuckin talk bout\nGet you niggaz chalked out\nChi-town and Birdman show you what that fuckin' hawk bout\n\n(Baby)\nYou can shine like stunna (Papi it's all gravy)\nI bought the Rover for me and bought the Benz for my ladies\nSee I, wipe ya down, I shine ya up\nAnd put the rims on the whip then diamonded up\nIt's the m-uh-m-uh-man, that I hustle for grams\nMe, Ta', and Cris' with a blunt in my hand\nSee I come through shinin, known big tymin\nRed Caddi truck, nigga I'm grindin\n\n(Tateeze)\nI come Harley D, black bike all chrome\nYour queen is home, daddy tell 'em where they went from\n\n(Baby)\nSee I'ma slide on through, then I stash the loot\nWho washed the coupe, ma look I know what to do\n\n(Tateeze)\nGot the suit you to wear some pumps on\nMatchin' the car, matchin' my bra, shit nigga pimpin' is hard\n\n(Baby)\nI jock that, so wipe a nigga down\nLet's dribble on a hoe, bitch time to go\n\n(Tateeze)\nThe Caddi do me pop, the coupe is hot\nThe groupies flock, and case me out my Gucci socks\nYeah, we get that dough, Tatee' watch me drop these\nYou got me, can I get the car keys\n\n(Baby)\nSee I wipe a bitch down, then dribble on a hoe\nAnd I touch her from her head, from her waist, to her toes\nPop up in the Lexus with the mink on the floor\nRocked out Nexus 2K bird hoe, Woo!\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Hit Em Up", "href": "Hit_Em_Up&&1607", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "I tried to talk to him\nQuit talkin', I'ma hang ya by your tongue, Yeah\nAny motormouth could get hung high\nWe don't fuck wit niggaz like fungi\nWe don't even hear ya\nHollerin bullshit nigga quit the diaherra\nPistol lie inside of the armrest, um yes\nLay a nigga down in his own mess, don't mess\nPlaya fuck around wit the homeless, charmless\nYou can leave out here armless, no homies\nHonest, you niggaz is harmless\nI'm calm as a Don is supposed to (be)\nCosta Nostra, don't ever approach him\nDon't get close to him\nShootouts and nothin' but rock 'n' roll to him\nLeave your blood on the dash, call it rose wood\n'Nother murder, 'Nother page out the notebook\nIt ain't nothin' it don't make it if you no good\nI tried to talk to him, but then a nigga had to\n\nHit 'em up, Hit 'em up\nI ain't even wanna hit 'em up really, I was tryna be calm\nBut, uh, that chopper Rrrot, put his head in his arms\nAnd man, I tried to talk to him, I tried to talk to him\n\nHit 'em up, Hit 'em up\nI ain't even wanna hit 'em up, fuck it make a nigga get loose\nHe had too much talkin', not enough Deuce'\nI tried to talk to him, I tried to talk to him\n\nHit 'em up, Hit 'em up\nI ain't even wanna hit 'em up hit 'em up\nI ain't even wanna hit 'em but I hit 'em up (Gun shot)\nI tried to talk to him, I tried to talk to him\n\nY'all take them shoes off your teeth\nStop runnin' your mouth\nNo shoes, no feet, I'll run in your mouth\nI'll come to your house, me and my goons\nLoadin up bangers, ridin' under the moon\nThrowin' up fingers sayin' \"My side rule\"\nIf a nigga disagree, ask him \"Must I prove?\"\nThat Maybach coupe a cock-eyed fool\nAnd I'm \"in it like Bennet\" hoe, aren't I cool\nBut if that thermostat switch and that needle move\nThen the attitude switch and the heat'll move\nI got that, Shakita banana, clip for the tool\nMe the disaster, pity the fool, eat a catastrophe\nSwallow the truth, belch reality\nHow does it taste, Pie to your face, You a bitch nigga\nAll pussy, stop comin' out your lips nigga\nI tried to talk him, but then a nigga had to\n\nReal talk boy, chill wit the talk boy\nThat tommy gun'll tear your neighborhood apart boy\nYeah, leave your feelings in your heart boy\nStart with the wrong boy, you end wit a stone boy\nWit your friends, to carry you alone\nTo a concrete mattress and a fluffy tombstone\nFuck discussion, I ain't in to it boy\nI just get to it, let's do it, rip through a boy\nBig uzi, tissue the boy\nI'm inside lookin' out, you just an intruder boy\nYou need sooches on your smooches boy\nBut, I tried to talk to him, but then a nigga had to\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Lock And Load", "href": "Lock_And_Load&&7396", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "<i><b>Lil Wayne</b></i>\nYeah, vibe wit me sweetheart it ain't hard,\nAh fuck dem niggaz I ain't worried bout dem\nThis Cash Money baby ya no what I'm takin' bout\nIt's the Carter II, Kurupt holla at dem niggaz (nigga)\n\n<i><b>Kurupt</b></i>\nWe won, we won and then we shot that BB gun\nThey lost, they lost we took they shit now its time to floss\nLock and load\nWe won, we won and then we shot the BB gun\nThey lost, they lost we took they shit now it's time time to floss\nLock and load\n\n<i><b>Lil Wayne</b></i>\n22 year old 17 war vet life in the fast lane little red corvette little red handkerchief hangin' out the right side back pocket jeans fall and cover my evisu sign yep we do shine and they gon hate but they hated Jesus baby we won't break\nSo we ride like four perrelli's so s-cary no security, no protectin, no conparin lokin heavy, Oceans 11, aviators, both taker, so fakers, no players I'm\nHollygrove to the heart hollygrove from the start don't cross airheart boluvard or the war I come from 1-7 one shot never that blum, blum, blrrr, blrrr,\nPop, pop, clap, clap what the fuck hollygrove stand up nigga duck.\n\n<i><b>Kurupt</b></i>\nWe won, we won and then we shot that BB gun\nThey lost, they lost we took they shit now it's time to floss\nLock and load\nWe won, we won and then we shot that BB gun\nThey lost, they lost we took they shit now it's time to floss\nLock and load\n\n<i><b>Lil Wayne</b></i>\nGet 'em get 'em weezy hit 'em where you kill 'em easy sit 'em in the river leave 'em they find 'em tomorrow evenin sinkin I'm prolly drinkin' that\nSyrup thinkin' I won't slip even tho I'm leanin like a broke hip. he ain't know I got the nina with the full clip that's a sommersault, backspin full flip for\nYa. push this button ill flip out and hit sumthin miss nothin' I'm just bustin' until the scene clean. twelve hundred for the jeans stop playin' a hundred\nDollars for the glock in my pants who the man I am when I stand with it pointed right at your face knock your brains from the back of your neck for lack\nOf respect I strap a jet black gat to the death tell my momma to bury me with that no bullshit my hood gettin' kinda crazy where I be so rony's wit me\n'Cause he's the O.G.\n\n<i><b>Kurupt</b></i>\nWe won, we won and then we shot that BB gun\nThey lost, they lost we took they shit now it's time to floss\nLock and load\nWe won, we won and then we shot that BB gun\nThey lost, they lost we took they shit now it's time to floss\nLock and load\n\n<i><b>Lil Wayne</b></i>\nFresh out the backseat of the figgity Phantom the hater I make 'em madder when I wave at 'em like \"what up\" if it ain't bout money I keep goin'\nI'm tryin' to get that green I'm tryin' to mow my lawn but fuck. dem boyz I got da shoty on my arm dem boyz run up I leave they bodies on the lawn and duck the\nFuck outta there cause baby its hotter there if this was a movie its time to roll the credits \"CUT\" it's all over all of your brains are all over the\nMother fuckin' block I'm a mother fuckin' rock hard body Eagle street 17 shots night vision double clip hot steady beam glock pop, drop little man drop this\nIs not for little bitches your man all (?) I'm layin in the drop thinkin' of more money, Cash Money, young money, take money, your money\n\n<i><b>Kurupt</b></i>\nWe won, we won and then we shot that BB gun\nThey lost, they lost we took they shit now it's time to floss\nLock and load\nWe won, we won and then we shot that BB gun\nThey lost, they lost we took they shit now it's time to floss\nLock and load\n\n(Lil Wayne Outro)\nHahaha, yeah, lock and load, ya know, I thought they knew it was really real daddy, yeah, homeboy, my mother fuckin' wristband was 300\nDollars no lie, Dolce and Gabbana, they should pay me for sayin' that shit, so is my jeans they wasn't 300 but they Dolce too, yeah, we won mother fucker, we\nWinnin' over here, that's right, hey, somebody call gordon tell him pull up front open the doors suicide, lets ride out, you got money you know what the\nFuck I'm talkin' about, if ya don't, keep thinkin', if you can do that, your losin streak is goin' up, why?, 'cause we here straight up\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Fuck Tha World", "href": "Fuck_Tha_World&&6205", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Look, look, look\n\nA young nigga screamin fuck the world and let 'em die\nBehind tints, tryna' duck the world and smokin' rie\nGot my bandanna 'round my head and pants to my feet\nAnd got my eyes fire red and glock on my seat\nI'm tryna' stay under intoxication\n'Cause I lost my father, and got a daughter, plus I'm on probation\nI'm drinkin' liquor like it's water, gettin' pissy drunk\nAnd stayin away from them lil' broads that tryin' to give me some\nI keep a chopper in the trunk and my heat on my wasteline\nDuckin the law, 'cause I ain't tryna' do no FED time\nSometimes I just wish I could be away\nBut I gotta take care of everything and keep macita straight\nSo I just maintain the struggle and I keep tryin'\nBut how can I when my closest people keep dyin'\nI ain't lyin' that the law tryna' bust my clique\nBut I scream fuck the world man, I'm too young for this\n\nLook, I don't curse, but in this verse man, fuck the world\nI lost my father to a gun and made a little girl\nAnd I'm still thuggin' wit' my niggas tryna' keep it real\nAnd I'm still doin' for my mother and I'm payin' bills\n\nGive me a cigarette, my nerves bad\nThe FEDs said they heard that I know where them birds at\nAnd my old lady say she saw me with anotha Brizzah\nAnd some a the boys shot up my block so now I gotta kill 'em\nAnd teachers keep tellin' my momma that I'm gettin' worse\nAnd now she trippin' talkin' 'bout I need to be in church\nAnd my lil' girl whole family tryna' lie in court\nTryna' put me, a child, on child support\nAnd my own family deny me of what I do 'cause I'm a 'thug and stuff'\nPlus, my niggas keep fallin' to them drugs and stuff\nThat dope got these niggas meltin away\nMan they got clowns right around me, killin' they self everyday\nWe keep fightin but they so strong\nI know it's hard but don't give up baby hold on\nJust keep ya fate, count blessings, and wodie keep ya trust\nAnd grab ya nuts and let 'em know that we don't give a fuck\nWe don't give a fuck\n\nLook, I don't curse, but in this verse man, fuck the world\nI lost my father to a gun and made a little girl\nAnd I'm still thuggin' wit' my niggas tryna' keep it real\nAnd I'm still doin' for my mother and I'm payin' bills\n\nI mean the world just ain't gon' never change\nSo I just keep my head up and my nuts, let 'em hang\nDawg I swear it's very rough out here for the youngstas\nLike everybody against me 'cause I'm a young thug\nDear Rabbit, why they have to kill Rabbit?\nBut I'ma keep you alive, nigga, I'm Lil' Rabbit\nThat's why this lil' nigga be buggin like it's no tomorrow\nI only can depend on macita and C-M-R\nI try my best to make it through the night and live today\nBut I'm upset so I'm steady wipin' tears away\nAnd police got me under surveilance when and wherever\nWreckin they brains, tryna' figure where I'm gettin' that cheddar\nI tell my family just leave me a-damn-lone\nI can handle all a my business, this lil' man grown\nBut I try to forget about it and just stand strong\nBut if everythang was cool I wouldn't write this damn song\nFuck the world\n\nLook, I don't curse, but in this verse man, fuck the world\nI lost my father to a gun and made a little girl\nAnd I'm still thuggin' wit' my niggas tryna' keep it real\nAnd I'm still doin' for my mother and I'm payin' bills\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "BM J.R.", "href": "BM_J.R.&&2056", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Baby Talking)\nYeah shorty, you know what I'm talkin' bout'\nI peepin'these niggaz out here they slippin like they ain't bout\nMoney no more man, so what fuck\nYou know what we gon' do ha?\nWe gon' do what we been doin' nigga\nWe gon' load up, get alot mo' and alot mo' and say fuck em'\nNigga\nKeep buyin' shit\nKeep fuckin' hoes\nLoadin up on mo' bitches\nThen you know what I'm sayin', we gon' get greedy too nigga\nI ain't never gettin' full, I'm full blooded with this grind\n\n(Lil Wayne)\nI got it\nI got it\n\n(Lil Wayne)\nMurder Capitol, only key to survive is kill.\nIf the elements don't murder you,\nTha rydahs will... Fa real.\nAnd niggaz know I go hard to the fullest;\nGet involved,\nAnd I got em' playin' dodgeball wit bullets.\n(YEA) I got the sawed off, fully\nIn the Sean John hoodie\nGet fucked--ya play pussy.\n(HA) We hit em' up while dey ain't lookin'\nAnd tha body shots hurt But tha head shots took em'\nDAMN!\nAnd if tha red dot spot em'\nThen tha hollow-head got em'\nKnock his tops to his bottom Jack.\n(Yeah) Ya see we grind from the bottom\nJust to make it to da bottom\nAt the very bottom o' da map\nLouisiana--\nPiranhas Every where you at.\nU gotta wear a extra condom\nAnd a extra gat.\nYa bitch could get it fa actin' like a man\nAnd niggaz in Pak-istan, Impactin' on ya man\nI backed his hand... ya man on command\nIn fronta niggaz he cool\nWit dem boyz on fan.\nI'm on hot.\nI adjust in different climates\nStuck in a animal--Keep runnin' wit my prime mates\nU ain't did it till you done it like in fives states\nWeezy-hustle, No blubber, I put on weight.\nAnd in a drought\nI go on a diet and strecth more\nLose all dat weight, leave a nigga wit stretch marks\nYou'nt even come up to a nigga chest\nPause Up,\nPAW, What tha fuck they play dat in da club fa?\nReal Shit\nI'm duckin' bombs from a drug war\nNo religion, but da cops swear dat I'ma drug law\nFather forgive em' fa dey know not who dey pushin' Lord\nFather forgive me if I have to send em' to you Lord\nI'm just tryna dodge tha shots dey send to da god\nThey ridin' up high way to Heaven boulevard.\nDAMN!\nDem niggaz pussy and jive--not even in tha eye exam\nThey ain't lookin' fa I.\nFa A and a K\nI'll make ya face crook to tha side\nNow when you smilin' everbody gotta look from tha side.\n'Cause when you wilin' you ain't lookin'\nU jus lookin' High\nAnd when we hungry, U look like pie\nSweet potato-ass nigga\nU lemon Meringue--Apple custard\nCherry jelly--Don't make me get tha biscuit busta (YEA)\nWhat up chizzle?\nU my distant brotha\nReal shit nigga\nSame father--different motha (shit)\nI skip tha frontin' and stick to keepin' it \"trill\"\nU not know me fa nothin' otha\nI'm somethin' otha\nThan people you feel\nI'm deeper fa real\nI'm deeper than skills\nMy speeches can kill\nRest In Peace!\n\n(Baby talking)\nYeah, you underdig, shorty it's all about one thing nigga,\nIf you bout money nigga come fuck with us,\nIf you ain't bout money get the fuck from round us nigga\nAnd whatever you bout we 'bout it, however you wanna get it we can give it to ya nigga\nOrder bitch, ya underdig\nPut ya prints in nigga\nPut ya feet down and ya nuts on the concrete and lets roll\n\n(Weezy-talking)\nLet me get it back\nHey... hey\n\n(Lil Wayne)\nU sleep in a field fa tryin' a dude\nI'll bust ya head to da meat.\nTurn ya mind 2 food.\nFood fa thought\nThink!\nI ain't lyin' 2 U\nI'll lie his body in grease\nSet fire to em'\nI'll tie his body in sheets\nPut tha tires to em'\nMake em' feel tha Escalade\nPut his feet in tha blades\nDAMN!\nI'm tha heat in tha blaze\nAnd niggaz keep they ways\nWhen I'm in tha streets wit Blake.\nWatch...\nMy nigga hungry--he'll eat tha plate\nAnd if I ask tha homeboy\nHe'll eat ya face (YEA)\nAnd tho' he got me\nU can ask\nI'm like a pool table\nI keep tha 8!\nMy side pocket--side wayz\nWhen I pop it\nLeave a nigga side wayz\nFa five days\nBird man talk\n\n(Baby talking)\nYeah nigga, I tell em', I tell em' again shorty\nIf it ain't about money get all the fuck from round us\n\n(Weezy -talking)\nFuck dat... I'm comin' bak gurl!\n\n(Lil Wayne)\nCheck my swag\nI travel light--sound dog\nU play hard and I gravel like ground dog\nI'm under ground call me ground hog\nLay down laws call me ground law\nBut don't confuse me wit da law\nNaw--but just confuse me wit my paw\nBecause I am the Birdman J-R\nI ain't trippin' nigga\nI play tha corner like Rip-Kin nigga\nWit tha 40 Cal Rip-kin nigga\nRip a nigga\nFlip ya vehicle\nSplit ya windshield\nWhack ya baby mama\nBut I let tha kid live\nAnd people say that I am a kid still\n'Cause tha lil' nigga still ride on big wheels.\nU feelin' animal then come on and get killed\nThis kid peel bandanas like bananas\nSay I'm slight bananas\nI blow a weekend in Havana\nIn my Gabana wit my bottom bitch from Savannah\nMan a train couldn't stop ya man\nI'm man up and you not a man\nStand UP\nSay I got my land\nI'm tha man of my land\nCall it Lil' Weezy--ana\nThat's tha new plan.\n\n(Baby talkin')\nYeah nigga, you bout some money get at me nigga\nThat's the only way\nDumb shit we bout that get at me\nNigga roll solo, dolo nigga\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Wish You Would", "href": "Wish_You_Would&&6502", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nLook look look - don't play with me\nLook look look\nHuh? Huh? Look\nLet's get the pistols out the trunk, let's get ready to bust things\nLeave a nigga block full of nothin' but guts, brains\nAin't no way, nowhere that these niggas could duck flames\nMy guns up for and tellin' all to suck Wayne\nI'm runnin' with a clique that just be thuggin' heavy\nPlus I'm runnin' in them bricks, cook it, cut it, sell it\nOne time for my daddy, Rabbit, up in Heaven\nEver since my nigga died I've been strapped up and ready\nCome and get it - it's Wheezy Whee, the hottest ever\nNow this fella gon' get bullets inside his sweater\nI'm just terror, or better yet, horror or drama\nAnd tomorrow I'ma hit the block and barrow your momma\nBeef with me, you're swimmin' in water with sharks and piranhas\nRevolvers and choppers got all your partners callin' the coppers\nAnd for the grand finale, I might pull up in a tan Denali\nWhen I hop out, in my hand is a Calico sprayin' your family\n\n(Hook (Lil Wayne))\nDon't play with me - I wish you would\nI'ma hit your hood, then split your hood\nYou bet' not play with me 'cause I cock my gun\nI pop my gun\nBetter hide and run\n\nNiggas bet' not play with me 'cause I wish you would\nI'ma hit your hood, then split your hood\nNiggas bet' not play with me 'cause I cock my gun\nAnd I pop my gun\nBetter hide and run\n\n(Lil Wayne)\nWhat is this that done got me in your district? Twist it\nNow everybody got dots on they heads like Egyptians\nI'm tipsy - I've been sippin' on that Hennessy, people\nThen it get deeper, I start shootin' up innocent people\nSeventeen creeper is who I - what I - be, dog\nThe clip slide in the four-five, then it blow five\nIn heat, dog? It's your life or me, dog\nOn four tires, or feet, dog\nI still be on the block sweepin'\nNobody is not sleepin'\nGot me in all black with a gun in a palm\nRun in his home, start shootin', hit his son in the dome\nDummy, it's on - ain't gon' be no relaxin' and stuff\n'Cause when I come through mashin' the truck, I'm blastin' a pump\nAnd passin' a blunt - me circle once to see if he dead\nGotta be sure cause niggas promised me a ki if he dead\nBut, dog, you get it raw if you are with the kid\nI'll push your baby momma car off the bridge\nHuh?!\n\n(Hook (Lil Wayne))\nBet' not play with me 'cause I wish you would\nI'ma hit your hood, then split your hood\nNiggas bet' not play with me 'cause I cock my gun\nThen I pop my gun\nBetter hide and run\n\nNiggas bet' not play with me 'cause I wish you would\nI'ma hit your hood, then split your hood\nNiggas bet' not play with me 'cause I cock my gun\nThen I pop my gun\nBetter hide and run\n\n(Lil Wayne)\nYou might catch me with bandanas and strapped T\nOn the back street of your block in the back seat\nI'ma cap three at the first coward I up and see\nI'ma bust the piece and knock his body a couple of feet\nWhen I rush your front door, you get a few to your stomach\nHope they dress you up nice because your funeral Sunday\nNigga shouldn't've played tough - wouldn't've got his head bust\nNow your whole livin' room is full of pink and red stuff\nNow you're gatted up, full of that vodka and weed added up\nFresh platted up, your T-shirt all tatted up\nCrack in the tongue of my kicks\nPlus I got a gun on my hip, and I'm runnin' the strip\nI know you see me: Little Wheezy killaholeezy\nA hundred rounds from the chopper leave 'em real sleepy\nYou know how we be smellin' weedy up in our clothes\nCutthroatin', connivin' killers, but that's all I know\nHuh? Huh? Huh?\n\n(Hook (Lil Wayne))\nBet' not play with me 'cause I wish you would\nI'ma hit your hood, then split your hood\nNigga, bet' not play with me 'cause I cock my gun\nThen I pop my gun\nBetter hide and run\n\nNiggas bet' not play with me - boy, I wish you would\nI'ma hit your hood, then split your hood\nNiggas bet' not play with me 'cause I cock my gun\nThen I pop my gun\nBetter hide and run\n\nNiggas bet' not play with me 'cause I wish you would\nI'ma hit your hood, then split your hood\nNiggas bet' not play with me 'cause I cock my gun\nThen I pop my gun\nBetter hide and run\n\nNiggas bet' not play with me - boy, I wish you would\nI'ma hit your hood, then split your hood\nNiggas bet' not play with me 'cause I cock my gun\nThen I pop my gun\nBetter hide and run\n\nNiggas bet' not play with me\nLook, uh-huh (uh-huh uh-huh)\nLook look look\nLook look look\nWhoa\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Fo Sheezy", "href": "Fo_Sheezy&&7632", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "You know they saying since the bar back on the 'dro, he lackin the flow\nAnd if that ever happen whoa I ain't rapping no more\nI'm good with a pina, daq and an o\nGagging and choke like ho put the dick back in your throat\nStill packing fo sho\nYeezy Weezy off of the heezy\nCruise with the top off of the 'Ghini\nDem lil boys got cheese I got cheddar linguini\nThat's why I keep the federals scheming\nThat's why I keep the platinum blinging\nEvery diamond's like a nice size\nI help people with problems look at the bright side\nWith nice ties on a rise so they sitting me high\nAnd the rims born in '79\nWeezy carry the nine glock\nSlipping they gon have to get six niggaz name Paul to carry a pine box\nMarry me ma, not\nBut here's what you can do to me\nGive me good brains tutor me\nW-E-E-Z-Y Wee\n\nThey call me Weezy Weezy fo sheezy\nBanana clip on the heater\nBanana whip on them sneakers\nBanana dick going deeper\n\nGot a good game honestly so respect the young'n\nGot your girl undercover like a detective woman\nI'm a mess blow a vest to onion and I'll test your stomach\nAnd the pistols right next to cousin\nI'm a player having sex with dozens\nSex with cousins hoes dissed with husbands\nMy pants is down her dress is up\nHer head down and her neck is tough\nShe suck till I say, \"That's enough!\"\nWe fuck till her ass fractured up\nAnd when I nut no shower bitch pack your stuff\nAm I a mack or what\nYep, Weezy macaroni with a bony model bitch\nOh you modeling ma\nShe got her own whip so you following ma\nShe said she like that squad shit\nSo oh you swallowing ma\nShe said she like that hot dick\nWell miss I got three bricks and two pills pop\nOne blunt mami let's roll\nAnd understand, I know what my name is, right\nBitch say it\nW-E-E-Z-Y Wee\n\nI'm so gangsta\nIf she don't go down no thank you\nI got so many bitches so anxious\nGot so many pictures of Ben Franklin\nHigh top tennis on the car cover up the whole ankel\nFuck it up with me niggaz come from all angles\nRepresenting S-Q like the Star Spangled\nWhite tee-fish at Kango\nLow top Nikes plus my ho pop Nikes\nHow exciting we riding in the third lane\nSaid she like Juvy but prefer Wayne\nChicken give me head\nCall her birdbrain on err-thang\nIt's Young Weezy 'cause I be golly\nMy neck more colorful then Nelly, Murphy and Ali\nI'm so cold deep\nLow seats in the old drop blow reef\nLike no cops could fuck with this\nSwiftly no tops on the whippy\nCash Money hot Bizzy Lil Wizzy get with me\nNow I'ma, I'ma ask you again\nYou know my name right bitch\nBitch say it\n\nW-E-E-Z-Y Wee\nBitch holla!\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Get Down", "href": "Get_Down&&918", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Baby and Lil Wayne talking)\nWeezy\nWhat up pop. What up pop\nFuck what they heard it's what they need to know nigga\n(They sayin' C.A.R.T.E.R. yep!)\nYa feel me. Hey nigga we done built this shit from the ground up now homie\nBelieve that daddy. It ain't no lookin' back from here. We too strong\n\nAnd that's the only way we get down (We get down)\nCause that's the only way we was taught (We was taught)\nAnd everything we got we bought (We bought)\nAnd real niggaz still shine in the dark (Still shine in the dark yeah)\nAnd that's the only way we get down (We get down)\nAnd that's the only way we was taught (We was taught)\nAnd everything we got we bought (We bought)\nAnd real niggaz still shine in the dark (Still shine in the dark fuck a law Oh!)\nCause that's the only way we get down\n\nI down down a brother we ain't cut from the same cloth you Downy soft\nBullets separate ya body compound a busta\nI'ma find ya if ya hidin I'm a bounty hunter\nIn ya home puttin' dick all down ya woman\nYou come home we in the bedroom countin' money\nI bring her home and I fuck her on a thousand hundreds\nThen I shoot the nasty bitch in the mouth for nothin'\nI say Birdman Birdman what's good today\nWe ain't never let them niggaz take our food away\nAnd we recognize real and got a rude awakenin\nAnd woke up together and our life was better\nI'm the Cash Money son I never like fa cheddar\nNot a rat though hat low Nike is leather\nLil maw twist to get my life together\nYa bitch meet me at the bar and we night together Cut!\n\nThrow my weight like Sherman Klump\nI gotta hold up my estate like Donald Trump\nAnd I aim kinda straight when it's time to pump\nI bring the pump when it's time to punk\nWrapped around my waist like a cumber bun\nDon't make a nigga pump (clap clap) you up!\nI come in that new thing she threw up\nNow yo' bitch ass gotta clean yo' shoe up\nI'm rich as fuck and I never blew up\nBuisness mug gotta get my loot up\nBet ya bitch get fucked if I ever met her\nBet ya ditch get dug you ever step up\nOne by one I push 'em down fat bullet fat head make a pussy sound\nHard head soft ass make a gushy ground I'm straight from a crooked town\nLike that bitch!\n\nI give my arms and my legs to the game I'm ahead of the game\nI dead any mane if he said any thing but it's cool as long as nigga paid when he came\nAnd I'm a fool wit the flame and the caine\nCut it just a little bit but the drain stay the same yeah\nYoung Wayne and the pain and the stain still remain\nOn the chest where the four made a mess yes\nI'm still here in the flesh 21 year old legend I'ma live way after my death\nI sacrifice whateva that's left\nI give y'all the last of my breath like..(exhales)\nWrite it down take a picture record a copy\nPress pause only way you stop me fucker\nI'ma get mine and make you not me\nSpit wine at ya face if you watch me Bitch!\n\nAnd that's the only way we gettin' down nigga Cash Money CMB man\nYou already know we here neva left fuck 'em\nSee me if you got a problem boy\nI'm at home all day man. It's not a game\nStunna, what's really good wit 'em we ain't neva let 'em take our food away\nFresh you nasty on this on dawg. Ugh\nThis one, this is the Carter Beotch!\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "What Does Life Mean to Me", "href": "What_Does_Life_Mean_To_Me&&8852", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Baby\"Ghetto Biotch!\n\n(Chorus)'what does lif mean to me?\nCars clothes an a lot of jewerly.\nWhat does life mean to me?\nA fine ghetto bitch wit a big ass booty.\nWhat does life mean to me?\nDrinken, pimpen an a whole lot of weed.\nWhat does life mean to me?\nEvery things right what we said, please believe me\n(Baby) \"Talken\"\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Snitch", "href": "Snitch&&8643", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Snitch!\nDon't let cha mouth open up 'cause you don't wanna see the handgun open up,(no) don't let cha mouth open up 'cause you don't wanna see the automatic open up, (no) don't let cha mouth open up 'cause you don't wanna see the handgun open up (no) don't let cha mouth open up 'cause you don't wanna see the automatic open up, (no)\n\nVerse 1 (lil wayne)\n\nAin't no snitches riden wit us, old modely mouth niggas can hide in the front, can't no loose slips get on my yaught, I leave playa hatas at the dock, watch! and a nigga help you burn the block, and as soon as you get hot nigga turn the gock, setting up federal appointments now, nigga all in court, brain out, daddy not know what hes doin' his child, we gonna mail 'em his finger when he get out yeah, juss to show 'em what we's about, never let shit about g's leave ya mouth, yeah, me and zach can't leave ya house, two dounut lovers to police ya house, I sneak pass those brothers, sneak in ya house, and put the heat right dead in ya mouth so shut up\n\nDon't let cha mouth open up 'cause you don't wanna see the handgun open up,(no) don't let cha mouth open up 'cause you don't wanna see the automatic open up, (no) don't let cha mouth open up 'cause you don't wanna see the handgun open up (no) don't let cha mouth open up 'cause you don't wanna see the automatic open up, (no)\n\nVerse 2 (lil weezy)\n\nWeezy nigga been 'bout me, stay loose so you don't know shit 'bout me, make no mistake, I'm a veteran act, me never rat, mommy taught me better than that, gotta gat if you ain't got 1 already, if you do, you ain't gotta enough, get 2, you could neva get me nigga get you, and you ain't gotta fuck me, girl fuck you, I'm rollin' wit my goons and I would never roll on my nigga, take that to my tomb, ain't no girl came out her mom's wound, real niggas shead motha fucker I'm tune and I was taught if a man talk about a anotha man while that man ain't present, a man don't listen, they throwin' bricks but they hands is mizzen, juss watch what cha sayin' sissy. (bitch! snitch!)\n\nDon't let cha mouth open up 'cause you don't wanna see the handgun open up,(no) don't let cha mouth open up 'cause you don't wanna see the automatic open up, (no) don't let cha mouth open up 'cause you don't wanna see the handgun open up (no) don't let cha mouth open up 'cause you don't wanna see the automatic open up, (no)\n\nVerse 3 (lil wayne)\n\nAin't no tellin' whos spread the earl, you tellin' ya boy, hes tellin' his girl, uh now she tellin' the world, it ain't no secret I'm hotta than eitha, but I don't need the cop shit niether either close ya mouth or meet the heater, we the dirty south where cocaine cheaper, you go up north niggas boost they fee ya, this where the real hustlas meet, uh look out anybody could be them people, your old people could be the people, no glasses help ya see them people, they around too many evil people, detectives wanna get evil equal, my desert eagle ain't even leagel, but shhhh!\n\n\nDon't let cha mouth open up 'cause you don't wanna see the handgun open up,(no) don't let cha mouth open up 'cause you don't wanna see the automatic open up, (no) don't let cha mouth open up 'cause you don't wanna see the handgun open up (no) don't let cha mouth open up 'cause you don't wanna see the automatic open up, (no)\n\n\nLil weezy talking:\n\nYeah nigga watch the people around you, watch the people away from you, leave them niggas be, let them stay from you, these niggas run they mouth like hot water swear to god, real niggas takin' falls like niaguara, tryin' to stay up like Viagra, but it ain't gone happen, these niggas is best buddies wit the 5 0 team, they know the d.a. by name, it ain't a game, it used to be one, it's like these niggas got them big ducks in they mouth, the thing a gonatoligist use when ya bitch go to get a pap smear, that's pussy anyway... wEEzy\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Hoes", "href": "Hoes&&4826", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Hoes! Lets just talk about Hoes!\nCan we talk about Hooooooeeeeesss Hooooooeeeeesss!\nRepeat\n\nMannie \"Lets Go\"\n\nYou got to talk like a pimp what's good mommee\nYou knew betta you threw betta who betta than\nThat nigga with the crisp. White tee icy white\nSneaks jeans to a betta you do betta gettin' yo ass\nOut off up in that coupe bitch. See yo ass on that new\nLeather and regroup bitch. Its only me you bitch on\nOur way to the stoop. I'm the birdman junior you ain't\nKnow and don't give me that silly bullshit about you ain't\nHoe. I move ya to my city put yo ass in 1 &amp; O. I have ya\nLookin' pretty at the have knock at the do. That gucci gon'\nFit cha like you suppose to be in pictures I got computer love\nBaby Wayne will change your image. You need Weezy them other\nBoys just gimics. Me I'm just game, green and straight physics\nIs you wit it (Yeah) I ain't even tryin' to hit it. I ma get it\nWhen its time to get it. Lets talk about\n\nVerse 2 (Mannie)\nI got this rat name Shelly dat loves Macavelli\nNumber 5 combo meals and splashin K-Y jelly. Our\nOld school shorty still drink a 40. Grab the mic\nStart a fight, fuck up the whole party. Maybe you\nShould leave, just yo weave that's velcro hell no bitch\nGo wit Steve. Got this lead singer bitch from a popular\nGroup I would say her name but she bought me a coupe. Got\nThis poor hoe Shawnna swear like Marijuana she dig lil wayne\nBut she love the big tymers. Got pretty gurl Patrice found out\nI'm fuckin' her niece she tried to stab her so I grab her and we\nCall the police. Mr. Officer, dat bitch den lost it bra she goin'\nTo jail oh well, I be fuckin' her. See two dykes, Spanish twins nuts\nPress on they chin, will we go video well nigga that depends\n\nI got old school bitches and new school hoes\nFemale basketball players with cornrows and I don't\nLike short hair gurls no not really if I do she got to\nLook like the old halle berry or the broke toni braxton\nOr first lil kim but I still take hood rats and work with\nThem. I put yo ass in a jag and I got jerk ya quick. Give ya ass\nA lil game if you smerk you in. I am pimp not a simp like ice in\nMy drink and I don't think twice or blink 'cause I'm focus rollin' in\nThe whitest mink like I'm polar bear yeah let down my hair Get jazzy\nOn a bitch like Fred Astair rose gold in her face get her red as glare\nMy bentley plum my mercedes pear. I am lookin' for a freak momma take me\nThere Yeah\n\nChorus repeat 3x's\n\nWeezy Talkin'\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Skit", "href": "Skit&&6269", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "You have now reached the end of side A it is time to turn over wait turnover\nGet a fuckin' CD asshole so bring your ass down to fuckin' sound advice buy a\nFuckin' CD player go to fuckin' sam goody buy the fuckin' CD stop copying shit on\nTapes you fuckin' loser and play the shit right and if you ain't feelin' it your\nFucked up your deaf so the shit better rattle your fuckin' trunk better make\nYour fuckin' ear drums bleed better make the neighbors go wow what the fuck is\nThat what's so loud is there another party at the house no its fuckin' Lil Waynes\nAlbum rockin' this shit motherfucker\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Young Playa", "href": "Young_Playa&&6026", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nHe he hee\nI'm a young playa nigga, (what)\nI get the game from the big tymers, nigga (what, what)\nWho else? (Speak on it) On the real nigga, on the real nigga\nRespect the game\n'Cause I got the game\n\n(Lil Wayne)\nY'all know who I is\nWeezy coming through in the bubble eye Benz\nSee me front in back with the wood all around\nPlus I got that surround sound\nDon't hate on me boy if you do get down\nCome from under my shirt try to lift you off the ground\nBut on the other hand, I'ma keep running man\nI got about a hundred coming up with three Hummers man\nWe stuntas man\nI might stumble across a grand and give it to you wifey\nAnd watch how she *slurp* on my pipey like a Icee\nI might be in a Range that night\nI might be in a Lex watching the game tonight\nI got a hundred on Kobe, hope he playing it right\nBut if I lose, its cool, that's some change lil shite\nThat ain't nothing\nI ain't doing nothing if I, I ain't stunting\nHold up, girl be quiet, Lil Wayne coming.\n\n(Baby)\nSlow yo roll lil one\nYou ain't glad its bought\nAnd Ms. Pat and gray head over there\nIn the back card gambling\nAt the bar dranking\nBut go head, just be quiet with 'em lil one\n\n(Lil Wayne)\nBroads I use 'em\nHatas I bluse 'em\nMy whole front grill is full of confusion\nGot dammit\nWeezy pull up in a Porsche, expanded (expanded)\nI was to the back, niggas couldn't stand it\nSoon as I left the scene, the women vanished\nI got it like that\nGot Rolex, blue shit hard to say watches\nPlus I bought all of my niggas Cartier watches\nWeezy and his clique leave with forty b-e-atches\nMillion dolla man baby tear da beasy\nCatch me sippin on some Hen, maybe Covoursier\nSammy, Mario, tody Taz, that's my posse\nAnd what\nYou might see me dippin low in a Benz truck\nTell yo girl hello\nI done did her, what you muggin me for\nKeep playin' with me, I'll put a slug in yo do\n\n(Mannie)\nNow looky here, young blood\nPull yo pants up on yo ass and put that piece of metal up in yo shirt\nDon't make me get up out this wheel chair and kick yo ass\nNow keep doing what you doing\nGo head\n\nY'all know me, young playa, stomp with the big dogs\nPlay with me boy I give you cancer like menthol\nCough cough cough up\nGot a cat eye benz on brollas\nThey call us\nUptown shiners\nOriginal hot boy$ baby, big tymers\nI spit game\nGet in they head, they be like, Quit Wayne!\nHalf hour later, I'm in they split man\nHehehehe it be kicks man\nLet me get real\nI'll kill on the battlefield\nSteal for the scrill\nI will never leave my clique nigga, I'm to trill\nI'm a little peepsqueal\nBut I'm a ape in that jungle\nAnd if you get it twisted,\nNigga, I'm taking yo lover\nI mean I'm raping yo lover\nLeave her taste in my rubber\nI'm a playa nigga, I'm a playa\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "This Is The Carter", "href": "This_Is_The_Carter&&9025", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne talking)\nOk I'm finally perfect, ya know\nY'all already know what it is and if you don't\nThen the great Mannie Fresh will enlighten you\n\n(Hook: Mannie Fresh)\nLadies and gentlemen, pimps and playas\nHalf ass rappers and true rhyme sayers\nThis is the Carter, so hold onto your teenage daughter\nBecause this is the Carter, a lot more rich and a whole lot smarter\nWayne in ya brain young Carter\nWayne in ya brain young Carter\n\n(Lil Wayne)\nWho am I, young wizzle fa shizzle\nFlow sicker than a third floor in hospitals\nMy charm starburst, my watch skittles\nI'm hot sizzle, what up hot bizzle\nHolla at a playa, I'm sorta like BD\nY'all can't stop my dribble, or block the lay-ups\nSoft top the Coupe, mami pop her too\nDon't chase the feelin' baby girl let it come to you\nRemove the ceiling on the girl now she comfortable\nI'ma world class G mami fuck wit dude\nI got Lazy-Boy bank that's comfort low\nI'ma offense coordinator run the shoe\nYou watch your grill what you ought to do\nFore' your ribs get barbecued\nAnd my ribs is showin I say I'm starving dude\nThis, this, this, this, this is the Carter dude\nWhat up Reel, c'mon\n\n(Lil Wayne)\nI'm the Birdman Birdman Jr. bitch\nI be high in the sky shit on you and yo bitch\nI be flyer than your guy nigga lose the prick\nNow if ya follow everything just grab a wing\nAnd we could sssssshhhhhhhh\nAll the way down to the mall and bet I buy it all\nYoung Mar' picture the broad lick\nAll the way down to the balls then she wipe it off\nIf getting money is wrong I ain't right at all\nI young money a car I just write it off\nI'm the boss of my own shit, I'm my own click\nI would say fuck ya but go and get ya own dick\nGet ya game up boy hustle harder\nThis, this, this, this, this, this, this, this, this\nGet ya game up boy hustle harder\nThis, this, this, this, this, this is the Carter, yeah\n\n(Lil Wayne)\nAnd y'all better blame Baby\n'Cause he the muthufucka that made me, and I'm crazy\nAnd y'all ask why I never left the navy\n'Cause he the muthufucka that pay me, is you crazy\nYoung, young, young wizzle baby\nGive you yo issue, me don't wanna kiss you\nNo, no, no me no want no bullshit\nSo, so stop baller blockin 'cause a nigga hood rich\nAnd I floss everyday because I could bitch\nSo holla at ya boy 'cause I'm still on some hood shit\nLike, like, like what's really good wit ya mom or your lil boy\nAnd your sister lookin' good shit, shit\nI'm still Apple Eagle weasel\n1-7 Hollygrove never ever ever leave you\nI got y'all waitin on my sequel\nThis, this, this, this, this, this is the Carter people\n\n(Hook Repeat X2)\n\n(Lil Wayne talking until the end)\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Hustler Musik", "href": "Hustler_Musik&&9391", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Goddamn\nMissed and hit a nigga in his head with dis one\nIma paint da city red wit dis one\nIma head wit dis one\nSee you fuckin' wit da boys who tote toyz way b4 christmas\nNo assisstance (jis) Thta persisstance me. That commitment if- I don't get it somebody gone die tonight\nI know my vibe is tight- And I deserve da throne - if da kid ain't right- den let me die in his souls\nI'll be ridin' (jis)\nRidin' alone\nWit my daddy on my mind like you gotta be kiddin\nHow da hell you ain't here 2 see ya prince do his thing\nSometimes I wanna drop a tear but no emotions from a king\nShe'll be\nSo I be who I be\nDats me, dats Weezy F. Baby and\nPlease say da maotherfunckin\nSo I be whoo I be\nDats me, dats Weezy F. Baby and\nPlease say da motyherfuckin\n\nBaby you gotta know dat I'm just out here doin' what I gotta do 4 me and you and we eatin\nSo bitch\nY da fuck iz you trippin'\nI'm takin' dese chances\nMy head 2 da sky\nMy feet on da ground\nMy fingas 2 da judge if da money don't move\nAnd I won't budge\nWon't budge\nNo I won't budge no\nNall\n\nMoney iz da motivation\nFacin da avenue\nBack touchin' da wall\nGot da weed\nGot da gun\nGotta run wen I hear dat bird call (birrr) Dang\nHop in dat thang and merk off\nSwerve off\nU know me, dey call me birdman jr\nNe body murderer\nBirdman sponsor it\nPhantom of da operah\nAll black- clock tent- locked in\nI can let dem shots out\nU can't get no shots in\nBullet proof\nLeave a nigga wit a bullet proof\nShoot ya in ya mouth and call it bullet tooth\nI'm like what dey do\nWhat 2 do\nThere's a full court\nPressure I'm just going 4 da 2\nIf I'm movin for da three\nIma take it in a second\nEven if there's one second and\nIma make it. It's nothin'\nI don't take it for granted\nI don't take it for nothin'\nI takee it for what it is worth to da durf motherfucker\n(Yeah)\n\n(Chorus: Repeat 1x)\n\nI ain't neva killed nobody I promise\nI promise if you try me\nU gone have to rewind dis track and make me go back, dat nigga go dat\nDat boy will lay flat so flat\nDat act is wat I perform amongst you hatas\nGot Nina in my palm and I'm masterbatin (black)\nPeter pan flies till I die what you sayin'\nBaden ape, Yves Saint, Evisu iz wat I stand\nGot me feelin' like scarface, like da Koheba\nStreets reply I look right in da 4 seater\nTop floor of the 4 Seasons four of them whores\nAnd they all know how to cook it up\nAnd look I got some\nAnd only one know how da bad bitch fundal up\nSee it's a cold world so homey bundle up\nWe ain't on dis grind for nothin'\nNow get ya hustle up\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Gangstas and Pimps", "href": "Gangstas_And_Pimps&&6554", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Mannie Fresh)\nLadies and gentlemen\nThis one goes out to that little kid that got fried Spam for lunch\nI feel for you, I'm with you, I'm with you brother\nAnd this one right here is for that ghetto girl with the bad perm\nThat just burn baby, burn baby, burn\nPop open a malt liquor\nSmoke something until your scalp gets killed\n\nGangstas and pimps\nLove lobsters and shrimps\nKool-Aid and chicken\nFlashy things and women\nAll I need\nIs Remy and weed\nSomebody not afraid\nTo go some for my Escalade\n\n(Lil Wayne)\nI'm just pimping\nBaby you got a rule for me\nPut your mink on and slide in a cool for me\nHey you gotta get high and go low for me\nIt's Cash Money young money never know money\nIt's 500 Degreez it's not fool\nBut it and the dro got me so scummy\nAnd to drum hole a whole hundred\nCan I put a whole hundred in your whole tummy\nHehe, man Weezy's a legend\nYou can tell by the bottom of my sleeve when you see what's in a bezel\nAnd he be on a level that's so terrific\nI'm in this bitch hold your pictures\nAnd hold your bitches 'cause she gon want a part of me\n'Cause she never see the roof of my car with me\nAnd you never see a tooth without a diamond on it\nThis is game at its finest homie\nPeep it\n\n(Baby)\nSee I was born from a gangsta\nPa gave me a whip\nRan numbers with pimps and I laid down cents\nOne of a kind Birdman I shine\n22's on it?\nThe bitch ain't mine\nI taught her the game ma\nI gave it all to her\nWeezy Wee my son I give it all to him\n(Lil Wayne)\nThe Birdman junior I'm the son of a stunna\n\n(Baby)\nMannie Fresh\nJazze Phezzy this our summer\n500 Degreez got rich off the four\nCadillac slant back cut side elbow\nCadillac smoke dro just me and the ho\nFlash from hard times from that coke and dope\nPut cars in moms name just to duck white folks\nWe eat lobster and shrimp\nNigga park that Lambo\nI'm a V.I.P. nigga\nPop bottles of Mo\nI pray that one day I'll open a better door\n\n(Lil Wayne)\nAin't no mountain high enough\nTo me for 'cause I keep on buying fi-fi stuff\nAnd the Eastside where we pump\nIt's my part of New Orleans\nBleed for ya I'm the heart of New Orleans\nHear you're fucking with a gangsta foe\nHope you never close your eyes I'll bang your ho\nAll she need is some guidance I'll tame your ho\nIt's big pimping over here man yeah man\nIf she looking for a daddy see the lil man\nWeezy baby, don't fool yourself you need me baby\nEasy baby, I'm just trying to keep my bread cheesy baby\nSlick when I spit shit right\n26-inch got a deep-dish ma\nSweet as mami lips when I'm creeping by\nBaby gave me wings just to keep me fly\nWeezy I, hell yeah\nAnd I'm rolling with them\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Fuck Wit Me Now", "href": "Fuck_Wit_Me_Now&&8340", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nLet's go - let's go\nLet's go - let's go\nThey can't fuck with me now\nHuh? Fuck with me now\nNo, they can't fuck with me now\nCan't fuck with me now\nLet's go\n\n(VERSE 1 - Lil Wayne)\nI go by \"Wheezy: the Don\"\nMagnificent nigga, lot of ice around my neck, and freezin' the arm\nAnd if a nigga decide to test, their chest get completely took off\nAnd if you wonder who the fuck (?)\n(?) We so sip\nIt's like ain't nothin' but we gotta squab\nOn the block everyday sellin' rocks and shit\nChoppin' bricks - give the damn cops a dick\nWe cop a whip and drop a brick - that's how we do it\nWeed, liquor, money, and guns how we do it\nFreak bitch to swallow cum like fluid\nWho it be? Through his feet, Dubbs\nAin't nothin' sweet 'cause I can't keep trust\nLil' nigga - worth well over a mill, nigga\nReal nigga - come around and show up where you live, nigga\nPullin' out the K's, nigga - (??) and all\nWayne 'bout to damage your home\nNigga 'bout to go to see the man in the stars\nHoppin' out the van with bandanas and all\nCannons went off\nNews cameras takin' pictures of your family when your avenue's gone\nDamn, it's a shame how the bullets slammed in your brain\nHow the ice slammed the pain, rammin' your dame\nThat's because she ran into the game\nNigga, stop playin' with Lil Wayne\nCome on!\n\n(Hook) (Lil Wayne)\nIt ain't a game, nigga - I don't know who told you it was\nI put holes in your mug if you're holdin' a grudge\nTry to take 'em when you get the gun and load\nAnd the slug check ya low when I bust\nCome to show you no love\nUh, fuck with me now - they can't fuck with me now\nNo! They can't fuck with me now - they can't fuck with me now\nStop playin' when ya get it understood\n'Cause I know if you know what's good for ya\nCome around your hood for ya\nYou don't know me - I kill everyone who show love\nYou have them motherfuckers lookin' all up in the woods for ya\n\n(VERSE 2 - Lil Wayne)\nIceberg Shorty - (??) pants is saggin', forty magnum\nComin' out the club on Bacardi's, staggerin'\nTen in the Ferrari wagon, braggin'\nOh, what's happenin'?\n(??) 'Round the court 'cause some ex just looked at me\nRunnin' with them cats that be clappin' the plastic\nNigga put a cap in your asses\nCatch me on the av with the crack and a 'matic\nHopin' that the law don't pass me - stash it\nFirst of the month, just snatched me a package\nBag it - 'bout to get this motherfucker crackin'\nIf a nigga think about jackin', please believe\nI be clip-slappin', click-clackin'\nPull the bitch back and run up on his parents\nKidnap for his snacks, and then whack him\nShit get drastic\nThat's why I try to stay as fars away from beef as I could\nGrab me a freak to ease on my wood\nTransport coke from each of my hoods\nWheezy Whee - CMB's in my blood\nIn the streets seventeen's where I'm from\nAnd I ain't got no feelins for none of these womens\nReally, though, fetticheese is my love\nYou know the streets made me\nAnd I don't give a damn if you hate me\nNigga better be S-Q-A-D\nUntil the bigger man do take me\nSquad shit!\nYou don't want no violence to keep the quiet\nWe call my people wild, and then we beef in quiet\nOr we'll creep in houses, we'll sweep your momma\nSo, please stay out it, or you leave in silence\nCome on! What!\n\n(Hook) (Lil Wayne)\nIt ain't a game, nigga - I don't know who told you it was\nI put holes in your mug if you're holdin' a grudge\nTry to take 'em when you get the gun and load\nAnd the slug check ya low when I bust\nCome to show you no love\nUh, fuck with me now - they can't fuck with me now\nUh, they can't fuck with me now, them can't fuck with me now\nStop playin' when ya get it understood\n'Cause I know if you know what's good for ya\nCome around your hood for ya\nYou don't know me - I kill everyone who show love\nYou have them motherfuckers lookin' all up in the woods for ya\nUh, fuck with me now - they can't fuck with me now\nUh, they can't fuck with me now - them can't fuck with me now\nCome on!\n\n(VERSE 3 - Lil Wayne)\nIt's too dark for ya's\nI ain't got no love for ya's\nLet gunshots smoked ya's\nWho fuck with us?\nWeed, liquor done corrupted us\nWet a nigga like umbrellas\nTake the woman out a man; stomach out a man\nPump and bust, the guts comin' out a man\nRunnin' out the Hummer with guns in each palm\nIf the motherfucker sleep, call him come get it\nNiggas be kiddin' - me awake, deal away\nGun-spray - bullets damn near took off your son face\nOh, shit - niggas on that whole shit\nFours spit so quick like that lil' nigga ain't got no sense\nSlow this shit down - let me get back down to reality:\nI cause fatalities for any technicality\nWipe off your family randomly - ya understand?\nIt ain't no motherfuckin' game, and I ain't fuckin' playin'\nCome on!\n\n(Hook) (Lil Wayne)\nIt ain't a game, nigga - I don't know who told you it was\nI put holes in your mug if you're holdin' a grudge\nTry to take 'em when you get the gun and load\nAnd the slug check ya low when I bust\nCome to show you no love\nAh, fuck with me now - they can't fuck with me now\nUh, they can't fuck with me now - them can't fuck with me now\nStop playin' when ya get it understood\n'Cause I know if you know what's good for ya\nCome around your hood for ya\nYou don't know me - I kill everyone who show love\nYou have them motherfuckers lookin' all up in the woods for ya\nAh, fuck with me now - they can't fuck with me now\nThem can't fuck with me now - ah, they can't fuck with me now\nLook-\nIt ain't a game, nigga - I don't know who told you it was\nI put holes in your mug if you're holdin' a grudge\nTry to take 'em when you get the gun and load\nAnd the slug check ya low when I bust\nCome to show you no love\nAh, fuck with me now - them can't fuck with me now\nThey can't fuck with me now - them can't fuck with me now\nStop playin' when ya get it understood\n'Cause I know if you know what's good for ya\nCome around your hood for ya\nYou don't know me - I kill everyone who show love\nYou have them motherfuckers lookin' all up in the woods for ya\nAh, fuck with me now - they can't fuck with me now\nThem can't fuck with me now - no, they can't fuck with me now\n\n(Lil Wayne)\nCan't fuck with me now - it's not a game, nigga\nCan't fuck with me now - it's not a game, nigga\nWha, wha, uh, uh, nigga!\nWheezy Whee! (Whee! Whee! Whee!)\nWatch out! (Watch out!)\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Watcha Wanna Do", "href": "Watcha_Wanna_Do&&4671", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "What what nigga huh huh\nNigga what what what check\nI'm shooting flees\nPolluting you and your niggas\n\nBetter run from me\nComing through in that strap\nWith a two twenty three\nYou be losing your life\n\nWhen you caught up in beef\nWhat nigga, nigga she\nNow I ride and ride\nWith a K on my side\n\nBet this jai fly and fly\nNigga you won't be for I\n\nI hope you lying but why\nIn the middle of the night\nI be fatigued\nCamouflaging by\n\nBy by the by by by what\nNigga what taking me for joke\nAnd watch me heard you\nBoy they be commercial\n\nI'll beat them till they purple\nI'm live any nigga\nBut I got a big oh chop tools\n\nThat'll kill bitter niggas\nDid you do it\nThought it was cool\nBut you still in it nigga\n\nYou're so ugly with your boys\nBut I'm still pretty nigga\nLil' Wayne representing\nI cut like blades\n\nI bust breads and break legs\nI tear up dreads\nTake my our breads\nNow cold figure\nWhy from the seventeen\n\nI bang down from gold nigga\nHad me for go beat the go carts\nOn your block with four triggers\nMan y'all niggas ain't up with this\n\nY'all eating one me\nYou could suck my dick\nNow taking a chill but\nRealer you could play if you want\n\nFind you something in the back of my trunk\nOh feminine funk\n\nNigga what huh\nNigga what you gon' do\nNigga huh what what\nWhat you gon' do\n\nI say what huh huh\nWhat you won't do\nNigga huh what what\nWhat you won't do\n\nI be Wayne Wayne Wayne\nFrom C-M-B fifty shots\nSlang flang flang\nFrom artillery\n\nBut look they sting sting sting\nBurn like rubber on streets\nUrrh if you can't hang\nFind your way from around me\n\nLitle soldier all for A-N-E\nAppley ego my niggas\nSo ain't no playing me\nYeah I may be\n\nA little small and all that\nBut I'm about war tone a get\nFlipping a car and all that\nFreeze me and my shit\n\nPlease hit your hood like fleas\nSolider rag black boys\nWhy you teasing Rees\nPlease tell me that you was full of weed\n\nThen things won't be\nI don't think none of y'all families\nGon' see y'all bleed\nI know what the hell it be\n\nNiggas start his nothing of speed\nI be ten D and two twenty threes try trees\nRabbit told me not to be weed\nAnd let a nigga play me\n\nSo he who take the biggest bite of all of his teeth\nHook up with Ju turp and B.G.\nOpen niggas like key\nGee I bet that some gees boy\n\nWhere the H be\nUs thieves seem beaters\nMake a scene off a keys\nAll y'all please need to cease\n\nRaah cheese\nNigga what huh\nWhat you won't do\nNigga what nigga what\n\nHuh what you won't do\nI say what huh what\nWhat you won't do\nNigga what huh\n\nWhat you won't do\nLook dog you could be stupid\nWhy they all be J ball\nAll you try to call\n\nThe block and get 'em all\nWhole nation gon' fall\nLil' Wayne spent the cut\nPut your guns up nigga what\n\nI clutch your butt\nNigga go and hide\nWhen I ride\nI blow the forty five\n\nAnd explode on your side\nAnd niggas like a Mario\nTools for me\nNow it's been a nigga use to me\n\nOn the three five diaomond dust\nJust waiting niggas could take me\nEntice a caden\nNigga if you won't walk with me\n\nIt's gon' be about your issue\nPut this set with my nigga\nThanks to pitcher\nLook at nigga dressed in black\n\nWith a big old cut\nFred your house pow\nI love my nigga what\nNigga what huh\n\nWhat what you won't do\nNigga what huh what\nWhat what you gon' do\nWhat you won't do\n\nYeah I say huh\nWhat nigga what you won't do\nHave me in all black\nBusting back at your crew\n\nI say what huh\nWhat what you won't do\nI say huh what\nNigga what you won't do\n\nNigga what huh\nNigga what you won't do\nHave me in all black\nBusting at your crew\n\nWhat what what\nHuh huh huh\nNigga, nigga, nigga what\nY'all want nigga\n\nWhat y'all niggas want\nDo nigga what\nHuh huh\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "I Miss My Dawgs", "href": "I_Miss_My_Dawgs&&1707", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Lil Wayne talking)\nYeah.yeah.yeah.yeah\nThis is the Carter muthafucka, yeah\nAnd in my building I must keep it real\n\n(Lil Wayne)\nAnd man I miss the times, we would shine, you would keep on your side\nYou would teach me how to ride and you would teach me how to pry\nThen we get on the line and go over our lines\nWe were in the same position and that's when you change position, shit\nI never change and I miss ya, and its strange but I never forget ya\nThough that at you in dem pictures homie\nAnd I know that ain't you wit that dissin on me\nThat's why I never replied and never will just let 'em live phony\nIf ya ever died I swear to God I got yo kids homie\nWhat's mine is their I gotta give homie, and yeah\nWe still a army in this bitch homie\nYeah Cash Money still the shit homie, shit homie\nWhat's really real is you feelin' me nigga\nThat Hot Boy shit still in me nigga, word to diggity nigga\nAnd I ain't got time to speak the history\nI miss you and I know you missin'\nGizzle but\n\n(Hook: Reel (Lil Wayne) Repeat X2)\nMan I miss my dawgs (yeah)\nMany nights club hoppin (yeah)\nMany nights we were blowin' trees (yeah)\nMany nights we were hustlin (yeah)\nMan I miss my dawgs (yeah)\nMe and you through thick and thin (yeah)\nMe and you through the very end (yeah)\nFor only you I'll sin again (yeah)\n\n(Lil Wayne)\nAnd I remember when you came to the click\nI had already made my name in the click, but you got famous and shit\nI got my solja rag and dangled my shit\nI was honored just to hang wit you shit\nAnd I banged to the boogie bang bang wit yo click\nAnd I ain't even from the 3 (3rd Ward), my hood was angry at me, shit\nBut I rose to my feet, played the post wit the heat\nAt them shows while you performed and posed\nI was waitin for a nigga to jump, see I was patient but was ready to dump\n'Cause you my brother chump\nReal Gs never buckle up\nBut every family ain't filled wit gangstas that's real\nAnd that's real and I would never turn my back or turn ya down\nEven if you turned around muthafucka\nBut history is history\nI miss you and I know you missin' me\nJuve but\n\n(Repeat X2)\n\n(Lil Wayne)\nYou was my nigga, my nerve, my joy, my hurt\nMy main muthafuckin man Turk\nMy other, my partner, I was teacher, he was father\nI skilled, he schooled, we chilled, we moved\nWe thug, we hung, we ate, we slept\nWe lived, we died, I stayed, you left\nRemember how we played to the left\nAnd we stayed out of trouble 'cause we stayed to our self\nMember Slim and B would leavin' and hand the keys over\nTell me not to go Uptown and we went straight to tha Nolia\nWhile I watched you reunite wit yo soljas\nAnd yo mom and brother, while I lied to the stunna\nYeah those were the times my brother\nNow I recognize real and I honor my brother\nYeah nigga sub mage my brother, the Sqad's my brother\nThe niggaz you left behind is my brothers\n\n(Repeat X2)\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Let's Go", "href": "Let%27s_Go&&9636", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "It's gravy nigga. Believe it.\nYou hot? Fuck it. Hot as a firecracker.\n(It's gravy too.) I got a mac in this bag.\n(Click clock) What you got? Glock. (Look)\n\n(Baby)\nNigga I'ma tell ya straight off the bat\nI got a mac in this bag with 20 grams of crack\nAnd I'ma sit in the back seat of yo' 'Lac\nJust in case I gotta snap, a firette to the chest\nIf I don't know shit, I know cars and broads\nI done ordered plenty hits and watched heads come off\nAnd I done saw my nigga get life behind them bars\nTo them dog hoes, nigga, we scream \"fuck 'em all!\"\nI hustle hard in these city streets\nI got my block on fire with my HB's\nSpinnin' Benz in these drop tops double r\nCook a brick, flip 'em up, now I got 'em hard\nAnd you can find me\nRight up in them hallways, holdin' and totin'\nGot the whole motherfuckin block loaded and smokin'\nNigga know one thang: its some uptown shit\nIf a nigga get it fucked, then we killin' a bitch\n\nNigga I'ma tell ya this, straight off the bat\nI got a mac in this bag, with 20 grams of crack\nWell let's go nigga, see we can slide nigga\n'Cause if you hot, then I'm hot, let's ride nigga\nLook, I'ma tell you this, straight off the top\nI got a blunt, and a glock, and a bag of rocks\nLet's go nigga, let's slide nigga\nIf you hot, then I'm hot, let's ride nigga\n\n(Lil Wayne)\nBetter pay attention now so you don't forget later\nI run the damn block, I oversee all of the paper\nDon't make me take ya, play ya\nI cock the glock and spray ya\nCall it a caper, won't be no as-salama-laka\nAnd J, he got the gauges, they cocked and ready\nMake me run up in ya places and pop ya daddy\nGot them bricks rocked and heavy, let it be known\nI cook it hard and cut 'em in zones and the money be gone\nThen I hit a blunt to the dome, and ride when night falls\nSupply the white raw, if there's a problem, knock ya wife off\nLock the spot down\nRespect it young nigga, I'm creepin' over\nNow cut it with just a little bakin' soda, breakin' boulders\nI take it out my holster and bakin' soldiers whenever\nNigga it's whatever, tell ya ma to call the reverend\nYou see me on the block with crack, gats, and weed\nRats, plats, and ki's, that's practically me\n\n(Lil Wayne)\nSee I'm a hustler, cut-throat, put rhymes in mom's muffler\nYou can't even count how many times the 9's bust at ya\nSome of the, niggas that you run with are, suckas bruh\nNone of ya, won't leave, without some bullets up in ya\nNiggas can't hold me down, wodie wild\n'Cause all that they can hear is loud screamin' and explosive sounds\nThey show me how to cook that brown and rock that white\nNo school, put that book back down, pick up that knife\nSee that's the real reason I hate to be on tour\nI'd rather be back on the block with a bird of that pure\nNiggas got it all wrong, thinkin' I'm all song\nBut y'all gon' twist it and end up all gone\nDog-gone cocksuckers, you not thuggers\nI pop dozens of glocks, cousins, in my struggle\nSo stop frontin', it ain't gon' get ya everywhere\nI'ma start bustin', and bullets hit ya everywhere\n\n(Baby talks till end)\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Shine", "href": "Shine&&4022", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Wayne)\nWhat, wha, wha, wha, wha\nWhat, wha, wha, wha, wha\nCash Mo-ney Millionairs\nSo take it there\n\n(Juvenile)\nYellow Viper, yellow Hummer, Yellow Benz\nYellow PT Cruiser, yellow 'Lac on rims\nDrop yellow 'Vette and a platinum Rolls Royce\nThat's seven different cars, everyday I got a choice\nOn my way to pick up Joyce, she be makin' me moist\nGivin' me head while she hummin, she can play with her voice\nAnd she got nice thighs, a big plump ass\nShe could ride a dick too, make me come fast\nI like them modelin bitches, I love them swallowin bitches\nWhere them hoes, there they at, I'm 'bout to follow them bitches (let's go)\nI know you with your folks, but that nigga is broke\nYou might as well open your legs up and let a nigga poke\nI'm a show you what it is not to be a window shopper\nMama you can have Fendi, mama you can have Prada\nAll you gotta do is break a nigga off proper\nYou could be with your man, I ain't tryna stop ya\n\n(Chorus-Baby)\n(Shine), from my head down to my shoes\n(Shine), skiiiiirtin on twenty-two's\n(Shine), check my baby mama\n(Shine), whip Rover's not Honda's\n(Shine), I'm a spend it till it's gone\n(Shine), don't know when I'm comin' home\n(Shine), pop X and drank Cris'\n(Shine), My life is the shit\n\n(Lil Wayne)\nBaby named me, fire Wayne, ice and change\nYou can catch me in an aqua Range, squattin things\nWith them twenty-two inch chopper blades\nDiamond face, diamond brace\nMore colors than the game Simon Says\nGo, 'hind me\nAnd mami on forty-fifth she told me \"I'm a Lez\"\nBut she ain't like too much of dick\nBut gave bombest head, and so I took it anyway\nBut bitch I got family get your pussy anyway\nOK, let's talk about this ice that I'm carryin\nAll these karats like I'm a fuckin' vegetarian\nNiggas play, I bury them, y'all already knowin'\nI threw up my arm and bitches thought it started snowin\nSee I'm a keep it goin', Big Tymin, you heard's me?\nDog I got cake like everyday my birthday\nWait, I don't think they heard me\nI say dog I got cake like everyday my birthday\n\n(B.G.)\nI'm a Hot Boy, that's name brand and top of the line\nRide fly daily, all year 'round I shine\nAin't a nigga and they mama gonna stop me dog\nCome through on dub-dueces, they jock me dog\nGlock cocked for haters tryna block me dog\nCatch 'em so low, they geezy, don't shock me dog\nWell get the fuck, slide on out the way\nAnd let B.G. ease down the shinin linen\nLet the diamonds and the jewelry light shit up\nEach piece of jewelry I own, I ice it up\nYou don't wanna put your vehicle next to us\n'Cause all of our vehicles, we dress 'em up\nWith television, Dreamcast, DVDs\nNice sounds, buttons, it's twenties\nI'm a Cash Money Hot Big Tymer nigga\nThat'll hold a pinky finger up and blind ya nigga\n\n(Turk)\nI'm a stunt till I die, so you better respect it\n'Cause whoever try testin is gonna be restin\nI'm a young millionaire, Hot Boy, Lil' Turk\nBling blingin everyday, plus I got work (bling)\nNigga like me stay in the cut twenty-four/seven\nSteady stackin my ends on dubs, twenty-four/seven\nEvery car you wish you had, we got it, we got it\nBentleys, Hummers and Jags, big bodies, big bodies\nLove to floss, no secret stun'ner's\nNiggas steady baller block, can't take nothin' from us\nYoung nigga, livin' a life surrounded by ice\nHoes be like, \"Damn, them boys, they're nothin' nice\"\nThey on fire, that must be them Hot Boys\nYou muthafuckin right, you think this not girl?\nBetter think twice, get it right dog\nKnow you recognize, we got it on lock for all\n\n(Baby talking to fade)\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Weezy Baby", "href": "Weezy_Baby&&4716", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Yeah... ma gurl get in at 1:15 am\nThe guitar's cryin right now\nJust a couple things goin' on in my life, you know\n\nBrim leanin, cup tilted, blunt flickin\nGet money, fuck bitches\nYoung Weezy, young pimpin', she love it\nI keep goin', she keep cumin, what you know 'bout it\nSo 'bout it... like Master P... but no coward\nNo I am no Howard the duck duck\nLead showers, black flowers\nBlack dresses, two hours, closed casket\nMa dough tactics is so crafty\nNo laughter, I do that after I get the dough bastards\nI get the dough faster, what if I flowed faster\nLike... oh Nancy the flow's plastic, automatic, I'm\nMore drastic, ain't no names compared to me\nWho are you, where are ya, I can't see, ya air to me\nYa not there to me, I ain't fuckin' wit you bitch niggaz\nI'm fuckin' ya sis nigga, it's Weezy\n\n(Hook - Nikki)\nIf you don't call him Weezy\nThen you must say the baby\nIf you don't say the baby\nThen just don't say it at all\n\nI'm... slick as an old mac, I'm... sick as a prozac\nAnd... the Carter 1 was the... dick for you hoes trapped\nAnd... this is Tha Carter 2 and... this is the bozack\nDiggin you hoes back, quick if I blow back\nGot it... gone Rabbit\nFast ma daddy's Rabbit at home\nWhat up pa (what up), what up Pac (what up), what up Pun (what up)\nWhat up Big (what up), what up Solja\nAs the streets get colder I get chillier\nWhat up Left Eye (what up), what up Aaliyah (what up)\nTeck 9 close by touch 'em up\nI shoot niggaz in the mouth boy pucker up\nSweet sucker tash gee golly what the fuck\nWhere the hell all these new pussy rappers come from\nI chew 'em up like bubble gum... yum yum\nYoung Weezy so troublesome, what what\n\n(Hook - Nikki)\nIf you don't call him Weezy\nThen you must say the baby\nIf you don't say the baby\nThen just don't say it at all\n\nI ain't talkin' fast you just listenin too slow\nI'm... gettin' them Benjamins\nCan serve like the Wimbledon\nIf I'm in any predicament, nervous never that\nGot a gat to knock whoever back back, very flat\nChest... caved in, mess on the pavement\nSplat... cherry wax, rrraaah... bury that\nRats... scary cat, rrraaattt carry that\nHollygrove trigga man guns in a knapsack\nArea code five zero four, I ain't Nino fuckin' Brown\nAnd... this is Tha Carter ho, this is a quarter stick\nThis in ya garter ho, leave out the back and go straight to the corner store\nReturn with the cake, come wit all ma dough\nAnd if not they find you in a lake in the mornin ho\nWeezy Baby please say the baby\nIf not, don't ya motherfuckin say it at all, bitch\n\n(Hook - Nikki)\nIf you don't call him Weezy\nThen you must say the baby\nIf you don't say the baby\nThen just don't say it at all\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Best Rapper Alive", "href": "Best_Rapper_Alive&&2994", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Bring the crowd and I'm loud In Living Colour\nIt is Weezy fuckin' baby got these rappers in my stomach\nYumi, I'm takin' it I ain't asking them for nothing\nIf you sell a million records we can battle for ya' money\nI rather count a hundred thousand dollars on a Sunday\nWatch a football game and bet it all on one play\nStill stuntin' baby yes I'm still flossin\nLatest car on the market wit the top peeled off it\nBig wheels make it look a lil bulky\nYou look a lil salty have ya' self a chill coffee\nChill out the girls is still out\nEven though I am a boss and got papers to fill out\nI'm busy I got paper to reel in\nGod I hope they snappin' at the end of my rod\nAnd I hope I'm fishing in the right pond\nAnd I hope you catchin' on to every line\nWho am I?\n\nThe Best Rapper Alive (4x)\nSwagger right (check) game tight\nAnd they gon R-E-S-P-E-C-T me\n(Who) The Best Rapper Alive (4x)\nSwagger right (check) game tight\nAnd you should be afraid be very afraid\n\nThe heart of New Orleans\nThumpin' and beatin'\nLivin' and breathin'\nStealin' and feedin\nPeelin' and leavin'\nKillin' and grievin'\nDearly departed erased deleted\nNo prints no plates no face no trace\nOut of sight out of mind\nNo court no case\nSell his chain celebrate block party second line\nZulu ball essence fest jazz fest mardi gras\nShotty bounce body rock\nNow he drop now he got\nFamily cry tell the feds tell the cops\nSmell the rat comin' back to the house\nTo the spot tap tap knock knock who is dat\n(Pow!) trigga man hoodie man tell the kids\nBoogie man pistol pete ammo mammal gun man blum blam!\nDamn Sammie you dun' fucked up\nPussy ass niggaz put ya' nuts up\nJust call me\n\nFuck up wit all these rookie MCs\n(Whew!) smell like a bunch of pussy to me\nFuck Em!\nFuck 'em good fuck long fuck 'em hard\nFuck who? Fuck 'em all\n(Yeah) like dat jus like dat\nI'm on dat money train and the mac'll knock 'em off track\nThe quarterback well protected from the Warren Sapp\nThe young heart attack I spit dat cardiac\nYou can't see me baby boy you got dat cataract\nI'm right here straight out the hood jus like an alley cat\nSince everyone's a king where the fuckin' palace at\nMe I got callous on my hand I can handle dat\nIts no problem baby I so got 'em\nIts just a victory lap baby I'm just joggin'\nAnd I ain't even out of breath\nThe motherfuckin' best yet sorry for cussing\nWho?\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Money on My Mind", "href": "Money_On_My_Mind&&8641", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Yeah\n\n(Chorus 2X with variations)\nMoney on my mind\nMoney on my mind\nMoney on my mind\nMoney money on my mind\nMoney on my mind\nMoney on my mind\nMoney money on my mind\nSo money is all I think of\n\nSteppin out the motherfuckin car they in awe\nI'm lookin' like a star bitch when you see me make a wish\nHolla at ya motherfuckin boy J.R\nBirdman my pa bitch ball bred born rich\nDear Mr. Toilet I'm the shit\nGot these other haters pissed cause my toilet paper thick\nI know but trip and that forty make a chip\nOut a potato head wimp and like ranch I dip\nAnd the hustle was all muscle just strength\nWhen it comes to that weight I don't struggle I just lift\nI got my hand on the game yeah I make a grip\nHundred grand in my fist same on my wrist\nGet key money from a quarter blame it on my wrist\nI whip coke like hoes nigga I'm a pimp\nLil nigga bout to rape the market\nIf we talkin' bout money baby now we talkin'\n\n(Hook: during chorus)\nFuck bitches\nFuck bitches\nFuck bitches\nGet money\nGet money\nGet money\nGet money fuck bitches\nFuck bitches get money\nFuck bitches get money\n\nYeah\nNigga get it in a slump if you know how\nIn the heart of the summer we need a snow plow\nWhat you know bout that baby its yo time\nCoke transactions on the phone we call it blowjob\nToo fast for the feds too cocky for the cops\nHad to ditch my old bitch gettin' sloppy wit the pots\nHoppin off the boat meetin papi at the docks\nHe tell me I'm gainin weight I tell him I'm gettin' paid\nMoney over bitches I'm yellin' it to the grave\nDeveloped at a young age go after what pays\nThese Gabana sunshades block the sunrays\nI drop a car note in the mall on the first day\nI gotta get it even if its in the worst way\nThat cake like it's it's my birthday\nNew Orleans my birthplace ya heard me\nWhere moneys more important than the person\nNigga\n\n(Chorus + Hook during chorus)\n\nTwistin up a blunt thinkin' bout my next dollar\nI'm diggin in the game tryna get some money out her\nI'm so vain it's a problem\nIt ain't a stain on these Pradas I'm just bein modest\nGot me a goddess sure how to divide it\nShe still down and she don't get none of the profit\nWe around the city let the tints hide me\nThat's a cold muhfucker whoever inside it\nForever symbolizing the grind it don't walk to you\nI make it run like horses do\nGiddy up baby if you got it then hit 'em up baby\nI know its crazy but I can't get enough baby\nI love it I fuckin' love it\nI'm a self made millionaire fuck the public\nRidin' to myself 'cause I don't fuck with nothin'\nPistol on my lap on the way to the money\n\n(Chorus + Hook during chorus)\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Tha Blues", "href": "Tha_Blues&&5958", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nCome on, come on\nCome on, come on, come on, come on\nAin't nothin' nice or sweet (Huh?)\nThey don't even much understand this (Uh-uh)\nLook-\nNow when I crawl up out the Rove' I got quarters and O's\nForty-fours under my clothes - I'm drunk and blow\nAnd I done told them boys if they play I dump their mothers\nNow they findin' niggas everyday slumped in gutters\nI come through on the block strapped, bumpin' Bubba\nFor the summer in a bright orange pumpkin Hummer\nStumblin' from the Courvoisier, and lots of hay\nAnd make me run in your place and take your pops away\nSee, they got niggas in my hood who can't cop the yay\nSo I can get it understood and have you chopped today\nAnd not to say I could even hit your block and spray\nAnd try to knock all the bone structure out your face\nStick a potato on the head of my nine - it's deadly quiet\nLeave a nigga redder than swine, you damn pig\nThe plan is to take everything and kill 'em all\nYoung or old, nigga, big or small\nAin't nothin' nice\n\n(Hook (Lil Wayne))\nAin't nothin' nice around here, stupid\nKeep playin', you won't see next year, stupid\nAnd in the van there's a box in the back full of plenty of tools\nAnd when you see me on the block, I come to give 'em the blues\n\n(Lil Wayne)\nLook-\nNow we all do dumb things\nPlayin' with Wayne doesn't have to be one of 'em\nI'll murder his father right in front of him\nNone of 'em are ready for the trouble I'm 'bout\nPull up in a bubble, hop out, then let a couple pop out\nI got two double Desert Eagles, bustin' at your peoples\nCussin' at polices, and roughin' up your nieces\n(????) Off the meters\nDon't leave without the heaters\nBelieve this, my nina's got more shelves than Adidas\nYou see the slick jackin', believe it's glocks and millimeters\nRun up on your family and pop your senioritas\nA lot of Hennessy - just twist that lil' baby\nDamn, them hollow tips just missed that lil' baby\nThis is definitely, step to me, get a hysterectomy\nTechnically I'll murder anyone who disrespectin' me\nSeventeen Carollton - mess with me, I bury one\nThree-eighty - I carry one\nCome to kill up everyone\nWhat!\n\n(Hook (Lil Wayne))\n\n(Lil Wayne)\nEverybody freeze and drop when Lil Wheezy cock\nAnd niggas be like Q-Tip 'cause they breath and stop\nBelieve or not, the ki's ten G's a wat\nUntil I die apple and Eagle that be's the block\nAnd he's so hot that four hundred degrees the spot\nAnd weed and vodk' got me wanna beat a cop\nI grease the glock, the scope with the beam and dot\nAnd I'm hangin' out the Beamer top releasin' shots\nFollow me - everybody in the family die sourly\nNiggas drop hourly - ruinin' your economy\nLiquor power me, now there's nothin' that can bother me\nCreep up in your window while you're sleepin', take your child with me\nI'm wild, and Wheezy more violent than Dennis Rodman\nSlide up in a blue truck and shoot-up a whole lot of men\nA lot of heat, a lot of fire, a blazer like Stoudamire\nRide around your neighborhood and you wake up with bodies by your house\n\n(Hook (Lil Wayne))\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "You Want War", "href": "You_Want_War&&3288", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nAw aw\nAw aw!\nAw aw!\nPeep me out, look!\nHead bustin', black fatigues\nSo blunted, 400 degreez, it's sweet\nNigga, respect me\nWhen you see tha left hand buggin', nigga, respect it\nBut if you see tha left hand bustin', nigga, your disrespectin'\nTook one to tha chest, I never die, I'm tha same brotha\nJump out and shoot K's, let 'em fly, I'm tha same brotha\nIt's a must they recognize that I'm untamed, brotha\nDisconnect a boy like a damn change number\nUh, hang up and try again\nI kill ya, wake ya up, and make you die again\nSpark it up, and make a nigga block fry again\nGo ta jail, and do life, not five ta ten\nMe, Lil' Mario, and Toolie, that's my man, fam\nMy niggas don't give a Jean-Claude VanDamme\nAbout'chu, 'cause we don't play around\nBring tha K around, spray tha town, take tha ground\nTake tha ground that you walk on\nTap tha phones that you talk on\nJam ya up and take your arms off\nI hit you twice with tha sawed-off\nAnd your nigga just watch your head fall off... fall off\nYou think ya love me, I shoot anybody that look suspicious (what)\nI bust tha three-six until tha damn drum bust (what)\nI hit tha hood, (I hit tha hood) be up in all black, (be in all black)\nNumb-nut\nI run up in your house with a tommy gun, what\nI'm standin' there like all mine\nRun through your click like a weak defensive line\nDoggy fresh\n\n(Turk)\nYou want war, nigga, let's beef... beef\nWe can do it how ya want, or take it to tha streets... streets\nI'll be dressed in camouflage, Ree's on my feet\nThrough your air (through your air) leave ya burnin' like heat\nWhat ya... know, I'm tha one from tha T.C.\nChopper shooter, block bruiser, I'll bet any G (any G)\nOn fire, nigga, label, that's a HB\nAnd if I can't kill you... killin' your family (family)\nThink it's a game, 'rilla, test my nuts, you'll see\nHow fast I send shots through your 6V (6V)\nHeads bust if ya really think it's CMB\nAnd I know you all know about Slim and B\nWe get our ball on, nigga, drink Cristy\nMe and Buck get head from meekos in Tennessee\nBetta ask somebody, nigga, I been a G\nAnd the Baby still servin' niggas for ten a key... nigga\n\n(Lil Wayne)\nAw, aw, aw, look\nCall me big baller, Big Tymer, big pockets\nCall me big stunter, big stick, or big body\nCall me that lil' nigga with tha Role... fulla diamonds\nCall me tha number one Hot Boy on fire\nFire, when you shoot outta town, then I'ma holler\nWith a crate of Crystile, couple of blunts, and a condom\nLet him know if (let him know if) he down bad, that ain't my problem\nLer him know if he come at me bad, then I'ma chop him\nCh-uh... chop him\nPut tha flame to him\nAll of a sudden tha thing hits straight through him\n'Cause I'm tha same nigga, pimper boy, Lil Wayne\nThugged out, pants fall to my shoe strings\nBut since I use ta be... doin' tha best at thangs\nThat mean I gotta wear a vest that day\nI really think them niggas jealous... of tha sparkle in my necklace\nHe ain't ready... he ain't ready\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "Earthquake", "href": "Earthquake&&2516", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Jazze Pha)\n(Lil Wayne)\n(Speak to them Jazze)\nI\n(Yeah fly guy)\nI'm way more fly than you\n(That's right)\nI'll take your dime from you\n(That's right)\nNow she wanna spend all night with me\n(She wanna wake up with Weezy-F baby)\nLet me, (whoa) be the one that you throw it to, baby\n(Throw it back ma, throw it back, throw it back, throw it back ma)\nI'd like to spend the rest of my night with you, baby\n(Yeah so how 'bout you, yeah, yeah, so how 'bout you)\n\n(Lil Wayne)\nI'll take your bitch give her back; take your bitch again\nThat's because you throw a 5 I pitch a 10\nNow she wanna get inside of my 66\nShe sees that my wrist blue and yellow like Michigan\nShe say she love her man she misses him\nBut nobody do it better than her distance dick (me)\nI'm her long distance pimp\nWhen I land my bitches wait for me on the strip (yup)\nAnd I don't lie I confess, I'm the one who turn that orange vest to a dress\nGotta dress to impress though, Gotta stay clean, plus momma in the next row\nShe with me, what you expect, I live to be fly to death\nIt's the bird man jr. sincerely yours\nWhen it rains it pours, when it Waynes it whores\n\n(Li' Wayne)\nNow why you wanna go do that\nI can see through that\nTattoo right there like can't I view that\nGirl what that say, what who that\nBet he was lame, bet he ain't Lil Wayne (no)\n'Cause I'm way more flyer\nHave you hanging round a bunch of yayo buyers (nop)\nAnd not a day go by us, we don't get higher than the telephone wires\nCut your telephone off we rising where phones don't roam they don't even come on\nYou're far from home so leave it alone\nYou creeping with the king of the throne\nYou sleeping in a tee and a thong\nWith your hair in a pony\nI ain't got no blinds we can stare at the morning (yup)\nBut I can't be there all morning\nI'm a pimp baby, yeah I'm going, going, going\n\n(Lil Wayne)\nI'm Sorry I was grooving\nGotta love that laid back Mannie Fresh music\nBut let's get back to what we was doing\nLaid back in that black on Pat Ewing's\nThat's 33 V tires heat fire\nThese streets ain't papaya ma\nYou gotta keep heat on your side\n2 must\nSo I'm a get 3 more and I'm a cop you one\nWait, naw hun 'cause you ain't exempt\nIf your ass ever trip I'll give you a clip (yeah)\nBut I love the way your jeans huggin in your hip\nAnd you walk kinda mean how you strut with a dip\nAnd you talk kinda clean and you lick your lips\nBut I can't fall for you 'cause I stick to the script (yup)\nI said I stick to my grip; I stick to my money, that's life to me\nSorry honey Jazze\n\n(Lil Wayne)\nSo how 'bout you yeah\nSo how 'bout you\nSee what I'm talking bout sweet heart you ain't even gotta have John Madden\nYou ain't gotta have Dick Vitale, you ain't gotta have Lee Carsole\nYou ain't gotta have Stuart Scott, you ain't gotta have Linda Cohn\nKnow what I'm talking bout, you ain't gotta have the staff of ESPN\nYou ain't gotta have the ABC staff just to speak sports baby 'cause I got game sweetheart\nJust fuck with the boy and I'll get you a jersey\nWhat you want me to put on the back\nDaddy's little girl that's right, know what I'm talking bout\nI can't give you the game but I can show the game\nAnd you can see what you see and peek how you peek and see what you get\nKnow what I'm talking bout\nWeezy\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "We Don't", "href": "We_Don%27t&&649", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Baby - talking)\nAy shawty, you know what I'm sayin'\nSome niggaz palms be sweatin'\nSome niggaz palms be itchy\nIt don't matter, a nigga just gotta get it\nYou know what I'm sayin', nigga\nWe built this shit from the ground up\nNigga, The Carter, nigga\nYou what I'm sayin'\nWe been around the world gettin' money nigga\nWe been to every ghetto, every neighborhood\nEvery project, nigga\nWe worldwide hustlas, nigga (Belie' that bitch)\nYou what I'm sayin'\nLet's get them niggaz, lets ride shawty\n\n(Baby)\nIndictments, got us conspiracy for murders\nFive young niggaz uptown servants\nWord, they bird curvin' for servin'\nLook, the worstest of the worst is shootin' out like they jaws curvin'\nBitch, and we was raised in these war times\nJail also made men in these hard times\nAnd don't cry I'ma get mines so pray for me\nI'm on the block on the grind, mama pray for me\nSo nigga respect my G, respect my grind\nNigga respect how I eat, respect my mind\nNigga respect this heat\nWhen these niggaz out of line, nigga we dress up and creep\nWhoa, shawty I'ma blow they whole block\nFuckin' with a soldier, mastermind is on plot\nThird ward survivor, uptown madness\nKillin' is a hobby, jackin' is a habbit, bitch\n\nWe don't give a fizzuck my nigga we young and bizzuck\nWe'll fuck a nigga's shit up if nigga is fuckin' with us\nAnd then pump 'em make 'em lift up, hit 'em up and be out\nAnd we out for cash motherfuckin' money baby\nC'mon, we don't give a fizzuck my nigga we young and bizzuck\nWe'll fuck a nigga's shit up if nigga is fuckin' with us\nAnd then pump 'em make 'em lift up, hit 'em up and be out\nAnd we out for cash motherfuckin' money baby, c'mon\n\n(Lil Wayne)\nThe murder man, picture me lurkin'\nRight up behind ya curtains nine's squirtin'\nAnd you could hear it when it's hurtin'\nBut if I hear him hurtin' I'll walk over and merk him for certain\nI took over the circus\n'Cause I'ma act a clown if you put your feet down on my surface\nI walk around, fo' pound and surface\nTo spin ya ass around in circles, you urkle\nBlood run up out ya earth now you purple\nYour homeboy get it first, but you worst so\nNow you headed to the skies above\nAnd I'm go and get high with ya bitch in the club\nYeah, life's a bitch and death's a husband\nAnd you gonna have to meet up if you keep on fuckin' up\nAnd you gonna have to meet us if you keep on fuckin' up\nBut you don't want see them CMB blood knuckle up\n\nWe don't give a fizzuck my nigga we young and bizzuck\nWe'll fuck a nigga's shit up if nigga is fuckin' with us\nAnd then pump 'em make 'em lift up, hit 'em up and be out\nAnd we out for cash motherfuckin' money baby\nC'mon, we don't give a fizzuck my nigga we young and bizzuck\nWe'll fuck a nigga's shit up if nigga is fuckin' with us\nAnd then pump 'em make 'em lift up, hit 'em up and be out\nAnd we out for cash motherfuckin' money baby, c'mon\n\n(Lil Wayne)\nShoot him in his head so he remember\nBecause of that mama I'll be gone till Novemeber\nI be back next winter in a hummer on spinners\nThem niggaz on the block say them boys gon' get 'em\nBut them niggaz on the block don't know the toys who with 'em\nTell ya boy come and get me if I go he goin' with me\nI'm hoping y'all feel me, I told y'all what the dealy\nYa open up ya face I'ma open up the semi\nI open up ya kidneys now ya floatin' up the Missi-\nSsippi, river nigga play with deep water now ya swimmin'\nSilly, you play with me, Carter, now ya missin'\nReally, I shoot ya in ya head and make you feel it\nAnd even though I be the man with the milli's\nWhen the shit go down I be the man with the milli's\nBeef cranberry on the ceilin'\nThis is the Carter, bitch welcome to my buildin' c'mon\n\nWe don't give a fizzuck my nigga we young and bizzuck\nWe'll fuck a nigga's shit up if nigga is fuckin' with us\nAnd then pump 'em make 'em lift up, hit 'em up and be out\nAnd we out for cash motherfuckin' money baby\nC'mon, we don't give a fizzuck my nigga we young and bizzuck\nWe'll fuck a nigga's shit up if nigga is fuckin' with us\nAnd then pump 'em make 'em lift up, hit 'em up and be out\nAnd we out for cash motherfuckin' money baby, c'mon\n\n(Lil Wayne - talking)\nWish a nigga would say something, gotta\nStandin right chea guns up boy\nWeezy F, Birdman\nHolla back\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Tha Block Is Hot", "href": "Tha_Block_Is_Hot&&4909", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Wha wha, wha wha, wha wha, wha wha, what\n\nStraight off the black gold, nuts in my hand, trustin' no man\nGot my glock cocked, runnin' this thing, ya understand\nWe be steamin'.. blazin'.. nines, pumps, and K's, and\nHolly Grove 17th, (what) the hood where I (what) was raised in (what)\nNiggas bustin' heads and, runnin' duckin' Feds and\nRocks under they tongues and, ki's under they beds and\nHood fulla real niggas, twenty-four seven hustlers\nEh, until we shove a barrel down your pipe suckers\nAin't no love for no busta, no fear for no coward\nNo respect from no stunt, and no money without power\nWe keepin' niggas hotter, ewww nasty and sour\nPile up in the Eddie Bauer and BLAKA at every hour\nSome niggas like that powder, foldin' up what they drain\nSome like that weed or that dope and some shoot it up in they veins (oh)\nFrom the home of that 'caine, jackin' and crackin' brains\nBroadcastin' live from tha Block it's Lil Wayne (who it is?)\n\nJuve: Nigga you got that yayo?\nB.G.: Well cook something nigga\nJuve: Nigga you let them K's go?\nB.G.: Well bust somethin' nigga\nJuve: Are you duckin' that law?\nB.G.: You better run from 'em nigga\nJuve: Are you playin' with that raw?\nB.G.: Well won't you front somethin' nigga\n(Wayne) Tha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha...\n\nSee where I'm from we keep our guns out\nDodgin' cops and burnin' blocks, so we be thugged out\nIt's time to floss, bring the big bodies on dubs out\nAnd they got quarters, halfs, and birds in that one house (I got it)\n(I got it) It's all good in the hood but a lot illegal\nSoon as you get it, hot skirt, there go them people\nBreak up the block and hit the cut by the corner sto'\nEnd up in Miss Taylor backyard, be quiet, she on the porch\nThis everyday, at the spot where niggas murder off top, boy\nIt's the spot where they got Fire Girls and Hot, Boys\n\nWe don't know what be goin' 'cause we so blunted from trees\nAnd we'll be 'round you all day till we \"400 Degreez\"\nAnd you see where niggas go, nobody be on the pulpit\nThey got a nigga got on a scarf, he flippin' out off that raw\nBetta stay in yo' car, and make sure (beep beep) your door is locked\nCause this ain't nothing proper, cause Tha Block, is just Hot\n\nJuve: Nigga you got that yayo?\nB.G.: Well cook something nigga\nJuve: Nigga you let them K's go?\nB.G.: Well bust something nigga\nJuve: Are you duckin' that law?\nB.G.: You better run from 'em nigga\nJuve: Are you playin' with that raw?\nB.G.: Well won't you front something nigga\n(Wayne) Tha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha, ha-ha\nTha block is hot, Tha block is hot ha, ha-ha\nTha block is hot, Tha block is hot ha...\n\nSee watch your step on my set, gotta walk like, talk like\nWe done shot out all the street lights\nSo you can't see who we be like\nAnd we like, to dress in all black up in my residence\nAin't got on no suits, 'cause we ain't tryin' to be presidents\nAnd ever since the coke drought, niggas been on a trip y'all\nSo you better watch what y'all playin' wit\nCause a nigga will try to flip y'all\nThey hit y'all, jam you up and put a gun to your jug\nHah, catch your breath, now shhhhh, catch a slug\nIt's street smarts, plenty niggas that keep spots\nWhen the heat starts, ain't nobody got sweethearts\nCallin' weak shots, you could come try to cheap talk\nWe cut your week short, them lil' boys don't give a damn\nGo all out for that cake, won't hesitate to kill a man\nRun in his house and kidnap the nigga, him and his fam\nTie 'em up put 'em in the vans, then put a gat in his jaws\n... Tch, one move blow his cactuses off\n\nJuve: Nigga you got that yayo?\nB.G.: Well cook something nigga\nJuve: Nigga you let them K's go?\nB.G.: Well bust somethin' nigga\nJuve: Are you duckin' that law?\nB.G.: You better run from 'em nigga\nJuve: Are you playin' with that raw?\nB.G.: Well won't you front somethin' nigga\n(Wayne) Tha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha, ha-ha\nTha block is hot, tha block is hot ha...\n\nWhoot! Some people call me 'cause tha block is hot\nShk-a-blaow! Bust ya guns 'cause tha block is hot\nNigga chshhhhh, cook it up, 'cause tha block is hot\nSay look Daddy, just hook it up, 'cause tha block is hot\nNigga whoot! Some people call me 'cause tha block is hot\nShk-a-blaow! Bust ya guns 'cause tha block is hot\nNigga chshhhhh, cook it up, 'cause tha block is hot\nSay look Daddy, just hook it up, 'cause tha block is hot\nNigga my block hot, nigga my block burn\nMy block on fire, nigga what about yours?\nNigga my block hot, nigga my block burn\nMy block on fire, nigga what about yours?\nThe block is hot ha ha ha ha\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "Mo Fire", "href": "Mo_Fire&&8577", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Mo Fi-ya Weezy, Mo Fi- ya... Mo Fi-ya, I give her, Mo Fi-ya\n\nWhy did he plot, my fifty cup, my city hot I'm dodgin the city cop\nI play em' like pitty pat (shh) I'm kickin back (yeah) I'm gettin' stacks, these bitches is really rats\nI fuck 'em and give 'em back (yeah) I really mack (yeah) how real is that, you love him, you really wack\nI hustle and bend my back\nMy muscle is in tact\nMy biceps and triceps is AYYYE YESSS\n\nMo Fi-ya Weezy, Mo Fi- ya... Mo Fi-ya, I give her, Mo Fi-ya\n\nI Come at You (shh), it's somethin' new, the color is smurf blue, I'm puffin that purple, believe it if I talk it I walk like curse you\nI get it like it is on the commercial\nThis is Verse 2, it is worse too, I'll mirk you, like I birth you\nYou niggas small bubbles, I'll burst you, and spit you out and have your girlfriend slurp you\nMy jewelry earth blue, some say its earth green, I'm like whateva my shit mean and obscene\nNow I been seen on alotta different scene, that mean I got alotta different creme\n\nMo Fi-ya Weezy, Mo Fi- ya... Mo Fi-ya, I give her, Mo Fi-ya\n\nI raise mo fire to the man up higher, I lick a shot to let him know that I'm a rider (yeah) my dreads hang to let him know that I'm a lion, represent the\nJungle when the others just tryin', I represent my mother like baby stop cryin, I know my papa gone but guarantee to see her shinin (yeah), now you are\nLookin' at New Orleans finest, now you are being blinded, by European diamond, and you were seein 2 or 3 times and, got your vision all fucked up, now you\nCan't even find me, and I ain't even hidin naw, I'm right here baby, she wanna walk witcha, I'm like yeah baby, party man with the shotty to his head\nRock-a-by his ass to sleep, rock it lay him down to bed\nI put you in my pocket, right next to the condoms homie, you ain't nothin' but a prop fish...\n\nMo Fi-ya Weezy, Mo Fi- ya... Mo Fi-ya, I give her, Mo Fi-ya\nMo Fi-ya, Mo Fi-ya Weezy... Mo Fi- ya, I giver her, ...\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Shooter", "href": "Shooter&&3532", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nYeah, yeah, yeah\nWeezy baby y'all, don't get shot\nRappin' fire, what you know about it\nI brought my homie along for the ride\nHe strapped, he came here to come out the barrel\n\n(Robin Thicke)\nI heard some shouts like \"Down on the floor\"\nThen even louder we got shooters, shooter\nI turn around, I was starin' at chrome\nShotgun watches door, got security good\nJumped right over counter\nPointed gun at, wink, he tell her\nI'm your shooter, shooter, shooter\n\nMy hands up, my hands up\nThey want me with my hands up\nOh, shooter (2x)\n\n(Lil Wayne)\nI think they want me to surrender\nBut no, I can't do it (2x)\n\nSo many doubt 'cause I come from the South\nBut when I open up my mouth, all bullets come out\nBang! Die bitch nigga die I hope you bleed a lake\nI'ma play x-ray, helpin' y'all see the fake\nI'm just tryin' to be the great, tryin' to get a piece of cake\nTake it offa your plate, eat it right in your face\nThey got a whole lot to say but I don't listen\nCall me automatic Weezy bitch I keep spittin', pow\n\n(Robin Thicke + (Lil Wayne))\nWith all these riches and, all these riches\nBut ain't no loaners around\nThey thinkin' about shooters that-shooters that\nGuns-Girls-Ladies that-Gunners that\nShoot shoot shoot shoot shooter\n\nPut my hands up\nThey want me with my hands up\nThey want me with my hands up\nOh, shooter\n\n(Lil Wayne + (Robin Thicke))\nBut I'm not\nI just cry mama, I think they, hey\nMe think they want me to surrender (Shooter)\n\nAnd to the radio stations, I'm tired o' being patient\nStop bein' rapper racists, region haters\nSpectators, dictators, behind door dick takers\nIt's outrageous, you don't know how sick you make us\nI want to throw up like chips in Vegas\nBut this is Southern face it\nIf we too simple then y'all don't get the basics\n\n(Robin Thicke)\nLady walks into a shotgun surprise\nDropped to her knees saw her life before her eyes\nHe said \"Bitch is gonna get it\", everybody gon regret it\nI'm your, shooter\n\nMy hands up, my hands up\nThey want me with my hands up\nOh, Shooter (2x)\n\n(Lil Wayne + (Robin Thicke))\nMe won't surrender, me no pretender\n\nSock soakin' wet I been runnin' y'all\nI reload, every hundred yards I'm comin' forward\nBetter know me, Lil Wayne just call me lord\nHard, take pain like Tylenols, raw\nWay past par, for, I'm some shit you never saw\nI take you to the shootout baby win lose or draw\nAnd then they ask who when where how\nAnd, my reply was simply pow!\n\nMama, I think they, hey, me think they want me to surrender\n(Shooter, my hands up, my hands up, they want me to surrender) (2x)\n\nNo, me won't surrender, no, no\nI promise no surrender\nI got my burner\nAnd I'm your shooter\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Bloodline", "href": "Bloodline&&3190", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "The streets make the hustlas\nHustlas make the world go round\nThe world is made of keys, ounces and pounds\nThe keys, ounces and pounds is made from hustlas\nSee how shit come back round for ya\nGotta cop it, chop it and cook it\nSee how shit come back round for ya\nGotta cake in the oven now watch it bubble\nAnd you can knock on my door\nBut you can't knock the hustle\nBut I- it's like a game of twenty-one and I got nineteen\nAnd my Jake but I put more'd' on me\nLil Weezy Wee gon eat that's how it is\nGot insurance on the floor man I'm that positive\nAnd I'm shaggy in the saggy lens\nMe and my squad in the paddy waggy tally Benz\nAnd you know I put the mags on that\n.45 mack with the flash on that\nWho want it\nEverybody sing along\n\nNow I'ma ride 'cause I got riding in my bloodline\nAnd I'ma shine 'cause I got shining in my bloodline\nI get that dough 'cause I got hustle in my bloodline\nI bleed concrete\n\nAnd when I move, I move out with the raw\nI move out with the squad\nThen to his album we ride we so mob\nI throw lives and loaves to live\nFor my loaf of bread the people's player\nI did what the culture said\nAnd I live by the coast of Nostre Cid\nFuck around I'll knock your shoulder from your head\nGet it right I'm a soldier till I'm dead\nThis kid in white with buttonholes inside that bled\nI'm pumping o's of lots of haze\nI'm so high and really I don't even know why\nBut oh I just go buy a whole house\nAnd lay my mat down lay her back down\nBut I never put my mack down\nYou see the thug in me\nYou know Weezy he the young son of Bubba-B\nAll my basketball shorts where the thunder B\nIf you want it then come for me\nI'm right here\n\nI'm G'd up\nOnly follow the code of the streets\nLive bad to die good\nKnow how to move when hustling by the day with no food\nBut just so I can eat\nAnd ain't it a bitch\nAnd if you see me getting fat I'm probably getting rich\nAnd you probably can come see me for some crack before six\nAnd after that it's all bricks\nMy fate and my palm is wrapped around this eight\nAnd my arm because the dirty south is straight Vietnam\nI skate with the bomb\nI'm asking you don't play with me at all\nShots hit your ass and make three of y'all\nIt'll take three of y'all to fill one of my shoeprints\n'Cause I did and I do shit that's better than new shit\nFit for two clips\nThe kid is a nuisance\nAwww man, he's inspired by his own gangsta music\nAnd the Blueprint\nCruising through the stoop with the ewe lit\nLike ooh shit this is more than weed, it's 500 Degreez\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Everything", "href": "Everything&&3490", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Talking)\nI know, I know, Weezy Wee, this dedicated to my father\nRabbit nigga, y'all excuse the expressions\n\nWhat it be like up there baby boy, ay this here ya son hollerin at ya\nI miss the shit out ya, it's hard to be without ya\nBut I know you watchin, peepin down on how I'm livin'\nAy, tell Jesus I said thanks for the blessings he sendin\nPlease ask him to forgive me for the sins I commit\nJust let him know I'm still young and at risk\nSay, I'll never forget the time that you caught me smokin' herb in the house\nI was dead wrong, I deserved to get out\nBut you just talked it over with my mom and got it situated in due time\nTold me get the paper instead of high\nSo now I take that advice and shed light over my whole life dog\nI wanted to be just like you my whole life dog\nI can't believe them niggas stole ya, that shit's pain to me\nBut don't trip, I hold you down, you still remain through me\nAnd dog I know I can't see you but I bet that you smilin'\nAnd I'm a make you even happier, I promise\n\nI know you can't be close to my nigga, I know\nBut I know you watchin over me nigga, I know\nBut the shit's steady hurtin', burn deep\nBut it's all right dog, everything gon' be all right dog\n\nI know you see my daughter growin' up and bad as ever\nBut she cool 'cause she do whatever daddy tell her\nAnd your wife, she's still the most wonderful woman\nI just built her a new house, she ain't runnin' from nothin'\nB and Slim, them niggas still love me like they own child\nMs. Rose nerves get bad, but still she gon' smile\nAnd me I'm on some \"squash it\" and some debate it\nBut I know they love it way more than they hate it\nAnd I know you probably laughin' at the way I treat these hoes and these\nBitches\nI try love 'em, my BM be trippin'\nBut Rabbit, you know one thing, I got the game from you, every perspective\nThat's why I keep the gun at close connection for protection\nAnd you see I left school behind and chose CMB\nIt was impossible on the road every week, but I know enough\nAnd I follow by everything you ever told me, think wisely\nWatch over me my nigga, just guide me\n\nI swear to you man, at some times I really wish I was with you\n'Cause I get fed up with this life and I miss you\nSomebody pass me a tissue, and let me wipe the tears from my eyes\nYeah, nigga I cried, it's 'cause I loved you dog\nI promise I won't ever put nothin' above you dog\nSo I live my life in dedication of you dog\nI know you see me happy on the outside and hurt within\nMake me wanna grab that gun and burst again\nBut I know they got a reason why I'm here\nAnd I know they got a reason why you gone\nAnd therefore, I'm succeedin on my own\nBut you ain't never left me, nigga, you still dwell in my heart\nI can't forget you kept it real from the start\nAnd until my last breath I exhale, I'm a keep you with me\nAnd when we do meet again, I'm a keep you with me\nAnd tell them niggas Pac, B.I.G. and Pun I said \"thay's my peoples\"\nWatch over me nigga till I see you\n\n(Wayne talking)\nI know I can't be close to you (dog)\nI know you watching over me dog\nBut the shit's that it hurt and burn deep\nIts all right dog, everything gon' be all right dog\nRabid, nigga, it's your son\nI'm down in your hole and your down\nYou see Cita strait, mom strait\nYour mom strait, I mean Everything going right\nMe and Slim nigga, is the realist niggas I ever met dog\nAnd plus now I'm on some Squad Shit\nMy niggas, they keep it real with me\nI keep it real with them\nMy little girl growning beutiful as ever man\nYou need to see her dog, she bad though man\nAnyway dog, aiight holla!\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Tha Mobb", "href": "Tha_Mobb&&4357", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Yeah... hard body (hard body)\nCarter carter Carter yeah\nLets go\n\nCash Money Young Money motherfuck the other side\nThey can fuck with us if they want I bring 'em homicide\nWord to my momma I'm gonna continue bombin\nTill they gettin' out the game it's like comin' out of a coma\nI'm tryin'... but I'm normal when this rap shit get borin\nAll I ask is that you pray for me (Please)\nAnd the beat keep cryin and I'mma keep beatin' her\nFee I'm fuckin' her I'm deep in her sleep in her\nAnd what happens when the reaper come (huh?)\nI'm just hopin that he sends that elevator up\nI made enough I ain't meant shit\nSo while I'm here I'mma take that and take this (nigga!)\nBreakfast yes let's eat wipe ya mouth when ya finished\nThen hunt for the lunch and dinner no beginner\nTo the criminal activity fuck with them they rushin in\nLike Seminoles Indians no bow and arrows Harold\nJust leaners Cheena just choppers Robert\nCarter II tell me how is you gon stop a riot\nI lock and seal it up the best I could feel it (yeah!)\nI'm in the lead I can pop a wheelie (got em!)\nNot for rookies late bloomers stay in the womb (GO!)\nI'm here muhfucker make room... BOOM!\nYoung Tune the big kahuna\nIt's my ocean baby y'all niggaz is tuna\nBetter now than sooner junior\nFly around ya city try and take another tune ya\nI ain't goin' nowhere special I won't never leave\nShit I'm already a legend if I ever leave\nGame get rid of me? Not little me\nMan I got 'em I'mma get 'em B (I got 'em B)\nI'm hungry like I didn't eat\nI want it like I didn't see a mill before seventeen\nWhat the fuck you niggaz tellin' me?\nYou pups can't keep up with the pedigree\nCatch me where the weather be somewhere in the seventies\nCall myself settling palm trees Promethezine but what's new?\nSometimes I can't cut through that rough loop\nGet fucked so many times till it's fuck you (fuck em!)\nSo how you wan' do it baby we can get it\nAll you gotta do is say it and I'm wit it\nMoney and murder you my nigga my jelly preserver\nI'mma ride baby till the judge give me a verdict yeah\nHear me or heard me I get it and serve it\n'Cause every time I did it I hit it and hurt it yeah\nNow I kill it the mission accomplished\nThe niggaz abolished the bitches astonished\nThen they pay homage when did they find it but\nNow that they know it's a must I remind 'em so\nThey don't forget it I underline it and\nI'm in the sky when the thunder's cryin young'n\nI been through all that I done done what you sayin'\nI put it down when the others was playin'\nWhen the jungle was open I rolled in with the riders\nStole food from the bears and bought it back to the lions\nQuote unquote with the eighth I'm a gorilla but lighter\nWit the eye of a tiger the heart of a fighter yeah\nStart 'em ignite 'em I walk through fire\nWatch the flames start multiplyin whoo! yeah\nAlter a nigga nina talk to a nigga\nTake a chunk outcha body like a shark bit a nigga\nI'm awkward like Cartwright fuck wit a nigga\nShot ugly but my arch right come on dog bark bite\nFork in the road I'm always goin' right\nNowadays knowin' life ain't no more road lights\nWe can't see but we gon make it to the finish line\nIt's right there the goal line right behind the scrimmage line\nTouchdown check the scoreboard gimme mines\nSemi 9 fit me fine hit a nigga twenty times\nDamn then one more to the face (BOW!) just\nSo they close the casket like I pay to close the case\nI'm made straight mafia shit front line\nTop rank ready to die for my shit and the obvious shit\nIf I talk about my robbery they prolly get rich\nSo fuck 'em I'mma let 'em sit\nAnd I ain't duckin 'cause I'm right here I'm just enough\nI don't care who at the top of the stairs I'm steppin up\nSee you fuckin' up the money baby that ain't good business\nYou startin to look like a witness and this is\nFor the gangstas and the bitches the hustlers and the hoes\nCrossover whatever mainstream know\n'Cause Wayne thinks silent Wayne'll never fold\nYou heard it right here if the game was ever told\nLift up ya toes and look under a rug\nTrust me there's history under all that dust\nSo deep down in the dirty there lies us (who?)\nYeah Cash Money Records and I'm still up front\nStunna pop a bottle baby peel us a blunt\nLets eat and talk about all them niggaz we cut\nWhat? You know what? Lets not fuck up our lunch\nThat's real shit if you ever seen such\nChuch\n\nTha Mobb\nNigga\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Act A Ass", "href": "Act_A_Ass&&656", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Act a ass wit it, back ya ass wit it\nAct a ass wit it, back ya ass wit it\nAct a ass wit it, back ya ass wit it\n\n(Verse 1: Lil Wayne)\n\nYou know them hoes love Weezy\nSticky, pimp small, long hair, big dick\nWeezy bring to y'all\nDon't y'all lip quit\nPut your lips on this dick\nLet me get on some livin'\nSpit all over ya chin\nWeezy be on some pimp shit\nI see 'em, peep 'em, meet 'em, beep 'em\nLater on if she ride\nG 'em, freak 'em, by the weekend she be fuckin' the squad\nI ain't got no loves for broads\nI ducks and dodge\nI grab 'em, on they butts and all\nShe fucks my dog\nSlut sucks nuts and all\nAnd nothin' small\nThis dick make 'em hit the floor and touch the wall\nCall my hoes to get salami, 'cause they brush the balls\nLet Weezy bust they jaws\nNever have no picks and chooses\n'Cause I hits and lose 'em\nAnd go to the hotel and switch for ruggy\nLike a hot, spicy, fire, project girl ta duck wit me\nI'm so gangsta pussy chick don't wanna fuck wit me\n\n(Chorus: Lil Wayne &amp; B.G.)\n\n(Lil Wayne)\nTitty bop, drop it like it's hot\nMake it fall slow\nNow walk wit me, shake a leg, catch the wall hoe\nYa gotta back ya ass wit, act a ass wit\nGotta back ya ass wit, act a ass wit\n\n(B.G.)\nA c'mon, tear it down, catch the wall\nGet naked, show me some\nTear that dick down bitch, start all over again\nAnd work your jumpin'\n\n(Both)\nYa gotta back ya ass wit it, act a ass wit it\nYa gotta bend ya ass wit it, act a ass wit it\n\n(Verse 2: B.G.)\n\nThat's right, act a fool bitch\nDo what you do hoe\nAfter I finish don't get up gotta let Weezy go\nYou get your props your pussy fire, girl you a pro\nSo when I'm speakin' I'm creepin' and come get some mo'\nYou better recognize, you better realize\nThis is the nigga Geezy, I ain't nothin' nice\nLove when you reach out grab, stuff it straight your mouth\nStart suck it till that middle come out\nRide me (ride me), put that dick inside you (inside you)\nAfter that wiggle your ass and make that juice move\nI'ma donkey (donkey), better yet a veteran (veteran)\nAt the same time I can fuck you and your best friend\nThe Number 1 Stunna, Baby you wit me\nBump in my head never let a bitch play me\nAlways get the tec nigga fuck 'em all\nWrap a chain 'round ya neck and walk it like a dog\n\n(Chorus: Lil Wayne &amp; B.G.)\n\n(Lil Wayne)\nTitty bop, drop it like it's hot\nMake it fall slow\nNow walk wit me, shake a leg, catch the wall hoe\nYa gotta back ya ass wit, act a ass wit\nGotta back ya ass wit, act a ass wit\n\n(B.G.)\nA c'mon, Tear it down, catch the wall\nGet naked, and show me somethin'\nPut that dick down bitch, start fuckin'\nAnd do your jumpin'\n\n(Both)\nYa gotta back ya ass wit it, act a ass wit it\nYa gotta back ya ass wit it, act a ass wit it\n\n(Verse 3: Lil Wayne)\n\nSee now when Lil Wayne put that dick down\nBiznites can't even walk or even sit down\nWipe your mouth off and let me hit now\nThat Rum got me feelin' real good\nThe dick hard like real wood\nI put it in slow and work it real good\nThis Lil nigga have a lot a sex\nSo do me slow, get out the Prada dress\nCome when you wanted to like private jets\nI'm on blast ma', why you take it slower than its fast time\nFlip ya back over, make that ass right\nWeezy make ya suck it then taste\nThat's how the pimp play\nMake her friend eat me in this bitch up like shrimp plates\nBounce it in and put a rollin' on A.I. fish black\nI got 2 more 'nites is you wit that\nFuck it let's go, when we pop out Lil Moe\nDrop the top part of the 'Dro\nLater on I'm touchin' the throat, bare wit it\nWhere them hot girls that like that nasty shit\nMake'em act a ass wit it, back ya ass wit it\n\n(Chorus: Lil Wayne &amp; B.G.)\n\n(Lil Wayne)\nTitty bop, drop it like it's hot\nMake it fall slow\nNow walk wit me, shake a leg, catch the wall hoe\nYa Gotta back ya ass wit, act a ass wit\nYa Gotta back ya ass wit, act a ass wit\n\n(B.G.)\nA c'mon, tear it down, catch the wall\nGet naked, show me some\nTear that dick down bitch, then start fuckin'\nAnd do your jumpin'\n\n(Both)\nYa gotta back ya ass wit it, act a ass wit it\nYa gotta back ya ass wit it, act a ass wit it\n\n(*Repeat till end*)\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Cash Money Millionaires", "href": "Cash_Money_Millionaires&&2543", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nKeep pimpin' (5x)\n\nI got a bitch in the back, got a hoe in the front\nOne cookin the crack, one rollin' the blunt\nYou get pussy and ass from a beautiful broad\nIf you lookin' for that, holla at ya boy\nI'm a m-m-mack mack\nA p-p-pimp\nI sp-sp-sp-spit out shrimp\nI pull up clean\nI get out limp\nI walk like li-li-li-limp\nI talk like bitch b-bitch get here\nBest player on my team when I ball women cheer\nAnd they love the way I dumb out with the gear\nThis jacket, these shoes don't come out this year\nSo if you love your girl don't let her come out this year\nIf you leave her out there, then she comin' out here\nAnd that ain't fair, but I don't care\nI'm a motherfuckin' Cash Money Millionaire, yeah\n\nWho you think you fuckin' wit' (Bitch)\nWho you think you fuckin' wit'\nWho you think you fuckin' wit'\nWho you think you fuckin' wit' (Bitch)\nI'm a motherfuckin' Cash Money Millionaire, yeah\n(I'm serious 'bout this pimpin' shit)\n\nI got 25 dollars on my dresser and if I give it to my hoe\nShe gon' bring back more, not a minute go she ain't gettin' that loot\nAnd if you ain't got no money she ain't gettin' at you\nI like 'em sexy, high, yellow if you fittin' that's you\nOoh boo you can come and get in that Coupe\nTake a hit of that fruit get high wit' Wayne\nFly wit Birdman Jr. wave hi to planes\nSay bye to lames don't buy they game\nIf he don't score in the first half, bench his ass\nIf you play wit my money I'ma lynch ya ass\nI John Lynch ya shit don't tempt me bitch, OH!\nWipe me down 'cause I'm filthy rich\nIf gettin' money's a crime then I'm guilty bitch\nAnd that ain't fair, but I don't care\nI'm a motherfuckin' Cash Money Millionaire, yeah\n\nWho you think you fuckin' wit' (Bitch)\nWho you think you fuckin' wit'\nWho you think you fuckin' wit'\nWho you think you fuckin' wit' (Bitch)\nI'm a motherfuckin' Cash Money Millionaire, yeah\n(I'm serious 'bout this pimpin' shit)\n\n\nI sit' low in the car sit high in the truck\nLay at the front of the plane lay in the back of the bus\nI got ladies for days, got women for months\nLeave ya girl at home on May 21\nI got that thang on chrome blade 21\nGot them thangs inside, make me empty one\nPull it over to the side by a pretty one\nLike 'what's good mami come make a cloud your pillow, come fly wit' me'\nMy diamonds sing, my weed is rap\nCall me Weezy the king or call me Weezy the crack\nIf pimpin' is dead then I'm bringin' it back\nMatter of fact it never died so I take that back\nIf your shoes too small shorty take that back\n'Cause you gon' walk all day till you make that back\nAnd that ain't fair, but I don't care I'm a motherfuckin' Cash Money Millionaire, yeah\n\n\n(Chorus 4x (with Ad-Libs during the last 2 repititions))\nWho you think you fuckin' wit' (Bitch)\nWho you think you fuckin' wit'\nWho you think you fuckin' wit'\nWho you think you fuckin' wit' (Bitch)\nI'm a motherfuckin' Cash Money Millionaire, yeah\n(I'm serious 'bout this pimpin' shit)\n\nWhat's really good mami? It's ya boy W-e-e-z-y F. Baby so high in the sky I'm so fly watch out for\nThe power lines ya know get wit me one pimp daddy\n\nI'm a motherfuckin' Cash Money Millionaire, yeah\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Fly In", "href": "Fly_In&&6914", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne talking)\nSo they ask me young boy what you gonna do the second time around\nHow you gon come back I tried to told them\nI come back like 32 I jump back like 33 (ugh)\nHit me it's nothin' this is Tha Carter II people\nThis is Tha Carter II people (hey)\n\nThey call me Mr. Carter I kissed the daughter\nOf the deads forehead I killed the father\nSpilled the heart of a mildew hater\nI will put them body on chill like gla-ciers\nGracias I'm crazy yes it's obvious\nGoing against me is atheist\nI got my angels on my shoulders and a quarter of that angel dust\nI ain't sniffin I'm just pitchin ya honor I ain't snitchin ya honor\nHate bitch niggaz bitches with power\nVacate when the kitchen get hotter\nI just sit on the counter open the cabinet close the cupboard\nPut that jar in the skillet drop a 4 in the bubbles\nI remember being young tryin' to hustle my dough\nTryin' to tell the old junkies that my crack ain't soap\nTryin' to tell you fool you chump that my mack ain't broke\nYou ain't tryin' to see how far that black backlane go\nNo call me pacman you ghosts is blue\nI got my red river rubies and my oceans blue\nJewlery usually I'ma hooligan for the money\nYeah I'm eatin but I got a tapeworm in my tummy oh\nMake harm in the bomb you in public\nHit you with the straight arm no warning nothin'\nLook it's mornin no yawnin or nothin'\nI ain't sleep and I'm up tryin' to take a nigga lunch\nYou gon make a nigga break a nigga fronts\nThen shake a nigga shorts and we takin' what we want\nI'm so 5-0-4 you got to kill me here\nIf you ever lookin' for me bitch I will be here\nCash Money is an army envy seal me here\nLot of niggaz ran from it but I'll still be here\nNo chrome on the continental I'm so fundamental\nCrack the phill' crack the roof and roll up the window\nAnd my hood love me they tell me bring it home\nThat's why I holla Hollygrove on each and every song\nYou leapin at a dog a dog wit no bark\nJust a bite like an old shark\nAnd all you rich niggas know Pa\nI'm talkin' bout stunna\nHe like keep ya door he got ya whole winters\nSunshines on the king and sets on the prince\nI met the birdman and I been shinin ever since like that (echo)\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Come On", "href": "Come_On&&8467", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Where my niggas at, it's play it raw time, baby\nLoad up the guns guerilla war time, baby\nLight up the blunts, light up the block time, dawg\nChoppers with drums, ozzee's, and glock time, dawg\nWhoever he with, they better stay 'cause they to nice\nAnd whoever and hit, jump out the window and get it right\nThen we run in his house and hit the body and haul them out\nThen we empty the clip and let the Lord sort 'em out\nBust it really, it ain't no stopping me 'cause I hang up to that ville\nAnd now I'm tying on my bandanna and I'm cocking back\nJump out the Hummer and say lil' shorty wear your stocking cap\nDawg we got automatics, two shooters, six shots, and 50 round drums\nHit your daddy, you Suki, you son, your wife and move your momma\n'Cause I'm off the wall, off the hook, off the chain\nGot a sawd oil tec and I'm bout to knock off your brain\nTell 'em\n\nCome on, nigga Come on, time to do it nigga\nNigga come on, nigga come on Wodie!\nCome on, nigga come on, time to do it nigga\nNigga come on, nigga come on Wodie!\n\n(Verse 2: (B.G.))\nIf drama come to me then it come\nFor that I got two glocks and a k with a drum\nThat's what I ride with not what I got got ducked off\nThe mac, sweeper, the six shot, pump that sawd off\nI got the tillery when beef kick\nI got soldiers ready to march when that beef start\nI got niggaz be in that zone on that herion\nI got niggaz ready to kill when shit get real\nI got niggaz that play all out akirts of the field\nSo get caught up in that place and your brain get spilled\nOh it's a game but it's a game of life or death\nYou lose and can't continue if you get dome checked\nYou get blues it's all what duck gonna be next\nCome in that water and get wet\nThink you can fuck with me, you thoughts will get upset\nI don't shot to hit I shot to kill\nBelieve me I don't shoot for fun when I shoot it's for real\nCome on nigga!\n\nCome on, nigga come on, time to do it nigga\nNigga come on, nigga come on Wodie!\nCome on, nigga come on, time to do it nigga\nNigga come on, nigga come on Wodie!\n\nGive me the guns, I'm ready to bust one nigga\nMy nuts hung nigga, since I was young nigga\nI get dumb nigga, with the M-1 nigga\nI sip some nigga, and I flip some nigga\nA uptown stunter, what the hell you think\nReady for war, BUT I AIN\"T NO CAPTAIN OF NO GOT DAMN TANK!\nAnd you can take that to vegillity boy\nI'm burning up, I'm on fire is you smelling boy\n'Cause I be coming with the top down\nLetting them know how the chop sound\n100 rounds tore the whole entire block down\nAssault rifle with a drum and beam totter\n38 with a speed loader in my holster\nMac ozze achine with a strap around my shoulder\nBut if I pop my trunk I'm might just set off a damn explosure\nI'm off the wall, off the hook, off the chain\nGot a sawd oil tec and I'm bout to knock off your brain\nTell 'em\n\nYou ain't gotta hollar wodie, here I come nigga! (x2)\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "Receipt", "href": "Receipt&&152", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "It's kinda hard sayin' this shit to ya face\nSo I do it over snares and bass\nMusic take me away\n\n(Verse One)\nYoung boy, I know you love me like you never loved\nYou know you couldn't find a better thug\nAnd uh, you been peepin me since I was younger\nSo young that you even called me your little brother\nBut I'm all grown up now I got my own money\nI'm married and divorced and my daughter is a woman\nAnd guess what? my daughter want another\nSister or a brother and you lookin' like a mother\nI took you from a clubber to a lover\nAnd you took another bitch husband\nThe other bitch wasn't doin' shit for him\nShe say she did too much, I say she did nothin'\nShe need to quit frontin\nI havent hid nothin' and you love everything\nCan't hide ya feelings, can't let my pride conceal it\nYou got Wayne, I charge it to the game\nAnd baby you can keep the change, but...\n\n(Chorus: Lil Wayne)\nI gotta hold on, hold on to my receipt\nTo redeem your love, that's exactly what I need\n(It's kinda hard sayin' this shit to ya face\nSo I do it over snares and bass\nMusic take me away) - (2X)\n\n(Verse Two)\nDestiny Child CD, song number three\nShe cater to me till we fall asleep\nThen we wake up and we pick up where we started\nThen she make a nigga breakfast sprite, orange juice, and water\nAnd she on stage waitin for me after my show\nSo no time for groupies, straight to the top flo'\nFresh out the shower, a smile and a towel\nThen after an hour, she gon need another shower\nI'm at home or in the coupe or in the office\nOr the streets or in the booth, thinkin' 'bout you\nAnd, most of the girls that come by are cute\nAnd they try to holla but they all on mute\nAnd, my old girls turn they face up at me\nAnd, they thrown they purses and they make up at me\n'Cause you got Wayne, I charge it to the game\nAnd baby you can keep the change but...\n\nCome home smellin food on the stove\nShe done cleaned the whole house\nWashed the dishes and the clothes\nAnd we out we do it just how we supposed\nLook good for the public leave the drama in the Rolls\nRoyce, choice of car dat we move\nAnd she gets high sometimes 'cause I'm always doin' it\nYou hear them hallways we always doin' it\nWork cut, always feel like the first one\nPerfect, when a nigga stressed off dat work shit\nTake away all the pain, make it lesser than dirt\nThat's why you got Wayne, I charge it to the game\nAnd baby you can keep the change but...\n\nIt's kinda hard sayin' this shit to ya face\nSo I do it over snares and bass\nMusic take her away\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Break Me Off", "href": "Break_Me_Off&&2214", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne talking)\nWe have them bitches like it was unplugged\nIts Weezy Wee, Mannie Fresh, and Unplugged\nWe have them bitches like it was unplugged\nWeezy, Fresh, and Unplugged\n\n(Lil Wayne)\nGive me a big fine bitch in a dress\nOne put them lips in effect\nSuck the dick till the shit in her chest\nYou can piss on her brest\nI like that shit\nProject hoes like that dick, Don't bite that dick\nGive me a Spanish sweet hoe\nBlack from Puerto Rico\nFreak ho, Specialize in givin' me deep throat\nReally don't care how short how plump, short or thick\nGive me head, Don't care, Swallow cum don't spit\nAww shit, I like them Jamicians and them Hatians\nNiggas can't take it when they shake an make me rape 'em\nWhite girl's I video tape 'em and they enjoy it\nThey love it when everybody saw it\nIts off tha chain\nHigh yellow Mexican bitches they all for brain\nBut watch them hoes who want the change\nIt's not a game\nOr short cuban hoe, With a fat ass though\nAn I'll keep the bitch just like Fidel Castro\n\n(UnPlugged)\nTell me what you like\nLet me tell you what I like\nYou goin' on an breakin' me off by the end of the night\nYou can ride with me\n'Cause I like ya Simmon's jeans\nAin't tryin' to make a love scene\nTruly I just want you to break me off\n\n(Lil Wanye)\nWeezy the hottest\nDrinkin' Barcadi\nI stream through the scene on a Lincon on Robbers\nLookin' for the finest dime, To wine and dine\nLater on I'm tryin' to climb behind ya spine\nHold up lil mama, Slow ya ass down\nPick it up, Throw ya ass down\nNow throw ya ass around\nAn scream me name\nI can't hear you say it louder what (Wayne, Wayne)\nA damn shame\nBetter watch that boy he nasty\nI strap on a plastic\nBreak ya off like elastic\nPut the dick in the middle, Make it wiggle for y'all\nMight be small, But that dick ain't little at all\nI like a short thick broad, Fat ass an shit\nLike Taso flip like Trina The Baddest Bitch\nMatter of fact when I see her, Pull her Over like a cop\nJuve coulda Backed It Up an I woulda Dropped It Like Its Hot\nHa Ha, Ya heard me\nHa Ha, Unplugged\n\n(Mannie Fresh)\nI like them big, round, yellow and brown\nA bitch that take it from the back and make the (Ugh Ugh) sound\nNow you can bounce, slide, drop, giddy up, giddy up\nNow you can ride till you feel it hit a nut, hit a nut\nBounce for ya hood, Shake for ya baby daddy\nTwerk for that nigga who got you pregnant in the Caddy\nSlide with the KY, Hold up ???\nMy bitch got thong, You bitch got drawls\nMy chick like to swallow, Yo chick like to spit\nIf yo chick was my chick I'd still love that bitch\nHold up, Chill out, Wait a minute stop\nMy Ginseng, Viagra, and a Strawberry pop\nSee I'm feelin' kinda bold, Why don't ya bring a friend\nFrom vigina to the asshole do it again\nI want a yucky down misses bout whatever\nYo mama loved a Tymer, Now you welcome\nYou ok Lil mama and I love that chick\nBut deep down inside I just love me dick\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Get Over", "href": "Get_Over&&2771", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Yeah, real rap, real rap fo ya\nLighters up, let's get 'em\n\n(Chorus - Nikki (Lil Wayne))\nThooouugh, though I'm missin' you (straight to the head man)\nI'll find a way to get through\nI know livin' without ya is impossible (yeah)\nGooonnee... I know you gon live on (cry momma, ya momma)\n'Cause you were my brotha and I love ya, and I miss ya\n\nStay strong, be tough, that's what the preacher tell ya\nHe never really felt ya, so he can't even help ya\nNeed a shoulder to lean on, somebody to cry to\nIt's like everything's gone, but I'm a survivor\nStandin on stage in front of thousands\nDon't amount to me not havin' my father\nThat's real talk, I know a lot of y'all got 'em\nBut you need 'em way more when you gotta go without 'em\nAnd I'm without 'em, but that's life y'all\nSometimes you gotta learn to swim with no lifeguard\nI'm all right God, shit I'm still breathin\nBut lose hurt like bullets, I'm about to start bleedin\nThrow me down some comfort, cause my heart need it\nTryin' to cope wit my chances and meet 'em\nThere's a dark road ahead, but I'm tryin' to take it easy\nRest in peace Lil Beezy, my nigga\n\n(Chorus (Lil Wayne simultaneously in the background) x2)\nThooouugh, though I'm missin' you\nI'll find a way to get through\nI know livin' without ya is impossible\nGooonnee... I know you gon live on\n'Cause you were my brotha and I love ya, and I miss ya\n(I miss my dawg I can't believe that it's over\nBut I'm a soldier, so I gotta over, can't stay sober, I'm just tryin' to get over)\n\nSmoke cush all day and pop painkillers\nFuck who don't understand it, this what the game did us\nThis what the streets showed us\nThis how the block made us, the same block where they laid 'em\nI pray every time I cross the spot on the pavement, save me\nLord will I be next for the taking? Take me\nI know I'm livin' like I know when I'm comin'\nBut I'm just livin' 'cause I know that it's comin'\nAnd the end is comin', but I ain't runnin'\nI and hidin and duckin, I'm in the middle of a war, I'm alive and love it\nI'm just speakin' from the heart of the dyin' public\nWe still beatin', we gon rise above it\nThough it seem like they cheatin' and we loosin\nWe survive if nothin', they could never take the stride from strugglin\nI gotta ride\nAnd sometimes that ride get bloody\nBut I just think about my buddy and go after that money, but uh...\n\n(Bridge - Nikki (Lil Wayne simultaneously in the background))\nOh, we gotta get over, we gotta get over, gotta get over\nIt's almost over, and we gon be all right\n(I gotta get over, I gotta get over, cause bitch I'm a soldier)\n\nStraight Patrone out the bottle to the head now\nWe gettin' read now, bitch my nigga dead now\nAnd all the things I never said, I gotta say it now\nI shoulda said it then, now I gotta talk to clouds\nNow I gotta walk around, brim down\nJust tryin' to find my way to the next day, escape\nYa birthday could be ya death date\nSo I'm livin' like it was just yesterday, let's pray\nTen fingers together, can't bring 'em together\nIt's murda murda, I don't think it get better\nSo be a competitor or get out the weather\nMe? I got a umbrella and a berretta\nI'm just tryin' to make sure my daughter future progressin\nAnd behind that, I'm shootin excessive, trust me\nThe beautiful dead, we livin' wit the ugly\nI just tell my pops wait for me, I'm comin'\n\n(Chorus (Lil Wayne simultaneously in the background) x2)\nThooouugh, though I'm missin' you\nI'll find a way to get through\nI know livin' without ya is impossible\nGooonnee... I know you gon live on\n'Cause you were my brotha and I love ya, and I miss ya\n(I miss my dawg I can't believe that it's over\nBut I'm a soldier, so I gotta over, can't stay sober, I'm just tryin' to get over)\n\n(I miss my dawg I can't believe that it's over\nBut I'm a soldier, so I gotta over\nCan't stay sober, I'm just tryin' to get over) (in background over and over while talking)\n\nThey ask me why I wear shades at nighttime... 'cause I don't wanna see nothin'! Yeah...\nLike I said, life ain't nuttin but a long extended road, keep drivin'\nI done passed up plenty people up on the side of road, no help, keep goin'\nYeah... Lost a lot of passengers on the ride, kept goin'... yep...\nWho knows when I'll run outta gas. Yeah...\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Tha Heat", "href": "Tha_Heat&&5654", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne talking)\nFuck with me, you know what it is\n\nI shoot your arm, leg, leg, arm, head\nThe heater burner bruisa is on my hip this year\nI shoot your arm, leg, leg, arm, head\nI wish a motherfucker would trip this year\n\n(Verse One)\nDressed in all black and my gun the same color\nMurder my enemy love thy brotha\nAnd I ain't never gave a shit about a motherfucker\nHit him up and watch the guts come up out a younga stomach\nYou niggaz better take side with young money, Cash Money\nYou'll get left in your ride crash dummy\nI'll be around when the times get ugly\nWhen the wheels fall off and the tires stop running\nThe magazine empty and the nine stop busting\nI bang my fist till my palms get bloody\n'Cause I'm a monsta man\nI'm gonna find you in my AP nine on jam\nI'm a rider you can't take it out of me man\nI be wilding, you can wait by my house for me fam\nI will fire and drop a hater rite where he stands\nI'm gonna die with this blazer rite in these hands\n\nI shoot your arm, leg, leg, arm, head\nThe heater burner bruisa is on my hip this year\nI shoot your arm, leg, leg, arm, head\nI wish a motherfucker would trip this year\n\nTwenty-two's, thirty-eight's, forty-four's, forty-five's\nTucked in my thirty-eight, mack on my back I am\nSo ready for whateva that awaits me\nRun up in your place wile you're sleepin' await the\nCalicoes, ak's, Uzi-machines\nGot ya misplacin your arms and losin your knees\nI am takin' names, so who wanna leave\nOut this bitch with your brains and your dew on your sleeve?\nI got the hood with the names of the crew on they t's\nAnd I might make a funeral sweep, I ain't bullshitin\nAR hit ya truck got ya hood flippin\nFeet by the engine, head by the transmission\nAnd I be right where I am mista\nMe and my damn pistol\nMe and my girlfriend\nIn this world alone, so bring it on\nAnd umma have to sing you this song nigga\n\nI shoot your arm, leg, leg, arm, head\nThe heater burner bruisa is on my hip this year\nI shoot your arm, leg, leg, arm, head\nI wish a motherfucker would trip this year\n\nI got the scope on the tool I can see what you do\nWith a little red dot nigga peek-a-boo\nShhh the silence will speak to you\nHit you from across the street wile you tying ya shoe\nLike Bang! Bang! say breathe nigga breath I stand ova the body with the boy in his tee\nSay Bang! Bang! say breathe deep breath I stand ova the body with the boy in his chest... Clear!\nNow the boy is a mess and the block in fear 'cause ya boy up and left\nLife is short enjoy what eva's left\nBefore you run into a nigga like me and meet death\nIn less than three seconds I'll pull a three-eighty\nThree feet from my waist\nThree inches from your faces\nMake no mistake Weezy neva hesitate\nI'll pop till your shit separate like eewww!\n\nI shoot your arm, leg, leg, arm, head\nThe heater burner bruisa is on my hip this year\nI shoot your arm, leg, leg, arm, head\nI wish a motherfucker would trip this year\n\nNigga up, down, front,\nBack, side, side hit a\nNigga like that he's\nGonna die\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Grown Man", "href": "Grown_Man&&9277", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Dawg you gotta feel me on this one\nWhat it be like dawg, I'm on some some adope grown up type shit\nLook who I be around nigga, look who I been around nigga\nGeezy, Juve and Turk, B and Slim dawg pay attention dawg\n\nAge is nothin' but some digits nigga trust me on this\nCas I think I speak for every one when I say life is a bitch\nI ride D L in the C L Gun right in my grip\nI slip a clip in every whip, cas hatas likely to trip\nCome home to my future wife and every night she'll flip\nShe end up catchin bites to her lips behind diapers and shit\nBut I light me a spliff drink henney without ice when I'm pissed\nGo to the club and start a fight thinkin' I'm Tyson and shit\nBut I'm a man so I'm here to handle my situtions correctly\nAnd I know I might be young but niggas gone definitely respect me\nBut in the mean time I'm fightin gun charges in court\nAnd in a couple of weeks our next tour about to start\nIt's like I'm never happy now\nExcept for the fact my daughter sayin' I love you daddy now\nAnd that kinda juice me up and I smoke about 3 blunts\nAnd puff a Kool it boost me up\nAnd say a prayer for everyday\nJust so I get through the stuff but I be like\n\nAh man, it's complicated doin' everythang on your own man\nBeing responsible for everybody in ya home man\nAnd when you feel like everythang is goin' wrong man\nI'm gone stand 'cause I am a GROWN MAN\n\nI try to keep my head up, but I die to keep my bread up\nAnd usually I'm fed up thinkin' everythang's a set up\nBut I get up this shit, stick out my chest and clutch on my nuts\nAnd I get hit up with all kinda stress\nAnd put up wit the stuff trust me it's tough\nBut I mantain to climb through it all\nAnd I still manage to be Lil Wayne therefore I shine and I ball\nAnd dawg I live for today and hope and pray that there's a tomorrow\nAnd I borrow confidence from out my heart when thangs get awfall\nAnd I'm walkin' on the edge stuck without a solution\nAnd someway I still pick it out and shuffle to conclusion\nAnd I don't need nobody else so keep yo advice and jus doubt me\nCas y'all cats don't really no me y'all jus no 'bout me\nSo if my dawgs be on my side they keep me covered with spirit\nAnd plus I know my fathers watchin and my mother's the dearest\nAnd I ain't neva said they don't appreciate what I do\nBut jus know if I wasn't a man I wouldn't make it through\n\nWho would have known that this was somthin that didn't turn out so hectic\nBut I chose my own life so I gradually accept it\nI'm influenced and effected by the way it became\nAnd I don't play with them at all so I don't say it's a game\nAnd even though I grew up hard and I have gracefully change\nI'm always street so I'll forever be facin a change\nAnd I'll keep this thang brutained on the waist of my pants\nAnd I demand respect from all if not then I'm waisten a man\nAnd if I want it then I get and if I need it I have it\nTake care of them family first 'cause the liquir and weed is a habit\nAnd I'm so often I'm congratulated for the succeeding at last\nBut when they turn they back I just have Jesus leadin my path\nAnd I didn't ask for you to like me I don't care if you hate me\nBut don't mistake me no otha man can neva make me or break me\nAnd I'm faithfully inspired by the hood tell I'm gone\nAnd dawg I do believe I'm grown\nSo I'll be good on my own but I be like\n\n(Chorus) fading... Believe Dat\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "High Beamin'", "href": "High_Beamin%27&&3921", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(BG)\nNiggas be hatin'\n'Cause BG got it\nEvery top of the line car they got\nLook I ride it\n&gt;From the Hummer to the Rover\nTo the drop jag\nB and C lex truck\nNothin' my click ain't had\nEverybody head was fucked\nWhen they heard 'bout the deal\nCash Money hot boys climbed for 30-mill\nAlready was straight now we livin' larger\nAlready was ballin' now we ballin' harder\n??? Bitches can't take me\nCause my wrist stay flossed out\nNiggas hate me cause all day I'm flossed out\nGhetto made me\nMy dog, Baby, saved me\nNiggas find out they hoe got fucked, ??\nThat's how it go\nIt ain't my fault I got mega cheese\nWalk that walk\nTalk that talk I'm BG\nPaperchaser to the fullest get my grind on\nGotta do it 'cause I made that song Get Yo' Shine On\n\nMe and my click be sizzlin' hot steamin'\nBouncin' through diamonds high beamin'\n\n(Wayne)\nWha\nI'ma flosser baby, baller baby\nA fifteen year old shot caller baby\nAnd I'm racin' through\nIn the all black chrome\nA Mercedes Coupe\nGot yo' wife at my house\nAnd she naked too\nAnd all my niggas all around\nSayin' 'Shake it Boo, go ahead to what you do'\nIt's Weezy dog and off the heezy dog\nAnd I'm surrounded by the ice\nIt got me freezin' dog\nAnd it's plain and simple\nWon't change 'cause it's natural\nLil Wayne a pimp y'all\nGot the game from Beatris\nI'm trying to see six numbers\nPull up at the Grammy awards in six Hummers\nLeave the Grammy awards with six womens\nAnd make a stop at the gas station for six rubbers\nPut it together\nThis is the life when you get full of the cheddar\nDon't try to end it or you wouldn't get better, what\n\n(Wayne)\nLa, la, la, la\nHere I come star rapper\nI get the fast money\nShort, cute hot boy that rapper Cash Money\nStandin' out the roof of my car\nAnd flash hundreds\nTake your girl to the mall\nSpend a G like that's nothin'\nShe lay on the floor\nOpen up the spot\nTake off her draws\nLet me see the cunt\nDon't stop Lil' Weezy\nWe's ain't nothin' nice\nBut gats in my Jesus Christ\nNothing but ice\nWhen they see me at night\nBehind ?? I stay high\nSnatch yo' wife\nRun up in her with the K-Y\nBut it's on man\nEver since I was born Wayne\nNigga get out of line\nI get dirty like John Wayne\nI'm bout stuntin', flossin'\nWhatever come with it\nAnd I don't shoot guns\nUnless they have a drum wit it\nAt first they wasn't wit it\nThought that I was jokin'\nNow I got 'em all payin' attention like they owe it\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "Remember Me", "href": "Remember_Me&&1470", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Say, Weezy\n(Weezy)\nCan they remember me?\nLil' Weezy\n\nMake 'em remember, ya, nigga\n(Ha)\nLet these niggas know your background, nigga\n(Look, look)\nLet 'em know your background\n(Look, look)\nLet 'em know how you've been for a while\n\nAll I was taught was murder murder\nKill drama and nothin' less\nI strap tha Smith-Wess and bust it in they chest\n\nI had ta hustle, hustle, hustle, hustle\nHad ta struggle for success\nHid grams in girls' breasts\nStick bricks under they dress\n\nThem niggas there with me fooli'\nMe, I'm full of that dilly\nHope when I catch them slippin'\nHim and they daddy's trippin'\n\nShorty can hold it down\nShorty be totin' rounds\nSmellin' like a pound on school grounds\n\nShorty, wow, hair all over my head\nBandana 'round my brain, eyes bloodshot red\nBriches down to my legs, guns up in my trench\nWhen niggaz playin', they get drenched\n\nMy pockets is full of lead\nSo, nigga, stay off the Benz, I'm young with bad nerves\nSince I lost my father, I've been troubled hurt and disturbed\nSo I'on't even hesitate to leave 'em on tha curb\nAnd wet dem niggaz shirt, nigga, get 'em full of birds\nTell them niggaz, Geezy\n\nRemember he? Tha little G, never die\nTook one to tha chest but Weeze Wee never die\nRemember he? Tha little G, never die\nHave B.Geezy on his side, so Weezy Wee never die\n\nLil' Weezy Wee had ta steal, hustle and jack\nWeezy Wee roll with K's, glocks and MAC's\nTha little G, he was raised keepin' it real\nThat's my lil' nigga, I taught him to get it how he live, nigga\n\nLook, look, that time I forgot tha bills\nAin't been home in two weeks\nMacita lookin' for me\nTha word all over tha streets\n\nWell, shit, I love my momma\nBut all I got ta offer is drama\nAnd many problems, I lay back in tha cut\n\nThese niggas out and I rob 'em\nThey ain't spin around here\nWe all alone on my block\nLike nobody live 'round here\n\nTha lights got cut off at my house\nAnd now I'm lookin' for a window\nI can't see it, I'ma drop my pile on tha floor\nThey got some niggas stuntin' in Benz\n\nHey man, them boys ain't riders\nHand it over, partna, my feet done got tired\n(Break it off)\nWell, picture this, I gotta corner this ole nigga address\nHe said he got that work\nAnd needed me ta meet I'm there\n(Meet him there)\n\nNigga, take your Roly down\nWith somethin' shady, daddy\n(What?)\nWithin a week he changed his mind\nAnd received tha package\n(What?)\n\nOh well, back to tha drawin' board\n(Board)\nCowards start hollerin'\n'Cause they know I'm comin' for it\n\nRemember he? Tha little G, never die\nTook one to tha chest but Weeze Wee never die\nRemember he? Tha little G, never die\nHave B.Geezy on his side, so Weezy Wee never die\n\nLil' Weezy Wee had ta steal, hustle and jack\nWeezy Wee roll with K's, glocks and MAC's\nTha little G, he was raised keepin' it real\nThat's my lil' nigga, I taught him to get it how he live, nigga\n\nLemme tell 'em, you remember\nThat there nigga use ta be thuggin' it out\nBlunt in his mouth, would stay passed up in a drought\nRun in your house, \"Lay down, nobody move\nTell that slut go get your stash and empty your pockets, fool\"\n\nThat's how it was crime, struggle, drivin' for scrubs\nLots of thugs make niggas come ta answer them up\nSome niggas choose ta come back to me, ride around my set for me\nMy lights off that thing 'cause I got that SKS with me\n\nOkay\n(Okay)\nListen, all you ballin' niggas betta relocate\n(Locate)\n'Cause, see, y'all got it\nI gotta make my cheese rotate\n(Rotate)\n\nRight now I'm doin' bad\nSo just give me with whatever you have\nMy stomach hurt, I need a bag\nI'm street-livin' week for week\n\nNo, sleep livin', look outside ya window\nIn tha mornin', your jeep missin'\nMy heat sizzlin', I'm ready ta sweep these niggas\nGeezy make 'em remember Weezy, nigga\n\nRemember he? Tha little G, never die\nTook one to tha chest but Weeze Wee never die\nRemember he? Tha little G, never die\nHave B.Geezy on his side, so Weezy Wee never die\n\nLil' Weezy Wee had ta steal, hustle and jack\nWeezy Wee roll with K's, glocks and MAC's\nTha little G, he was raised keepin' it real\nThat's my lil' nigga, I taught him to get it how he live, nigga\n\nRemember he? Tha little G, never die\nTook one to tha chest but Weeze Wee never die\nRemember he? Tha little G, never die\nHave B.Geezy on his side, so Weezy Wee never die\n\nLil' Weezy Wee had ta steal, hustle and jack\nWeezy Wee roll with K's, glocks and MAC's\nTha little G, he was raised keepin' it real\nThat's my lil' nigga, I taught him to get it how he live, nigga\n\nLook, remember that?\nWuz up\n(Are you rememberin', B.Geezy?)\nI remember you, nigga\nWe go way back ta true story, nigga, ya heard me\n(Now)\n\nLook, you don't remember me?\nI remember ya, nigga\nI was, I was a bad dog, highly\n(You were doggin', you were a lil' dog)\nGrove 17, off top, nigga\n(Uh, huh)\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "Carter II", "href": "Carter_II&&3481", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "So you made it this far, Heh\nWe upstairs, I let you up here\nYou special, Marley, don't shoot\nYou know what this is?\nStill The Carter 2 people (x2)\nYeah, you still in the carter 2 people\nHey yeah\n\n(Lil Wayne)\nAll I have in this world is a pistol and a promise\nA fist full of dollars, a list full of problems\nI'll address them like P.O. Boxes\nYeah I'm from New Orleans, the Creole cockpit\nWe so out of it, zero tolerance\nGangsta gumbo, I'll serve 'em a pot of it\nI'm wealthy, still fuckin' wit that block shit\nWet your ass up, head to feet till your sock a drip\nDon't strip, you might fall and bust your ass\nNo snakes at the carter, tell the gardener to cut the grass\nI hear 'em but they talking under mass\nStop throwing pebbles at a bulletproof glass\nThat's Cash Money, honey pie\nWe ain't runnin', we don't hide sayin' fuck the other side\nDon't get caught on it, this the dailiest grind\nI'll put your heart on it and walk on it\nThe chalks only for the art homie\nHow they trace ya after I erase ya\nLook around, we at war and you still in preparation\nI'm riding for them reperations, No patience\nSlow paper is better than no paper\nFast money don't last too long, you gotta pace it\nYou gotta know that paper\nIf you got it from a caper, you gotta blow that paper\nGotta know that photo fobia, no kodak moments\nFeds walls with my pictures on 'em\nNah, I ain't even in the school yearbook\nI don't do too much posin, got a cool killer look\nCareer crook, get your career took\nI'm back like a brizeer hook\nBitch cheer, camoflauge gear, the hunter's here\nBetter play it by ear, you ain't nothing but a deer\nAround here and this here is The Carter\nServe it while it's hot out the pot to your mama\nAnd Slim tell me ain't nobody hotter\nBut get your boys some different sauce, I want the whole enchilada\nI got 'em by the collar, watch me drop 'em\nOn the head at the bottom\nYou ain't gotta shoot 'em 'cause I already shot 'em\nAnd I ain't gotta get 'em 'cause I already got 'em\nGet 'em\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Walk Out", "href": "Walk_Out&&8141", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "And in here is where the heroine boil\nAnd I also got a large pot of cigarette oil, that\nEmbalmming fluid illiterate are you\nThat's ok man I got the medicine for you\nI got, I got, I got the amphetamine for you\nGot that vitamin D or UG for your shorty\nOne window to let the dawn in\n'Cause we hustle in this bitch midnight to morning\nWe dump in and pump out\nI showed you this window for you to jump out\nYou on the backyard lawn where a nigga got the ganja growin'\nNo cats or dogs, rats or snakes, Sam's or Jakes\nRound here it's all gravy, ham and steak\nMama cookin that up here have a plate\nThat's mama Carter she's a basket case\nBut I make sure her sandwich's and napkins straight\nYou pic wit this picnic and I'm at your face\nI say I'm at your throat, this was the carter slam the door, go\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Bring It Back", "href": "Bring_It_Back&&6344", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Ladies and gentlemen, people with jobs, people without jobs\nMiddle class, upper class, high class, all that\nCats, snakes, chickens, ducks, elderly people, and twerkers\nI presents to you\nFresh, fresh, fresh, fresh, fre, fre, fresh\nDJ Mannie Fresh, fresh, fre, fresh\nMannie Fresh, fre, fresh\nDJ Mannie Fre, fre, fresh, young ladies\n\nPut ya hands on ya knees and bend ya rump\nPut ya back in, back out, do the hump\nPut ya hands on ya knees and bend ya rump\nPut ya back in, back out, do the hump\n\nWell, I'm fly as a son of gun, son of a stunna\nYeah, high as a 757 going to heaven\nWho, Weezy F, ya reverend, preach about me\nI'm the god, 1-7, Apple and E\nI'm the Cash Money Makaveli, y'all ain't ready\nQuick, fast like Tom Petty, y'all just petty\n'82, I was born ready, I'm too ready\nY'all Betty Crocker baller blockers, I'm too heavy\nMeatball, Lamborghini, top spaghetti\nSeats Ragu, twenty the shoe\nBoo, me and you got plenty to do\nI don't need no pool, I'm swimming in you\nAnd I sleep with the sharks, shawty, on that water water\nIn the Beamer, eight hundred forty, mama, shake something for me\nAnd it don't make sense if it don't make that money\nI'mma take that money, I'm straight Cash Money\n\nPut ya hands on ya knees and bend ya rump\nPut ya back in, back out, do the hump\nPut ya hands on ya knees and bend ya rump\nPut ya back in, back out, do the hump\n\nWhodi, I bring it back, whodettes, to the bottom of the maps\nWhodi, I bring it back, whodettes, to the bottom of the maps\nWhodi, I bring it back, whodettes, to the bottom of the maps\n\nI take off my brim\nMoment of silence for the homeboy Soulja Slim\nFronting 'round here will get ya back chopped off\nWe do our own thing, we don't act like y'all\nI say, black white walls with the back swiped off\nY'all lil bustas just a tax write-off\nI'm a stand up guy, not the type that fall\nWe don't breed them kind, but they bleed just fine\nWeezy the Don, homie, read between the lines\nIf ya can't, boy, read my nine\nI'm going hard in the paint like Diesel time\nEither I'm the illest cat doing it or these cats is losing it\nI be easy, fall back and be cool with it\nPallbearer is moving his dead flow, I'm through with it\nI'm the sh--naw, naw, I'm sewer-rich\nWeezy F Baby, I do's this\n\nPut ya hands on ya knees and bend ya rump\nPut ya back in, back out, do the hump\nPut ya hands on ya knees and bend ya rump\nPut ya back in, back out, do the hump\n\nWhodi, I bring it back, whodettes, to the bottom of the maps\nWhodi, I bring it back, whodettes, to the bottom of the maps\nWhodi, I bring it back, whodettes, to the bottom of the maps\n\nAn old school gangsta, mack like the 80s\nI look like Cita and act like Baby\nYou play with me, I react like the navy\nOr better yet the army, you gon' need them for me\nYeah, and your head is a bleeping target\nYou don't want me to see you with my peeking Tommys\nWizzle Fizzle, I keep in New Orleans\nSleeping with women that sleep with the Hornets\nA country boy in something foreign\n'Bout a hundred thousand more than what you're in\nYou're not 'bout it, you freeze up like popsicles\nPop up on bicycles, pop y'all like spot pimples\nWizzle Fizzle, original Hot Bizzle\nStill Lil Wayne, but the dividend's not little\nDon't be surprised how the crown fit him\nUh, get down, uh, get down for the young Pac footprints\n\nPut ya hands on ya knees and bend ya rump\nPut ya back in, back out, do the hump\nPut ya hands on ya knees and bend ya rump\nPut ya back in, back out, do the hump\n\nWhodi, I bring it back, whodettes, to the bottom of the maps\nWhodi, I bring it back, whodettes, to the bottom of the maps\nWhodi, I bring it back, whodettes, to the bottom of the maps\n\nThe best rapper alive since the best rapper retired\nThe best rapper alive since the best rapper retired\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Way of Life", "href": "Way_Of_Life&&5661", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(MANNIE FRESH: Talking) (Lil Wayne)\nLook'a here... (Umm-hmm...)\nThis how we gon' do this...\nHook up the turntables,\nWolfe, get on the keyboard...\nAnd we gon' run it, ya heard...\n\n(Mannie, baby, &amp; wayne)\n(**Talking**)\n\n(GIRL)\nCash Money...\nCash Money...\nCash Money...\nCash Money...\n\n(LIL' WAYNE and BABY: Verse 1)\n(Lil' wayne)\nNow let me slide in the Benz with the fished out fins,\nHit the mall with my girlfriends, dish out ends.\nCause you know it ain't trickin' if you got it,\nCop baby girl what she desire, it's chump change mama.\nMarijuana Scholar... Knowin' what I got up in my styrofoam cup?\nThat purple stuff. It was givin' to me at birth to stunt.\nSo that's why I cop the Bentley with the leather and the fur in the guts.\n\n(BABY of Big Tymers) (Ay, Ay, Ay..)\nHold on, mami! Them whips on dubs.\nCadillac truck, twenty-eights, no rubs.\nSlide in the Benz, fins, bubble-eye lens,\nCar show in New York, Y'all know who wins!\nIt's the birdman, daddy, with the Gucci and Prada,\nSlant-back, cut truck. No rims? Can't holla.\nIt's that Louie/Fendi on Ostrich streets,\nIt's the tailer-made daddy, Mami, do you love me?\n\n(TQ: Hook (Mannie Fresh))\nBaby, I'ma a stunna... (Oh! Oh! Oh!)\nI ain't gon' change it... (I told y'all...)\nDon't - you - know,\nIt's a way of liffeee... (I told y'all...)\nMama, do you want it?\n'Cause I'm about to break it, (I told y'all...)\nOoh, baby... Can't stop the stuntin',\nNo, no... (Bring back that beat...)\n\n(BABY and LIL' WAYNE: Verse 2)\n(BABY of Big Tymers)\nPop one, pop two... Them new Nike shoes,\nRoyal blue Jag on them twenty-two's.\nFlip white to green, 500 Degreez,\nIn that Cadillac truck on them twenty-three's.\nI'm the boss of the game with the money and fame,\nAll these naked women that pop champagne.\nAnd these marble floors stay high as Rick James,\nIf you know my name, then you know my game.\n\n(Lil' wayne)\nIt's lil' whodi from the hot block with ser'ous flow,\nGotta get dough, cause y'all won't feel me, bro.\nBut y'all don't here me tho...\nTill I'm rollin' down my window and my grill-ie show.\nAnd you know I'm prolly pumpin' through the hood on the twenty-fo's,\nWord! Rims pokin' out the side of the 'ERV,\nGlock have ya ribs pokin' out the side of ya shirt.\nI'm a seventeenth nigga and I ride for the turf. Whoo!\n\n(TQ: Hook (Mannie Fresh))\nBaby, I'ma a stunna... (I told y'all...)\nI ain't gon' change it...\nDon't - you - know,\nIt's a way of liffeee... (I told y'all...)\nMama, do you want it?\n'Cause I'm about to break it,\nOoh, baby... Can't stop the stuntin',\nNo, no...\n\n(LIL' WAYNE and BABY: Verse 3)\n(LIL' WAYNE) Ay...\nAnd my pinky glow... Cause my ring is so...\nBlingy-blingy, yo... Stop blinkin' though...\nWe smoke - stinky, stinky dro,\nAnd we don't cop them ency-wency O's,\nAnd we don't stop. Nah! We blow, fuck the peo-ple!\nEverywhere we go, we smell like E-yo.\nThe birdman my paw, so that make me go...\n\"Flly like an eagle!\" Fo' sheezo!\n\n(BABY (Lil Wayne))\nThey think 'cause I stay at English Turn,\nThat Stunna don't have a O - Z to burn, (Light it up!)\nI go in each sto' and ball like a dog,\nMe and my nig's, we ball like a dog.\nCars on the streets, all on our lawn.\nIce in my teeths, all on my arm.\nTat's in my face, my back, and my arm. (What?)\n\n(Lil' wayne)\nTat's in MY face, my back, and my arm.\n\n(TQ: Hook)\nBaby, I'ma a stunna...\nI ain't gon' change it...\nDon't - you - know,\nIt's a way of liffeee...\nMama, do you want it?\n'Cause I'm about to break it,\nOoh, baby... Can't stop the stuntin',\nNo, no...\n\n(MANNIE FRESH: Talking)\nYep!... There it is!.. ya' lil' low-life...\nSee, I'm a pro - fessional. You a rookie.\nFuckin' game so serious...\nI could sell a hooker some pussy...\nNow, that's some serious shit...\nOh, yeah! Bel'ieve that!\nWho we rollin' wit?\nWe rollin' wit Cash Money!\nOh, I forgot about \"peace\"!\nPEEACE! I mean... \"Piece\" of pussy,\n\"Piece\" of land, \"Piece\" of property...\nIt's just a mind game...\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Lil One", "href": "Lil_One&&2026", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne talking)\nFuck, Man I been on this block all day\nHot ??? my shirt, Hot\nBoy that look like Baby\nThat ain't Baby\nThat is that nigga\nLet's go\n\n(Baby)\nSay Lil One\n(Lil Wayne)\nOne What's happenin' with you big dog\n(Baby)\nLook I need to talk bout some serious shit\n(Lil Wayne)\nLike what?, Look I ain't have nothin' to do with killin'\n(Baby)\nSlow down, I'm talking bout some get money shit an how it's gonna go down\n(Lil Wayne)\nWell holla at me nigga, Talk to me, Let me know somethin'\nCause right now I'm tired of husltin, And these rocks ain't doin' nothin'\nAnd to tell you the truth I feel like I be out here for the fun of it\nI swear if I don't hit a lick by next month I'm done with it\n(Baby)\nI understand, But you ain't listenin' you just talkin'\nI said I could get you paid, Is you with that offer?\nI know you see me comin' thruogh everyday pimpin'\nIn a Benz, the Jag, and a Ferari\n(Lil Wayne)\nYeah, But I like that Bentely\n(Baby)\nAll that's cool shorty, You can get this if you with me\nLet me run it down to ya bout this shipment I'm gettin' in\n(Lil Wayne)\nI mean I'm sayin' it sound good, I like that\n(Baby)\nWhat that's a blunt?\n(Lil Wayne)\nYeah\n(Baby)\nLight that, Nigga I'll be right back\n(Lil Wayne)\nAight cat, Don't be playin', This worth my while?\n(Baby)\nLil daddy I play with hoes, Is you a hoe?\n(Lil Wayne)\nNah\n(Baby)\nSay I got work, I need to flood it all over\nI can't do it all myself, So I need me a Lil solider\nI been peepin' ya Lil ass, I see you grindin' an shit\n(Lil Wayne)\nI been peepin' you to, Nigga I see you shinin' an shit\nAn you don't even know how long I been tryin' to find me a brick\nTo make it flip and take the chips and go an buy me a whip\n(Baby)\nFuck a whip, That could wait\nYou worry bout your cake\nOnce you make enough to play\nGo buy a Z-28\n(Lil Wayne)\nA Z-28\nBoy go head, Once I get change\nI'mma go an cop me a Range or two platinum chains\n(Baby)\nWell look I ain't fuckin' with ya\nYou to young from the start\n(Lil Wayne)\nMan that ain't even got anythnig to do with it\nIts dedication and heart\n(Baby)\nDedication and smarts\nDon't put your heart in this game\n'Cause when you fall to deep in love you get caught in this game\n(Lil Wayne)\nWell correct me when I'm worng\nAnd acknowlegde me when I'm right\n(Baby)\nLil bitch, If ya hard head ass listen I might\n(Lil Wayne)\nB I'm all ears\n(Baby)\nGet yo ass in this car\n(Lil Wayne)\nUnlock the door\n(Baby)\nIts unlocked\n(Lil Wayne)\nDon't holla at me\nYou ain't my pa\n(Baby)\nNow stop playin', Look I got a hundred bricks just came\n50 ki's of raw dope, and 50 bricks of cocaine\nPays 5 a piece\n(Lil Wayne)\nEvery week\n(Baby)\nJust move it together\nI'mma knock off my Lil section\nYou take care of ya area\n(Lil Wayne)\nUghhh, Nigga I been waitin' to be the Don round here\nI'mma have Coke and Dope\nIts gone be on round here\nBut how you want me to sell this\nZones, Quaters, Halfs, Ki's\n(Baby)\nHowever they ask for it, Just give it to them Lil Weezy\n(Lil Wayne)\nI'm all for it cousin\nI'mma get me a million\nIf power get between it I'mma split me a nigga\n(Baby)\nYou better, But when I get you this shit nigga\nLet them have it\nI bet you be on the block workin', Directin' traffic\n(Lil Wayne)\nLike you park here, You park there, You meet me in the cuts\n(Baby)\nSay Lil One\n(Lil Wayne)\nWassup?\n(Baby)\nWe gone fuck it up\n(Lil Wayne)\nNigga what?\nNigga what?\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Go Hard", "href": "Go_Hard&&2502", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "It's H-B Weezy Wee off the streets\nStay deep 'Cedes Jeep big feet\nGazer seats hold the bare floors\nI faithfully hold to pimp whores\nYou ate with me and you gon get yours\nThis eight with me that's bullets through doors\nGot haze in me now I'm so tall\nCome blaze with me 'cause Beaky got more\nAnd now or later I'm major player\nI ball right I need an agent player\nAy ma you tight you need to page a player\nThat's so tonight you can taste a player\nI got the burner on the waist if you flinching\nMy shit turning on 28-inches\nMy shit burning like 500 plus\nAnd this album's a three permer and a clutch\n\n24/7 (Yes, sir)\nI go hard (Go hard, go hard, go hard)\nNot here\n\nI claim squad game till no more Wayne remain\nBang my thing till no more lane remain\nUse the left lane man cook up the cocaine\nDudes a lil game and get her to do brain\nThat boy Weezy is a bad mother-feezy\nMe and Young Jazze at the back of one tweezy\nI'm so breezy off the Velvie and the perk\nNow I'm getting head on the balcony on Bourbon\nApple and Eagle is the street that I shop\nThe Birdman my daddy and we fly south\nAnd we don't go to work man we get work out\nAnd the bricks may go as low as ten up in the drought\nNiggaz is selling and you should be buying\nNiggaz is telling and you should be dying\nNiggaz is yelling Cash Money till they kill me\nC-M-B, I know you gotta feel me\n\nYou know if I'm doing it I'm probably doing it for the block\nI'm out here bitch I got this here on lock\nCome out here bitch I bet this here gon pop\nI got ya slick this my year don't knock\nSpeakers from the front to the rear gon rock\nWood-grain handles to steer it's all hot\nI never drove factory and I don't own stock\nI drop that bitch on chrome chops, yeah\n\n(Hook till end)\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Fly Out", "href": "Fly_Out&&9389", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nWe here\nI said we here\nThe back of Tha Carter\nThe back of Tha Carter... Two... Ooh\nYeah... This here is... the end of Tha Carter Two people\nHEY! HaHa.Yeah\n\nI got the game on ball and chain\nI threw the key in the train\nI'm like the key in the truck\nI spent a G on these frames, though my vision is priceless\nSeeing through you niggaz like a fuckin' psychic\nHearing through the grapevine, niggaz wanna hate mine\nSay my name and die in the daytime\nYou catch my drift, man you better be Peyton\nBoy the heats on, they make a peace bond\nI'm in this bitch, throwing up the seventeenth sign\nStraight frowns, no daps, strapped three times\nA Tec-11, AK 47, one Beretta, ready for whatever\nTell them pussy niggaz come together\nHeavy wetter, nigga super soaker wetter, nigga\nSix feet under flowers, you ain't nothing but a petal nigga\nI'm just a little nigga, trying to be a civil nigga\nThirty years old, shit that'll be a different nigga\nQuit it Wayne, your Mom is listenin\nBut she ain't really trippin', 'cause the pots is piston\nThem niggaz trippin', unitl the shots whistling'\nHear them bullets sizzle, like a cobra at attention\nI gotta bitch, and quit callin women bitches\nAs long as she don't worry 'bout the coke in the kitchen\nNo preventing the crime, I gotta get it\nI'm admitted to the game, true playa, no quittin\nThere you go shittin on a way a nigga thinkin'\nOnly history I know is Benjamin Franklin\nAnd since the future ain't promised to no one\nI live everyday like this is the sure one\nTrain in the tidal wave, this is the ocean\nStand in the heat, till the mother fuckin' snow come\nAnd it feels so fuckin' good\nThrow my dope like a rope, let them tug and pull\nNo hope for the hopeless, rats and roaches\nRunnin' cross the porch, in the attic there's a fortune\nCome and get it, automatics in motion\nWe bangin' for the bread nigga, even the molded\nI got my loaf, I got my toast\nChaperone of the south, I got my coast. Yeah\nAnd unll I die I'm Da. Da Da Da Da. Da BEST RAPPER ALIVE\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Big Tigger Live on the Radio", "href": "Big_Tigger_Live_On_The_Radio&&5075", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Big Tigger)-a u lockdown ta the south to W.B.I.T.C.H were the w stands fo wah! hit us at 180-nobitch wut happenin'\n{Caller)-hello\n{Big Tigger}-yo\n{Caller}-yeah man check this shit out I went to the concert last night you know the after party and the niggas put on rashed's shit\n{Big Tigger}-Roc master rashed?\n{Caller}yeah you know wut I mean ain't nobody move noboby did shit but when they put Wayne's shit on everybody you know tvs fell down mutha fuckin' helicopters come from the fuckin' sky twirlin an shit niggas throwin' money every goddamn were but you know rashed mandat nigga you know put countryness in rappin' he want ta save the whales dosomethin from the fuckin' earth\n{Big Tigger}-yeah he ain't bringin' that heat like 500 degreezdats wut we got right heh wit lil wayne and cash money caller 2 get up out ah heh\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Up to Me", "href": "Up_To_Me&&3014", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Look, where I go from here?\nJust lost my father last year\nBut I still, remain to keep it real like dollar bills\nI drop tears, can't believe my daddy's gone\nRather come home, why ya left us all alone?\nBut I'm comin' man\nJust wait at the gates, I'ma be runnin' man\nArms open, eyes wide, full a love\nYou watched me come up from a scrub\nNow ya see ya son ridin' everyday on dubs\nBut I wish, I could share them times wit' you\nIt got me pissed, this family and my momma, too\nBut please brah, won't ya come back for Lil Wayne\nAnd see ???, Mrs. Roe, Sheryl, Kemp and plus Sinetra\nDawg, we really miss ya\nAnd it ain't all that cool livin' off pictures\nAh man, visit while I'm sleep, write a note or call me\nCan't believe you left me to be a small man\nBut I know it wasn't meant to be\nThat's why I suck up all the game that you sent to me\n\nIt's up to you, Wayne, nigga, stay up and keep it real\nIt's all on you, man, my nigga, I know how you feel\nJust be strong, 'cause everythang gon' be all right\nI know it's hard tryna make but it's gon' be all right\n\nAll right I know it, see I got a child\nI know I'm young, but when you left dawg, thangs got wild\nI know you probably sayin' 'damn, you raisin children now?'\nBut it's all gravy I'm with Baby makin' millions now\nSo I still smile\nI'm takin' care ya wife brah\nAin't nothin' changed, if I still come home late at night she fuss\nBut it's still the ol' same ol', same ol'\nThangs go, up and down like rainbows, we maintain though\nSo you know who payin' the bills now, ah hah\nStill flossin, give my audience the chills, ah hah\nI got all my game from you, man I ain't gon' lie\nBut I'm still thuggin' nigga, playa you think I ain't gon' ride?\nBut Slim and B done slowed me done and brought the talent out me\nYeah Slim and B done showed me 'round, all a the Jags around me\nAnd I ain't goin' no where, that nigga stuck wit' me\nAnd make you and my people happy, man it's up to me\n\nI know you know I'm thinkin' 'bout ya, you be on my mind\nI know ya see me every time watchin the boys shine\nAnd I know that ya see I put out my own CD\nAnd picture this, your little boy even on TV\nBut I swear it's off the heezy, Weezy\nSay it's cool, you can believe me, I like how they treat me\nI'm doin' what ya say, don't let a nigga try me\nAnd I don't let a fine, pretty broad get by me\nDon't let nothin' pull me off track from my hobby\nOh yeah, and I don't leave my room sloppy\nBut the same thang make ya laugh, make ya cry\nAnd everybody that ya love it's like they have to die\nI pray to the Lord everyday and ask him why\nAnd ask him to bless your soul every time I pass by\nI know he doin' it, and leavin' all the love to me\nAnd I'ma prove it, and show ya daddy it's up to me\n\nI mean it's up to me man\nJust watch over me\nAnd it's gon' be all gravy man\nLeavin' big, treatin me all good\nEverythang else be all good\nRest in peace ya heard me\nI'll be there\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "On My Own", "href": "On_My_Own&&9230", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "Yeah hit me wit the snares Fresh\nJust the snares fresh\nI like the snares Fresh\nIma ride the snares all the way throught this thing right here man\nI'm sexy Weezy baby\nTest once again what up\nThis is what they call me bitch\n\nEagle Eagle Carter Man\nIn a 96 Regal contraband\nOn my way to the east to the laundramat\nGotta wash that money and get on my ass\nGotta flip them bricks it be gone so fast\nI gotta do somethin' I done blown my last\nDollar holla at ya boy on the ave\nAnd that cheaper eagle is what I'm known to have\nShit tend to be slow I put on the mask\nAnd make it halloween and take all ya bags\nI say Holly Holly Grove wount you gon on and stash\nFuck it make these mutha fuckas understand\nI say look coach ya pitchin at me underhand\nBut I'm a designated hitter I adjust so fast\nY'all been designin woman I'm a womans man\nI'm the Cash Money prince blow the trumpets band and\nThey say they want the drugs to stop\nBut Ima major set back when my album drop\nI got that wet crack flow out ya mammy's pot\nI got that jet black 4 at ya mammy's spot\nI'm tryna get back door I demand it now\nYeah panic now you better pan it down\nFore the neighbors sen me over here tearin it down\nHere's Weezy F. Baby and his crown,\nThe Prince\n\nThis is my town my home\nThis is my crown my throne\nThis is me on my own\nLet's get it on\n\nAnd the handgun is so included\nDon't get it confused I want no confusion\nAnd keep ya hoe I don't want yo contusions\nI make my hoe stop and let the dough keep movin\nA bitch over some money is a hungry nuisance\nIt Money Over Bitches that I'm gon keep provin\nYes its Weezy F. I got ya mama groovin\nOut of all the Hot Boys she say I'm the coolest\nI bought my bag of oranges this time to juice it\nThis game is a bitch and I'm tryna seduce it\nI floss a awful lot of haters tryna reduce it\nBut the laser on the 45 is eyein ya stupid (oh)\nOne shot to remind ya who is\nThat fly lil nigga that's behind the trigga (wizzle)\nI'm off chronic combined wit liqour\nBut nigga will never see me like mama tigger (oh)\nA 80's baby a fightin nigga\nI got it on my mind like a psychic nigga\nI'm somethin' ya culpepper like a viking slick\nSee me over the viking stove and I'm whitin bricks\nOr in the middle of the shootout untightin clips\nPop another one shoot back while lightin this spliff\nI do this\nYou catchin my drift\nRepresentin wit my section on my belly and shit\nI am the prince\n\nSo roll the carpet out\nCause you fuckin' wit a nigga from the royal south\nSee ya either in or ya out\nAnd if ya out stay in cause them warriors out\nThem vultures the cops and them lawyers out\nI just open up the gate and let my hoyas out\nNah nigga I never call ya house\nI'm probably somewhere takin' Toya out\nNot answerin my phone man ignorin ya spouse\nShe leavin' messages about me enjoyin her mouth (aye) (stop)\nI'm ready to knock a boy in the mouth\nGive me the name nah better yet point 'em out (aye)\nMe and the streets got a joint account\nI'm from the streets that ya need to be warned about\nNew Orleans woadie put the gat in ya mouth\nAnd we tote a lot of iron that'll flatten ya out\nFew roaches but never have no rats in his house\nNever tell on one another leave that in the house\nAlways been a small hustler move my packagin out\nI ever run into some trouble send them savages out\nThese niggas talkin' sweet I get them cavaties out\nI got graveyard flyers man I'm passin 'em out (aye)\nBitch nigga get ya ass on the ground and bow down to ya majesty now\nI am the Prince\n\nThis is my town my home (yeah)\nThis is my crown my throne (the prince)\nThis is me on my own (the prince)\nLet's get it on (the prince)\n\nThis is my town my home (the prince)\nThis is my crown my throne (weezy)\nThis is me on my own (by my self so niggas guess what)\nLet's get it on\n\n", "album": {"title": "Tha_Carter_(2004)&&4818", "genre": "Hip Hop", "year": 2004}}, {"title": "Feel Me", "href": "Feel_Me&&2317", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Interviewer:)\nSo \"Little Wayne,\" what's your motivation?\n\n(Lil Wayne:)\nIs that really a question\nDo you really have that written down in your notepad\nYou should be ashamed of yourself\nYou smell me girl\nI smell like money\nSee, that's what they don't understand (Tell 'em a god damn thang)\nTo me it was always get money or die\nI come up under Birdman the Number One Stunner\nYou know what I mean I'm stunner junior that's all I know that's all I ever knew\nGet money or get nothing you know what I'm saying\nAnd I feel that way\nForeal\n\nSo hard I go I keep pushing\nThe game so crazy I'm in it like deep pussy\nI got chip from trying to get the whole cookie\nUsed to make a thousand dollars every time I played hookie\nDwayne Carter absent keep looking\nI'm present on the block\nI'm a legend on the block\nIce so bright like heaven on the watch\nYeah nigga I done dropped one eleven on the watch\nSo watch and see what I do\nBreeze by you so fast got you sneezing hachoo\nThey got the shivers 'mayne I got the fever\nI got to bring the hood back after Katrina\nWeezy F. Baby now the F is for FEMA\nSick nigga bitch I spit that Leukemia\nYeah no cure no help\nSo me so good so hard so felt\nFeel me\n\n(Lil Wayne:)\nAnd that's just my point right there\nThat's what I'm always trying to stress know what I'm saying\nIf you don't understand me if you don't feel me then you ain't real\nIn my eyes, and that's all that count to me you know\n\n(Interviewer:)\nSo, is your music considered the voice of urban America or America period\n\n(Lil Wayne:)\nI mean, I would say the voice of the hood 'cause that's who I speak for\nAnd myself, you know what I mean, my family that's who I represent\nMy hommies, my girl, my life you know\n\nC'mon, bang this shit nigga pump my shit\nYou gotta bang that wimp and go and dump that bitch\nYou gotta claim that strip and go and flood that bitch\nYou gotta aim that shit and straight bust that shit\nLike motherfuck them niggas what they wan-do I'm ready\nTevin Campbell, no homo, black rambo\nFucking with the boy baby that's a cambo\nIf he won in vegas leave him on the crap table\nI'm willing and I'm able to come run up in your stable\nLike nobody make a sound where the paper where the paper\nGotta get it gotta have it\nOnce I got it I'mma spend it\nThen its back to doing any damn thing just to get it\nThe re-ups be like birthday parties\nNo room to park the cars in the garages\nSo outside the cribs all you see is arayis\nIf I ain't say it right fuck it I ain't foreign\nFeel me\n\n(Lil Wayne:)\nAnd see that's where everybody get me wrong at you know what I mean\nI got that heat rock, foreal\n\n(Interviewer:)\nWhy do you think other rappers lack the impact of your music\n\n(Lil Wayne:)\nThat's because they ain't got that heat rock like me you know what I mean\nThey ain't spitting like me\nThey spitting, but, know what I mean, they ain't got colds\nI got the flu over here man, foreal\nI need relief, y'all help me\nI know y'all sick of me, 'cause I'm tired of y'all foreal\n\nAnd based on the bank, I'm doing much better than alot of these niggas\nI'm tired of these niggas\nYawning when I see them make me stretch and pull the burner\nI'm cocking back and passing\nThey catch 'em in they sternum\nOoh ooh that gone probably burn ya\nThat gone probably learn ya\nTo never ever ever - ever ever ever come around here no more\nRich gangsters over here you gotta die with the broke bitch\nI'm the God I should ride with the Pope\nBut the boy so hood I just ride with my hoe yeah\nYeah, and tell 'em bout Hollygrove\nTell 'em bout my last show\nTell 'em bout my last hoe\nYou know, just born to mack\nCall me Dione Sanders bring the corner back, yeah\nI'm in my prime niggas falling back\nThat's right I'm coming baby yeah hard as crack\nFeel Me\n\n(Lil Wayne:)\nAnd that's just what it is nigga\nIf you don't like my shit then fuck you and your shit man straight up\nThat's how I was tought that's how I was brought up\nAnd that's how I'mma go down\nCash-Money Young-Money in your motherfucking throat bitch\nSwallow slow\nWeezy F. Baby this interview is over, go to the next song\nBitch\n\n", "album": {"title": "Tha_Carter_II_(2005)&&7066", "genre": "Hip Hop", "year": 2005}}, {"title": "Lovely", "href": "Lovely&&5850", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "I love myself\nI love what I am\nI love who I is\nI love Weezy\nLil girl your man your damn kids love Weezy\nYou gotta love the nigga just because other nigga\nAnd I don't love other niggaz\nBut I love other niggaz bitches\nI love 20-inches on everything I sit in\nI love my nappy hair\nI love the shit I wear\nYou gotta love the squad-ad girl\nIf she ain't giving love to the whole squad-ad\nGet outta here\nYou people love the shit I pop in your ear\nYou gon love the shit I do to hip-hop this year\nYou gonna love when I bring it back to the block this year\nI represent the Biggie and 'Pac era; you gotta love me\nThat I know ma love me just 'cause I got a lot of money\nBut I love that girl too, but I love that girl too\nI let y'all know me and I would love to know you\nNow come on\n\nEverything that I love in this world\nHas gotta be the greatest thing in this world if I love it\n'Cause, I love this, I love that, I love y'all because\nEverything in this world is just love\n\nI know you probably love the bar, right\nYou love to live that big dog life\nYou love to live just like a young'n Weezy by here\nAnd I love to see you do so\nI love my Coupe blow on them deuce-o's\nI love a cute ho and you probably love her all right, girl\nHe probably love you all your life I love you all night, girl\nI love an all white pearls\nSix with the two pipes barrel kit\nI love to get it cracking in your girl lips\nI love to sip from bill\nI love to go hard purp-pill\nYou love that I'm a star and got that work still\nDon't get it fucked because I love to work still\nAnd you won't love how the hurt feel\nHow getting mirked feel\nAnd I love how getting hurt feel\nI know you love I got some of it on your shirt ee-yew\nI need to treat you\nAs a matter fact I love to cheat you\nDon't call me cool\nHey, you love me and I love to love you\n\nI love fast cars\nI love fast broads\nI love fast money\nI love Cash Money\nI love a slow cigar\nI love a slow m&#233;nage\nWhat you love blower hard\nLet's get it cracking money\nI love to stack my money\nYou will love to jack my money\nI love to clap-clap and black-black get back here honey\nI love act a plumb-ass when I had a tall glass\nAnd that bust your ass in one gulp\nI love to shit talk\nYou love to hear me talking shit on this\nWhen Fresh dropping that nasty shit\nThat old uptown get down CMB classic shit\nI like to ride around with a plastic fifth\nI love to melt ya\nI love them underground S-Q albums\nHaters love to get you twisted\nBut I love the haters 'cause haters just love twisted\nThem bitches love Weezy\nMy bitch gon love me when I'm busy\nWith T-Rez fleece suit is Jayo nothing busy\nSquad up\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Respect Us", "href": "Respect_Us&&5522", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil' Wayne)\nWhat what what\nWhat what what\nWhat what what\nListen, listen\nWhen... I come through... bustin'\nEverybody on... tha block be... run-nin'\nWeezy Wayne, Hot Boy, I... be... thug-gin'\nGot... them... things... ten up, keep... hustlin'\nCatch me at tha shop, I will... be... there\nAnd my prices stay low, I keep... it... there\nAnd if you want it raw, I got... it... right... here\nAnd if you want war, I am... your... nigh-tmare\nThis is all I know, it's bang bang\nI hustle and slang slang\nMy block... I hang hang\nWho am I? Lil' Wayne, man\nI represent CMB\nMy cell is ten in heat\nI usually get in beef\nWas taught that it's him or me\nI pop head-bustas quick\nI rock here for my brick\nI chop that, I'ma (?)\nMy shop here ??\nI always... thug in black\nAnd always... bustin' gats\nYour girly's... fuckin' back\nNow how you... lovin' that\n\n(Chorus 2x, Juvenile)\nHot Boy$, wardy... respect... us\nRepresen-tin' Cash Money... Records\nIt's warfare, you betta... vest... up\nBut if you ain't scared, they blow... your... set... up\n\n(Lil' Wayne)\nListen, listen\nI give it to 'em how they ask me\nRaw and nasty\nTha AK, I pack it\nBelieve I'm 'bout that action\nSlash a busta like a fraction\nI'm on that yolla\nStandin' on tha corner with one sleeve over my shoulder\nRide on your block, I see a dozen of weak jerks\nNow it's time for your momma ta order a dozen of T-shirts\nFor only half-a brick\nI'll blast tha fifty\nAnd I ain't gon' stop shootin' till I jam tha clip\nYeah, I'm a small creeper, what\nBut it's about ta get ugly\nY'all betta call people up\nI'm about ta start shovin' my sawed-off between your guts\nWayne 'bout ta (cugghh-gghh-gghh) ball people up\nY'all betta duck\nWhen it get real, they hide from me\nBut, all them bustas 'bout ta get killed, I'm tired of it\nMan, I'm thuggin' till tha day I... I die, cousin\nWeezy Wee... let 'em burn, bring tha fire truck in... (whoooo!)\n\nNigga, let it be known\nI'll come blow up your home\nTake a few blunts to tha dome\nAnd... show up alone\nJust me and my... flame-torch\nWayne start... danger\nWalked with my head down like a stranger, and banged ya\nBurnin' off that Hennesy\nSome-a y'all be feminine\nBounce in with a twitch\nLeave 'em crawlin' out a ditch\nGod damn... son of a shhh!.. Don't speak\nI cocked that, and let it go, tssss!.. Give 'em heat\nYour cheese, I got... ta... get... paid\nI'm goin' all out, no matter what... it... takes\nI... was... raised... up on... that... paper\nKill-for-the-scrill was... in... my... nature\nTote M1's and keep... tha... block... hot\nSell wrong colts to keep... my... glock... hot\nNever add taxes to... my... price, man\nAnd if a boy play, I ride... at... night, man\nWhat!\n\n(Juvenile)\nUh, uh, uh\nSay Lil' Weezy\nYou did this one here, ya heard me\nThey ain't gon' never get weared out from this one\nIt's like they said, boy\nIn tha year 2000, it's all about Wayne\nIt's your chrome, man, run that thang\n17th ward to tha 3rd ward downtown\nDo that there\nHuh, huh, huh, huh\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "Lights Off", "href": "Lights_Off&&33", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nCut the lights off nigga (Cut 'em off)\nYou know what time it is (What)\nYou know what time it is (What)\nStrap -Up (Gun Cocks)\n\nA lot of niggas better move out\nCause here I come with my click\nWith the tools out\nAll of a sudden all these cowards\nStartin' to spook out\nIt's warfare a buncha of niggas\nBout to lose out\nIt's time to load up them thangs\nHit the spot run in his house\nAnd make 'em show up then thangs\nTake 'em in the room go in his pockets\nAnd then blow up his brain\nNo matter the weather\nRain, snow, sleet, or hail\nI'ma slang that metal\nSo tell 'em niggas in yo' hood\nTo get it together\n'Cause I'm the tolas mario\nAnd we down for whatever\nNever underestimate or you goin' under\nY'all keep on playin' with Lil Wayne\nBut that lil' boy trouble\nAnd plus this shorty be full, wodie\nBe scorin' bundles, them start wildin' and\nHit the block and let his toys rumble\nAnd it go ratter tatter\nYa be surprised how niggas scatter\nWhen the M-1 shatter\nAnd everybody on they block\nThey get bout ten in they bladder\n\nTell 'em lights off\nMask on\nCreep silent\nYour life's gone\nWe done left the block quiet\n\nLa\nWhen it's time to ride\nIt ain't no time to play\nIt could be time to die\nAt any time of the day\nAnd I'll be goddammit\nIf I let a nigga steel me\nIt will not happen\nI'ma fire about a hundred and fifty shots at 'em\nAnd got my glocks rammin'\nLeave a nigga spot damaged\nThat's how the beat made us\nI chief three blunts\nSo I can get a head rush\nThen come around the corner\nAnd your whole day crush\nI'm sick and tired\nNiggas choosin' test a boy\nThey get hit and die\nSome of 'em scared of man slaughter\nSo they stay inside\nAnd watch they partner get lit up\nAnd then they ask why\nThat's cause you played wit' me\nThey couldn't of known I'm'a guerilla\nDrama stayed with me\nRun in his home went to kill him\nTook his head with me\nYou better get it right or keep it right\nOr lose your whole town\nTell em' lights off\nIt's about to go down\n\nMassacre all these streets block it off\nLil Wayne in yo' hood\nWith something like a rocket dog\nAnd I'm after ya\nI don't pass beef\nI stop at all\nThat boy got a head on his shoulders\nI knock it off\nI'm highly intoxicated mixing krystelle and vodka\nSomebody call the doctor\nCause my chopper done went blocka, knocka\nNigga out the way man\nI'm sorry but us guerillas we can't stay tamed, say it man\nAre you ready, ready\nReady for warfare Wayne, Turk, Juvi, and BGeezy they all there\nWe all flare, don't care, dog they all tear\nGive the guns to the one with the long hair\nDem block burner\nIt gets quiet they see the rims twenty four seventy\n(Breathes) they breathe heavily\nBullets they come steadily\nYou better stay off the block\nCause you might fall\nYou better stay off the block\nCause the lights off\n\n(Lil Wayne)\nLights off\nTell 'em lights off\nLa, la, la lights off\nNigga lights off\nWe done left the block quiet\n\n", "album": {"title": "Tha_Block_Is_Hot_(1999)&&9403", "genre": "Hip Hop", "year": 1999}}, {"title": "Beef", "href": "Beef&&9217", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Lil Wayne)\nCheck\nHuh\nWhat?\nWhat?\nLet's go, nigga (Where you at, Wheezy?)\n\nYou liable to catch me speedin' up the six, or beatin' up a chick\nOr standin' over a stove, sweatin', heatin' up a brick\nAnd we keep the hustlin' slick, and got clips like bananas\nWe twist the bandanas, and spit at niggas with cannons\nWe ran in habitats with masks and plastic gats\nStormin' through the house, screamin', \"Where's this bastard's crack?!\"\nI flash the mack in front of your gal and make her tell\nLike, \"Slut! Where's the yay, or I'ma pop one in your grill!\"\nIt's Lil Wayne, nigga - blast and bang triggas\nPay with my change, then I'm gon' have to bang niggas\nI bag the caine quicker, and sprinkle like rain, nigga\nFlood the av quick with the quarters and halves, nigga\nIf you out, you can find me on the street with the work\nIf it's a drought, you can find me on the street with the work\nNever slip - I empty half a clip deep in your shirt\nAnd put your whole clique deep in the dirt\nSmell me?\n\n(Hook-2x (Lil Wayne))\nWho wan' beef with 'em?\nWho wan' creep with 'em?\nAnd when it comes down to guns, nigga, I sleep with 'em\nSee, we can sweep with 'em 'cause it get deep with 'em\nAnd when it comes down to drugs, I'm on the streets with 'em\n\n(Lil Wayne)\nLook\nI'm the youngest Hot Boy on the field with heaters\nLet my nine-millimeters kill your peoples\nBust up in your house and put the gun to lil' Renita\nGive me the yay, or else I'ma put her in her sneakers\nWow (wow, wow) you can catch me in all black with no smile\nMe, Turk, Geezy, and 'Nile - chicka-POW!\nHow come these niggaz keep burnin the world?\nAnd why the hell this nigga Wheezy keep firmin your girl?\nTurnin' the wheel on the orange and teal Bentley drop\nThen I'ma put that up and hop in the van and hit your block\nTell your mom to get the cops cause y'all gon' need 'em\nWhen you see them bullets that my glock pop, y'all gon' eat 'em\nSee this for all my niggaz in the pen, I hope for freedom\nAnd this for all my niggaz buyin bricks, I got 'em cheaper\nKeep a nigga quiet as a mouse when I come\nWayne #1 Hot Boy, hot as the sun - ya smell me?\n\n(Hook (Lil Wayne))\nWho wan' beef with 'em?\nWho wan' creep with 'em?\nAnd when it comes down to guns, nigga, I sleep with 'em\nSee, we can sweep with 'em 'cause it get deep with 'em\nAnd when it comes down to drugs, I'm on the streets with 'em\n\nWho wan' beef with 'em?\nWho wan' creep with 'em?\n'Cause when it comes down to guns, nigga, I sleep with 'em\nSee, we can sweep with 'em 'cause it get deep with 'em\nAnd when it comes down to drugs, I'm on the streets with 'em\n\n(Lil Wayne)\nNasty case, nigga run up in your crib, crash the place\nMask the face, automatic attach to waist\nYou bastards play? Then it get awful and bad\nThere will be no more walkin' for dad, and it's off with your head\nAnd they gon' either get it right, or they get it at night\nAnd when they spit, it lick his ass twice like 20 damn dice\nHenny and ice is what I prefer, but light on the rocks\nI pack them clips tight on them glocks and light up your block\nAnd if there's coke involved, then your throat's involved\nI get the toaster and roll up and smoke most of y'all\nMe and my nigga, Super Sosa, run up in your crib\nWhile your grandma watchin Oprah, jag her up and rope her\nIf you wan' grudge, chances slim like Ethiopia\nIf you want drugs, I got more flavors than Fruitopia\nRecognize it's real and nuttin udder than that\nCause one from the mac'll have blood coverin your back, ha?\n\n(Hook-4x (Lil Wayne))\nWho wan' beef with 'em?\nWho wan' creep with 'em?\n'Cause when it comes down to guns, nigga, I sleep with 'em\nSee, we can sweep with 'em 'cause it get deep with 'em\nAnd when it comes down to drugs, I'm on the streets with 'em\n\n(Lil Wayne)\nWho wan' beef with a nigga? Creep with a nigga?\nWhen it comes down to guns, look, I sleep with them triggas\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}, {"title": "Believe That", "href": "Believe_That&&1786", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Chorus - Blaque and (Mannie Fresh))\nPush Impalas and Caprice's (Believe that daddy)\nStarch flat no creases (Believe that daddy)\nGot that work, you a D boy (Believe that daddy)\nYou a H-O-T Boy (Believe that daddy)\nDo ya Bentley got them hoes (Believe that daddy)\nThat's, that weed smell in yo clothes (Believe that daddy)\nBet a hunderd, shoot a hundred (Believe that daddy)\nIt's my block, I run it (Believe that daddy)\nGot them 20's on ya ride (Believe that daddy)\nGot the gator inside (Believe that daddy)\nFine bitch, bow-leg (Believe that daddy)\nAnd she go both ways (Believe that daddy)\nSlugged up in the front (Believe that daddy)\nGot a trunk full of bump (Believe that daddy)\nGot cribs, cars, bikes, dykes (Believe that daddy)\n'Cause that's what hoes like (Believe that daddy)\nNow I do it for the ladies, do it for the ladies\nI do 'cause I wanna push a cat-eye Mercedes\nI do it for my dudes, do it for my dudes\nAll the niggas on the block that got that work to move\n\n(Verse 1 - Lil Wayne)\nIt's Weezy baby, young and from the Dirty South\nGet up your dope, I'm putting birdies out\nLike thirty in my mouth, so I can say\nFuck you bitch you still ain't got a dirty mouth\nThe hood still ain't got over the drout\nSo you should sleep on your roof, just to watch over ya house\nNigga we tymin', the cost of my watch over ya house\nI'm a boss man, I watch over the South\nJazze Pha, let's hop in the Lammy (Lamborghini)\nStop by Sammy, chill in the hood, you good, you family\nMy boys like to pull them blammies, and big pimp\nMami suck dick till she pull your hammy, homey\nYou know we only, keepin' it gangsta\nDeep in the Range, 17 in the chamber\nAll I need is my banger, nigga it's Weezy\nThis shit is over somebody cue me\n\n(Verse 2 - Lil Wayne)\nYou don't wanna play wit me, I touch you man\nLose ya man in a tussle, but y'all don't see me\nY'all can't hear me, this a def jam, call me Russell, man\nI played on Martin, call me hustle, man\nAnd now y'all know I'm the yee-yo muscle, man\nBut on the under, I got that wonder, to stop that thunder\nThat rumble in the side of ya stomach, piled on water\nHow do you want it, come through in a Coupe powder blue or\nHigh with water, how do you want it man\nAy, I towed a lot of tullies dun, I den broke a lot of hoopties dun\nI den drove a lot of QP's from, here and there on the road\nFor the nigga gotta move his son, and I show you how to do this son\nThat's, that boy Weezy We, CMB, BITACH, and ya stunned\n\n", "album": {"title": "500_Degreez_(2002)&&3570", "genre": "Hip Hop", "year": 2002}}, {"title": "Hit U Up", "href": "Hit_U_Up&&3736", "artist": {"unique_name": "Lil_Wayne"}, "lyrics": "(Turk)\nCome on, come on\nCome on, come on, come on, come on, come on\nI roll with a bunch of untamed guerrillas, head bustas, and sharks\nNiggas that's 'bout beefin' - lettin' them K's spark\nKnockin'-it-off-your-shoulder soldiers - them real niggas\nNiggas who did time - hard-to-kill niggas\nHow you live, you get it is the way a nigga play it\nNiggas ain't fightin' no more - niggas bustin' your head\nSendin' you to your grave - it's do or die, cousin\nAimin' straight for your head, makin' sure you die, cousin\nThey dressin' in black, prepared for combat\nRidin' four deep strapped with choppers and macks\nNot givin' a fuck, gettin' your cut, lettin' it bust\nYou get hit, that's on you, my nigga - you're outta luck\nYou're stuck like chuck - wodie, you're assed out\nThat's what happen to ya tryin' to be hard, runnin' your mouth\nGet erased, my nigga (my nigga)\nLook here: I leave no trace, my nigga (my nigga)\nNo witnesses so can you see my face, my nigga (my nigga)\nFled the scene - so you have no case, my nigga- -case, my nigga\nLook here: you can play if you wanna get down\nGet your stupid ass left where you can't be found\n\n(Hook (B.G.))\nWe done hit you up, lit you up, twist you up (Ooh!)\nWe done chopped you up, popped you up, boxed you up (Ooh!)\nWe done hit you up, lit you up, twist you up (Ooh!)\nWe done popped you up, chopped you up, boxed you up (Ooh!)\nWe done hit you up, lit you up, twist you up (Ooh!)\nWe done popped you up, chopped you up, boxed you up (Ooh!)\nWe done hit you up, lit you up, twist you up (Whaa?)\nWe done chopped you up, popped you up, boxed you up\n\n(Juvenile)\nI was wrong for a lot of shit that I'ma take to my grave\nContinuously whippin' niggas like a runaway slave\nMust was meant for me to be thuggin' - I stay in some beef\nBaby and Slim keep tellin' me, \"Juvenile, stay off them streets.\"\nI can't help - I draw attention; they be fuckin' with me\nI'm hot in the ass and can't get enough of these streets\nA lil' nigga in the Rolls screamin', \"Fuck the police!\"\nPeelin' out in front the club, about to duck to the east\nNow play yourself, you gon' find yourself by yourself\nIn a nice place ducked off with fucked up health\nI done been strucked and snuck, but never fucked and stuck\nMy life is four hundred degrees, so I bust 'em up\nStill stickin' to the g-code, Ree's, and B's\nQuit drinkin', but I will smoke some weed indeed\nAll they understand is my project English\nAnd if you don't like it, you can kiss my penis\n\n(Hook-4x (B.G.))\nWe done hit you up, lit you up, twist you up (Ooh!)\nWe done chopped you up, popped you up, boxed you up (Ooh!)\n\n(B.G.)\nI run the streets 'cause I'm real if it's daylight or dark\nYou a killer, nigga? (Eah?) Ain't no fear in my heart\nI'll go toe to toe with ya or take ya to war\nI'll even go K for K with ya - now make your choice\nBetter know when I'm in beef that I be creepin', nigga\nBetter know that I'm a snake, and I'ma sneak ya, nigga\nEach time I hit the corner, I be leavin' niggas\nMomma upset - can't even go on and grievin', nigga\nNothin' change - I'm on TV, I don't play with you niggas\nStill the same that'll spin broad day on you niggas\nAnd empty a hundred out that K\nWhere you're caught hangin' is where you're left stankin', ya heard me\nI've been in the game - niggas know what I'm 'bout\nSo many murders under my belt, I done lost count\nIf you wanna be another number, my nigga\nGo ahead, drop your nuts, and run up, my nigga\n\n(Hook (B.G.))\nWe done hit you up, lit you up, twist you up (Ooh!)\nWe done chopped you up, popped you up, boxed you up (Ooh!)\nNow, we done hit you up, lit you up, twist you up (Ooh!)\nNigga, we done chopped you up, popped you up, boxed you up (Ooh!)\nNow, we done hit you up, lit you up, twist you up (Ooh!)\nAnd we done chopped you up, popped you up, boxed you up (Ooh!)\nLook, we done hit you up, lit you up, twist you up (Whaa?)\nLook, we done chopped you up, popped you up, boxed you up (Ooh!)\n\n(Lil Wayne)\nHello, world\nI zip through fast in a yellow pearl drop Porsche Boxter\nYoung mobster, wild and obnoxious\nPop some in your dreadlocks - What? Me not no rookie, boy\nGlock cookin', boy\nI'll turn your forehead to a pussy, boy\nOff the gate, cousin, you niggas gon' make me stalk and spray somethin'\nSpark or lace somethin'\nPark the car, get out, walk, and spray somethin'\nTaught to stay thuggin' brought up in this shit that we call America\nAnd in my hood the laws are scared of us - we are too terrible\nIf I live to be old, it's a miracle\n'Cause the way a nigga hatin' or bitch plottin', the shit's hysterical\nThat's why I keep me two big guns on blast like a stereo\nCome to your burial and kill anybody else who care for you\nDon't blame me, society changed me\nYou haul white, you smash powder all night for the fast dollar\nCut off lights, we masked riders\nThe hood trash got us in a position we can't shake\nWith boys we can't break, and due to that you ain't safe, bitch\n\n(Hook (B.G.))\nWe done hit you up, lit you up, twist you up (Ooh!)\nNow, we done chopped you up, popped you up, boxed you up (Ooh!)\nLook, we done hit you up, lit you up, twist you up (Ooh!)\nNow, we done chopped you up, popped you up, boxed you up, nigga (Ooh!)\n(Did you see that?)\nWe hit you up, lit you up, twist you up (Ooh!)\nAnd we done chopped you up, popped you up, boxed you up (Ooh!)\n(Did you see that?)\nWe done hit you up, lit you up, twist you up (Ooh!)\nNow, we done chopped you up, popped you up, boxed you up (Ooh!)\nBoy, look,\nWe done hit you up, lit you up, twist you up (Ooh!)\nNow, we done chopped you up, popped you up, boxed you up (Ooh!)\nLook, we done hit you up, lit you up, twist you up (Ooh!)\nLook, we done chopped you up, popped you up, boxed you up (Ooh!)\n\n(B.G. (talking))\nNigga - we put holes in you bitch-ass niggas, ya heard me\nWe don't barrow nothin', don't fear nothin'\nAnd ain't nothin' you can do 'bout these (Hot! Hot! Hot!) Boy$, nigga\nLet 'em burn, nigga\nLet 'em burn, nigga\nB.Geezy, Lil Wheezy, Juvy, Two Tymer\n\n", "album": {"title": "Lights_Out_(2000)&&240", "genre": "Hip Hop", "year": 2000}}]