[{"title": "Still Lives Through", "href": "Still_Lives_Through&&4111", "artist": {"unique_name": "Little_Brother"}, "lyrics": "(Big Pooh)\nImagine, if this was the last rhyme I ever wrote\nThe last words that I ever spoke, NO\nI'm a keep servin' them\nCause its somebody out there, that never even heard of him\nOr the songs I be murdering\nNow it's a whole herd of men that follow in his footstep\nI did it all to get a rep and it worked out\nNow my sisters kirk out when they hear me on the radio\nHere we go with the steady flow\nI'm the best since sliced bread but you already know\nHow it goes when, me and Te be composing\nOver instrumentals 9^th holding\nWe not hot niggaz scolding, I told men\nBut it's only now you want to listen\nSo get close, please pay attention\nHere's a few things I'd like to mention\nThe B the I the G the P the O the O the H\nThe is none greater\nThe L the B the J the L\nIs here forever money so see me later\nStash away plenty sheets of paper\nShit is perfected and we hit the majors\nSee, I said you niggaz couldn't cage us\nThem mere feeble attempts was outrageous\nIt ain't a party till we hit the stages\nRapper Pooh signing off, see you in the funny papers\nHa, you can bet your life on it, you gon see me man come on\n\n(Phonte) (Busta Rhymes repeats, \"Oh my god!\")\nRock, Rock and you don't\nFreak, Freak and you don't\nTo the Beat and you don't\nIts unique and you don't\nYou think I will but I won't, stop\nThey think I will but I won't, stop\n\nRock, rock and you don't\nFreak, freak and you don't\nTo the beat and you don't\nIts unique and you don't\nBig Pooh and he don't stop\nAnd 9th Wonder he don't stop\n\n(Phonte)\nEven though, most of our albums are poorly promoted\nAnd all the magazines probably won't even quote it\nJ League never running or folding\nWe got tight to steal y'all spotlight and y'all won't even know it\nOne time for Big Pooh 'cause he quit eating steak\nAnd two times for 9^th Wonder 'cause he setting it straight\nAnd 3 times to that hoe from the 8-1-4\nThat moved in, got kicked out and caught on tape (ha, ha)\nJust a little bit of time, is all that we granted on this planet\nFor us to get our little bit of shines\nIf y'all want to get a line, then talk to BIG DHO\nCause ain't shit free but the spirit of my rhymes\nI hear it all the time, LB ain't on the same?\nSo innovative you the next best things, since, whateva\nI just laugh wit it, cause today's fan is tomorrow's rap critic\nOne day they giving you the thumbs up the next\nThey telling 9^th to go on switch his drums up the best\nIs what they expect, but why they won't let the music\nJust be what it is is anybody's guess, so ah\nIf y'all feeling this y'all ain't gotta analyze it\nThis shit is dope so we ain't changin' up\nMakin' money and our parents ain't ashamed of us\nAnd when I think about that I can't complain as much so let it rock.\n\nRaleigh gotta\nDurham gotta\nChapel Hill gotta\nGreensboro gotta\nHigh Point gotta\nGot a zone\n\nIts for all y'all man\n\n(Phonte) (Busta Rhymes repeats, \"Oh my god!\")\nRock, rock and you don't\nFreak, freak and you don't\nIts unique and you don't\nTo the beat and you don't\nThink I will but I won't, stop\nThink I will but I won't, stop\n\nRock, rock and you don't\nFreak, freak and you don't\nTo the beat and you don't\nIts unique and you don't\nThink I will but I won't, stop\nThey think I will but I won't, stop\n\nPhonte is the sho shot\nBig Pooh and you don't stop\n9th Wonder got the beat the sho' shot\nLB is on the beat and you don't stop\n\n", "album": {"title": "The_Minstrel_Show_(2005)&&6404", "genre": "Alternative Hip Hop", "year": 2005}}, {"title": "We Got Now", "href": "We_Got_Now&&4967", "artist": {"unique_name": "Little_Brother"}, "lyrics": "(Rapper Big Pooh)\nYe-yeah! One more time, one last number...\nChaundon, where you at, nigga?\nIt's the future right here, man\nWe startin' it right now... Let's get it goin', Big Pooh, UH!\n\nMy attitude real shitty, temper short\nMy mind cluttered like the streets of New York\nI ain't tryna take a 'L', 'cause I casually fought\nThis shit, real serious not casual sport\nLet time fly by as I pen these thoughts\nAnd I'm speedin through life wit my car in park\nAnd even in the day sometimes it's dark\nAnd that cloud hoverin low is not the worst part\nSecond guessin yourself, tryna remain sharp\nSee niggaz blowin' up who ain't got yo SPARK, uh\nAnd that alone is a burden to carry\nEither you'll get strong or you'll get buried\nAnd rap keep plenty room in the cemetery\nPull out your Blackberry's change yo itineraries\nYou see, you could be the shit today\nAnd tomorrow wake up, fame blown away!\nAnd homey on the real, ain't nothin' you can say\nThat's why I work hard now, got later to lay\nIn the sands on the beach, mixin drinks wit Belvy\nThe world's gon' remember my name, muhfuckaz!\n\nNow they heard some of yo songs, and peeped you from the side\nAnd watched yo videos and seen the car you drive\nCHILLLLL! - And we know what to expect my nigga\nDone seen it all before I ain't impressed, my nigga\nBut they heard some of our songs, and peeped us from the side\nAnd came out to the shows and seen us on the grind\nCHILLLLL! - And this is how we get down muhfuckaz\nWe don't care who got next, this is now muhfuckaz!\n\n(Phonte)\nI tried to work wit niggaz, don't wanna jerk them niggaz\nBut everybody's runnin' around thinkin' they murderers\nGave birth to niggaz, and when I burp them niggaz\nThe spit up old lines that I fed to them earlier\nAnd this is what the state of hip-hop is like\nI'm thinkin', \"Damn, this cannot be right\"\nAnd I agree that everybody's a biter\nBut if you Xerox my style, then that's infringin on my copy, right?\nIt's the bottom of the 9th with no extra innings\nAnd we all in the game tryna collect the pennants\nAnd from the, old school, I'm a direct descendant\nAnd y'all can feel it at the end of each sentence\n'Cause underground rap is just immense and gimmicks\nAn image they phone in for ten cents a minute\nI knew that since I entered, the rap game, my style\nWould have niggaz takin' it back, but what about now?\nI think about the youth and how their minds are so closed\n'Cause now \"Rap City\" look like \"Video Soul\"\nAnd that's a sad state of affairs\nBut no need to despair, 'cause we the next ones that's takin' it there, ya know!\n\n\nNow they heard some of yo songs, and peeped you from the side\nAnd watched yo videos and seen the car you drive\nCHILLLLL! - And we know what to expect my nigga\nDone seen it all before I ain't impressed, my nigga\nBut they heard some of our songs, and peeped us from the side\nAnd came out to the shows and seen us on the grind\nCHILLLLL! - And this is how we get down muhfuckaz\nWe don't care who got next, this is now muhfuckaz!\n\n(Chaundon)\nA note to my opponents, yeah, I got now\nAnd I always got next 'cause I cease every moment\nI'm an opportunist wit ambition\nKeep an eye on that number one spot before it wind up missin'\nAnd the heart of this bein is the art of MCin\nI feel I'm God wit the flow, 'cause people started believin, HUH\nSo what I'm cocky, who gon' stop me?\nTwist hoes, leave 'em knock knead, smile for paparazzi\nThis is how I get down\nGot a crib in every hood, so I'm always the hottest nigga in town\nHate it or love it, who fuckin' wit our music?\nYeah, y'all niggaz is the SHIT when it comes to bowel movements\nPooh showed and proved it, can't sleep on his game\n'Te converted all the currency with Foreign Exchange\nUp next to rock the booth iiiis a rapper named Chaundon\nThe Bronx Borough President wit' \"No Excuses\"\nDoubtin' me is foolish, don't ask who produced this!\nKnowin' damn well only 9th can do this\nIt's no secret, Lyor even know\nWhen me and Little Brother flow, it's guaranteed another video!\n\nNow they heard some of yo songs, and peeped you from the side\nAnd watched yo videos and seen the car you drive\nCHILLLLL! - And we know what to expect my nigga\nDone seen it all before I ain't impressed, my nigga\nBut they heard some of our songs, and peeped us from the side\nAnd came out to the shows and seen us on the grind\nCHILLLLL! - And this is how we get down muhfuckaz\nWe don't care who got next, this is now muhfuckaz!\n\n(*Crowd cheers*)\n\n(Phonte - Outro)\nOn behalf of myself, Phonte, Big Pooh, and 9th Wonder\nAnd the whole cast of \"The Minstrel Show\"\nI wanna thank y'all, for watchin this shit\nI ain't gon' front, only reason I took this job 'cause I need the money\nI don't need... yo, I ain't gon' front\nI don't give a fuck if UBN pull the plug on me, dawg, I-I gotta be real...\nY'all really wanna know how I feel about \"The Minstrel Show\"? (*crowd cheers*)\nY'all really wanna know how I feel about UBN? (*crowd cheers*)\nThese goddamn crackers get on my muthafu...\n(*Stand-by bleep*)\n\n", "album": {"title": "The_Minstrel_Show_(2005)&&6404", "genre": "Alternative Hip Hop", "year": 2005}}, {"title": "Say it Again", "href": "Say_It_Again&&9685", "artist": {"unique_name": "Little_Brother"}, "lyrics": "And now with The Minstrel Show update, with your correspondent... Jennifer Duvall\n\nHow's everybody doing, this is Sean Don, you know me; Jennifer Duvall\nI'm over here chilling with Little Brother right now\nAnd it's feel good, you see us\nI'm listening to The Minstrel Show (hahaha)\nYou ain't heard, it's the biggest colored show on earth\n\n(Rapper Big Pooh)\nI'm overweight, rap is fat to death\nObese when these beats catch wind of my breath\nAnd yes, you ain't heard you still rocking with the best\nI just saved y'all from taking a guess\nNot jeans, my dear\nYou ain't worthy to breathe my air\nOr stand tall in the pair I wear\nAm I making it clear\nAs the best to lay his head 'round here\nAnd no I'm not the heir apparent to whoever...\n\n(Phonte)\nThey never could out hit us (hit us)\nTried to think fast but never could out wit us (wit us)\nThe only thing they could ever do was outfit us\nWhen clothes fit strange\nI'm playin' Rick James\n\"Fuck yo' couch nigga!\"\nI'm comin' out with a bang\nStraight Tay, Pooh, and 9th with no middle man\nEverybody at the label asking \"will it bang?\"\nI say chill, 'just take a percocet or ritalin'\nNow, let the people sing\n\n10 G's a show\nWhylin' out with pretty Tony and O\n(We make'em wanna say it again, yeah, we make'em wanna say it again)\nBeats from Mr. Douthit\nFresh jeans, fresh clothes, and outfits (let me hear it)\n(We make'em wanna say it again, uh yeah, we make'em wanna say it again)\n\n(Phonte)\nI got so many rhymes, many styles to go with\nAnd my competition all the while be hoping\nThat I'll quit bringing the pain like Ibuprofen\nI can't dog, can't you see that the crowd is open\nI mean, mouths is open\nHands in the air, just so aroused and focused\nThis is a movement, nigga its bigger than showbiz\nThis is how I live it\nI love hip hop, I just hate the niggaz in it\n\n(Rapper Big Pooh)\nIt's like, I'm just another nigga rockin' the mic\nThat's way above average and take it however you like\nHowever despite I'm left to write\nTill my forearms get all tight\nAnd my fingers start cramping up\nPose ampin' up I'm standing, what\nY'all niggaz ain't man enough, chill\nAgitating like dandruff\nI ain't talking all tough, but them people keep saying...\n\nBig trucks and wheels\nDominican broads that's cookin' my meals (right papito) one time\n(We make'em wanna say it again, yeah, we make'em wanna say it again) check it out\nNiggaz copy my style\nBig Dho walking down the aisle (sing it to them)\n(\"She's your queeeeeeeen to beeeeee\")\nYeah, we make'em wanna say it again...\n\n(Rapper Big Pooh)\nAyo, they beggin' for a taste of it\nGet a plate, grab a cup or something, my nigga stop frontin'\nOn a mission, dudes still hunting\nSo stay out my way, act like you want something\n\n(Phonte)\nYo, my girl's a grown woman who ain't trynna get her eagle on\nShe'd rather be in bed gettin' her Keagel on\nIn and out, working the walls when the heat is on\nLike Mary J. or Tweet is on, now sing along...\n\nFresh clothes and cribs\nGimme a salad pass 9th the ribs\n(We make'em wanna say it again, ooh we make'em wanna say it again) now bring it back\nGetting what's finally mine\nSign of relief, 'cause we finally signed (I'm home niggaz)\n(We make'em wanna say it again, yeah, we make'em wanna say it again)\n\nSay it one more time for that girl named Pam Gram or that some black chic chick\nShe got me saying damn, damn\n(You make me wanna say it again, you make me wanna say it)\nNow say it one more time for my nigga named pretty Tony\nThat always come through it, the hoes that wanna know me (yeah)\n\n", "album": {"title": "The_Minstrel_Show_(2005)&&6404", "genre": "Alternative Hip Hop", "year": 2005}}, {"title": "The Becoming", "href": "The_Becoming&&6177", "artist": {"unique_name": "Little_Brother"}, "lyrics": "(Phonte)\nI went from niggaz tellin' me I really shouldn't rhyme\nTo droppin' a classic album muhfuckers couldn't find\nTook my respect, took lessons and took the time\nAnd if you want a success story, just take a look at mine\nI was blessed with the right components, so precise\n'Cause I write so tight within the moment\nAnd spit like my life depended on it\nI target you herbs\nOn some teleprompter shit I got you watching your words\nTay rhymes are real life, yours are so 'for instance'\nTaxin' these like no dependents\n12 bar courtroom drama with no co-defendants\nDon't beat it off, come to your senses\n\nHard rock, my block is where you better be from\nTop of the line, my team will never settle for crumbs\nAnd he's hated, but still rated 2nd to none\nI'm everything you wanna be but have yet to become\n\n(Phonte)\nIt all started back in '99 when time was hard\nNorth Carolina Central but we called it the yard\n'Cause niggaz wasn't trying to study abroad\nThey was trynna study a broad or two ir three up in the dorms\nMet my nigga Chaundon and I started to ponder\n\"Fuck this, I'mma quit the football team tomorrow\"\nDid shows around town and word got around that battling Tay\nWas like yelling 'spic' in Tijuana\nBuild my rep up, that's when Pooh and 9th stepped up\n9th was old school, Pooh was young and playing catch-up\nCool, 'cause he could still rock an instrumental\nOur first joints, yeah they was wack\nBut niggaz could hear potential in 'em\nHoning our skills for survival, hustling\nOur flyers passed out like mamma at revival\nThe real deal on how I repped my peeps\nYou ain't goin' find this in no press release\n\n(Hook extended)\nAnd \"he's shook\"\nThat's what your team is telling me, son\nStill hated, but still rated 2nd to none\nAnd Greensboro, 'cause that's the only 'boro I'm from\nI'm everything you wanna be, but have yet to become\n\n", "album": {"title": "The_Minstrel_Show_(2005)&&6404", "genre": "Alternative Hip Hop", "year": 2005}}, {"title": "Hiding Place", "href": "Hiding_Place&&5701", "artist": {"unique_name": "Little_Brother"}, "lyrics": "Where you gonna hide?\nRapper\nWhere you gonna hide?\nDilla Dog, Jay Dee\nWhere you gonna hide?\nElzhi\nWhere you gonna hide?\nPhonte\nAnother little brother presentation\nSending this out across the nation\n\nI'm a hell of a problem, nobody has the answer\nPooh be spreading out, like a body of cancer\nMy stanza, get it going like a car, (vroom)\nUsher in the new era, like this y'all (this y'all)\nI'm raw strip down, no minerals\nA distilled emcee, no chemicals\nNo subliminals\nA smooth criminal before the rape charge\nI, shake and bake, bring terror to your squad\nMy, peers ferocious\nI'm so focusing\nI pray to God that the world knows this\nNo one exposes flaws in your scheme dog\nMe and Dilla go hard, my Lord\nYou don't want know problems (problems)\nI'm a nigga that'll solve 'em (solve 'em)\nWithout a doubt, ya\nI'm in the booth, cold knockin' niggaz out\nTell my tales by word of mouth\nYa, you know me\n\nWhere you gonna hide?\nWhen the sun goes down, and the lights in the city get low\nWhere you gonna hide?\nWhen your peeps ain't around, and there ain't no place to go\nWhere you gonna hide?\nWhen the hood starts watchin, and the boys got they eye on your safe\nWhere you gonna hide?\nAin't nowhere to run, and there ain't no hiding place\n\nDon't compare me to jokes\nI'll strangle the air in your throat\nLike you jump from a chair and choke\nIn mid-air from a rope\nGot a big gun and carry a scope\nThe flair of the smoke\nKeep niggaz quiet like words that librarians spoke\nI'm arrogant, outlandish\nBlow your face out, and shake out the dandruff\nThe jakes wont make out the handprints\nI'm as real as it gets, with the steel and the clips\nBark and make niggaz duck, and kneel and do splits\n\nIt gets no realer than this\nIts Tay and Elzhi dropping that definitive shit\nThis should have been a double album commemorative disc\nCause hip-hop might need us\nAnd in your town, no telling where you might see us\nMy whole team coming through in tees and wife beaters\nOut, doin' their damn thing like beavers\nYo, its P to the H-O, I finish the job\nPlus my Dominican Broad\nMaking me chili con queso\n\nWork and plan a perfect verse\nThen burst like a person\nThat jerked from a circus cannon\nThen landed to the earth\nIt's me on the song, featured your fleet\nBreathing is strong\nIt's a gypsy reading a palm\nWith a drawn heater\nNever gone of the wrong reefer\nA bong chief, of the don ballest\nAs long as the bronze is bronze sneakers\nGot ways of a thuggie, thinking I won't come and get you\nDressed like a gun with pistols, and AK's in a bundle\n\nAnd Tay is blazing it lovely, 'cause I'm one with the game\nSo I sat back, chilled, dropped Foreign Exchange\nAnd a lot of rap niggaz got lost\nHeard Phontigga carrying tunes and assumed he don got soft\nThey didn't understand it was my next direction\nSo I'm playing postman and addressing questions\nLike, yes I'm still a LB, no I'm not leaving\nNo I don't eat meat, but yes I'm still beefin\nBut all these wack niggaz putting records out\nThis is all live nigga, check it out\nLb, S bill a fam on a mission\nAnd I ain't worried about people biting \"Minstrel Show\"\nThey still teething on \"The Listening\"\n\nWhere you gonna hide?\nWhen the sun goes down, and the lights in the city get low\nWhere you gonna hide?\nWhen your peeps ain't around, and there ain't no place to go\nWhere you gonna hide?\nWhen the hood starts watchin, and the boys got they eyes on your safe\nWhere you gonna hide?\nAin't nowhere to run, and there ain't no hiding place\n\n", "album": {"title": "The_Minstrel_Show_(2005)&&6404", "genre": "Alternative Hip Hop", "year": 2005}}, {"title": "Not Enough", "href": "Not_Enough&&3245", "artist": {"unique_name": "Little_Brother"}, "lyrics": "(Phote)\nWe spent the last year writing rhymes doing shows and chopping records\nAnd traveled all around the world to spread the message\n'Cause ain't no rest for the weary when it comes to my team\nWe only sleep on December the 32nd\nDJ's dissin' the album before they check it\nDealin' with their managers and program directors\nAnd even though I try not to stress it\nSometimes it feels like a waste of time and not worth the effort\n\n(Rapper Big Pooh)\nNaw but I won't let it\nPut a block on my team's hustle for a second\nPoobie keep it rushing, as long as Tay and I on the mic\nAnd 9th is on the percussion, these fronting dudes can't say nothing\nIt was only time for we finally spoke out\nPlenty cold nights ahead I suggest you get your coats out\nNo time to stand here lips poked out we bout to closeout that stored up doubt\nAnd keep it moving\n\n\nSeems like whatever I do\nIt's not enough for you\nI paid the cost and gave you my all\nBut you still want more\nI'm still standing right here\nBut it seems so unfair\nThat I sacrifice and give you my life\nBut you still want more\n\n(Phonte)\nBeen a long time comin'\nBut damn we just made it\nSo much to discuss so frustrated\nYes, I must say that the industry lost touch\nRadio better play this, 'cause Tay's style is nuts\nAnd y'alls is just dated\nIts history in the making\nWhen I write its for all of N.C., call me the state pen\nAnd now I'm making my name for those who hate that I'm\nStaking my claim just like Nationwide\nRadio, them suckas never play us\nTook our wax to the station and they straight played us\nThat's how the game got contaminated\nAnd now they sayin' we're at fault like the San Andreas\n\n(Rapper Big Pooh)\nAnd still trying to play us\nBut not spin the record or disc\nI got a fire burning deep that will not be extinguished\nI mean this from the depths of my soul\nPeople no more mind talk let my heart take control (oh)\n\n- Listen to this, just listen to this\n- Uh, right now, we gettin' it right now and now we gonna give you what you want\n- Just listen to this, just listen to this\n- I'm talking you, you, you, and all of you in the back\nAnd in the middle in the front, come on\n\n(Rapper Big Pooh)\nHomie, this here is pain\nI'm speaking on this pitiful thing\nThat's now forever stained in the banks of my memory\nYou probably like, 'they running this, b'\nBut naw, I'll doubt we'll ever be\nIts funny cats don't remember me\nAnd don't think 'cause we all here that it's gonna be all we\nOr all love, it's all bugged\nTrying to mask them emotions with pounds and hugs\nNo more I say gotta make'em pay\n'Cause I'm tired of getting stepsonned in the worst way just wait\nThem chips on my shoulder getting attached\nWhen my pockets catch up Pooh's never turning back\n\n(Phonte)\nYo I ain't never heard a act to blow and go global\nThen come back home and still be called local\nAnd when we onstage the people they all front\nDope beats, dope rhymes what more do y'all want (shout it out)\n\n", "album": {"title": "The_Minstrel_Show_(2005)&&6404", "genre": "Alternative Hip Hop", "year": 2005}}, {"title": "Cheatin'", "href": "Cheatin%27&&8314", "artist": {"unique_name": "Little_Brother"}, "lyrics": "(Phonte as Percy Miracles)\nBaby... we've been together for so long...\nAnd I just don't know... why you continue to do me\nThe way you wanna do me?\nI checked your cell phone... and I saw a number\nI didn't notice he called on that...\nSo somethin' tells me... either yo' mama done change her number...\n*Inhales* or you CHEATIN' *exhales*\n\nHow could you do this to me after all these years?\nGirl I don't know what in the fuck you think this is\nAlways tryna play around and tell lies while you are not at home\nSorry girl, you busted now, I saw the number on yo' cell phone, you cheatin'\n\nYou was cheatin' (yes you was), caught you creepin' (yes I did)\nTo the window, to the wall, skeet-skeetin' (you triflin' hoe)\nHeavy breathing, now I'm leavin'..\n(I got to walk out right now, 'cause I just can't take it girl, you was cheatin')\nYou was cheatin' (yes you was), caught you creepin' (yes I did)\nTo the window, to the wall, skeet-skeetin' (you dirty bitch)\nHeavy breathing (yes you was), now I'm leavin'..\n(I got to get outta here, 'cause I just can't take it no more\n\n(Mr. Diggs - Ronald Isley impersonator)\nLa-la, Percy don't you know-ho...\nWe been through this type of thing before-hore\n\n(Percy)\nOh Lord\nBut this time it's different, I know I ain't trippin'\nI looked in the cell phone, saw another man's digits\n\n(Mr. Diggs)\nNow, you must be trippin', 'cause you know it's not the same\nShe caught you from her mama house and maybe her number changed\n\n(Percy)\nNo, she got the two-thousand minute plan, callin' her minuteman\nI'm packin' the kids up, we gone in the minute babe (no don't do it Percy)\n\n(Chorus - (Percy) (Mr. Diggs]]\nYou was cheatin' (yes you was), caught you creepin' (yes I did)\nTo the window, to the wall, (to the wall) skeet-skeetin' (you cold busted)\nHeavy breathing (out the door), now I'm leavin'..\n(No mo' checks and no mo' CHILD support) (Oh my gawd-hod)\nYou was cheatin' (Fuck that..), caught you creepin' (I can't believe she would do this to me)\nTo the window, to the wall, skeet-skeetin' (Give her another chance, Percy)\nHeavy breathing (She don't deserve it), now I'm leavin'... (no, no, no she don't)\n(Let me count the ways that I loved you girl)\n\n(Background singers - Bridge)\nI say, one, two, three, four, five\nReally wanted you to be my wife\nThen I say six, seven, eight, nine, ten\nReally wanted you to be my friend\nThen I say eleven, twelve, thirteen, fourteen, fifteen\nCan't, think of nothing that rhyme wit', fifteen\n\n(Percy (Mr. Diggs))\nOh Lord, the background singers just messed up\n(Well, Percy I don't give a fuck)\nWell, tell me where we gonna go\n(We're going to \"The Minstrel Shooooooooooow\")\n\nYou was cheatin' (yes she was), caught you creepin'\nTo the window, to the wall, skeet-skeetin'\n(We're live at the show and I DON'T know where to go, baby)\nHeavy breathing, now I'm leavin'..\n(Ooh, I'm so hurt, I'm so tired, I don't know what to do\nI'm so turned around and I just turn around of seein' faces\nAnd then +I+ just wanna bawl out...)\nYou was cheatin' (I know how you feel Percy), caught you creepin' (You don't understand)\nTo the window, to the wall, skeet-skeetin' (Believe me, I know how you FEEL-EEL)\nHeavy breathing (How do you know?), now I'm leavin'..\n(You know in your heart, that you, don't, want, nobody but, HERRRR)\n\nWhoo! Thank you! (thank you, thank you everyone)\nThank you \"Minstrel Show\"\n(Thank ya) thank ya, I'm Percy Miracles, Mr. Diggs...\nYou sound so wonderful, baby (*Mr. Diggs harmonize*)\n\n\"Hi, this is Devon {?} out of Brooklyn, New York\nAnd you're watching the biggest colored show on earth\n'The Minstrel Show'\"\n\n", "album": {"title": "The_Minstrel_Show_(2005)&&6404", "genre": "Alternative Hip Hop", "year": 2005}}, {"title": "Sincerely Yours", "href": "Sincerely_Yours&&9899", "artist": {"unique_name": "Little_Brother"}, "lyrics": "(Big Pooh)\nImagine, if this was the last rhyme I ever wrote\nThe last words that I ever spoke, NO\nI'm a keep servin' them\nCause its somebody out there, that never even heard of him\nOr the songs I be murdering\nNow it's a whole herd of men that follow in his footstep\nI did it all to get a rep and it worked out\nNow my sisters kirk out when they hear me on the radio\nHere we go with the steady flow\nI'm the best since sliced bread but you already know\nHow it goes when, me and Te be composing\nOver instrumentals 9^th holding\nWe not hot niggaz scolding, I told men\nBut it's only now you want to listen\nSo get close, please pay attention\nHere's a few things I'd like to mention\nThe B the I the G the P the O the O the H\nThe is none greater\nThe L the B the J the L\nIs here forever money so see me later\nStash away plenty sheets of paper\nShit is perfected and we hit the majors\nSee, I said you niggaz couldn't cage us\nThem mere feeble attempts was outrageous\nIt ain't a party till we hit the stages\nRapper Pooh signing off, see you in the funny papers\nHa, you can bet your life on it, you gon see me man come on\n\n(Phonte) (Busta Rhymes repeats, \"Oh my god!\")\nRock, Rock and you don't\nFreak, Freak and you don't\nTo the Beat and you don't\nIts unique and you don't\nYou think I will but I won't, stop\nThey think I will but I won't, stop\n\nRock, rock and you don't\nFreak, freak and you don't\nTo the beat and you don't\nIts unique and you don't\nBig Pooh and he don't stop\nAnd 9th Wonder he don't stop\n\n(Phonte)\nEven though, most of our albums are poorly promoted\nAnd all the magazines probably won't even quote it\nJ League never running or folding\nWe got tight to steal y'all spotlight and y'all won't even know it\nOne time for Big Pooh 'cause he quit eating steak\nAnd two times for 9^th Wonder 'cause he setting it straight\nAnd 3 times to that hoe from the 8-1-4\nThat moved in, got kicked out and caught on tape (ha, ha)\nJust a little bit of time, is all that we granted on this planet\nFor us to get our little bit of shines\nIf y'all want to get a line, then talk to BIG DHO\nCause ain't shit free but the spirit of my rhymes\nI hear it all the time, LB ain't on the same?\nSo innovative you the next best things, since, whateva\nI just laugh wit it, cause today's fan is tomorrow's rap critic\nOne day they giving you the thumbs up the next\nThey telling 9^th to go on switch his drums up the best\nIs what they expect, but why they won't let the music\nJust be what it is is anybody's guess, so ah\nIf y'all feeling this y'all ain't gotta analyze it\nThis shit is dope so we ain't changin' up\nMakin' money and our parents ain't ashamed of us\nAnd when I think about that I can't complain as much so let it rock.\n\nRaleigh gotta\nDurham gotta\nChapel Hill gotta\nGreensboro gotta\nHigh Point gotta\nGot a zone\n\nIts for all y'all man\n\n(Phonte) (Busta Rhymes repeats, \"Oh my god!\")\nRock, rock and you don't\nFreak, freak and you don't\nIts unique and you don't\nTo the beat and you don't\nThink I will but I won't, stop\nThink I will but I won't, stop\n\nRock, rock and you don't\nFreak, freak and you don't\nTo the beat and you don't\nIts unique and you don't\nThink I will but I won't, stop\nThey think I will but I won't, stop\n\nPhonte is the sho shot\nBig Pooh and you don't stop\n9th Wonder got the beat the sho' shot\nLB is on the beat and you don't stop\n\n", "album": {"title": "The_Minstrel_Show_(2005)&&6404", "genre": "Alternative Hip Hop", "year": 2005}}, {"title": "Beautiful Morning", "href": "Beautiful_Morning&&4985", "artist": {"unique_name": "Little_Brother"}, "lyrics": "(Rapper Big Pooh)\nOpen my eyes to a new day, spreading my wings\nTaking shots fo crown 'cause I'm going through things\nCoattails getting heavy 'cause I'm living my dream\nI'm trying to school these young niggaz it ain't all what it seems\nI still struggle just like you, and I still hustle just like you\nBut it just so happens that Big Pooh doing what he love to do\nGet back on my work, 'cause I was penning on this piece last night\nThat'll drive these niggaz berserk\nTiggalo hit me up, \"Pooh its time to murk\"\nThrow on a pair of sweats, A-1's, white shirt\nHeaded back to the shop, back to the spot where the hits keep coming\nStack them up like bricks, you can call me the mason of shit\nFoundation has been rock solid no replacing, ya dig?\nNo replacing my nig, on everything that I live\nWe gonna let this bitch ride to our trains collide\nOr we fall off track, and ain't no bringing me back\nAnd everything that go for you the same applies to Pat\n\nCause even though the birds ain't singin' and the sun ain't shinin'\nIt looks like a beautiful morning\n\n(Phonte)\nEach day's another chance to do the things I could've\nDone the day before, but I didn't and I known I should've\nSo I say a prayer for the gone for gooders\nWho left this world, then kiss my girl \"good mornin', shuga\"\nAnother sunrise, and as much as I would love\nTo roll over on you I cannot do it because\nThe good Lord I prayed to him\nAnd he said, \"Niggaz is listening now\"\nSo I better have something to say to 'em\nSo I'mma tell 'em how it went down, man\nDoin' shows for free goin' outta town, man\nThe way I almost broke down and, got a 9 to 5\n'Cause I had more press than the soundscans\nThis is the price that I pay for this music\nAnd every word that I write is a testament to it\nAnd if I had to go back, I wouldn't change a thing\nWouldn't re-cut it, re-edit, or change a frame\n'Cause it would not be fair, to turn my back on the struggle\nWhen that exact same hustle got me here\nTold niggaz for the getup, we three the hard way\nAnd Broadway's the only place you'll ever throw a set up\nSpeechless is all you'd be if we ever met up\nI survived far to much now to ever let up, motherfucker\n\n(Hook) - repeat\n\n", "album": {"title": "The_Minstrel_Show_(2005)&&6404", "genre": "Alternative Hip Hop", "year": 2005}}, {"title": "Lovin' It", "href": "Lovin%27_It&&6411", "artist": {"unique_name": "Little_Brother"}, "lyrics": "Oh we get started up one more time\nI got the number down right here, I'm looking at it\nI couldn't believe she would do me like that P\nI just don't understand it dog, can't understand it\n\nLadies and gentleman\nWanna welcome y'all back to \"The Minstrel Show\"\nThank y'all for tuning in; y'all keep watching a lotta the station\nBut y'all touring us right now\nAnd it feels so beautiful\nPerforming at black face tonight!\nIt's my nigga, Joe Scudda\nComing up a little bit later on in the show\nI just wanna thank y'all for just tuning in\n\nIt's like this yo...\n\n(Phonte)\nYo, when 'Te pulls his verses out\nPromoters pull their purses out\nThat, money for a purchase out\nThe charge card that they swipe for the worst amounts\nCause this is business, not personal\nThought I would switch my personnel\nLike Big Doe and Big Pooh would be the first to bounce\nBut y'all, niggaz is boring me, y'all never gon' change\nAnd please, join a sorority, go step your game up\nY'all boys ain't ready for damage, you need extra planning\nYou in the game, but you off-size and gotta extra man\nAnd I'm the coach doing your reprimanding\nI got a team to run, boy respect my standards\nAnd when I'm on the mic y'all should expect the grandest\nShowing lyricism ever let 'em know who your man is\nIt's Phonte (a ch- a ch- a ch- a check it now)\n\nDon't stop, can't stop, yes I wanna\n(So gutter)\nCan't stop, won't stop, yes I wanna\n(Little Brother)\nDon't stop, can't stop, yes I wanna\n(And all across the world, the fly ladies and girls, tell me they lovin' it)\nCan't stop, won't stop, yes I wanna\nDon't stop, can't stop, yes I wanna\n(East Coast say they lovin' it)\nCan't stop, won't stop, yes I wanna\n(Midwest say they lovin' it)\nDon't stop, can't stop, yes I wanna\n(All worlds say they lovin' it)\nCan't stop, won't stop, yes I wanna\n\nIts rapper Big Pooh!\n\n(Big Pooh)\nI got a prob with, niggaz speaking gossip\nTalkin' bout what you know, nothing it is nonsense\nThat's a Bronson, Charlie take precaution\nGet you sold on the block, no not an auction\nDearly departin'\nI'm not a G, but I move like they move\nWith a head full of smarts man\nHere these niggaz go rambling\n'Cause they don't know about the business we be handling (But let 'em know!)\nConstant hits keep 'em scrambling\nTill the stores, till the shelves dismantlin' (And?)\nAnd what's that joint 9th sampling?\nPooh and 'Te on the mic, them bastards them, (Damn!)\nAnd your women, we attractin' them\nAnd if you ever wanna know what's happening\nWe tell em\n\nDon't stop, can't stop, yes I wanna\n(It sounds so good)\nCan't stop, won't stop, yes I wanna\n(It's so hood!)\nDon't stop, can't stop, yes I wanna\n(From state to state, them boys making the papes, and yeah we lovin' it)\nCan't stop, won't stop, yes I wanna\nDon't stop, can't stop, yes I wanna\n(West Coast say they lovin' it)\nCan't stop, won't stop, yes I wanna\n(The East Coast say they lovin' it)\nDon't stop, can't stop, yes I wanna\n(Southwest say they lovin' it)\nCan't stop, won't stop, yes I wanna\n\nIt's Joe Scudda!\n\n(Joe Scudda)\nI wake up every morning, holding my dick\nGoing through life like I know I'm the shit, ya ain't fucking with me\nSo why try? Why go that route?\nWhy take that street? You can't take that heat?\nMan your whole flow weak, we will take that beat\nPut our own words on it, we will make that street\nTo the crowds and the masses, and all I ask is\nDon't settle for the average, rap cabbage\nHeads; yeah you heard what I said, we the best here\n'Cause our worst days be better than your best years\nWe your worst fears\nSo get up, get out, and get somethin'\nMan, its only getting worse here\nJoe Scudda, little brother, man we family\nAnd we here forever so understand me\n\nDon't stop, can't stop, yes I wanna\n(Check the realness)\nCan't stop, won't stop, yes I wanna\n(If you can feel this)\nDon't stop, can't stop, yes I wanna\n(Doing shows and videos, collecting ?)\nCan't stop, won't stop, yes I wanna\nDon't stop, can't stop, yes I wanna\n(9th wonder say he lovin' it)\nCan't stop, won't stop, yes I wanna\n(Big Pooh say he lovin' it)\nDon't stop, can't stop, yes I wanna\n(J. League say they lovin' it)\nCan't stop, won't stop, yes I wanna\n(Everybody say they lovin' it)\nDon't stop, can't stop, yes I wanna\nCan't stop, won't stop, yes I wanna\n\n(Chorus fades to end)\n\n", "album": {"title": "The_Minstrel_Show_(2005)&&6404", "genre": "Alternative Hip Hop", "year": 2005}}, {"title": "Slow it Down", "href": "Slow_It_Down&&2376", "artist": {"unique_name": "Little_Brother"}, "lyrics": "This some grown man shit right here\nListen\n\n(Rapper Big Pooh)\nI'm trying to man up see what's really good with you\nGentleman's approach, not bring it hood to you\nSame things that you hear everyday like\n\"Hey ma, hey boo, baby what's your name\"\nPlease pull up a seat, I'm so glad you came\nMy mother call me Thomas you can do the same\nDamn it's so refreshing when you calling out my name\nBeen Pooh for so long it doesn't sound the same\nMy occupation rap and I make a little change\nI see you not impressed with what this life brings\nFinished school, got a job, girl do your thing\nIt's a lot of independent women wanna be claimed\nMarry into money or marry into fame, or at least give birth to a check\nWIth all due respect lets two-step in the name of like\nWho says we gotta do the waltz all day and all night, it's like\n\nIf love is not enough\nWe don't have to rush\nCome around, I'll slow it down just you\nLady you should be\nRight here next to me\nCome around, I'll slow it down just for you\n\n(Rapper Big Pooh)\nWe can go to the movies\nI'll take you to the park and promise to have you home before the lights go out\nSteady asking you questions what your life about\nOh and me, mine's everything I scribe about\nNo doubt this my life and\nDedicated to this witting sacrificing everything for it\nWasted time I can't afford\nSo if it ain't you/then you know I'm cooped up to the record...\n\n(Phonte)\nI'll scoop you up in me Porshe, sike\nYou know I got a Nissan\nThat I'm still paying for, still got a lease on\nBut it don't matter 'cause that ain't my aim to get you\nI got fame, but you know that just ain't the issue\nBecause you're looking like a woman of virtue\nSo well-rounded, no wonder your're in my circle\nAnd normally you probably wouldn't give me the time of day\n'Cause Tay got rhymes, but no he ain't got time to waste\n\n(Phonte)\nSometimes I think I'm from another world (preach)\nWhen I'm trynna tell a woman just exactly where I stand that (aight)\nI want a girl, when I want a girl\nAnd when I don't want a girl, I want a girl who understands that\nAnd that's some hard shit to explain\nTo a woman that's in love with you, it's a pitiful thing\nUntil I had to figure\nThat I don't wanna play around, but I don't wanna settle down\nAnd that's a man's dilemma, 'cause every man remembers\nHow his daddy and his uncles did it\n'Cause more than likely that's the way they're gonna do it\nI know it sound fucked up and most wont admit it\nBut yo, I gotta face it 'cause I know I'm living through it\n'Cause when the party stops and niggaz get old\nAnd the chain and the cars and the houses get sold, and that\nOther side of the bed gets cold, you don't wanna be alone\nSo girl I'm trynna hold you...\n\n(Vamp Out)\nOh baby (Take it slow, take it slow, take it slow, take it slow)\nWhat you need to do is\nTake it slow with me\nSlow it down a little bit (Take it slow, take it slow, take it slow, take it slow)\nWe don't have to rush into anything serious\n(Take it slow, take it slow, take it slow, take it slow)\nNo we don't, take it from me (Take it slow, take it slow, take it slow, take it slow)\nMy name is Percy and I make miracles if you take it slow with me baby\n(Take it slow, take it slow, take it slow, take it slow)\n\n", "album": {"title": "The_Minstrel_Show_(2005)&&6404", "genre": "Alternative Hip Hop", "year": 2005}}, {"title": "Watch Me", "href": "Watch_Me&&3564", "artist": {"unique_name": "Little_Brother"}, "lyrics": "LB B'ness\nYeah, I go by the name of Khrysis (My nigga Khrysis on the beat)\nOne half of the Away Team\nAnd right now, you in tuned to the biggest colored show on earth...\nThe Minstrel Show nigga\n\n(Rapper Big Pooh)\nI can't afford to not record\nSo I call my nig' Khrysis tell him hit the boards\nThen I call Tay put the pedal to the floor\n'Fore we do the shop gotta stop by the store\nI'm on my knees gotta go to the Lord (Dear Father)\nI pray to you these niggas gon' pay for it\nAll them times that I went ignored\nSo what it wasn't 20 but still I scored\nMy heart still scorned and my mind is focused\nSo this, serves as a warning to protest\nAny verse disperse is sicker that the first and\n'S no treatment for this disorder\nCarolina's number one reporter\nA nigga who's back with a vengeance better run for the border (run)\nOr head for the hills or duck and seek cover\nWho else gon' make it hot this summer, its LB nigga...\n\nThey can't stop me, naw they can't stop me\nThey keep playing', keep sayin' I'm cocky\nThey keep tryin' but too tired to top me\nTheir best bet is to fall back and watch me\n\nThey can't stop me, dawg they can't stop me\nThey keep playing', keep sayin' I'm cocky\nThey keep tryin' but too tired to top me\nTheir best bet is to fall back and watch me\n\n(Phonte)\nUh, (whoo) ain't no need in gettin' teary eyed\nTay's the illest, point blank period\nPlus I got niggas, in DC\nThat'll hit you for 3G's and a box of Yum's carry out\nOutlook lookin' scary now\nThey was frontin' before but now they seein' that we serious\nThis ain't a peace talk, so muhfucka save your sweet (suite) talk\nFor reservations at the Marriott\nThey say birds of a feather often flock together\nBut me and Big Pooh rock together\nAnd if not forever\nI'mma reach to the sky, and keep flyin' high like we got propellers\n'Goddamn, y'all boys doin' it', they stop to tell us\nAnd if God propel us to the top, I won't go pop (pop)\nNo need to act a fool in public\n'Cause when you, ego trip you just lose your luggage and well...\nI ain't got no time top play with 'cha\nI'm Phonte, international stage ripper done\nMade friends and made figgas\nWhile you stuck on the front porch\nMad, like you fixin' ta shave Mister (you fixin' to shave)\nThat's reality, so color me purple\nMy name in history, nigga that's what I work for\nBetter keep it moving like the laws of inertia\nBefore these Carolina boys come hurt 'cha\nBetter tell 'em 'bout it...\n\n-And now The Minstrel Show is proud to present... Jazzy Jeff (Jeff Jeff Jeff..)\n(Scratching)\n-Khrysis on the board with--with the heat\n-Fuck that, I got your head still bobbin and my verse to be rhymed\n(Scratching)\n-And to my man... Jaaaaaazzzzzzzy... Jeff (Jeff Jeff Jeff)..\n-Rap--Rapper Pooh, Justus League\n-All my real life niggas...\n\n", "album": {"title": "The_Minstrel_Show_(2005)&&6404", "genre": "Alternative Hip Hop", "year": 2005}}]