[{"title": "Best Friends", "href": "Best_Friends&&4807", "artist": {"unique_name": "Mac"}, "lyrics": "You was my nigga now we beefin'\nI'm bustin' at you, you bustin' at me\nAnd it won't stop till we both sleepin' (2x)\n\n(First Verse)\n\nWe was claimin' the same hood fucked the same bitches\nAnd they knew, if I hit it you had to hit it too, we was cruel\nYou was wit me when I first pulled the trigga\nYou tried to shoot two, but your gun jammed so we pulled off, remember?\nI headed by your Mama house, for a couple of days\n'Cause the niggas we was beefin' with, knew where I stayed\nWe was some down South niggas,\nBoot in the mouth niggas\nThe wrong route niggas\nTypical niggas\nWe'd just make a lil' dollar, sellin' weed to the needy\nEverything be fifty/fifty ain't no need, for bein' greedy\nYou my dog, ha? So that's how we played it\nNiggas who hated, we rushed and demonstrated\nWhy we ain't to be faded\nOn this mission with get money, power, and bitches\nI would ever come along with these riches that's if nobody snitches\nI do a bid for you, take care of your kid for you\nBut damn, look what these pussy niggas done did to you\n\n(Bridge One)\n\n&lt;Phone ring&gt;\nHello?\n(Yeah, nigga what's happenin'?)\nWhat's happenin' wit'cha dogg?\n(What's happenin' with you nigga, nigga talk about you got some\nBeef wit me nigga)\nBeef wit you? Nigga you know I'm a real nigga,\nIf I had some beef with you I'd come to ya like a man,\nIt ain't like that between us, what it is is, you talkin' to these\nNiggas, and these niggas got you...\n\n(Verse Two)\n\nThem niggas told you I blew up and I forgot about us\nThe same niggas who was with you, and afraid to bust\nHow could you listen to these niggas? When they mean no good?\nMuthafuckas ain't even from our hood\nAnd now you snortin' furl with em\nOff in that World with em\nFather forgive him he dancin' to some other rhythm\nEver thought that we could work it out?\nWe would meet,\nBut as long as you with them niggas I be with that heat\nAnd that's deep,\n'Cause I made a promise to your mama when we was only 12\nI would deliver you from evil and keep you alive and well\nGuess I gotta disappoint her, but you leave me no choice\nCallin' my crib with this \"Murder, murder\" tone in your voice\nWhat I'm a bitch or somethin'?\nI used to fight for you,\nUsed to let you stay at my Mama crib when shit just wasn't right for you\nLook what you do me in return\nI guess I played with fire, so eventually it burns\n\n(Bridge Two)\n\nHello?\nHello?\nMan, this nigga done fuckin' hung up on me.\nY'all think that nigga serious?\n\nIt's World War nigga\nOnce again, it's the fuckin' murder prince\nThe ghetto commando, representin' niggas\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Lockdown (Remix)", "href": "Lockdown_(Remix)&&199", "artist": {"unique_name": "Mac"}, "lyrics": "Mac talking:\n\nI'ma send this out to my nigga Soulja Slim\nMy nigga Cold Jack, my nigga Curve\nMy nigga Ween just touched down\n\nI was on my way upstate, for felonies, Mac would never see\nThe sunshine, these good old times, it's haunting me\nMy family is wanting me to break free\nPlus it's looking as if I'm about to die, in the arms of the justice\nPlotting my escape, before I made it to the gates\nThinking I'ma break, no matter what the shit takes\nThe maximum incarceration is what they got me facing\nI'm having thoughts of pacing and masturbation\nLaying up in a cell, never seeing females\nReminiscing about the skins I gave hell, oh well\nCourts ain't even trying to hear my pleases\nYelling you gonna get parole when hell freezes\nA double murder is what I got to explain to God\nWith no holds barred, it's hard, my mind is forever scarred\nMercy on a soldier, I'm seeing things Nostradamus couldn't see\nWhen all I really wanna be is free nigga\n\nThis is for my people locked down\nHold you heads up and stand your ground\nOn the block it's the same struggle\nThe cops put a bad lock on the hustle\nThey hate to see the niggas buckle\n\nMy baby girl is pregnant with a future Mac\nWaiting for me to come back, but old judge ain't tryin' to hear that\nHe rather see me locked in this rage, in a two man cage\nA straight rage, I'd rather be on stage\nInstead I'm in the pit, over some shit, I didn't commit\nIt was the niggas I was with, but I'm silent\nIts funny how Lucifer can seduce ya\nThese so called niggas be on the Seas of Madusa\nIts funny how time walk, when they be in the slammer\nFacing the type of sentences you can't correct with grammar\nAnd I'm dealing with these lifers, some of these niggas find me attractive\nThey be trying to bend me over backwards, but bitch I ain't having it\nYears add on, every enemy I shank, penetentary ain't what you think\nI wanna be free, wishing I could strangle up all the jurors and prosecutors\nBut I'm trapped with lots of losers\n\nIt's been 9 months of pain, in this ball and chain\nStill thinkin' about them days, I was living vain, ain't it strange\n'Cause I'd give anything to move on\nAnd play a game of peek-a-boo with my newborn\nI'm seeing niggas take they own lives under pressure\nYou come back here with attitudes, niggas gonna test ya\nI'm lookin' at the gates, ready to break, bitch I don't fake\nTell the judge I'll be rapping at his wake\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "If It's Cool", "href": "If_It%27s_Cool&&6525", "artist": {"unique_name": "Mac"}, "lyrics": "Verse 1 (Mac) :\n\nGirl look,\nFuck your man and them niggas he be hanging with\nNiggas he be slangin with, me I'm on some banging shit\nStrictly, now you with me or you wasting my time\nAnd time is valuable\nEspecially when you looking at it through this perpetual\nNow how you love that, I nothing nice with the ice\nMe without the mic is like the Orients with no rice\nBut look fuck that let's take a walk to where my truck at\nAll I wanna do is talk I ain't got to touch that\nBut that's game, before you know it she callin my name\nRunnin' round tellin' bitches she my main trying to get some fame\nAnd that's the game so you gotta respect that\nAnd respect my mind too 'cause I could get you naked in seconds\nMac-a-deezy if you open up I'ma slide in easy\nBut if it's cheezy let me smack you\nAnd call you all kind of bad words like bitch\nAnd smack myself too for trying to get with ya\nShould have knew you was stank\nAnd all you wanted was the tank\n\nChorus: Mac (Ms. Peaches)\n\nI don't wanna be ya man\nI wanna tap something if it's cool (It's Cool)\nBut if you not ask your girl what I asked you\nAnd when she tell about the way I freaked her\nHeres the number to my beeper\nLook\n\nI don't wanna be ya man\nI wanna tap something if it's cool (It's Cool)\nBut if you not ask your girl what I asked you\nAnd when she tell about the way I freaked her\nHere's the number to my beeper\n\nVerse 2 (Mac) :\n\nCheck it, look\nI meets bitches, I greets bitches, I freak bitches\nThem street bitches, even you sugar sweet bitches\nI neva eats bitches, I suck titties\nMight even fuck titties, now you with me?\nThen hit me on my hip and call me anytime don't even trip\nI guarantee it will be your gladdest night without the pimp\nI hope you not a noise maker, 'cause I live with moms\nHer rooms right next to mine and she be home all the time\nI'll pick you up at nine be looking and smellin fine\nIt's 7 o'clock now so you got some time\nI don't like wine, no I don't wanna dine\nBut I hope you like it from behind, cause that's my time to shine\nI work that spine like a chiropractor\nWhen I attact ya your big ol ass is what is what I got a knack for\nSo let me crack ya if it's cool, but if it's not then it is time to move\nBut before I excuse ask your girl what I asked you\n\nI don't wanna be ya man\nI wanna tap something if it's cool (It's Cool)\nBut if you not ask your girl what I asked you\nAnd when she tell 'bout the way I freaked heres the number to my beeper\nLook\n\nI don't wanna be ya man\nI wanna tap something if it's cool (It's Cool)\nBut if you not ask your girl what I asked you\nAnd when she tell about the way I freaked her\nHeres the number to my beeper\n\nVerse 3 (Ms. Peaches) :\n\nLook\nLet me explain this before we go any further\nI ain't really looking for a man it's another type of lover\nI need, 'cause I got my own ends, my own benz\nThe only thing you can do for me nigga is be a fuck friend\nSome of these niggas like to fall in love\nOnce they get a small taste of my voluptuous glove\nI'm saying this 'cause I wanna keep it real with cha\nAnd chill with cha, or even make a couple of mill with cha\nNow if you ready to get down and dirty\nI gonna hit you on your hip around lets say around 11:30\nSexy ass got me so anxious\nLet me whipe you with this ghetto angel, baby don't be a stranger\n'Cause I like my niggas rock hard\nAnd if you bout twirkin something nigga lets go to war\nI'm trying to see how many times you can catch a nutt\nSo you can really see it's cool to fuck, nigga it's cool to fuck\nI don't wanna be ya man\nI wanna tap something if it's cool (It's Cool)\nBut if you not ask your girl what I asked you\nAnd when she tell about the way I freaked her\nHeres the number to my beeper\nLook\n\nI don't wanna be ya man\nI wanna tap something if it's cool (It's Cool)\nBut if you not ask your girl what I asked you\nAnd when she tell about the way I freaked her\nHeres the number to my beeper\n\n(DJ scratches a sample of Tupac's How Do You Want It)\nTell me is it cool to fuck.\n\nMac talking:\n\nThe question is babygirl\nIs it cool to motherfucking do\nWhat I wanna do with you\nIf you want it let me do it with ya, ya heard me?\nBig Rise on the motherfucking beat\nAnd you know me The Mac-a-don is out this biatch\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "That's Hip Hop", "href": "That%27s_Hip_Hop&&6915", "artist": {"unique_name": "Mac"}, "lyrics": "Say man, niggaz say No Limit ain't hip hop.\nMan these old fake ass niggaz don't even know what hip hop is.\nWhy don't you show 'em what hip hop is?\nI'm 'bout to show a nigga what hip hop is. Nigga gimme a motherfuckin' beat\nOr something nigga. Motherfuckin' clap or something.\n\nMac:\nSo uh, who's ya favorite rapper\nDo he really got skills\nIs he real\nCan he flow like this nigga who murda kills\nIs he a fool\nOr you like him 'cause his single was cool\nHis video got bitches in bikinis hoppin' out the pool\nIs he complete\nDo he got tight lyrics and tight beats\nDo he write his own rhymes\nDo they sound like mines\nIs he one of these niggaz who's on\nOr is he just some other niggaz clone with no fuckin' style of his own\nYou probably like thugs\nYou probably like to fight in the clubs\nYou probably like him 'cause he talk about murder and drugs\nHe's such a thug\nWhat if a nigga told you he lyin'\nWould he still be yo' #1 or would you change yo' mind\nDid you listen to his LP or just one of his songs\nIs he type that just go on and on about being the don\nOr what he drive, where he live at\nTell him you don't wanna hear that\nYou around and GET jacked fuckin' WIT Mac!\n\nMac:\nSo who he sound like\nMystikal, Makaveli, or Bone\nWu Tang, Nas, or Jay Z\nMan, niggaz are crazy\nNiggaz will steal yo' style and fuck around be dissin' you\nKnowing you the main nigga they be listenin' to\nSo what you like his voice\nWhat he make you moist\nI mean what\nDid he sign ya autograph when you met him\nDid he look at you strange and call his bodyguard like you was tryin' to\nSweat him\nDid he try to fuck? Did you let him?\nDid he tell you he was diggin' you\nAnd after he fucked you he got rid of you\nPromised you he would send for you\nLet him penetrate ya\nThen you find out he ain't really got no paper\nNow ya saying he raped ya\nI know the game is tight, it's all right, it's so terrific\nWhat I write is so prolific when it's to a beat that I can live with\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Like Before", "href": "Like_Before&&873", "artist": {"unique_name": "Mac"}, "lyrics": "Mac talking:\n\nAnd I put that on my life nigga\nIt's 1999 niggas\nLook lets make it like before\nIt's World War\nOnce again on these...\n\nVerse 1: (Mac)\n\nWe been together for awhile, I'm diggin' your style\nYou sorta wild, but fragile, with a slugged smile\nLookin' like you ain't been plugged up in awhile\nThat's how I met you, comtplating on how I could get next to you\nIf you was mine I would never leave you, that's what you agreed to\nNever meant to mislead you, believed you\nWhen you told me you would make it all work\nPlus when you said it you was sportin' a mini- skirt\nNowa days I'll we do is fuss, I'll we do is cuss,\nI'll we do is fuck, we don't even make love\nI hate it when we fight like I hate a fake thug\nIn the process you kinda made me wanna escape love\nAs of tonight, I wanna make it right, wanna make just like the first night\nWhen it felt so right, you held me tight,\nTold me you would be there for the stretch and I said the same\nNow stop playin' games\n\nChorus: (Mac)\nAnd I don't wanna fight no more\nWe just can't seem to make it right no more\nYour love, I couldn't tell you what it's like no more\nBaby let's make it like before (let's make it like before)\nAnd I don't wanna fight no more\nWe just can't seem to make it right no more\nYour love, I couldn't tell you what it's like no more\nBaby let's make it like before (let's make it like before)\n\nVerse 2: (Storm)\n\nAt times it seems like we don't belong together\nAnd at the same time it seems like we meant for each other\nI'm stressin', cause after so long we been in this struggle\nIf worse comes to worse, you know I'm there for you 'cause I love you\nNothing's changed, in your driving range\nAnd if money could buy love your spending chump change\nThe house, the car, the money, jewlery, and clothes\nReally don't matter to me, it wasn't there before\nIf you know like I know, you better step it up and show me something\nCause all this fighting and fussing, it don't amount to nothing\nIt's hard times, and alittle more lies\nBaby just tell me what you feel inside, and we can ride the tides\nThis is my heart, you playin' with my life\nSee fucking hoes is your thing so you don't need a wife\n'Cause when Storm is feed up, I'm pissin' on you\nShittin' on you, and if you cross again bitch, I'm spittin' on you\n\nChorus: (Mac)\nAnd I don't wanna fight no more\nWe just can't seem to make it right no more\nYour love, I couldn't tell you what it's like no more\nBaby let's make it like before (let's make it like before)\nI don't wanna fight no more\nWe just can't seem to make it right no more\nYour love, I couldn't tell you what it's like no more\nBaby let's make it like before (let's make it like before)\n\nVerse 3: (Mac)\n\nWhen I'm alone in my room, sometimes I stare at the wall\nJust waitin' on your call, anticpating, pentrating your draw\nIt used to be a drug to me, makin' love to me all night\nHad me feeling like it was all right\nI know I'm wrong, most times we on the phone\nArguing about how long or when I'm comin' home\nI never meant to hurt you or make you cry\nForgive me for calling you a lie, killing your pride\nKnow you down for me, slang your ground for me,\nLet off a couple of rounds for me, when they over- stepping their boundaries\nAnd it's real to me when we walking and talking\nI made it possible for you to be parking the big cars\nSportin' these fine jewls and it's cool, we can't lose\n$200 dollars shoes, it's real to me\nYou feel that look, let's go ahead and walk these dogs\nAnd stop all this fighting, ya heard me?\n\nChorus: (Mac)\nAnd I don't wanna fight no more\nWe just can't seem to make it right no more\nYour love, I couldn't tell you what it's like no more\nBaby let's make it like before (let's make it like before)\nI don't wanna fight no more\nWe just can't seem to make it right no more\nYour love, I couldn't tell you what it's like no more\nBaby let's make it like before (let's make it like before)\nAnd I don't wanna fight no more\nWe just can't seem to make it right no more\nYour love, I couldn't tell you what it's like no more\nBaby let's make it like before (let's make it like before)\nI don't wanna fight no more\nWe just can't seem to make it right no more\nYour love, I couldn't tell you what it's like no more\nBaby let's make it like before (let's make it like before)\n\nNow want you break a nigga off, break a nigga off\nBreak a nigga off, break it off\nYou gotta a nigga rock hard, a nigga rock hard\nA nigga rock hard, now take it off\n\nNow go to war with me, Now go to war with me\nNow go to war with me, Now go to war with me\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Just Another Thug", "href": "Just_Another_Thug&&9799", "artist": {"unique_name": "Mac"}, "lyrics": "(C-Murder)\nSay Mystikal (say Mystikal nigga)&amp; MAC brah (Macadon)\nNiggas on tha streets can't do but love niggas like us\nSpittin' all that muthafuckin' real gangsta ass shit\nWe ain't playin' we mean what we say and say what we mean\nI thought you know (I'm just another thug nigga) you know what I'm sayin'\nThat's all I'm makin' forever boy\n\n(C-Murder)\nI'm known for runnin' tha streets and makin' moneys in bundles\nAn niggas love me for that gangsta ass shit I be comin'\nBecause I'm TRU 2 Da Game\nYou niggas feelin' my name\nAn if you FUCK UP I'ma have them bullets pourin' like rain\nYou can't hide, I'm suicidal, it's very vital to yo health\nThat my muthafuckin' message is felt\nBecause I mean what I say &amp; I say what I'm mean\nAn my dream is to seem like I'm swimmin' in green forever\nAn never fall or put my Tank on tha wall\nAn spit real shit and watch them niggas label 'em hits\nCause only TRU niggas last in tha game and get bigga\nSo what do you call yourself, I'm just another thug nigga\n(I'm just another thug nigga)\n\n(Chorus: Jamo &amp; C-Murder)\nYou don't wanna fuck with me (I'm justa another thug nigga)\nI'm just (I'm just another thug nigga) another thug nigga\nOh you don't wanna fuck with me\nI'm just another thug nigga (just another thug yeah yeah)\n(Repeat)\n\n(MAC)\n(So who we do this for C)\nI send this out thug niggas holdin' nikel bags on tha come up\nSwollow 'em when them folks run up\nWe speakin' in tongues\nTo y'all deep in tha slums\nWe strive for that 18-5\nFuckin' your dealers wives and shit\nYou livin' in yo project, pushin' yo Benzo on lorenzo's\nTossin' weed out tha tinted window\nWhen you see po po\nI'm loco like short bus riders\nMy mission was to chief that\nAn that's tha shit these niggas gotta respect\nSo respect that and pass tha weed away from 'cause I don't fuck around\nYou don't wanna me high, ya see me buckin' niggas down\nI hate niggas who hate me\nSo I'm a hater to a certain degree\nBut who wouldn't be, I'ma thug nigga\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Paradise Popeye And Sam", "href": "Paradise_Popeye_And_Sam&&8774", "artist": {"unique_name": "Mac"}, "lyrics": "<b>Mac talking:</b>\nYeah I got these motherfucking Warlocks in this biatch\nSo you know it's all about that World War 3 Nigga\nYou feel me nigga haha\nMy nigga Sam\nMy nigga Popeye\nShout out to my nigga BI-Geezy you off in this bitch\nFeel it\n\n<b>Popeye</b>\nMy future, my focus, paradise\nCriminal slash pistol popper toat the badder dice\nAnd if I got to be real and sank a clip below my hip to survive\nI keep the real motherfuckers alive\n\nMy future, my focus, paradise\nCriminal slash pistol popper toat the badder dice\nAnd if I got to be real and sank a clip below my hip to survive\nI keep the real motherfuckers alive\n\n<b>Sam</b>\nIntentions to leave a coarse, remourse is extinct\nNiggas murder and lust the course we own is mislink\nThe pack we don't want it lead to unknowns\nLike understanding life and why we here and some gone\nI'm mystified conspicuous eyes vision my glory\nCamaflouge and wish we hiding side of the hallways\nThe narrow road has followed the battle hole of hollows I spit\nTo keep the real alive to have tomorrow\nMurderer slash real nigga slash ghetto celebrity\nTo often have life and death we hope to never see\nThe destiny of what's real is my fate to not hate\nConfusion keep unfolding that the migrates, my Lord\nTech to my face, flinching is forbiddin\nMurder in self-defense, can you blame me for living?\nKeep the real alive, the fake get famous with death\nKeep the real seen, bitch niggas are laid to rest\n\n<b>Popeye</b>\nMy future, my focus, paradise\nCriminal slash pistol popper toat the badder dice\nAnd if I got to be real and sank a clip below my hip to survive\nI keep the real motherfuckers alive\n\nMy future, my focus, paradise\nCriminal slash pistol popper toat the badder dice\nAnd if I got to be real and sank a clip below my hip to survive\nI keep the real motherfuckers alive\n\n<b>Popeye</b>\nFaster between the streets I held on\nPromoted through pistols and either elsewhere\nSilent and helped to hold on for killer that said a self-prayer\nTo walk away beside the lord, siners repent so we divide the sword\nBehind the tents I mean be riding cars\nStanding off the roof of a killer, to murder made life\nFocused than any president living that carry shade ice\nThat live amongst the fallen few, to walk away the day they calling you\nAnd freeze the heat when they come crawling through\nBreathing from the top of it's lungs, tomorrow it will shut down\nNiggas that held a piece of my heart they never let down\nWas yet to come before the lord,\nI thought my father supposed to show the card,\nThese niggas camaflouge to blow the guard\nMaking me a part of the wind, suspend will now hell\nEverything operated in time to end when I fail\nBeside the walls of badder shit, I run the streets and chose to stan and spit\nBehind the gate the hater grabbin' pit\n\n<b>Popeye</b>\nMy future, my focus, paradise\nCriminal slash pistol popper toat the badder dice\nAnd if I got to be real and sank a clip below my hip to survive\nI keep the real motherfuckers alive\n\nMy future, my focus, paradise\nCriminal slash pistol popper toat the badder dice\nAnd if I got to be real and sank a clip below my hip to survive\nI keep the real motherfuckers alive\n\n<b>Mac</b>\nNow Check it\nNow spill on my proverbs, I bless you, you bless the next niggas\nIts for the best niggas believe me\nThey say money is the root of all evil\nI say only when it's in the clutch of the wrong people ya feel that\nIf murder is the medicine for fools who refuse to abide by the rules\nYou lose your cool then you lose your shoes\nTo every nigga in the struggle with big dreams\nWe was born with the hustle in my genes, I know it seams like we forbiddin\nForced in ghetto living, poverty strickin eating popeye chicken and biscuits\nWith alittle jelly for my lil belly,\nThat I just can't fill cause moma belly make the bills\nAnd I know shit's real, when we go to school just to eat meals\nAnd for dinner we got sleep nigga, it's deep nigga\nWith that thinkin' the whole world against ya\nBitch ass nigga have you forgoten god sent ya\nWhoa\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Can U Love Me (Eyes Of A Killer)", "href": "Can_U_Love_Me_(Eyes_Of_A_Killer)&&4394", "artist": {"unique_name": "Mac"}, "lyrics": "Tell me why, Somethings make it hard to smile,\nMomma tell me can you love a child,\nI got the eyes of a killer\n\nTell me why, Somethings make it hard to smile,\nMomma tell me can you love a child,\nI got the eyes of a killer\n\nSo what you mean when you 14 and your life is a bitch.\nThat'll only fuck the rich, what, poor folks die holding they dicks?\nNever to achieve, only to grieve, so why we cry when they leave?\nIs it happiness like we were taught to believe?\nIs it hell for us, something like eternal jail for us?\nI feel for us, cause my niggas'll kill for us.\nDo God love killers, Do God love thieves?\nWould God forgive a man who murder to feed his seed?\nIf I'm a rebel tell the ghetto my story, the whole truth.\nThe revelation we can never avoid it like a toll booth\nAnd I will never turn my back on the struggle, I'm still a soldier\nBut it's only right, I'll put up my fight and when it's over say...\n\nTell me why, Somethings make it hard to smile,\nMomma tell me can you love a child,\nI got the eyes of a killer\n\nTell me why, Somethings make it hard to smile,\nMomma tell me can you love a child,\nI got the eyes of a killer\n\nLook in my eyes and tell me if you see a bright future.\nOr just the anger of a stranger that might shoot you.\nIn so many words, I wish that I could change the way we was raised.\nWe portray slaves, but got enough nerve to hate the gays\nMaybe I never understood life for what it's worth.\nI never liked church, but I hate the streets and doing my dirt\nBut I'm not no hethen, 'cause I know without believing.\nWill I fall short your glory for some fucked up reason?\nAnd they told me not to question you, where those your words?\nOr was that something man made up, to calm my nerves?\nWhat if I didn't want forever, tell me where will I go?\nI'm not that killer I just wanted to know.\nYou feeling me?\n\nTell me why, Somethings make it hard to smile,\nMomma tell me can you love a child,\nI got the eyes of a killer\n\nTell me why, Somethings make it hard to smile,\nMomma tell me can you love a child,\nI got the eyes of a killer\n\nThese are the words of my niggas who came round to save they life\nFor going through this shit that I speak every day and night\nMy auntie told me I had eyes of a killer.\nAnd every time I take a look in my mirror,\nHer observation I see clearer.\nI can remember, it was back in December of 88'.\nI was coming home from school late, So I took a walk through the park\nRight before it got dark,\nAnd I was trying to make it home before the dark start.\nBut you won't believe what I seen.\nI seen some niggas, and they lady teasing,\nI saw blood, and I seen the weapon.\nAnd I was hearing the scream.\nWhen them niggas noticed me,\nI broke 'cause I'd just witnessed a killing.\nAnd from that day on my mind has been gone look, you feeling me?\n\nBaby, momma loves you\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Bloody", "href": "Bloody&&1555", "artist": {"unique_name": "Mac"}, "lyrics": "Chorus: (Mac/(Magic))\n\nNiggas really wanna die tonight\nYou know you fucking with a rider right\nWe can all get bloody if you want to\nYou gotta crew, I gotta crew, so what you wanna do\n(What you wanna do nigga)\nNiggas really wanna die tonight\nYou know you fucking with a rider right\nWe can all get bloody if you want to\nYou gotta crew, I gotta crew, so what you wanna do\n(What you wanna do nigga)\n\n(Mac)\nNow what y'all mean, niggas on my team, it's all about the cream\nAnd by any means, we take it to extreme, to get the green\nNahmean, turn the block to a murder scene\nAnd I be screaming whoa, in the drop with my nigga Wop\nRunnin' from the cop who was trying to meet that quota\nI'm young and I'm black so they be thinking I'm slanging that baking soda\nYou ain't heard about, nigga from that dirty south, keep a boot in his mouth\nBitch everybody yelling 'bout it, better know what you bout\nBefore you leave your house, cause at night, nigga freaks come out\nGet the gat with the extra clip 'cause if you catch us slippin\nYou might be the next to rip, get shot get stab you get cut up strip\nYou boxed up in a ship, now you niggas on some retaliation tip\nWanna take a trip to the land\nWhere them niggas do the murder man dance on the enemies\nAnd fake niggas that pretend to be friends of me,\nAre the ??? nigga can't fuck with me\nWon't buck with me the murda murda kill kill for scrilla\nCap pilla turned rap dealer chose the style\nYour style, my style, our style\nTurn up the beat loud so we can all get wild\n\nChorus: (Mac/(Magic))\n\nNiggas really wanna die tonight\nYou know you fucking with a rider right\nWe can all get bloody if you want to\nYou gotta crew, I gotta crew, so what you wanna do\n(What you wanna do nigga)\nNiggas really wanna die tonight\nYou know you fucking with a rider right\nWe can all get bloody if you want to\nYou gotta crew, I gotta crew, so what you wanna do\n(What you wanna do nigga)\n\n(Mac)\nIs your niggas in the air like mine\nCan they make a M-16 sound like mine?\nGet hit with a stray from a big ole' K\nGet up say never die they just walk away\nNigga Mac got something to say\nI get to bucking they better get to ducking and it's getting to fucking\nIt's real tell them niggas I'm back, heavy triggers in fact\nWe got grenades now let a nigga hit you with that\nYou get bloody, throw in them dogs in the mud and get muddy\nThat's what you get when you fuck around with my buddy\nMurda Murda and this shit is so lovely, man them niggas can't fuck with me\nWon't buck with me the murda murda kill kill for scrilla\nCap pilla turned rap dealer chose the style\nYour style, my style, our style\nTurn up the beat loud so we can all get wild\n\nChorus: (Mac/(Magic))\n\nNiggas really wanna die tonight\nYou know you fucking with a rider right\nWe can all get bloody if you want to\nYou gotta crew, I gotta crew, so what you wanna do\n(What you wanna do nigga)\nNiggas really wanna die tonight\nYou know you fucking with a rider right\nWe can all get bloody if you want to\nYou gotta crew, I gotta crew, so what you wanna do\n(What you wanna do nigga)\nNiggas really wanna die tonight\nYou know you fucking with a rider right\nWe can all get bloody if you want to\nYou gotta crew, I gotta crew, so what you wanna do\n(What you wanna do nigga)\nNiggas really wanna die tonight\nYou know you fucking with a rider right\nWe can all get bloody if you want to\nYou gotta crew, I gotta crew, so what you wanna do\n(What you wanna do nigga)\n\n(Magic)\nSo you want to get bloody\nFucking with my niggas is like fucking with my money, you think it's funny\nTwist ya, make your momma miss ya\nTell your baby momma bye and tell your kids kiss ya, dismiss ya\n45 words that you spoke with your tongue\nMac pass the gun and this killing is done\nYou niggas ain't heard, Magic from the 9th and Mac's from the 3rd\nYou don't want to war with me but you done went far with me\nPut him in the trunk this punk is dead, I done hit him in his head\nWith a .45 slug, now he coughing up blood\nI'm a 225 pound nigga rapper slash killer cap pella grave filler\nSo what you wanna do, No Limit is my back bone\nSlap a tank on your back if you say something wrong\nAbout the clique I'm with, I'm a sick man\nAll it takes is 5 grand, I'll leave with your dick in your hand\nAnd I'm a grown man, and I'm down with Mac\nSo all you so called killers better step back\n\nChorus: (Mac/(Magic))\n\nNiggas really wanna die tonight\nYou know you fucking with a rider right\nWe can all get bloody if you want to\nYou gotta crew, I gotta crew, so what you wanna do\n(What you wanna do nigga)\nNiggas really wanna die tonight\nYou know you fucking with a rider right\nWe can all get bloody if you want to\nYou gotta crew, I gotta crew, so what you wanna do\n(What you wanna do nigga)\nYou know you fucking with a rider right\nWe can all get bloody if you want to\nYou gotta crew, I gotta crew, so what you wanna do\n(What you wanna do nigga)\n\n(Magic)\nBitch ass niggas y'all don't want to fuck with us\nWe niggas who love this type of shit\nBunch of pussy ass motherfucking niggas\nWe the real motherfucking riders ya heard me?\nMr. Magic and Mac down for the 2000\nAin't nothing motherfucking stopping us\nWe tank doggs we can't be motherfucking stopped\nYou motherfucking niggas better listen\nFor ya get your ass wacked Ya heard me?\nWell if it's on it's fucking on\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Still Callin' Me", "href": "Still_Callin%27_Me&&9324", "artist": {"unique_name": "Mac"}, "lyrics": "(Phone conversation between Mac and a girl)\n\nMac: Wassup girl? What's happenin' with ya?\nGirl: Nothing\nMac: Chillin' huh?\nGirl: Yeah\nMac: Well look, you know why I called you over here huh?\nGirl: Why?\nMac: You know what's happenin'. You ain't gotta be shy.\nGirl: What's happenin' with you?\n\nYo Yo Yo\nArriving at my back door, silk dress hit the floor\nSecond time around she want more, I got it instore\nJazz flowin' in the back drop, I hit the jackpot\nShe went to yellin' Mac stop,\nBut that's a contradiction, I can feel it in your friction\nYour finger nails full of my skin, but it's a sin,\nCause everything good is bad for ya\nIn the sheets, nothing but heat,\nSatisfing you, you satisfy me, it's like the ??? speaks\nAnd I don't wanna end it,\nIt's kinda cool how are bodies blended, a third time is recommend\nBut you my woman so it's no guilt, we lay between the silk chillin'\nIt's over but we still trippin' off the feelin'\nI'm a soldier, so I hold ya, them three words is what I told ya,\nYou smiled and tell me about the next time you coming over\nSee your mind is what I'm really sexin',\nYour body just a source of erection, and plus I use protection\nYou never worry about the chicks approaching me at my show,\nI be polite but you know I ain't really scoping them hoes\nYou never with another nigga cause you be with me,\nAnd that's the way is supposed to be,\nI got you in mind when you ain't close to me\nAnd that's love.\n\nChorus -1: (Sons of Funk, (Ms. Peaches)) x2\n\nYou would like to go war with me\n'Cause I can hear that pussy callin' me\nInside your love is where I wanna be\n(Would you like to come inside of my life?)\n\n\nYo, Yo, Yo, Yo, Check it\nYou think about Mac between blinks,\nRub your hand through my kink, and tell me how your day went\nUs againist the world, me and you girl\nGo together like diamonds and pearl, a camoflague and war\nI met ya through this chick I'm cool with so you gotta be real\nAnd I can tell through the way that we chill\nI can deal with cha, be real with cha, as we rise and shine,\nSpending time like a 3 to 9\nWe in the park in the dark reminsicing and shit, kissing and shit,\nActin' like stress ain't existing and shit\nAnd uh, I hit the cat I ain't know how to act,\nSpary painted on the wall so-and-so love Mac\nAnd that's love\nLook\n\nChorus -2 (Ms. Peaches)\n\nWould you like to go to war with me?\nI can hear your body callin' me\nBetween my hips is where you wanna be\nWould you like to come inside of my life?\nWould you like to come inside of my life?\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Cops and Robbers", "href": "Cops_And_Robbers&&9716", "artist": {"unique_name": "Mac"}, "lyrics": "Yeah, spinning been on these niggas.\nIt's World War.\nYeah, I send this out to my nigga.\nWherever you are.\nWe still ain't nothin' but some niggas in trouble, ya heard me?\nFeel it, uh, yeah.\nIt's World War nigga.\nIt's like a deadly game.\nAnd me and my niggas in it to win it, ya heard me?\nWorld War nigga.\nCheck it.\n\nFeel the wrath of a soulja, the Crescent City Jesus\nI pack a tre deuce, got a army 'bout the size of Babe Ruth\nTo hit em, rugged even if it's unplugged for thug lifers\nWe be the niggas leavin' slugs in ya crime cipher\nWe got the town locked\nWith underground stock around clock workers to serve us\nResponsible for many murders\nWe left your town with all the gold pieces\nShoot the Sheriff to assure my family's convict releases\nPay the witnesses to hold they breath,\nNon cooperation is only death, and no this ain't a phony Tec\nI'm in a limo full of blow niggas\nBut I'm never high cause a leader gotta be up on his toes nigga\nA trail of cops is followin' we start to swallowin' the evidentials\nKeep supplier's name confidential\nThe crooked cops started buckin' at us\nI made a turn to a dead end, but froze 'cause the cops had us\nI grab the Tec and started buckin' back\n'Cause I'd rather take half the force out before they pump a slug in Mac\nThe head shot took me under\nI fell on my back, the last scene is his pale face and badge number\n\nIt's like a deadly game of cops and robbers\nThe niggas who unload first be the survivors\nThe rest is dead on arrival, keep your heaters off safety\nI never let you crook cops erase me, cops and robbers\nIt's like a deadly game of cops and robbers\nThe niggas who unload first be the survivors\nThe rest is dead on arrival, keep your heaters off safety\nI never let you crook cops erase me, cops and robbers\n\nT-Shirts and white caprices, my Daddy used to call him Johnny\nI never thought them snake muthafuckas would be behind me\nThey took a shot nearly blind me\nMy eyes rolled like a zombie, my life started seemin' timely\nI can't believe it, Officer Friendly, he put a slug in lil' McKinley\nI'll be a memory, shit I ain't havin' it\nFightin' for my life, the reapers grabbin' it\nJust enough strength to pull the trigga once more\nI hit his cabbage and he dropped like the Value Jet\nI heard a nigga say he wasn't dead yet, they should have never said that\nMy life came back, like some supernatural shit\nI stood up, and took the bullets they was hittin' me with\nGrab the dead cocked glock out the holster\nPointed at the rest of them and said muthafuckers I'm a soulja\nYou can't kill me, they said we'll see\nI said nigga feel me, and hit 'em with the nine milli, ya heard me\nI took my vest off, and threw it on the pavement\nYou never see the Mac's assassination\n\nYou motherfuckers.\nAnd that's how it is in 99.\nIt's just World War against these motherfucking cops.\nFeel it.\n\nIt's like a deadly game of cops and robbers\nThe niggas who unload first be the survivors\nThe rest is dead on arrival, keep your heaters off safety\nI never let you crook cops erase me, cops and robbers\nIt's like a deadly game of cops and robbers\nThe niggas who unload first be the survivors\nThe rest is dead on arrival, keep your heaters off safety\nI never let you crook cops erase me, cops and robbers\n\nIt's the year twenty hundred, the devil's still running\nMoney is done with, we only sold get your gun shit\nYou either ballin or you starvin, tombstones in the mystic coffin\nOn top of that we living in New Orleans\nYet I'm trying to make something shake\nThe only thing between me and my cake is Fake Jake\nBut it get trifer\nIf I escape then its cool but if not,\nLooking at a lifer, that's hard to cipher\n'Cause I ain't trying to hear put no chip in my wrist\nI'd rather drink shit and eat piss, it's that serious\nSo get the phone, call my nigga Joe\nPray for me fore I go, running up in the store\nShould I die following my big collection of dough\nTell my niggas that I didn't die poor you know\nOld sucka John ass copper, trailing me in the helicopter\nI cocked back, went to busting at the chopper\nIt must have been my niggas blessing, 'cause I got away without requesting\nBut thugs never learn their lesson\nI'm strictly into banks, fuck blacks, they ain't got shit\nI'm running with an ex cop and an ex locksmith nigga\n\nIt's like a deadly game of cops and robbers\nThe niggas who unload first be the survivors\nThe rest is dead on arrival, keep your heaters off safety\nI never let you crook cops erase me, cops and robbers\nIt's like a deadly game of cops and robbers\nThe niggas who unload first be the survivors\nThe rest is dead on arrival, keep your heaters off safety\nI never let you crook cops erase me, cops and robbers\n\nY'all know.\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Father's Day", "href": "Father%27s_Day&&8317", "artist": {"unique_name": "Mac"}, "lyrics": "I dedicate this song to all the kids out there\nGrowing up without they father in they life\nThat's some real serious shit\nY'all listen\nI know I'm not perfect but I strive to be\nFeel it\n\nI met you at only five months, spittin' image of a one night stand\nBetween woman and man\nBeautiful baby girl, not a worry in the world\nI see the sun rise in your innocent eyes and I'm hypnotized\nLemme tell you bout life and 'bout the way it is\nOh this world ain't nothing like folks say it is\nLemme protect you from these years to come\n'Bout a fairy tale life far away from the slums\nYou'll be mines if I could rewind time\nYou know me so long though, you got them killer eyes of mine\nWhen you get older you understand\nEspecially when your peers tell you Mac was one hell of a man\nI never met your real dad\nAnd I never meant for this to make a nigga feel bad\nAnd that's my word, you couldn't understand the essence and this I know\n'Cause I was there to watch you grow\nIs you feeling me\n\nDaddy do you love me and if so\nWhy you wasn't there to hug me and watch me grow\nDaddy do you love me and if so\nWhy you wasn't there to hug me and watch me grow\nDaddy do you love me and if so\nWhy you wasn't there to hug me and watch me grow\nThis is what it sound like\nGrowing up without your godfather in your life\n\nYoung black male growing up without a father figure\nHa ha ha, makes it that much harder nigga\nTrying to be a man with no example of a man\nMama doing what she can but she can't show you how to be a man\nAnd this is where we break down\nWe used to be cops and robbers, turn into shake down\nNow we living like rebels, born killers\nWe born to be kings and queens nigga, on the reala\nI know that you and your baby mama can't get along\nBut there's no excuse, so leave the kid alone\nCause ain't nothing like the birth of a child\nA blessing in disguise, the girls, the guys with they daddy's eyes\nAnd think about this before you abandon them\nThe people they try and can't even having one\nBefore you say I'm preaching and you don't wan' hear it\nTake a look in the mirror, can you feel it\n\nDaddy do you love me and if so\nWhy you wasn't there to hug me and watch me grow\nDaddy do you love me and if so\nWhy you wasn't there to hug me and watch me grow\nDaddy do you love me and if so\nWhy you wasn't there to hug me and watch me grow\nThis is what it sound like\nGrowing up without your godfather in your life\nDaddy do you love me and if so\nWhy you wasn't there to hug me and watch me grow\nDaddy do you love me and if so\nWhy you wasn't there to hug me and watch me grow\nDaddy do you love me and if so\nWhy you wasn't there to hug me and watch me grow\nThis is what it sound like\nGrowing up without your godfather in your life\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "You Never Know", "href": "You_Never_Know&&447", "artist": {"unique_name": "Mac"}, "lyrics": "Verse 1: Mia X\n\nYou better think before you call Tyrone\nCan you trust him\nIs he real \nDoes he look you in the eyes and make you feel what he's saying\nShit I ain't playing\nMy ??? in knots\nRemember the last niggas you felt they got you robbing shop \nI gots no time for new friends \nSome of the old ones ain't cool \nYou ain't kicked it with this nigga since high school \nAnd you twenty-two now\nAll a sudden y'all exchanging numbers callin\nYou don't think that nigga heard you ballin\nFuck that\nI smell a rat \nAnd I can hear the gats click clack\nAlong with the sirens \nAnd special forces teams\nOr can it be that infrared beam and ski masks\nNiggas on a mission who say they gots to have it\nI'm grasping at straws\nAnd you think I'm picking with cha\nBut you gots to stay one up on them niggas \nFor they come and get cha \nYou figure since y'all go way back them that matters\nSometimes they be the first to ratta tatta\n\nChorus: Mia X\n\nFriend or foe\nYou never know who's real\nWho's fake\nWho's mask of love disguise hate\nYou never know \nBreak bread sleep in your house \nThen turn around and rat you out\n\nFriend or foe \nYou never know who's real  \nWho's fake \nWho's mask of love disguise hate\nYou never know \nBreak bread sleep in your house\nThen end up being rivals in a shot out\n\n\nVerse 2: Mac\n\nHave you ever pulled a caper \nWith a nigga who you thought was your ace\nY'all got separated he got caught \nAnd they took him to that place \nWith no hesitation \nHe was coughing up all kinds of information \nOle, master splint ass nigga\nCan't handle interrogation\nType of nigga that see your killer\nBut instead of informing you\nAct like he don't see shit\nWalk away without warning you\nAin't that cold \nCause you remember when he had slept on your couch\nWhen his other partner had kicked him out \nFor running his god damn mouth\nBut see ah that's the type of shit your girl was telling you bout\nAnd she told you he was trying to fuck every time you left the house\nYou thought he was only tripping \nAnd that she was only bitching\nTill you caught in your kitchen \nTrying to shove his little dick in\nWhat you love\nSo now you in the pen for it\nOh yeah you shot him so now you doing ten for it\nNiggas don't give a fuck\nThey would rob you now \nAnd drink with you later \nRape your sister \nGo to school with you \nAnd cheat on your paper\n\n(Chorus) until song fades\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "We Deadly", "href": "We_Deadly&&7498", "artist": {"unique_name": "Mac"}, "lyrics": "(Skull Duggery)\nWe deadly\nWe deadly, ah\nWe deadly, ah\nWe deadly, ah\nWe deadly, ah\nWe deadly, ah\nWe deadly, ah\n\n(Mac)\nMy rap style is kill kill, never forget that\nSee the wig, you split that, you get that, it's that simple\nTalk is cheaper then generic goods\nWe deadly apostiles, that means respected in every hood\nThe realest niggas be the illest niggas, he who whispers in the dark\nYou can see the black in my heart\nBut that tigers in my eyes when I come through, fuck what you been through\nIt's bout what you gone do when it come to\nYou ever dance with the devil 'cause we can take it to that level\nI'm talking ghetto to ghetto just to catch you and wet you\nBless the soul of any nigga I cross\nSomewhere in the shuffle we was lost looking for drama at any cost\nLove changes, niggas is cut throat, especially when they snort coke\nMac's a minister, I was sent to replenish ya\nNothin' can come between us, niggas who try to see us\nProbably thanking me for sending them to meet they Jesus\n\n(Mac/(Skull Duggery))\nY'all want this war nigga (war)\nY'all want this beef nigga (beef)\nY'all really want a million niggas on your street nigga (street)\nY'all best to chill nigga (chill)\n'Cause we some real niggas (real)\nYou ain't heard, we murder murder kill kill niggas (kill kill)\nY'all want this war nigga (war)\nY'all want this beef nigga (beef)\nY'all really want a million niggas on your street nigga (street)\nY'all best to chill nigga (chill)\n'Cause we some real niggas (real)\nYou ain't heard, we murder murder kill kill niggas (murder murder kill kill)\n\n(Master P)\nWe riders and I done rolled with the best\nSee y'all started this mess, now who wanna get wet\nI done changed my life and chill cause No Limit pays the bills\nNow suckas banging on records, tryin' to break down what I build\nBefore I started this I was a killer, a motherfucking drug dealer\nNow who the fuck don't feel us, what's up to my real niggas (hoody hoo)\nNo Limit Soldiers we back, aim cock the Tec\nRat-a-tat-tat, I hope they got they gat\nI'm the big fish, y'all cupcakes, run up on the Tank and get duct taped\nNigga look me up in the dictionary under motherfucking great\n'Cause I run Atlanta, North Carolina to Alabama\nDetriot to Chicago, every ghetto, every slammer\nEvery dope dealer, every dope spot, from the Calliope to your block\nI know why y'all bitches mad at us cause No Limit still hot\n\n(Mac/(Skull Duggery))\nY'all want this war nigga (war)\nY'all want this beef nigga (beef)\nY'all really want a million niggas on your street nigga (street)\nY'all best to chill nigga (chill)\n'Cause we some real niggas (real)\nYou ain't heard, we murder murder kill kill niggas (kill kill)\nY'all want this war nigga (war)\nY'all want this beef nigga (beef)\nY'all really want a million niggas on your street nigga (street)\nY'all best to chill nigga (chill)\n'Cause we some real niggas (real)\nYou ain't heard, we murder murder kill kill niggas (murder murder kill kill)\n\n(Silkk The Shocker)\nNigga it's murder murder, nigga it's kill kill.\nShit'll get real nigga.\nI know y'all don't want that.\nCause y'all talk this shit.\nUs, we live this shit.\nY'all trying to get in this shit.\nWe trying to get up out this shit.\nShit, you don't want a million motherfuckers coming to your door.\nYou can't go no where.\nCause once it's beef, it's on for life nigga.\nPicture that.\nYou can't walk no where.\nYou can't hide no where.\nPicture that, picture that.\nSee all of us nigga, we from the streets.\nAnd this how we eat.\nIt's No Limit.\nAnd don't none of us wanna go back nigga if we don't have to.\nBut if we have to, we'll go back nigga.\nYou ask me, would I ride and die for this.\nFuckin' well right.\nShit, niggas'll die for words nigga.\nFake ass motherfuckers man.\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "War Party", "href": "War_Party&&687", "artist": {"unique_name": "Mac"}, "lyrics": "Chorus (Mac) :\n\nIt's World War\nCan't nobody run and hide\nIt's World War\n'Cause everybody's gonna die\nIt's World War Nigga\nCan't no nigga run from me they gun for me and come for me\nFeel the Rath of a nigga who bust\n\nIt's World War\nCan't nobody run and hide\nIt's World War\n'Cause everybody's gonna die\nIt's World War Nigga\nCan't no nigga run from me they gun for me and come for me\nFeel the Rath of a nigga who bust\n\nIt's World War\nIf you want it let's go get it get it\nIf it's what you need nigga we committed\nIf it's standing in your way nigga split it split it\nAnd if it's real take it down with ya\n\n\nVerse 1 (Mac) :\n\nI'm Mac the motherfucking camoflauge hitman\nAnd murda murda is what they get when them unpure\nThey sick of your shit and your funural is my cure\nIt be a betta world without cha I'll be so sure\nCome one come all watcha 'em all fall\nFuck aorund with tha block-a block-a, I kicks it off like soccer\nWould you like to go to war with me?\nI'll make you sorry that you ever played a card with me\nYa bitch you nigga I'm soldier, got that eyes of a tiger\nIf you's a biter me and my niggas don't like ya\nWe don't feel ya, if it sound to familar\nWe might steal ya, in other words we gonna kill ya\nMac-a-don, and represent to the fullest\nPut my name on a record I'll put your name on a bullet\nI never liked ya anyway ya bitch you\nSay my name so we can make it official\nAnd get ya issue my nigga\n\nChorus (Mac):\n\nIt's World War\nCan't nobody run and hide\nIt's World War\n'Cause everybody's gonna die\nIt's World War Nigga\nCan't no nigga run from me they gun for me and come for me\nFeel the Rath of a nigga who bust\n\nIt's World War\nIf you want it let's go get it get it\nIf it's what you need nigga we can committed\nIf it's standing in your way nigga split it split it\nAnd if it's real take it down with ya\n\n\nVerse 2 (Magic) :\n\nI hear 'em scream bloody murder, hoping that they didn't see my face\nDidn't want to kill em, but they had to be erased\nWith all that bullshit that they be speaking\nCouldn't rest so I had to put them 6 feet deep\nThat's how it is, I was raised by the thugs\nThey all had potential but they told me to sell drugs\nIt's World War 3 motherfucker, you fucking with Mac you fucking with me\nHis enemy's my enemy, you wouldn't wanna go against this squad\nYou betta run and hide cause somebody bout to die\nIf Mac say it's on then it's on, fuck sleep\nWe ride till the early fucking morning, looking for you bitch niggas\nY'all started we gonna finish this shit\nTake my picture and put it on a t-shirt bitch\nI know you motherfuckers heard about me\nThe ones that's deceased are the ones that doupt me\nYou can call me Mr. 9th Ward\n\nChorus (Mac):\n\nIt's World War\nCan't nobody run and hide\nIt's World War\n'Cause everybody's gonna die\nIt's World War Nigga\nCan't no nigga run from me they gun for me and come for me\nFeel the Rath of a nigga who bust\n\nIt's World War\nIf you want it let's go get it get it\nIf it's what you need nigga we committed\nIf it's standing in your way nigga split it split it\nAnd if it's real take it down with ya\n\nVerse 3 (D.I.G.) :\n\nMoney and guns is what I'm known for keeping in my presence\nThese niggas better feel, what the fuck I'm tellin' them\nI'm a young ghetto nigga rebellion\nAnd I pull this from my weapon eat a nigga flesh every second\nI'm on that Murda Murda kill shit and trill shit\nSo feel that when I spit it's gonna be real shit\nI got my guns up ready to hit\nRun your mouth like a pussy I'ma fill it with dick\nNigga I'm a soldier, camaflouge nigga from the 'Nolia\nFuck around with this war shit nigga your world is over\nIf it's what you need nigga come and get it get it\nIf you want beef nigga I'm committed and wit it\nWhat\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Genocide", "href": "Genocide&&7846", "artist": {"unique_name": "Mac"}, "lyrics": "(Master P)\nWell, it's like this player.\nYou know, it's either we all strapped.\n'Cause if we ain't somebody goin' die.\nWe roll on this side and they roll on our side.\nIt's like a never ending game.\nAnd whoever left, that's who wins.\nSo check it out player.\n\n(Mac)\nEverybody's going trigger happy, wanting to blast\nI remember we used to play ball and cut class\nNow my niggas sport bulletproofs, clutching their gat\nWe all headed for hell, my grandmama told me that\nEven now I'm going shell shocked, wanting to shoot\nI was a little cool nigga to tell you the truth\nThey put the gats in the ghetto, them rotten motherfuckers\nWanted us to get frusterated and kill one another\nNow we all beefing and it won't stop till we all sleeping\nEverybody's got to die but why we point the finger at the white man\nNigga it's us killing us late at night man\nSo now I ask my God, is this the way of the world or just the hood niggas\nMy auntie said, Mac what happened to the good niggas\nAm I a fool cause my heart be true\nAnd I give a fuck about you and you\nBut they don't hear me\n\n(Ms. Peaches)\nWhen them niggas ride on you\nYou turn around and ride on me\nTell me what you gonna do, it's genocide\nWhen them niggas ride on you\nYou turn around and ride on me\nTell me what you gonna do, it's genocide\n\n(Mac)\nFlowers in the soap saying I felt pain\nThrough the eyes of the youth I envision your gain\nMy nigga Eric was young when he was caught up in the drama\nThem niggas took his life right in front his baby mama\nWas that God or the devil, that shit is so deep\nIt's hard to dig it with a shovel, now we on that other level\nThat's the tale of the ghetto, never change with the name\nIt's a constant war, nobody wins, everybody pains\nEverywhere they hating\nThey got me sporting camoflauge when I'm misled, preparing on the armageddon\nAnd everybody to blame for the supplies\nTo the vibes, little kids they caught up in the crossfires\nIs this the way of the world or just the hood niggas\nMy auntie said, Mac what happened to the good niggas\nAm I a fool cause my heart be true\nAnd I gave a fuck about you and you\nBut they don't hear me\n\n(Ms. Peaches)\nWhen them niggas ride on you\nYou turn around and ride on me\nTell me what you gonna do, it's genocide\nWhen them niggas ride on you\nYou turn around and ride on me\nTell me what you gonna do, it's genocide\n\n", "album": {"title": "World_War_III_(1999)&&973", "genre": "Southern Hip Hop", "year": 1999}}]