[{"title": "Never Look Back", "href": "Never_Look_Back&&9026", "artist": {"unique_name": "Madball"}, "lyrics": "I know its hard for me to see,\nThe way things have come to be but I must leave it be.\nCan't keep looking back,\nI don't know how to act.\nI don't know where to start,\nI know I've been here before.\nMy conscience still believes that it was on me.\nMy guilty heart bleeds don't want to feel this no more.\nSo tell me something since you've done nothing except you lied to me.\nYou said you'd never leave,\nAfter all this I wanted to believe that you still care about my life.\nJust tell me something so I can go in peace 'cause we could not make that sacrifice.\nAfter all this I wanted to believe that you still care about me.\nIts hard to see, but it must be,\nYou take away a piece of me.\nI never take a step back,\nNever look back.\nI've come to face the facts and I know where you stand.\nI won't take another step back, never look back.\n\n", "album": {"title": "Hold_It_Down_(2000)&&1821", "genre": "Hardcore Punk", "year": 2000}}, {"title": "Confessions", "href": "Confessions&&5268", "artist": {"unique_name": "Madball"}, "lyrics": "You're always talking but the things you say have no meaning,\nThey carry no weight.\nTake your time but don't waste mine.\nGo sell your stories I'm not looking to buy.\nWe all have flaws but this is your downfall.\nTalkin' a game you can't even back up and you're so hollow you have no clue.\nThere's repercussions and they're comin' for you.\nConfessions-i leave it up to you,\nI know where I stand.\nOppressions-something I must choose to make you understand.\nTo make you understand I don't share your pains 'cause I don't preach about pointless things.\nI only speak when I have something to say or I won't fake moves disgrace my name.\nSelf pride-i can't throw away,\nI have too much love for family.\nSelf pride-i wont throw away,\nRaised to be real from the first day.\n\n", "album": {"title": "Hold_It_Down_(2000)&&1821", "genre": "Hardcore Punk", "year": 2000}}, {"title": "The Blame", "href": "The_Blame&&1084", "artist": {"unique_name": "Madball"}, "lyrics": "What are you gonna do when they all turn on you\nIs it worth for us to live their way\nIt's their mistake and we're the blame\nAre we to live by their rules and be told what to do\nWe're not part of their society\nFuck their authority\nWe're the youth of today and nothing can stand in our way\nWe are young and strong with our new hopes we can't go wrong\nWe'll live without conformity\nWe got our dreams\nFuck authority\nCan't you look around you and see the world of today\nThey're all fucking hypocrites\nWho lies to get their way\nWe shouldn't feel this shame\nWhen we know we're not the blame\nWe can't take their abuse\nThey're full of selfish lies\nWe've heard too many excuses\nWhen we know we're right\nThe anger has grown inside us and we're out for blood tonight\n\n", "album": {"title": "Droppin%27_Many_Suckers_(1992)&&385", "genre": "Hardcore Punk", "year": 1992}}, {"title": "Smell the Bacon (What's With You?)", "href": "Smell_The_Bacon_(What%27s_With_You%3F)&&2116", "artist": {"unique_name": "Madball"}, "lyrics": "No more fighting we've had enough\nWe won't take any more of your shit\nYou got the badge and you got the gone\nDon't shoot us down just 'cause we're having fun\n\n", "album": {"title": "Droppin%27_Many_Suckers_(1992)&&385", "genre": "Hardcore Punk", "year": 1992}}, {"title": "Fall This Time", "href": "Fall_This_Time&&9815", "artist": {"unique_name": "Madball"}, "lyrics": "You better think quick,\nAct fast before its time you take another blast.\nYou better think about where you stand 'cause it seems you're on the wrong path.\nUsed to look down, talk down.\nNow you walk down the same path blown out.\nYou're foolin yourself, you're not proud.\nSo lean on me to come down.\nChoose you're own fate, but this ain't mine.\nYou've fallen from grace,\nI won't let you fall this time.\nOut back to back days sniffin gak,\nNow you're really on the wrong track.\nDo you really want to come back?\nAre you losing yourself and do you want that?\nI fall this time.\nIt's not a necessity,\nIts just a fantasy and it's too much for me.\nToo much of anything is not a good thing.\nFallen and now I plead.\n\n", "album": {"title": "Hold_It_Down_(2000)&&1821", "genre": "Hardcore Punk", "year": 2000}}, {"title": "5-0", "href": "5-0&&5210", "artist": {"unique_name": "Madball"}, "lyrics": "I see the way that you're looking at me\nYou don't like what you see\nHarrasing us every chance that you get\nWhen the fuck are you gonna leave me be\nI'm getting sick of your smart-ass ways\nAnd I don't have to play your bullshit games\nNow, hads against the wall\nDon't fuckin' move - don't say a word\nI look in your eyes, I know you're not much older than me\nGoing out of your way to impress your peers, and make a fool out of me\nAnd then you wonder why some people just don't fuckin' care\nQuick to lock us down, and when in need you you're just never there\nHelp - where are you\nIf this was you, what would you do\n'Cause I won't help you\nI can't trust you any more\nWon't back down from you no more\nYou think that you're better than me\nGive me a chance and then we'll see\nTake off your badge, now talk to me\nIf you're the man you claim to be\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "Done...", "href": "Done...&&5356", "artist": {"unique_name": "Madball"}, "lyrics": "My memories of better days still stand in my way because no matter what I say I still play your game.\nThe frustration of wanting things that you can't see.\nAnd its hurting you but its killing me,\nIts feeding my disbelief.\nAnd I take back all that I've done.\nI can't take back, what's done is done.\nI've seen the pain in your face,\nThe pain in your eyes.\nIts no surprise to me,\nI see what I've done wrong.\nNo sense in holdin' on,\nNow standin side by side,\nI hope I tried.\nI realize it's the end of our time,\nThe end of our lives together.\nNow there's no words left for me to say 'cause I know that things wont change.\nAnd there's nothin' left to rearrange,\nAll that's left is the memory.\nI can't take back all that I've done.\nAnd there's nothin' left for me to say because what's done is done\n\n", "album": {"title": "Hold_It_Down_(2000)&&1821", "genre": "Hardcore Punk", "year": 2000}}, {"title": "Can't Stop, Won't Stop", "href": "Can%27t_Stop,_Won%27t_Stop&&3261", "artist": {"unique_name": "Madball"}, "lyrics": "You are the blood running through my veins.\nYou are the streets that made me this way.\nIn you I've lost and regained faith but in my silence I'll never betray.\nThese are the streets where men are made.\nWhere our values are sometimes plagued into temptation I dwell for days.\nAnd I can't stop, wont stop living by the gun.\nNever one to run from my fears.\nCan't stop livin' this way and I know what my life means to me.\nI see there's things that shouldn't be,\nI see there's still hope for me.\nBut I see myself in these streets and I try but I cants stop.\nYou say there's still time but I won't stop.\nAnd I know there's still hope for me.\nBut I see myself in these streets.\nI pray there's hope for me.\n\n", "album": {"title": "Hold_It_Down_(2000)&&1821", "genre": "Hardcore Punk", "year": 2000}}, {"title": "Nuestra Familia", "href": "Nuestra_Familia&&5670", "artist": {"unique_name": "Madball"}, "lyrics": "Times are hard and getting rougher\nCould never understand why my family had to suffer\nMay be it's because we're not as fortunate as others\nAt least we've got each other, and we can rely on one another\nWorking hard just to make ands meet\nThrough good and bad we refused to accept defeat\nTrying to give us what they never could have\nNot a day goes by that we don't thank god for what we have\nTimes are hard but getting better\nWe paid our dues but money doesn't last forever\nMaybe it's because the money doesn't always matter\nAt least we have each other and we can rely on another\nI thank my family for everything that was given to me\nBeing there no matter what, even willing to die for me\nThey're not at fault if I'm not as good as I'm supposed to be\nThey did their part and now it's all up to me\nI thank god and all my family\nDid their best and now it's up to me\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "Ball of Destruction", "href": "Ball_Of_Destruction&&5548", "artist": {"unique_name": "Madball"}, "lyrics": "You wanna try and fuck with me\nAnd disrespect my family\nYou wanna judge the way I live\nAnd you don't even know me\n\nYou'll never understand our hate\nIt doesn't matter anyway\nNever understand our kind\nTry to disrespect what's mine\n\nYour words don't mean a thing to me\nYour living in a fantasy\nNow we have no more to say\nWe'll get about it our way\n\nGame has gone far enough\nAnd it's time we put it to an end\nWe're comin' out with all we got\n\nTime is runnin' out fast\nAdn you're the only one to blame\nWe're comin' out with all we got\nYou won't forget our name\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "Godfather", "href": "Godfather&&69", "artist": {"unique_name": "Madball"}, "lyrics": "He was young at heart, been through it all\nSeen all the changes, now it's time to move on\nIf it wasn't for him it just wouldn't be the same\nHe's not gone, in his heart it will stay\nPass the glory down\nSo pay your respect\nKeep alive what he started\nWe'll make sure of that\nIf it wasn't for him\nIt just wouldn't be the same\nHe's not gone, in his heart it will stay\nHe moved on; that's the choise he had to make\nDo what you gotta do, we're behind you all the way\nHardcore, that's all you're ever gonna be\nI give thanks; you'll always be a brother to me\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "Pride (Times Are Changing)", "href": "Pride_(Times_Are_Changing)&&8513", "artist": {"unique_name": "Madball"}, "lyrics": "Times are changing for the worse\nGotta keep a positive outlook\nGrowing up in such violent times\nHave some faith and you'll get by\nThinking back when I was a kid\nTimes have changed so much since then\nAll grown up I gotta do for myself\nI refuse to depend on anyone else\nLife's hard, you struggle some times\nIn the end I'll get what's mine\nBut for now I'll deal with the times\nHave some faith and you'll get by\nTimes are changing for the worse\nTimes are changing - I keep\nI know my family is there for me\nAnd without them where the hell would I be\nBut still I gotta try to be my own man\nMake good of what I got - do the best that I can\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "Still Searching", "href": "Still_Searching&&8936", "artist": {"unique_name": "Madball"}, "lyrics": "New times draw upon me I can't forsee what's next.\nBut I feel free to do what I have to do,\nI answer to, only g.o.d. I look up to. can't say I've changed,\nCan't say that I'm still the same.\nI mintain through my mindstrains to figure out the next move without pain.\nStill searching for the way to work it out,\nSoul searching can't do nothing about what lies next on lifes list,\nWill I live, will we ever get out?\nTrapped visions that I must believe,\nSo far away from I can't retreat.\nSometimes I find a way to get mine,\nOther times I'm lost, I'm blind.\nThe pressure gets hard B,\nI can't lose track it's always on me.\nI can't stray 'cause it won't go away,\nGotta figure out the next move day by day.\nTimes out!\nDo or die, it's my time, it's my life, it's my time,\nDo or die. do or die, it's our time-it's our lives.\nTimes out.\n\n", "album": {"title": "Hold_It_Down_(2000)&&1821", "genre": "Hardcore Punk", "year": 2000}}, {"title": "Across Your Face", "href": "Across_Your_Face&&5174", "artist": {"unique_name": "Madball"}, "lyrics": "In your eyes we've always\nBeen the bad guys\nDroppin' false knowledge\nYou're just full of lies\nYou've misled our youth\nDistracting them with fantasy\nBut your plan backfired\nBlewout into reality\n\nI've taken on losers\nLike you in my past\nSo why should I stoop\nTo your sorry ass\nI thought you were my friend\nBut you showed me disgrace\nI'll slap you with\nReality across your face\n\n", "album": {"title": "Droppin%27_Many_Suckers_(1992)&&385", "genre": "Hardcore Punk", "year": 1992}}, {"title": "Spit On Your Grave", "href": "Spit_On_Your_Grave&&1524", "artist": {"unique_name": "Madball"}, "lyrics": "All you wished was to block my goals.\nAll you did was strengthen my soul.\nAnd what I wanted from you, I couldn't get.\nSo dreading our deaths is how we choose to live.\n\nYou're the one who feeds my rage.\nYou're to blame fror endless pain.\n\nIt's in your nature to destroy my dreams.\nIt's in my heart to damage your means.\nBecause I feed off your fire day after day.\nIt's you who I live for, until I shit on your grave.\n\nSo shall it be the last laugh on me?\nWhen you lay there to rot, I breathe.\n\n", "album": {"title": "Droppin%27_Many_Suckers_(1992)&&385", "genre": "Hardcore Punk", "year": 1992}}, {"title": "Demonstrating My Style", "href": "Demonstrating_My_Style&&9230", "artist": {"unique_name": "Madball"}, "lyrics": "Demonstrating my style\nLettin' it be known\nFollow the path of no one else\nIt's all about being true to myself\nI'll speak my mind, I won't keep it inside\nThe years pass and people change\nBut I'm stayin' true to my ways\nHardcore is my life, I'll carry the name\nDemonstrating my style\nLettin' it be known\nDemonstrating my style\nWe're not alone\nGive respect where respect is due\nTo those who know what we've been through\nWe can all relate in our own way\nTo those who put us down, we won't see you around\n'Cause you're too scared of me\nTo those who've helped us out, you know what we're about\nYou'll get respect from me\nDemonstrating my style\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "Streets of Hate", "href": "Streets_Of_Hate&&9204", "artist": {"unique_name": "Madball"}, "lyrics": "Walking through these streets of hate\nAnd I can feel their pain\nI see how this fuckin' place\nCan sometimes drive you insane\n\nBut I choose to keep my sanity\nWon't let anything bring me down\nI gotta be strong mentally\nBe quick to the schemes that are all around\n\nWhen I walk these streets\nI know that it's in vein\nI've been told I should get out\nBefore I wind up a victim in pain\n\nBut I choose to keep my sanity\nWon't let the bgad times bring me down\nI gotta think of all the good things\nAnd all the good friends I have around me\n\nStreets of hate\nWalking through these endless streets\nAnd I can feel their rage\nI see how this fuckin' place can sometimes drive you insane\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "Back of the Bus", "href": "Back_Of_The_Bus&&31", "artist": {"unique_name": "Madball"}, "lyrics": "In a society where no one is free\nBecause you're judged by what they see\nAffraid of what they don't understand\nPutting you down whenever they can\n\nThought that it was better these days\nBut there are some people who will never change\nStill a minority in their eyes\nAnd when confronted, they will always deny it\n\nBe proud of who you are\nFight for what you stand for\nTogether as a crew\nThere's something you can do\n\nBe on-point when you take action\nNever give them the satisfaction\nOf watching you suffer for their lies\nStill a minority in their eyes\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "Live or Die", "href": "Live_Or_Die&&1490", "artist": {"unique_name": "Madball"}, "lyrics": "Live or die, are the choises I got\nBut I refuse to go anywhere soon\nLife is too short to keep explaining myself\nMy situation means nothing to you\n\nBack to reality once again\nI clear my thoughts and think about how much time I spent\nKeep movin' on and try to do what I do best\n\nI was always taught right from wrong\nBut who are you to be judging who's right\nDoin' what I gotta do to get by\nWill I survive; just look in my eyes\n\nI gotta live my life day by day\nNo matter what type of bullshit is thrown my way\nI'll overcome it with or without your help\n\nDon't tell me, you can't tell me\nHow I choose to live my life\nThe way I choose to live my life\n\nI was always taught right from wrong\nBut who are you to pint the finger at me\nI have no need to explain myself\nCause your opinions I don't need\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "Semper Fi", "href": "Semper_Fi&&5361", "artist": {"unique_name": "Madball"}, "lyrics": "I never backstab another to save mine,\nI stand the time.\nFor me its do or die,\nThese are the rules I live by.\nAnd I shed my blood for my brothers of the same mind,\nOf the same kind, who never leave a side.\nSee we never think twice,\nAnd they shed their blood for me.\nShos by my side, I'm by your side.\nMy blood is my loyalty,\nMy brothers are loyal to me.\nWho by my side, this is what we believe.\nWe stand for one another in hard times, in good times.\nNo matter what we find,\nA way so we can get by.\nAnd I shed my blood for my.\n\n", "album": {"title": "Hold_It_Down_(2000)&&1821", "genre": "Hardcore Punk", "year": 2000}}, {"title": "Hold It Down", "href": "Hold_It_Down&&7540", "artist": {"unique_name": "Madball"}, "lyrics": "Enough times been wasted and now I'm faced with our realities and what's to come of this scene.\nSo many come and go, some have disgraced it.\nI think its time we take a stand show them what we mean.\nYou can't stop this, this thing of ours.\nHold it down.\nThis things is ours, hardcore is ours.\nTime after time, line after line.\nI must express the truth 'cause that is what we stand for.\nSome live to lie they will defy and deny our roots I pay no mind.\nYou no who we care for.\nAnd I'm not only speaking for myself I can't.\nI hope I speak for everyone else out there.\n'Cause a lot of people think that we don't care.\nBut they can't stop what I'm bringing can't stop what I'm bringing.\nTryin' to make a change do what I can.\nThey can't stop what I'm bringing can't stop what I'm bringing.\nYou can't stop what we're bringing.\nTryin' to make a change and hold it down 'cause we can\n\n", "album": {"title": "Hold_It_Down_(2000)&&1821", "genre": "Hardcore Punk", "year": 2000}}, {"title": "Say What?", "href": "Say_What%3F&&7965", "artist": {"unique_name": "Madball"}, "lyrics": "Say what you want to say - the same old thing.\nSay what you want to play - the same old game.\nSay what you want to say - I won't change.\nSay what you want to say - just look my way.\nWhat you see is what you get.\nThis is who I am, nothing less.\nYou think you're better but you bleed red like the rest of us but are you willing to\nNow that's the real test.\nWho you know,\nWhere you're from and what you've done in my eyes!\nNone of that matters.\nStaying true to yourself is what we strive for!\nStaying true to myself, now whos hardcore?\nI say it now, I said it then!\nFor all those who always try to offend.\nYou paint a picture but you still don't comprehend\nOne thing about me 'cause you ain't my friend\n\n", "album": {"title": "Hold_It_Down_(2000)&&1821", "genre": "Hardcore Punk", "year": 2000}}, {"title": "Step to You", "href": "Step_To_You&&8141", "artist": {"unique_name": "Madball"}, "lyrics": "Here I'll put it to you\nBefore we fight\nI need to step to you\nTo prove I'm right\nI never leaked a drop of loyalty\nI never lost my hate and purity\nYou say you're down and out and I'm to blame\nBut all there ever was\nWas shame in your game\nNever will we battle or bleed for you again\nNever will we swallow our pride for your revenge\nI guess you never had it in your heart\nYou never had our back you were destined to part\nYou played yourself out\nFlashing true colours\nProving that bit of doubt to your brothers\nSukers like you run in and out of jams and pretty soon your luck will end\n\n", "album": {"title": "Droppin%27_Many_Suckers_(1992)&&385", "genre": "Hardcore Punk", "year": 1992}}, {"title": "Friend Or Foe", "href": "Friend_Or_Foe&&1254", "artist": {"unique_name": "Madball"}, "lyrics": "Hang out with me then you stab me in the\nBack- are you friend or foe\nSee me on the streets you walk right by\nMe- are you friend or foe\nTell me on the phone that I'm a fucking\nClone- are you friend or foe\nWhy don't mind your own life and leave me\nAlone- are you friend or foe\nFriend, foe\nAre you my friend or foe\n\n", "album": {"title": "Droppin%27_Many_Suckers_(1992)&&385", "genre": "Hardcore Punk", "year": 1992}}, {"title": "Addict", "href": "Addict&&5530", "artist": {"unique_name": "Madball"}, "lyrics": "All fucked up, now you turn to me\nAll this time I tried to help you see\nWhere you're headed is to an early grave\nI don't want to see you go out that way\nHelp you, is what I try to do\nBut you refuse - what can I do\nThat shit you do is only killing you\nIt's blinding you - can't see the truth\nCan't you see what you're doing to yourself\nYou're at fault, can't blame nobody else\nWhere you're headed is to an early grave\nI don't want you to go that way\nYou're losing all your pride\nAnd now it's time to gain it back\nGet your self-respect\nI can only help you out\nIf you want to be helped\nGotta help yourself\nLife's not waiting on you\nGotta put yourself in-check\nGet your self-respect\nI can only help you out\nIf you want to be helped\nGotta help yourself\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "Never Had It", "href": "Never_Had_It&&2417", "artist": {"unique_name": "Madball"}, "lyrics": "Don't tell me how much\nBetter it was in the 80's\nDon't talk about the brotherhood\nLost within the scene\nTo me you were always a quitter\nFrom day one, just like you proved\nMe right in the long run\nNo longer you wear the crown\n\n", "album": {"title": "Droppin%27_Many_Suckers_(1992)&&385", "genre": "Hardcore Punk", "year": 1992}}, {"title": "Everyday Hate", "href": "Everyday_Hate&&3895", "artist": {"unique_name": "Madball"}, "lyrics": "Everyday I hate more and more 'cause I know the truth.\nIts just a role you play and nothing more.\nLifes a game to you.\nBut I live by another set of rules and I know just what it takes to prove.\nThat weak at heart is what you'll always be.\nYour fake ass wont compete with me.\nIt must be hard to live in disgrace.\nThey know the truth and now who should you blame?\nYou have no fucking shame.\nI'm the one so blame me.\nEveryday I hate I cannot relate.\nYou'll never be a part of my scene.\nYou're just a sucka MC,\nA fucking wanna be.\nNow come and throw joints with me\n\n", "album": {"title": "Hold_It_Down_(2000)&&1821", "genre": "Hardcore Punk", "year": 2000}}, {"title": "Show No Fear", "href": "Show_No_Fear&&933", "artist": {"unique_name": "Madball"}, "lyrics": "I will not hesitate,\nIf I wait, I give in to chance and I can't live life that way.\nCan you read my face,\nThere's no way I'll turn and walk away so just make your mistake.\nSo when the time comes I don't care,\nWhen the time comes I'll be there,\nWhen the time comes show no fear,\n'Cause its time and I'm right here.\nI will not lose face, I'll save,\nEverything I am 'cause that's just how I was made.\nI will not hesitate,\nIf I wait I give into chance and I can't live life that way.\nA wise man once said to me\nSon, don't you ever back down to no one?\n'Cause I'll be there, don't show no fear.\n\n", "album": {"title": "Hold_It_Down_(2000)&&1821", "genre": "Hardcore Punk", "year": 2000}}, {"title": "Get Out", "href": "Get_Out&&7686", "artist": {"unique_name": "Madball"}, "lyrics": "I don't want you around\nGet out, get out\nI don't want you here\nGet out, get out\nI don't care what you do\nGet out, get out\nI don't care what you say\nGet out, get out\nMadball\nStay the fuck out\n\n", "album": {"title": "Droppin%27_Many_Suckers_(1992)&&385", "genre": "Hardcore Punk", "year": 1992}}, {"title": "In Memory Of...", "href": "In_Memory_Of...&&4804", "artist": {"unique_name": "Madball"}, "lyrics": "He had a life and so much to give\nI'll never understand what he did\nHe had a family who cared for him\nThat was a selfish thing that he did\nLife comes down hard on you sometimes\nYou gotta deal with it, give it time\nI know he had a lot on his mind\nWish I could talk to him one last time\nI know things are hard but that's no reason to end it now\nI can't believe that it was so bad, that you had to take yourself out\nWaste of life\nI know times are hard\nWhy'd you give in\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "Thinking To Myself", "href": "Thinking_To_Myself&&3183", "artist": {"unique_name": "Madball"}, "lyrics": "Beware of what's around you.\nThe elements of life will sometimes take you in.\nBad things always surround you.\nIt's your choice now to think.\nCrime is easy to come by and temptation is bound to bring you down.\nCorruption distorts your judgement and it seems you can't trust no one now.\nThinking to myself there's a price to pay.\nIs it worth the pain,\nThe pain of someone taking your life away?\nSaying to myself there is a better way.\nIt's not worth the pain,\nThe pain of someone taking it all away.\nMemories are here to remind you,\nLearn from your brothers.\nDon't make their mistakes.\nTrouble will somehow find you,\nIt's your choice to contemplate.\nCrime don't pay in the long run.\nMoney ain't worth the risk of death or jail.\nI'm not judging no one.\nI'm just thinking, talkin' to myself.\n\n", "album": {"title": "Hold_It_Down_(2000)&&1821", "genre": "Hardcore Punk", "year": 2000}}, {"title": "True to the Game", "href": "True_To_The_Game&&2774", "artist": {"unique_name": "Madball"}, "lyrics": "Livin' in a world\nPeople try to be what they're not - but can't see the fantasy\nWho's living a dream\nIt seems it's you\n\nWe know whose real\nYour life is just a game\nYou don't deserve your fame\n\nLiving in a world\nWhere the fake get apid and the true get pushed around\nTrue to the game I'll stay while for you it's the fame\n\nI despise you and your selfish ways\nYou know I'm real and I know you're fake\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "No Return", "href": "No_Return&&6705", "artist": {"unique_name": "Madball"}, "lyrics": "I'm tired of people taking with no return\nNever giving back when it was my turn\nI'm done giving charity so leave me be\nI have nothing to offer and no one to feed\nOnly myself I'm the one in need\nForced to live this way because of your greed\n\n", "album": {"title": "Droppin%27_Many_Suckers_(1992)&&385", "genre": "Hardcore Punk", "year": 1992}}, {"title": "Hardcore Still Lives!", "href": "Hardcore_Still_Lives!&&2109", "artist": {"unique_name": "Madball"}, "lyrics": "Hardcore still lives\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "Ready To Fight", "href": "Ready_To_Fight&&8262", "artist": {"unique_name": "Madball"}, "lyrics": "We won't take any shit and we're not about to leave \nJust cause you don't like who and what we want to be \nWho are you to say what's wrong what's right \nIf it's what it takes, we're ready to fight \nReady to fight, ready to fight \nReady to fight, fight, fight, fight, fight\n\n", "album": {"title": "Droppin%27_Many_Suckers_(1992)&&385", "genre": "Hardcore Punk", "year": 1992}}, {"title": "Unity", "href": "Unity&&8147", "artist": {"unique_name": "Madball"}, "lyrics": "Now - is the time for unity\nWhy - because it means a lot to me\nWe - can be strong once again\nI've seen it before and I know we can\nThey - always tried to hold us down\nWe - are the ones who are still around\nWhy - because we fought for unity\nThat is something they don't wanna see\nThey'll always try but they can't hold me\nThere are many who have come and gone\nI've seen the weak, I've seen the strong\nBut to those who are true, you know who you are\nThis is all about you and me, and our fight against society\nOur time has come; we have to break free\nDon't think that we believe your lies\nWe see the fear in your eyes\nYou can't change us so don't even try\nIt's time for us to make this last\nWe've learned our lessons from the past\nI've seen it before and I know we can\n\n", "album": {"title": "Demonstrating_My_Style_(1996)&&6320", "genre": "Hardcore Punk", "year": 1996}}, {"title": "We Should Care", "href": "We_Should_Care&&5774", "artist": {"unique_name": "Madball"}, "lyrics": "What is this world coming to\nThere's no faith, there's no hope\nPeople live in fear, and kill and\nAsk why die? What is this world\nComing to I can't believe what you're\nTrying to do you're killing people all time\nAnd not paying for your crime, what is\nThis world coming to I can't believe\nWhat you're trying to do you're killing people all\nThe time and not paying for your crime\nLook at me and look at you you think we're\nAll same but don't you know we're different\nIn your own way Do you got that fucked up\nAttitude? You say you don't care but\nWe all need unity for all of us to share\nNo faith, no hope, live, kill\nWhy die! Why don't you go fuck yourself\nAnd let me live my life.\nBlah!\n\n", "album": {"title": "Droppin%27_Many_Suckers_(1992)&&385", "genre": "Hardcore Punk", "year": 1992}}, {"title": "It's My Life", "href": "It%27s_My_Life&&5629", "artist": {"unique_name": "Madball"}, "lyrics": "It's my life and I'll do what I want\nIt's my life and I'll say what I want\nIt's my life and I'll do what I care\nIt's my life and I'll shave my hair\nYou turn it around you turn it around\nYour turn in my life up side down\n(Repeat)\n\n", "album": {"title": "Droppin%27_Many_Suckers_(1992)&&385", "genre": "Hardcore Punk", "year": 1992}}]