[{"title": "Good Lookin Out", "href": "Good_Lookin_Out&&3131", "artist": {"unique_name": "Magic"}, "lyrics": "Magic (1)\nD.I.G.(2)\n\n(1) You say you gonna get him nigga\n(2) You damn right, I'mma get him\n(1) Throw a slug in his head nigga\n(2) You fuckin' right, I'mma split him\n(1) Do exactly what I said nigga\n(2) Don't worry about it dawg, Its on\n(1) 'Cause I want this nigga dead nigga\n(2) Off top, this nigga gone\n\nD.I.G.:\n\nYou damn right I'mma get him, cut him and split him\n&gt;From his neck down lettin' him know I ain't bullshittin'\nHe shouldn't fucked around wit' Mr. Magic\nHe should of known shit get drastic when you start static\nI burn niggas like lastic so they won't come back\nThey try to get to you, but feel the heat from the gak\nI bust his ass have him fall flat to the ground\nHit'em twice in the head and walk away wit' a smile\nOh wha cha want me to do, bring him to you, and you watch me kill him\nSo you can see the blood drippin'\nAnd know I did it and know D.I.G. stay committed\n'Cause you my nigga anything for you\nI pull the trigga and be the green filla\nFuck that nigga I'mma get'em\nThat nigga history, I'mma put him out of his misery\nYou make him feel it, that not to play with these real niggas\nA TRU nigga... Ya Dig Nigga\n\n(1) So you say you gonna get him nigga\n(2) You damn right, I'mma get him\n(1) Throw a slug in his head nigga\n(2) You fuckin' right, I'mma split him\n(1) Do exactly what I said nigga\n(2) Don't worry about it dawg, Its on\n(1) 'Cause I want this nigga dead nigga\n(2) Off top, this nigga gone\n\n\nMagic:\n\nIt's a shame this all started as a misunderstanding\nThere is no turning around because my money is demanded\nNow I gotta call the fuckin' bandit ...D.I.G.\nLeavin' muthafucka's where they standing, single handed\nChoppin one by fuckin' one and hit me on the cell\nWhen the fuckin' job is fuckin' done\nMan do this for me dawg and I'll return the fuckin' favor\n'Cause his momma know my face, I mean she's practically my neighbor\nBut I'm all about my paper we went together on a caper\nAnd I ain't got my ends, this muthafucka gots to pay\nI mean 3 people died and I ain't got a fuckin' quarter\nBut if my plans go right they'll be fo dead by tomorrow\nBut my heart feels no sorrow, he deserves to fuckin' die\nShit I did all the shootin', this nigga spending mind\nHe saw the killa in my eyes now he gonna feel my fire\nSay bye-bye to the bad guys, yo life has been expired\n\n(1) So you say you gonna get him nigga\n(2) You damn right, I'mma get him\n(1) Throw a slug in his head nigga\n(2) You fuckin' right, I'mma split him\n(1) Do exactly what I said nigga\n(2) Don't worry about it dawg, Its on\n(1) 'Cause I want this nigga dead nigga\n(2) Off top, this nigga gone\n\n(1) So you say you gonna get him nigga\n(2) You damn right, I'mma get him\n(1) Throw a slug in his head nigga\n(2) You fuckin' right, I'mma split him\n(1) Do exactly what I said nigga\n(2) Don't worry about it dawg, Its on\n(1) 'Cause I want this nigga dead nigga\n(2) Off top, this nigga gone\n\n(1) So you say you gonna get him nigga\n\n\n\nMagic &amp; D.I.G.:\n\n(1) Did you bring me a gift, his head is acceptable or\nFingers or wrist\n(2) Nah nigga, I got a story lets chill first and discuss this over\nLobster and fish\n(1) Man picture this, I appreciate you spilling his blood and when you\nEver need this thug it's nothing but love\n(2) Well dawg, look it's all good I know you'll do the same for me that's\nWhy I picked up the peace at anytime and put a nigga to sleep\n(1) (shhh!) Nigga take these couple G'z and head to Hawaii, lay low until\nI say so and I'mma make sho no one follow\n(2) Nah soldier keep yo money, I don't really need it, I enjoyed killin'\nThat nigga while you watchin' him bleed\n(1) Well, did your dick get hard when he took his last breath, I just get so\nExcited in the presence of death\n(2) nah uh, but I can tell you the blunts got rolled, my eyes got red,\nMy lungs over filled with smoke\n\n\nMagic &amp; D.I.G.:\n\n(1) Yo, did you get this nigga\n(2) Uh huh!..I fuckin' got him\n\n(Both starts to laugh)\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Wobble, Wobble", "href": "Wobble,_Wobble&&6208", "artist": {"unique_name": "Magic"}, "lyrics": "(Magic)\n\nSay C &amp; Mac, bruh, I think them hoes gone love this shit dogg Foreal!\nKnowmsayin'? Tell them hoes come to the floor dogg!\n\n(C-Murder)\nTRU, ya dig?\n\n(Mac)\nWhoa!\n\n(Magic)\nWhat? It's goin' DOOOOOOOOOOWN tonight!\nYEEEEEEEEEEEEEEHAH! Where the ladies at? All ladies hit the floor!\n\n(Chorus-Mac)\nNow won't you wobble, wobble?\nLemme see ya shake it, shake it\nNow won't you drop it, drop it?\nOoh, take it take it (2X)\n\n(First Verse-Mac)\nYou already know what's happenin' when I step in this bitch\nAnd I know ya heard of me, 'cause I'm right there off of G.T. and Dorgenois\nAnd you been bout servin' me\nSheezy, you heard my song and it got you bucked up\nYou want that camoflauge love, ha? It got me fucked up\nI just want to see you wobble, like your mama's won that lotto\nLike your Daddy's full of that bottle\nLike your Brother when they called him hollow\nLike them G.T. bitches, them Saint T. bitches, my No Limit bitches\nThem boss bitches, bout they riches, and it ain't no secret\nThey want that soldier gear,\nThat you can only get from that soldier clique\nThat old \"Bitch I told ya\" dick, now luh-look\nWe drop it like it's hotter, from the dance floor to the Ramada\nGivin' up them pesos? I thinks notta, now won't you...\n\n(2nd Verse-C-Murder)\n\nLemme see ya wobbledy shake it, shake it pop it don't break it\nYou want love? Let's make it, shit I just can't wait till you naked\nYou lick your lips it makes me hard,\nDaydreamin, and fiendin' and screamin',\nYou creamin' for SEX that you be needin' this evening\nIt's all good, you bounce your ass for cash at the club\nShow me love for a dub, but is it cool to fuck or what?\nI'm sweaty, ready, full of juice and Amereti (?)\nGot 2 D.U.I.'s, here take my keys and you can drive\nLet's get high while we ride or do you wanna smoke outside?\nI got that cess weed, that shit make you thinkin' you can fly\nBaby girl come and get it get it, lemme hit it hit it\nFor real, no time for actin' shitty shitty\nLemme see ya shake, bounce, twerk, rattle and roll\nI call it the wobble now get your ass on the floor!\nHold on baby, bounce that ass or hit the dash,\nShit, this a muthafuckin' TRU party bitch\n\n(3rd Verse-Magic)\n\nI like it when I see 'em actin' bad, SHAKIN' THAT ASS\nGot me really contemplatin' bout, TAKIN' THAT ASS\nThe way they wobbledy wobbledy, ass bouncin' everywhere before they\nDrop it and droppin' it, I can't help but to stare\nGot a nigga sayin' \"ooh girl\"\nThe way you twerkin' gots to make you my boo girl\nDon't move girl,\nI'm on my way to the floor baby\nComin' for mine I wanna see if you can really shake it\nIt's bump and grind, is it, soft as it looks?\nCan I squeeze the Charmin? Ooh!\nAre you upset? I didn't mean no harm\nBut you got the wobble, uh, OH MY GOD!\nGot me, hummin and hummin, and hummin and hummin like a dog WOOF!\n\n(Magic)\nYo, this has been a TRU party production, ya HOID ME??????\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Freaky", "href": "Freaky&&3292", "artist": {"unique_name": "Magic"}, "lyrics": "Magic (Ms. Peaches) talking:\n\nYou big fine ass motherfucker\nI need to know one thing is you freaky? (oh come on now)\nHuh? I said is you freaky? (boy you better stop playing with me)\nYou hear what the fuck I'm saying\nSo don't act like you don't hear me (you crazy)\n\nI need to know is you bout that freak girl\n(I ain't really tripping)\nAll right well If it's on it's on\nI need to know is you bout that freak girl\n(Boy I'm not really tripping)\nAll right well If it's on it's on\nI need to know is you bout that freak girl\n(I said I'm not tripping)\nAll right well If it's on it's on\nI need to know is you bout that freak girl\n(Look boy stop playing I said I'm not tripping)\nBut look look\n\nVerse 1: Magic (Ms. Peaches)\n\nLet me explain my situation before we even conversate\nSee I'm involved with this female that just can't be replaced\nSo I'm just looking for a friend are you interested?\n'Cause I would love to see you butt-naked lying in my bed\nYou won't regret a mintue just tell me what you like\nAnd I promise to make this the best night of your life\n(Now would you dine on me?) sure baby only the best\n(Now would you treat me like a queen?) only if you can pass the first test\nIs the pussy good? (You just got to see for yourself)\nWell is you cold with it? (Oh believe me this is the best)\nIt's just me and you and I won't tell nobody\nSo put your hands on my hips and let your neck get rowdy\nIf you suck my soul, I'll play with your emotions\nSo at the point of pentration, your wetter than the ocean\nGetting aroused by my every motion\nAs I'm getting aroused by your Victoria Secret's lotion\nI'm harder than an armadillian, can't fight this feeling\nIf you get on all four, shoot that ass to the ceiling\nAs I apply the pressure as she starts to moan\nOh if it's it's on... look\nWhy is you biting at that pillow baby, screaming my name?\n(Because your working that dick, you got me going insane.)\n(Boy you'se a soilder) I told ya (How you keeping your composer?)\nCause right before we started, I smoked three gards of dolja\nYou getting the dope dick, I prepared for this\nWanted to dick you down before I blasted\nThe plastic got the bed down better than average\nIt's only been an hour and she's speaking of marriage\nI get upset, but then I start to laugh and I can't blame her\nShe's been exposed to Magic,\nNo other man can make her feel like I make her feel\n(Shit I ain't trippin' on your wife, I'm trying to keep it real)\nSo what you sayin' boo? 'Cause I'm hoping that I'm hearing you\nI told you from the jump there was no future in this\n(So what you sayin'? Don't I fulfill your biggest fantasy)\nNah to tell you the truth baby you bothering me\nI undressed you, only to sex you\nGave you the dick and it must have impressed you\n(Man you shiesty ass niggas fucking make me sick\nI wish I would have known, I would of asked you to lick my clit\nDon't you recall the day that you begged for the pussy,\nPaided for the pussy)\nYeah but now I got the pussy\n(You just a fucking same nigga, ain't nothing changed\nYou just another lame nigga)\n\nMagic (Ms. Peaches) talking:\n\nYeah Yeah Yeah\nWhatever save all that shit\nYou know what? get the fuck out of I'm sick of your stupid ass (What?)\n(Fuck you, I'll get my shit, I knew I shouldn't have been fucking with you)\nI ain't got time for all this fucking shit (Stupid ass nigga)\nI got what the fuck I want, I got what the fuck I want\nGet your ass outta here\n(Fuck you Magic you know that) all right all right whatever\n(It's cool it's cool\nI knew I shouldn't have been fucking with you bitch ass nigga\nFucking make me sick) get ya shit... get ya shit...\n(That's what all y'all niggas about)\nGet ya... get ya shit and GET THE FUCK OUT\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Ice On My Wrist", "href": "Ice_On_My_Wrist&&4803", "artist": {"unique_name": "Magic"}, "lyrics": "(Master P)\nCheck this out Magic nigga\nA lot of niggaz be fakin like they have shit\nLike they doin' this or that\nBut nigga you know here go the real\n\nChorus: Master P (repeat 2X)\n\nThe ice on my wrist shine like a light\nI can brighten up your day even at night\n\n(Master P)\nI'm just a young nigga hanging with the thug niggaz\nRollin' with the drug dealers now they wanna mug niggaz\nGhettofabulous I mean we ballin\nI represent the 3rd Ward, Calliope, New Orleans\nIf the price is on sale then I'ma buy it\nNiggaz talkin' bout they bigger than No Limit don't try it\nNo Limit don't stunt, or front, we got bank\nI put that on the tank, and about 72 minks\nIn the closet, you want it we got it\nY'all leasin, we buyin, No Limit soldiers raise your Rolex high\nMy cousin Hot Boy just got out the pen\nAnd check his wrist I mean he sitting on 1-10\nBling Bling with a 2000 big body\nHit the club and the girls get rowdy rowdy\nHumvees on stretch, Ferrari's and 'Vette's\nAnd a Rolls in the garage that I ain't even drove yet\n\n(Magic)\nShit I ain't got as much as P\nBut my Rolex cost me about 43 G's\nPrincess cut with a shine that will blind ya\nYou got platinum, but shit I'm right behind ya\nI love diamonds, like I love rhymin\nI need sun shades just to see the timin\nAww shit I done caused a fuckin' accident\nWith a flick of my wrist man that wasn't meant\nAll this ice I got them hoes crazy\nKeep the cat but I'll take some head baby\nLast chance you better jump in this Mercedes\nWith me and P, smoking weed and drinking Hennessey\nYou know the real, who made the Forbes list?\nI thought y'all was rich, man you niggaz ain't shit\nYou hate me 'cause I'm ballin\nEverything that I drive is paid out (What)\nA couple acres, man my shit is laid out (What)\nI'm walkin' around with a car on my arm\nShit they need to make a Roley alarm\nNow I use my Roley for a mirror\nAnd what I see in the reflection is a rich nigga\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "We Gon Ride", "href": "We_Gon_Ride&&5938", "artist": {"unique_name": "Magic"}, "lyrics": "Counting Down:\n4 3 2 1\n\nChorus x8 (C-Murder)\n\nTru niggas gonna ride (we gonna ride or die)\n\nVerse 1: (C-Murder)\n\nHit em' up, hit em' up, nigga I fuck them hoes\nI smoke weed, make you bleed and it's time to go\nAnd I walk with the league that's what gangstas do\nAnd say where them dollars at? like gansta boo\nAnd skee mask on the muthafucken dash my nigga\n'Cause if you see me that's yo' muthafuckin' ass my nigga\nAnd Mr. Magic got that chopper for yo' ass my nigga\nTake off my mask, so you can see my laugh my nigga\nI represent that 3 nigga, so fuck what you claim\nNew Orleans is the place where I slang my caine\nRed rum, red rum nigga (nigga) look who tried to harm me\nI told you muthafuckas no limit is the army (What?) (What?)\nIf I die, I'll never cry, see the hate in my eye\nIt's time to ride, muthafucka bye (bye) bye (bye)\nI told you muthafuckas don't fuck with TRU,\nIt was a dumb move nigga, now I'm fuckin' wit you, biotch\n\nCounting Down:\n(Muthafucka, muthafucka) 4 3 2 1\n\nVerse 2: (Magic)\n\nThey got to kill me to get to you\nBefore they leave, I'ma have them bitches black and blue, believe that\nMuthafucka you ain't heard of us?\nTRU till I die, man we muthafuckin' murderous\n&gt;From the place where them hoes crazy, niggas shady\nBut I maintain, cause no one could ever fade me\nTRU Records is the next (what?) 'cause we the best (what?)\nIf you don't think so, then you could get the fuck fuck\nI'm here to get you riders, so nigga what what\nAnd I ain't stopin' till we tear the fuckin' club up\nSo where my niggas at? actin' fuckin' fool\nAnd where the bitches at? show em' that bithces rule\nI wonna see you sweatin', clothes lookin' wet\nDick so hard that you can't even catch your breath\nSmoke your herb nigga and get your drink on\nYou gave the party, everybody got their dance on\n\nC-Murder Talking:\n\nMy nigga (my nigga)\n(What's Up?) Ride Or Die muthafucka\nTRU Records (you heard me?)\n(What's up? what's up?) for the TRU souljas Tru niggas (you heard me?)\nHonk your horn nigga, 'cause I'm comin' to pick you up Magic\n(What's up nigga? get real)\nI wonna say what's up to all the deadly apostles outhere\nMy nigga macadon, tom from the St. T (Saint Thomas), you dig?\nMy nigga G'Boe, my nigga Sam (the Calliope) what's up nigga?\nCrazy from ruff forever, Beelow (whoa) (Beelow)\nAll the muthafuckin' clubs playin' my shit, you dig?\n(You know that, you know that, the real shit)\nThe west, marine, you dig? monte\nWhat's up Ke'Noe nigga? (Deadly Sounds)\nHa (what?) this shit real out here boy,\nWe gonna ride or die, TRU for Life, you dig?\nPause, watch me out\n\nChorus x8 until fade\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Club Thang", "href": "Club_Thang&&2169", "artist": {"unique_name": "Magic"}, "lyrics": "(C-Murder)\nWhat's up Magic dawg?\nLet's go roll to the club, ya dig?\nCall Ke'Noe, Carlos and um let my nigga have it.\n\n(C-Murder/Magic)\nDoing my club thang, getting my drank on\nSmoking on weed and sipping on Thug Passion\nDoing my club thang, getting my dance on\nAnd watching them bitches taking their clothes off\n\n(Magic)\nPut your drank down nigga, put your drank down nigga\nPut your drank down nigga, put your drank down nigga\nPut your drank down nigga, put your drank down nigga\nPut your drank down nigga, put your drank down nigga\n\n(C-Murder)\nHoody Hoo in the speaker, girls bouncing and tweaking\nYour baby mama on stage, dawg I know you feel played\nBut I ain't tripping, steady sipping, getting higher then a blimp\nAsk your old lady nigga, I'm a No Limit pimp\nWe won't fall, many plaques on the wall\nSmoke weed till I fall, pass it dawg, and tricks shaking like a dog\nTwo minutes, I'm in it, won't doubt that I finish\nThat bitch know I'm No Limit, so she know I'm a hit it\nWhat's my name (C-Murder)\nAnd what I used to be (a murderer)\nAnd when I hit it, what I'm a do (hurt ya)\nAnd why you let me hit it (you deserve ta)\n\n(C-Murder/Magic)\nDoing my club thang, getting my drank on\nSmoking on weed and sipping on Thug Passion\nDoing my club thang, getting my dance on\nAnd watching them bitches taking their clothes off\n\n(Magic)\nPut your drank down nigga, put your drank down nigga\nPut your drank down nigga, put your drank down nigga\nPut your drank down nigga, put your drank down nigga\nPut your drank down nigga, put your drank down nigga\n\n(Magic)\nDo my niggas run this motherfucker (hell yeah)\nNow do my niggas run this motherfucker (hell yeah)\nOr do the bitches run this motherfucker (hell yeah)\nOr do the bitches run this motherfucker (hell yeah)\nLemme hear you say we TRU fucking soldiers\n(We TRU fucking soldiers)\nI thought them motherfuckers told ya\n(I thought them motherfuckers told ya)\nSo lemme see what your working with, huh\nLemme see what your working with, what\nLemme see what your working with, huh\nLemme see what your working with, what\nPut your motherfucking drank down, huh\nPut your motherfucking drank down, huh\nPut your motherfucking drank down, huh\nPut your motherfucking drank down, huh\n\n(C-Murder/Magic)\nDoing my club thang, getting my drank on\nSmoking on weed and sipping on Thug Passion\nDoing my club thang, getting my dance on\nAnd watching them bitches taking their clothes off\n\n(Magic)\nPut your drank down nigga, put your drank down nigga\nPut your drank down nigga, put your drank down nigga\nPut your drank down nigga, put your drank down nigga\nPut your drank down nigga, put your drank down nigga\n\n(QB/(Magic))\nPut your drank down and let's get real with it\nGet off the dance floor nigga if you can't deal with it\nStill with it, throw your set up\nThese niggas right here bout to get fucked up\n(So what you saying)\nFuck them other niggas 'cause I'm down with my niggas\nNiggas step out the club if you bout handling your business\nIf you spill your drink on me (you getting fucked up)\nIf you step on my shoes (you getting fucked up)\nIf you look at me hard (you getting fucked up)\nIf you say something wrong (you getting fucked up)\nSo if you 'bout it 'bout it nigga\nGet fucked up, get fucked up, get fucked up\nQ motherfucking B (Q motherfucking B)\nQ motherfucking B (Q motherfucking B) and Mr. Magic\n(Q motherfucking B, Q motherfucking B)\n(Q motherfucking B, it's Q motherfucking B)\n\n(C-Murder/Magic)\nDoing my club thang, getting my drank on\nSmoking on weed and sipping on Thug Passion\nDoing my club thang, getting my dance on\nAnd watching them bitches taking their clothes off\n\n(Magic)\nPut your drank down nigga, put your drank down nigga\nPut your drank down nigga, put your drank down nigga\nPut your drank down nigga, put your drank down nigga\nPut your drank down nigga, put your drank down nigga\n\nDoing my club thang, getting my drank on\nSmoking on weed and sipping on Thug Passion\nDoing my club thang, getting my dance on\nAnd watching them bitches taking their clothes off\n\nPut your drank down nigga, put your dance on\nPut your drank down nigga\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Keep It Gangsta", "href": "Keep_It_Gangsta&&8815", "artist": {"unique_name": "Magic"}, "lyrics": "(Silkk talking)\nLet me tell y'all haters somethin' I'm rich bitch, so get used of it\nNo Limit (No Limit) fuckin' 2000 shit, still keepin' that shit gangsta\n\n(Chorus: Magic &amp;(Silkk))\nWe keep it gangsta dawg (yo yo)\nWe keep It gangsta y'all (now all my killas sing along yo)\nWe keep it gangsta dawg (yo yo)\nWe keep it gangsta y'all (all my muthafuckin' niggas)\nWe keep it gangsta dawg (yo yo)\nWe keep it gangsta y'all (now all my muthafuckin' bitches)\nWe keep it gangsta dawg (y'all know, y'all know)\nWe keep it gangsta y'all (y'all know we keep it gangsta, now sing along)\n\n(Silkk)\nI click quick, cause my temper is bad\nMy moms don't like dat, say I got my temper from my dad\nWhen I was a young nigga I used to take thangs\nGet locked in my cell and day dream\nShit I been locked down since I was 18\nDeep in it, No beef in it\nIf it's beef in it, I can't sleep in it (get tha gun and creep in it)\nGrab tha chrome, it's on\nLet it be known, ain't noway to survive\nBut ride or die\nAn niggas gotta stay high\nAn stay by a liquor store, right up in tha hood and shit\nI'm flossed out, sittin' up on tha hood of my six\nI'm just chillin' tank top like I ain't got no stress\nIn tha middle of tha project, no bodyguards and no vest\n(I love my fans) Me and Magic &amp; C-Murder\nIn a car that seat thirty\nWe keep tha heat dirty\nNow I'm ain't tryna tell ya I'm a thug\nAN I ain't tryna tell ya I sell dope\nI'm not tryna convince y'all I'm rich, I'ma convince y'all I'm broke\n(Shit I keep it gangsta)\n\n(Chorus: Magic &amp;(Silkk))\nWe keep It Gangsta dawg (yo yo)\nWe keep it gangsta y'all (all my killas sing along yo)\nWe keep it gangsta dawg (TRU records keeps it gangsta y'all)\n(No limit keep it gangsta dawg)\nWe keep it gangsta y'all (No Limit keeps it gangsta y'all)\n(Nigga sing along yo)\nWe keep it gangsta dawg (yo yo)\nWe keep it gangsta y'all (now all my niggas say)\n\n(Magic)\n(Yo yo)\nIt's been a couple years, I rid myself of tha game\nBut I'm still thuggin', see habit is tha hardest thang to change\nI'm still strugglin', tryna make a name for myself\nBut I won't rest till I'm label as tha muthafuckin' best\nI hustled hard, you can see me creepin' to tha top\nThankin' to yaself, will this nigga ever fuckin' stop\nI'm still tha same, you can see I got it tatted on my arm\nBitch I been screamin' 9th Ward since tha day I was born\nYou niggas wouldn't listen but I bet you hear me now\nYou might not like me as a person but I bet you jock my style\nI'm comin' up &amp; I want tha whole world to know\nIt's my determination dat got me on every fuckin' video\nI'm pass up every shittin' hoe\nMashin' every single folk\nDash on every po po dat harash me bout my fuckin' dough\nDat nigga you hear on every radio station\nTha thug niggas demand me, I'm givin' 'em inspiration\nIt's my turn (it's my turn)\n\n(Chorus: Magic &amp;(Silkk))\nWe keep it gangsta dawg (yo yo)\nWe keep it gangsta y'all (all my killas sing along yo)\nWe keep it gangsta dawg (yo yo we keep it gangsta y'all)\nWe keep it gangsts y'all (No Limit keep it gangsta)\n(No Limit keep it gangsta y'all) we keep it gangsta dawg\n(No Limit keep it gangsta y'all. y'all niggas sing along yo)\nWe keep it gangsta dawg (yo yo)\nWe keep it gangsta y'all (now all my niggas say)\n\n(Silkk)\nI keep it gangsta, can't get no gangsta than this\nThey say if you ain't tha shit now, you ain't never gon' be shit\nIf you ain't rich now, you ain't never gon' be rich\nI told 'em if I can get 7 figures nigga, than why settle for 6\nIf I got beef and tha cops around I'm gonna relax and click clack later\nTha type of money I'm gonna get, automatically gonna attract haters\nI keep a steel, keep it treal, keep it real\nSilkk and Mista Magic gonna keep some mills (fuckin' keep it gangsta)\n\n(Magic)\nNow I'm drivin' a Navigator\nPassin' up all tha haters\nI'll see you niggas later\nI'm on my way to makin' paper\nNah nigga here can fade us\nBitch we straight creatas\nBut nuttin' for free, you muthafuckas better pay us\nI'm gettin' hot, got niggas changin' they verses\nAn I ain't I near bout finished it gets a whole lotta worser\nI usedta snatch purses, done sent plent niggas to hearse's\nIf they didn't die then ythey surrounded by nurses (now that's gangsta)\n\n(Chorus: Magic &amp;(Silkk))\nWe keep it gangsa dawg (yo yo)\nWe keep it gangsta y'all (all my killas sing along)\nWe keep it gangsta dawg (yo yo)\nWe keep it gangsta y'all (East coast, East coast yo)\nWe keep it gangsta dawg (keep it, we keep it gangsta dawg)\nWe kep it gangsta y'all (West coast, West coast yo)\nWe keep it gangsta dawg (yo yo)\nWe keep it gangsta y'all (Down South, Down South yo)\nWe keep it gangsta dawg (yo yo)\nWe keep it gangsta y'all (Midwest, Midwest yo)\nWe keep it gangstadwag (yo yo)\nWe keep it gangsta y'all (No Limit, No Limit yo)\nWe keep it gangsta dawg (yo yo)\nWe keep it gangsta y'all (TRU records, TRU records yo)\nWe keep it gangsta dawg\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Wanna Get Away", "href": "Wanna_Get_Away&&7796", "artist": {"unique_name": "Magic"}, "lyrics": "(Peaches/(Magic))\nMakes me wanna get away\n(I wanna get away)\nIt makes me wanna get away\n(I wanna get away)\nIt makes me wanna get away\n(I wanna get away)\nIt makes me wanna get away\n\n(Magic)\nIt's not a day go past I don't get a call, somebody need me\nAnd I glance and I see my niggas on the TV\nLying dead, front page of the paper\nI close my eyes, wishing I can wish this shit away, but I can't\nFour other people died that day\nAnd I know their families probably feel the same way\nFour other families felt the same yesterday\nYou don't think that's enough reason for us all to pray\nTwo girls got raped and they lost their virginity in my viscinity\nSix more of my niggas on their way to penetentaries\nJust watch the news, every day it's fuckin' problems\nThey feeding evil to our people, making promise\nQuick to point the finger at the mama's\nBut what about the men's,\nThey always making promises to make it better\nA bad plane crash, J.F.K. Jr.\nThat was the world, my heart goes to ya\n\n(Peaches/(Magic))\nMakes me wanna get away\n(I wanna get away)\nIt makes me wanna get away\n(I wanna get away)\nIt makes me wanna get away\n(I wanna get away)\nIt makes me wanna get away\n(I wanna get away)\n\n(Magic)\nAnother morning, ain't nothing changed, devil's still at my door\nSo I embrace myself for life as I pick my glock up off the floor\nGot so many words, Lord when will my mind be free\nEverything that look gold just ain't gold,\nShit y'all would like to be me\nI always thought that money would make me happy\nBut it seems to add to my stress\nBelieve me I ain't complaining, cause y'all know this life is a mess\nI mean I'm blessed, must confess, brought me from the bottom to the top\nBut was it a test, the reason I was put in this spot\nI lost my daddy when I was only eighteen years old\nAnd I found out that same year this world is colder then a polar bear\nDig that advantage, life is stressing me out\nA nigga got to go through all this bullshit just to make him some clout\nThis world is like a puzzle and I'm just trying to fit\nWithout putting myself on that road to that bottomless pit\nForgive me Lord, y'all know that I ask something rich\nIt's just a shame that this life is a bitch\n\n(Peaches/(Magic))\n(It makes me wanna get away)\nMakes me wanna get away\nIt makes me wanna get away\n(I wanna get away)\nIt makes me wanna get away\n(I wanna get away)\nIt makes me wanna get away\n(I wanna get away)\nIt makes me wanna get away\n(I wanna get away)\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Thugs", "href": "Thugs&&3786", "artist": {"unique_name": "Magic"}, "lyrics": "(Magic)\nOK, let the fuckin' dogs come through OK?\nGet the fuck out the way man\nAnd let the fuckin' dogs come through OK?\nThis belongs to us man.\nWe the fuckin' thugs.\n\n1 -\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Soldier", "href": "Soldier&&1392", "artist": {"unique_name": "Magic"}, "lyrics": "Chorus: Magic\n\nBitch I'm a soldier (until the day that I die)\nA No limit soldier (yes I am, yes I am)\nI thought that I told ya (and nothing or no one could ever change that)\nAin't no need to ask me why I'm a soldier till I die.\n\n(Magic)\nI'm a soldier see the tank on my neck?\nMr. Magic is my name y'all better give me respect\nYou might remember me from seein' me postin' up on the block\nWith a .45 Glock\nAnd a mouth full of rocks\nHustlin' like I didn't even care\nWakin' up my neighbors poppin' pistols in the air\nTryin' make a million pullin' all night flights I'm praying 'cause I'm\nKnowin' that my life ain't right\nForgive 'cause I'm wrong but I'm begging or forgiveness\nAnd now I'm hustlin' in a whole other business\nTryin' to do right for the people that I hurt\nIn the process of growin' up\nI've change my ways I guess that's why I'm blowin' up\nI'm comin' back for all my peeps\nJust try to stay alive and keep your ass off the streets\nFor the ones that gotta hustle just to eat\nLord, I say a prayer for you before I fall asleep\n\n(Magic)\nHow man heard Sky's the Limit?\nShit I ain't finished this is only the beginning\nI'm with no limit\nJust think I'm in my prime\nIf I'm not the best just give me some time and I'll change your mind\nNiggas like me hard to find\nGenuine I'm the only of my kind young black and full of pride\nWith a mind to teach the whole world\nIf you just listen to my words\nY'all can feel my pain\nA lot of years wasted, buku friends died a lot of wet faces\nThe other half caught a bunch of fuckin' cases\nSo still a lot of tender spaces\nWish I could erase the hate\nWho said money makes you happy?\nIt can never bring back my daddy\nSo fuck the Navi and Caddie\nI'm hopin' y'all could hear me\n'Cause I'm speakin' this from the heart\nMe and my fans never torn apart\n\n(Magic)\nAnd to the haters that be hatin' on my click\nFind a spot in line or suck a nigga's dick\nI'm gettin' a lot of call now\nBunch of fake bustas I couldn't ever trust ya,\nFuckin' blood suckers\nWant me for the gift that you never thought I had\nI saw your other side, but fuck it I'm mad\nYou say a lot of shit but you never ponit the finger\nI'm guessin' that Mr. Magic gon' remember\nSurprisin' a lot of so called superstars\nPassive comments but really don't want go to war\nNot with me my reputation stands for itself\nJust pull the disc out can't keep it on the shelf go and get it like\nIt's the last one left\nI work the piss out the people who press 'em\nI thank the lord for such a wonderful blessin'\nEvery word that I speak is a lesson\nHard to believe that this nigga is from the projects\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Puff Puff", "href": "Puff_Puff&&2093", "artist": {"unique_name": "Magic"}, "lyrics": "Here's that fire shit right here\nHere's that top of the line Cali\nYa heard me?\nLook...\nHey brother it's that fire you ain't gotta do all that just smoke him up iight K know pass it\nYou gonna learn how to use that rotation dogg\nIt's like this...\n\nPuff Puff pass the shit\nHurry up that's doja bitCh\nYou used to smoking that regular shit\nSo hurry up and pass it\n\n(MagiC)\nPass me the dope man and let me smoke,\nHigh as a kite and I'm bout to Choke\nI'm so loaded it's hard to Cope,\nSeems like everything is a joke\nMoving in slow motion, ChroniC is the potion\nGot me with the feeling I need\nI just wanna smoke all day, sippin Cran and tangeraie\nWith my windows down hollerin' at people from 'round my way\n(Wassup ni66a) hit this I'm with the good shit\nI'm through with smoking bullshit\nI gotta ConneCt, that's full in effeCt, and that's our little seCret\nI ain't gonna lie my troubles over, help me put down my revolver\nIt gotta be good anytime that I Can smoke it with my father\nIt never harmed a soul even tho some people say it do\nI never heard of no one dying over weed and that's the fuCking truth\nSo I'ma smoke and I'ma smoke until the day I fuCking die\nVery seldom you will CatCh me without a gloss in my eye\nSmelling like a pound of indonesia, that other shit will tease ya\nYou need something to please ya, send you into seizures\n\n(MagiC)\nSmoking on that fire, really get's me higher,\nKeep my fuCking mind at ease\nSinCe I been smoking on dat doja,\nI Can't keep my Composure, Can you roll another one please?\nMy moma don't like it but I'm a grown man,\nAnd she just don't understand\nThat when I'm red I'm a better man, but still bout my Cheddar man\nI went to JamaiCa and smoked myself Crazy with my lady\nTrying to make a baby, right after C-Murder paid me\nMy habit is a zone a week, yeah its illegal but it keeps me peaCe\nSo why in the fuCk the poliCe keep on trippin' on me?\nI ain't 'bout no trouble when I'm high,\nYou think I'm gon fight shit I'm too tired\nYou Can Cuss me out I look in your faCe and pass you by\nIf I was the president I'd make this shit legal\n'Cause if everybody was high then nobody would think of evil\nAm I ever gonna quit this shit? Man you gotz to be jokin'\nAs a matter of faCt please excuse me while I'm smokin'\n\nLet me see the lighters of all the smokaz\nEvery smoka put yo lighter in the air\nIts time to smoke\nEverybody let's get high at the same time\nOn the Count of three\nOne... Two... Three...\nMmmmmmmHmmmmmm\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Thank You Lord For My Life", "href": "Thank_You_Lord_For_My_Life&&9191", "artist": {"unique_name": "Magic"}, "lyrics": "Magic\nMy Lord, our father.\nThere's so many things I need to say.\nAnd alot of people don't wanna hear it.\nBut ya know what?\nI'm a say it anyway.\n\nI thank you Lord for my life\nForgive me Lord for complaining so much\nI thank you Lord for my life\nYour the only one that understands my pain\n\nI'm twenty three, I done seen the whole world rot\nEvery type of crime, loud cheers from the audience,\nThey was jocking my style\nBuck wild, doing my thang, fulfilling my dream\nShit, I remember thinking about back when I was a teen\nI know I'm blessed, just having this tank around my chest\nCause every city that I been to homeless people facing death\nI shed a tear, could never understand their pain\nCan't even shelter their own families in the pouring rain\nWhat did they do to deserve this life\nWas it so horrible to make them serve a homeless night,\nShit ain't right\n'Cause we eating, sleeping in good health\nWhat we don't want we throw away, thinking only yourself\nPeople need help, this generation we lost\nCrying for what we want, not just crying for what we need\nMen have to hunt just to feed\nAnd we complaining bout bullshit\nWhen we should thank him for the smaller things we did get\n\nI thank you Lord for my life\nForgive me Lord for complaining so much\nI thank you Lord for my life\nYour the only one that understands my pain\nI thank you Lord for my life\nForgive me Lord for complaining so much\nI thank you Lord for my life\nYour the only one that understands my pain\n\n(Mia X)\nFather I thank you for granting me another day to open my eyes\nSo I can see my little boy and girl play\nPray for so many worldly things I lust and greed\nGot us calling on you mostly when we think that we need something\nAnd we be running to the Bible when we locked up\nBut when we free we tryin' a tear the block up\nNegativity's embedded in our brains along with the mental chains\nThat we wear thanks to the slave masters game\nI came to humble myself, cause through your mercy and grace\nI got my freedom, my health and my spiritual wealth\nMy faiths been tested many times, the devil's so busy\nBut you gave me strength to conquer evil, Lord I feel you in me\nPlease forgive me for the times I haven't been right\nAnd God, I thank you for this precious gift, my life\nI love you Lord\n\n(Magic)\nLord.\nMe and Mia.\nWe do this all for you.\n\nI thank you Lord for my life\nForgive me Lord for complaining so much\nI thank you Lord for my life\nSee, I'm trying to teach the whole world\nI thank you Lord for my life\nForgive me Lord for complaining so much\nI thank you Lord for my life\n'Cause it's you that understands my pain\n\nI hear people complain they fat but you blessed, people hungry\nWhat you don't see those children on TV, starving and bony\nYou phony, would they complain if they could eat half that you eat\nOr maybe sleep some of the places you sleep\nI hear people complain they broke but you blessed cause you living\nBetter start thanking the Lord for the life that you was giving\nNot a preacher but I'm preaching to the people I can reach\nTell 'em you say your prayers 'fore you fall asleep\nIf you ain't saying your prayers then you ain't getting no blessings\nIf you ain't getting no blessings, that's why your ass is stressing\nI'm trying to teach a lesson, if you listen to the words I speak\nYou can see my Lord is the quickest way to get back on your feet\nParents should be teaching this just as soon as your born\nWouldn't matter it's out the Bible or the Holy Ahran\nEverything is everything and my God is the beginning\nWith him, no losers, just winners\n\nI thank you Lord for my life\nForgive me Lord for complaining so much\nI thank you Lord for my life\nYou see I'm trying to teach the whole world\nI thank you Lord for my life\nForgive me Lord for complaining so much\nI thank you Lord for my life\nYou can truly understand my pain\nI thank you Lord for my life\n\nI mean, just think about it.\nEverybody in this world are sinners.\nIt never matters to him.\nBecause we all his children, you know what I'm saying?\nEverybody here is capable.\nHe's coming back someday y'all for us.\nSo you gotta straighten out your life, know what I'm saying?\nStop complaining about all the small things.\nStart waking up in the morning and thanking for things that you have.\nYou know people that's blind\nWill give up everything they have just to have sight.\nPeople with no fingers\nWill give up everything they have just to have a hand.\nAnd you get up and you complain about small things.\nYou can't pay a light bill.\nYou can't put gas in your car.\nBut your walking, your breathing.\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "Do You Really Want Peace", "href": "Do_You_Really_Want_Peace&&846", "artist": {"unique_name": "Magic"}, "lyrics": "C-Murder talks\n\nChorus-C-Murder\nNow do you really want peace\nOr do you really want beef-(2x)\nYou say keep it real\nIt's all about the game\nBut when you live the street life\nIt can bring you so much pain\n\n{C-Murder}\nNow I'm tryin' and pryin' and\nPullin' dem hoes\nSmoking so much green\nI just can't feel it no mo'\nNow when I'm high ain't no lie\nI'm kind of stronger than before\nI lose my buzz and I wonder\nHow that blood go on the floor\nNow I'm competing wit' nobody\nMy gun is bigger\nNow I ain't looking for trouble\nBut I ain't runnin' from no nigga\nI meet aside for my nigga\nReincarnating get revenge and granting wishes\nLeave the bitch wit' his jealous friends\nAin't nothin' mo' dangerous than a man in denial\nAsk the Hail Mary please baptize me in eternal fire\nCause evil lurks behind every door\nPapa killed hisself\nI guess he couldn't take it no mo'\nAnd livin'young and dumb\nNiggas hustlin' for fun\nHoes addicted to dubs like fiends addicted to drugs\nMy young victims on these killin' fields\nWishin' for peace\nBut see the opposite of ??? is dead-end streets\n\n{Magic}\nNow do you really want beef huh\nYou showing off in front of dem chessy broads\nWhat I supposed to blow this off\nFuck that shit I'm going off\nSay Fath let me holla at you about something\nYou got a light (Here) (gunshot blast)\nThen I start to dump it\nDidn't matter where the fuck we at\nYou gonna get ya issue\nSo tell ya papa bye-bye\nAnd I know that he gon' miss you\nBut my nerves bad and\nI don't play no games wit' ya\nNow ya mama eyes running masscara she need tissue\nDressed in all black\nThis could've been avoided\nBut ya started now you're dearly departed\nHit'em wit' a mickey\nFakin' like a waiter\nHe drinkin' gin and juice\nHe'll never taste the flava\nA few seconds later he gettin' all dizzy\nFallin', reachin' for the table\nOnce yoy croos the line fuck peace\nAnd I won't rest until yo' funky ass deceased\nYa heard me\n\nMagic talks\nMusic till fade\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}, {"title": "That's Me", "href": "That%27s_Me&&502", "artist": {"unique_name": "Magic"}, "lyrics": "Magic talking:\n\nI'm that motherfucking nigga everyone asking about.\nY'all know who the fuck this is.\nThat nigga-nigga Mr. Magic. (huh)\nThat nigga-nigga Mr. Magic.\n\nThat's me motherfucker that's me (Who that is be with P?)\nThat's me motherfucker that's me (Who that is be with C?)\nThat's me motherfucker that's me\nI'm the one they call Mr. fucking Magic\n\nI treat the mic like a blunt so watch Mr. Magic get high\nSpitting lyrical fire till they day I die\nY'all remember me as that shadow that jumped out of the midst\nMaking hit after hit and got the whole rap game pissed\nGot 'em wondering where I came from\nStraight from hell the first nigga to make Lucifer run\nYou underestimate my consistency\nLook like you waiting a weak verse nigga you might as well get rid of me\nMad cause you can't trigger me\nWhich angle is I come from, mad cause you can't catch me son\nI already won and believe the best is yet to come\nI'll be flippin MC's until the day that I'm deceased\nAnd got every record label waiting on my contract to be released\nI mean all in the pentenaries, niggas is probably mentioning me\nGive or take a couple of years, I'll be the man eventually\nYou can't stop what supposed to be\nI'm the one, I'm the chosen man, That's ME\n\nI'm the whisper you can hear in every project hall\nThe conversation you can hear through every crack in the wall\nThe funny noises you can hear in your house when it's dark\nThe biggest upset in years 'cause I'm at the top of the charts\nGot niggas wondering why the fuck they struggling\nI guess that's a fucked position that Magic put you in\nBut it's my turn so give me some breathing room\nYou ain't on a nigga's ass killer but that's cool\nIt's all to be expected shit you let me know I'm competion\nBut there's alot more to me that you niggas couldn't even vision\nGive you a run for your money and bitch I'll take your shit\nI'll run your pussy ass home like a bitch\nSee ain't no studio up in me, better not offend me\nI'll rape Barney and kill Officer Friendly\nShoot at the sheriff and the motherfucking deputy\nSee I'm the one you looking for motherfucker that's ME\n\nJust name a designated time and a designated place\nPoint them niggas out and I promise they be erased\nAin't a fake bone in my body, If I did I'd take it out\nIn front of the whole world so nobody would have doubt\nThat nobody could take me out, I'm just in a half-clout\nForgive me if I'm wrong but my money is what I'm bout\nMy dope is high coat, smoking po-po till I die\nTrying to make a couple mill 'fore the age of 25\nI spin and been like a motherfucking tornado\nCut your from nose to navel, now that shit gonna potato\nIt's kinda hard to believe that a nigga like me from the C-T-C\nWent from serving fiends to posing in magazines\nNigga we hustled on the same corner\nThe only difference is my hustle was a little stronger\nI say you should go and fear, you got the right worry\n'Cause I was created to make end careers early, ya heard me?\nThat's me motherfucker that's me (huh)\nThat's me motherfucker that's me (nigga-nigga what)\nThat's me motherfucker that's me (nigga-nigga what)\nI'm the one they call Mr. fucking huh what\n\nMagic talking:\n\nAnd if you don't know now you motherfucking know\n\n", "album": {"title": "Thuggin%27_(1999)&&3788", "genre": "Southern Hip Hop", "year": 1999}}]