[{"title": "The Calm Before", "href": "The_Calm_Before&&8", "artist": {"unique_name": "Mars_Ill"}, "lyrics": "I left my footprints on the ocean's waves before the storm came\nBut form changed to man overboard sinking self-aware\nThinking no one's there to catch me when I fall to the sandy floor beneath the coral reef\nI pray the Lord my soul to keep. he holds the deep in his palm\nAnd simultaneously, he gives his hand to me\nThe salty sea that made my eyes to weep is now beneath my feet\nWith concrete stability, steps I take to moves made critically\nPeripheral at a standstill as Divinity makes his presence felt physically\nIt's miraculous but true. It's all for you\nBut the fact is that modern man is scared to death and torn in two\nBecause the truth draws him higher, undercurrent holds him down\nAfraid he'll drown, he forgets those pieces of peace he might have found\nWell at least he struggles 'cause to stroll too easily through those puddles\nLulls you to sleepy dreamscapes where your sensibilities are muddled\nAnd I know that if he seeks God, he'll recognize him when he sees Him\nAnd he'll realize whose hands he needs to be in...\n\nWhen disaster strikes the field, the likes of them head for the hills\nTo regroup their bearings on their enemy till they're ready, dressed to kill\n\"It's better to feel safe than live in fear.\" I ask 'em, \"Why is that?\"\nThey responded, \"We need stability in this comfortable habitat.\"\n\"So send the lower middle-class to the front lines, their death will protect us.\"\n\"We'll talk loud and hide behind our penthouses and brand new Lexus.\"\n\"It affects us to a point. Didn't you see the stock market crash?\"\n\"We couldn't sacrifice our buying power. Tell me, how smart is that?\"\nI said, I saw the blast, heard the crash of lives shattered to pieces\nSaw a street preached yelling loud and holding a sign about Jesus\nI agreed and kept walking because I'm not quite sure what to do\nI tried to front and talk a lot of patriotism, same as you\nBut the ideas ain't really new, see genocide, it happens globally\nWe just get shook up when it happens locally\nSo, love one another and be wise. Don't foster malice\nIn the name of revenge for Country until your soul turns callous, soul turns callous...\n\nBefore the world premiere of dawn light switched on and day broke through\nBefore the sky was blue, before any big-bang or primordial ooze\nBefore man stepped on the scene in his prowess unprepared for the challenge\nBefore the planets were set in place to hold the galaxies in the balance\nBefore time, before reason, rhyme, love, hate and emotion\nBefore the seasons, before the first word was spoken or heart was broken\nBefore defiance turned to evil revolt and all Hell broke loose\nBefore any creature would even dare to contradict his point of view\nHe was there, God, triune, omnipotent, controlling existence\nBefore people claimed to serve the Crucified was a slave religion\nBefore the fall of Adam imprisoned descendants with original scars\nBefore you were born of your mother to try to figure out just who you are\nBefore war and confusion, before reality, before illusion\nBefore the beginning, Elohim had mapped out all the conclusions\nBefore the restitution to come that Revelation promises all of us\nNot Nostradamus' blind predictions through delusional blurred vision\nThe calm came before the storm with power to kill\nThe calm is present now and it lives within me still\nThe calm is present now and it lives within me still\nThe Calm is present now and he lives within me still...\n\n", "album": {"title": "Backbreakanomics_(2003)&&431", "genre": "Christian Hip Hop", "year": 2003}}, {"title": "Sideline Speech", "href": "Sideline_Speech&&4159", "artist": {"unique_name": "Mars_Ill"}, "lyrics": "(Verse 1: Manchild)\nI got these blind musicians watching me listen to their songs\nAnd I think they're catching on there's a chance that I might not belong\nThey got it wrong behind the rabid barks for justice\nWhere you can support the cause from where the movement never touches\nDearly beloved, I can see the devastation so clearly\nAnd the night sky protects me when I'm running with the moon\nI wanna help the lepers, I just don't want their sickness near me\nI guess if you can't sing the song, you can try to hum the tune\nI got these dues I'm paying and I guess I'm almost even\nWhen I was stepping to the A.M., I could have sworn I caught y'all sleeping\nI rhyme for a reason beyond the regional limits that block them\nMy double-sided tongue is sharp and it can't be boxed in\nThey're caught between some rock\nRap fusion garbage\nAnd a hard place to taste the truth and everybody makes do\nHEY YOU! Yeah, I'm sorry, you don't get to play today\nBut after my crew wins the game, you can soak the coach with Gatorade\nIt's safe to say you're a ways away from the action\nYour image is imaginary and this song is love-tapping you on the shoulder\nAnd asking, \"Is this what you had planned?\"\nWhile I'm slapping 'em senseless, you can feel free to bystand...\n\nCan't really see from the cheap seats. Can't hear unless you listen\nCan't get on the field and play if you don't got the right equipment\nCan't hear what you're saying unless you step up to the mic\nWanna see life? Well this is what it looks like\nCan't see from the cheap seats. Can't hear unless you listen\nCan't get on the field and play if you don't got the right equipment\nCan't hear what you're saying unless you step up to the mic\nWanna see life? Well this is what it sounds like...\n\n(Verse 2: Manchild)\nConspiracy theorist backpackers, you don't have to run any faster\nThe government's not really after you, kiddo, you're just a rapper\nBut slave masters to exist, so point at them and wave your fist\nMedia's agenda becomes the mark on your head and plus your wrist\nThis is just in case you doubted that Mars ILL was about it\nWe linked with Bigg Justoleum for this public service announcement\nYou are not your outfit or the car that you drive\nCommercials keep you needing what you don't really need to survive\nYou grow sedated, addicted to a lifestyle\nPlanned parents become barren, juggling a choice and a child\nOf course it's a trial to speak loud and walk straight\nI've found a voice is a terrible thing to waste\nWake Up! Take up your cross-section of the populace and follow\nYou're not promised tomorrow\nSo just move, move, we can't stop speaking until they all know\nWe're not promised tomorrow...\n\n(Verse 3: Bigg Jus)\nSeminal mimicry trickery gloomy cavalry garrisons\nWho battle charlatans who love night targeting\nThe faintest comparison imbalancement crucially embarrassing\nSo woefully inadequate\nStaring at other rhyme ancient and tailored so massive\nArmchair quarterback chemical ali HAZMAT\nYou're just a little boy in a bubble with unrealistic dreams of a rap body double\nAnd rhyming as a meal-ticket\nThat's why this culture got you lovesick\nBorn word eternal, life orbit, Keebler elf timing\nCouldn't even flow on beat if the kick and snares were color coded\nWith dreams of a new bullet-proof 7 all dubs and silvery\nBut you lack any bass in your voice, cadence or delivery\nAnd there's already been two Agatha Christie unsolved rapper murder mysteries\nDon't let the sharks smell the bloody chum in the water\nAnd start a feeding frenzy\nSometimes I feeling like I'm in an underground purgatory\nTrapped between materialistic playa gunfire\nAnd suburban nerdy voice, funny voice falsetto\nWar prone with a howitzer patrolling the 33rd parallel rhyming no fly zones\nWith homeland security all tainted and corrupted\nIf you ain't coming with that '88 Daddy Kane R-A-W\nLike it was on the eve of destruction\nTrust me, don't even touch it\nOr get left on the side of the road and circled by buzzards\nOr fossilized in some tar pit\nWe call it craps now they be triple and doubling it\nEver since Tupac's style gave birth to quintuplets\nBiting is not a birthright, you starry eyed chipmunk\nGazing in the 18-wheeler headlights, waiting for the collision\nSoccer-mommy waste of battle ammunition\nSo younguns, we lop 'em off earlier than circumcision\nStay hidden, Jiminy Crickets and all is forgiven\nThis was craft worked at Dust's crib\nThen manchild slid to haunted gorilla silver back mountain lion of Judah\nThese bear paws hide zirconium claws made for pouncing\nEven though I don't eat meat anymore\nIt's just order of selection prototype\nMC's look tasty like melon, tofu and curry rice. Mmmmmm\nSucculent with the slightest hint of lime\nWay up in the nosebleed seats with torn ACL's on the sidelines\nComing rougher than one time with colorful things that go bump in the night\nAnd magical 180 reverse suplex clotheslines\nYou need to slow down and think twice\nYou ain't a risk taker with the flow. You're a risk taker with your life...\n\n", "album": {"title": "Backbreakanomics_(2003)&&431", "genre": "Christian Hip Hop", "year": 2003}}, {"title": "Inside Out", "href": "Inside_Out&&422", "artist": {"unique_name": "Mars_Ill"}, "lyrics": "Building in a cell block, shocked at the mystery\nUnlocked the misery kept inside his body's chemistry\nAnd when he's by himself, he has to cry to keep on living\nReads letters from his children from far outside the prison\nAnd it isn't enough that he didn't pull that trigger\nJust a neighborhood fixture on the corner drinking liquor\nA two-time offender who got caught up in the moment\nWas close by when a robbery was operated sloppily\nAnd somebody got shot and son was fingered in the line-up\nTossed into a 6x9, stuck because his time's up\nFine luck, had to beat a brother on his first day\nTo protect his own best interest in like the worst way\nBlames the system that built jails instead of schools\nBlames religion as a set of useless rules\nBlames his father that he never even knew\nLooks in the mirror. Yeah, he blames him too...\n\nHe starts to read books, an empowered resolution\nMalcolm, Dr. King, Mumia and Huey Newton\nLearns that nothing worth having is ever gon' be easy\nHe studies philosophy while everyone's watching TV\nAnd after 33 weeks, he starts to do the science\nSees God's handwriting there underneath the fine print\nIt had been there all along just waiting for him to find it\nBut he'd been blinded by his time spent trying to fight it\nBut the spark ignited the fuel inside him\nAnd now he holds the flame that burns the brightest\nBecause the slightest touch from the heavens can heavily change the tides\nOr tip the scales to either side of the problems in our lives\nHe found faith in a cage and his mind's already free\nAnd he can float through these walls far beyond what he can see\nHe sees his cell as a cross that he'll carry if need be\nBut of course his body wants to join his soul and be free...\n\nSo he's a new man, motivated to slice through the hatred\nAnd radiate to those that play with death and want to take his breath\nHe'll make each step count for something greater\nUnderstands that he can hate the game and still love the players\nHe shares his cell with another one-strike-too-many-type of Jon Doe\nWho wants his rights back though\nThe conversation words flow and get kind of thorough\nAnd it just so happens that they're from the same borough\nFrom the same neighborhood, from off the same freeway\nFrom the same ghetto and from the same PJ's\nAnd Jon Doe knows how his situation started\nHow kids were busting shots at their local supermarket\nOn that one fateful night that changed our hero's life\nAnd how he got knocked wrongfully and how it isn't right\nBut strangely, our man is calm and doesn't lose sight\nHe knows that he was broken so that he could find Christ\nAnd for that he's thankful, no shank pulled got him\nHe's never felt so high while he was standing at the bottom\nAnd after six months, a judge heard his appeal\nReleased into a city that becomes his mission field\nHe pulls a free breath that feels fresh despite all the smog\nHe used to hit the bottle but now he fights for God\nAnd since he's seen it all, he can say what it's about\nAnd to think this all started from the inside out...\n\n", "album": {"title": "Backbreakanomics_(2003)&&431", "genre": "Christian Hip Hop", "year": 2003}}, {"title": "Lump Sum", "href": "Lump_Sum&&8916", "artist": {"unique_name": "Mars_Ill"}, "lyrics": "Dear Dad, the class began, hands were held and arms were open\nMoments stolen from the globe and life's blood was always spoken\nOne was chosen for another. Broke my will against your wisdom\nPushed my face towards the light so I could cultivate the vision\nMade decisions for the unit. Hard times, you moved us through it\nBy each word and every movement, you're the one who showed me what truth is\nThanks for the blueprint passed down. I'll grip it by the cover\nPlus you showed me how to love my wife by the way you treat my mother\nAnd Mom, you sacrificed your body, scarred beneath the weight\nTo usher my soul into the universe, human contact, you were first\nThrough the worst I had to offer, caught his mercy in your stare\nYou were there. Patched my wounds an protected me with your prayers\nGave me food when I was hungry. Gave me love when I was empty\nGave me a look of knowing solitude when I said where God would send me\nThanks for the days and the nights, the laughter and the fights\nTeaching me wrong from right, Mom, the first woman in my life\nTo my brother, thanks for the beatdowns and the harassment\nIn you I learned to express my views with heated passion\nFollowed your footsteps good or bad, so please get the facts straight\nMy big brother introduced me to this and gave me my first rap tape\nI watched you grow up, thrive, prosper and self destruct\nFind the jewel in circumstances that sucked but still you stuck\nA husband and a father, a brother and a son\nKevin, I'm so proud of the man that you've become\nPam, Jeff, Billy, Cliff, Paine, David, Terry, Chris, Ricky\nThe names stick with me, the names stick with me\nJason Lee, Ben Heaton, Josh Cleveland, Eric Sartain\nTrent Gibson saw the best and the worst I've ever given\nSintax, I'd bend back the sky and shift the balance\nI thank you for your strong mind, your friendship and your talent\nYour example to all that witness 'cause there's no \"I\" in crew\nYou inspire me brother 'cause I can see Christ in you\nDust, where to start? The art's answer to my question\nBlessed from lessons together that's always led to progression\nThis profession needs your genius to show cats what it's about\nYou keep making the music and I'll keep running my mouth\nPlaydough, Harry Krum, enough heart for every alias\nThanks for helping me carry the torch as we take these kids\nListener, Illtripp, Fred B, Recon\nRabbi, Manuel, Sev Statik and Sivion\nIt's on until we change the face and finish what we started\nI'm thankful that you're all a part of this\nYeah it's on until we change expression, finish what we started\nDeepspace5, it's never stopping\nMary, I don't have the words to get across my feelings\nI breathe a purer form of oxygen when I'm staring at your face\nI can rise above my limits and break through this vaulted ceiling\nI'm a better man today because you occupy my space\nI hit the road, you hold it down and shun the glory\nI'll be the mouthpiece for your heart and I'll tell the world our story\nThanks for bearing our children. Thanks for sharing your life\nThanks for saying, \"Yes,\" May. Thanks for being my wife\nTo my daughters and all unborn and future seeds\nI look at the world through your eyes and you always help me see\nInspiration in your innocence and the future in your face\nI write these songs so I can make your world a better place\nAnd that's all to say that all that I am is a collection of souls\nThat God has used to touch me. Changed a reflection\nMade a man from a simple stick-figure\nAnd if I've ever met you, then you helped him paint the picture...\n\n(Repeat 3X)\n\n", "album": {"title": "Backbreakanomics_(2003)&&431", "genre": "Christian Hip Hop", "year": 2003}}, {"title": "Enterchange", "href": "Enterchange&&8923", "artist": {"unique_name": "Mars_Ill"}, "lyrics": "I got seven ways to say something different\nIf you're allergic to the truth, then I suggest you keep your distance\nPlug your ears and listen to the sound of a hard heart\nWhose trust was pulled one too many times by these card sharks\nI spark a charge that darts across the charts\nSet far apart from the garbage they're calling our art\nI start a lot of controversy. Afraid that we're dissing you?\nFrom the big willie cats to the underground and miniscule?\nHonestly, it's anyone polluting the subliminal\nIf that's you, retribution is unconditional\nI'm willing to commit career suicide\nIf I know that it could fill all your emptiness inside\nBut I'm confident that top-billing and ripping the veil\nIs my job and heart throbs with all it entails\nCan't fail, found success when feet hit the trail\nDues paid? Yes y'all, check's in the mail...\n\nIt's all about timing and it's about time\nTo get inside your spine and change your state of mind\nYou waiting for the music that you need to remember?\nForget all the rest, 'cause that's when we enter\nRight about now, we step into your space\nRun up on your intellect and look you in the face\nAre you tired of being lied to? That's all we're asking\nIt's time for a change, Mars ILL, enter the dragon...\n\nWe did a show but nobody showed up\nWe did another couple. Ten people came to show love\nNot trying to blow up, just need to make this music\nCan't explain it. It's just like I'm breathing when I do it\nKeeping muted's not an option. It's more like a death wish\nGot verses trapped inside and I gotta let them exit\nThe curse I'm blessed with, I consider very precious\nProceed with caution. This could crack your solar plexus\nNext, we did a few hundred shows in a row\nHit the road time and again and watched the revolution grow\nKeeping it moving to help you establish what's what\nWatch the masses mouth the words to \"Sphere\" and \"Love's Not\"\nWait at the bus stop with agenda in hand\nYelling, \"Bust shots in the air, not into your fellow man!\"\nTell a friend, tell a foe and I'll tell a few of mine\nWe can change the whole world one soul at time...\n\nM-A-R-S-I-Double L\nRocking the bells, so go home and tell\nEveryone on your block we got records to sell\nM-A-R-S-I-Double L\nM-A-R-S-I-Double L\nRocking the bells, so go home and tell\nEveryone on your block who taught you how to spell\nM-A-R-S-I-Double L...\n\nYeah, you talking loud, but you ain't saying no thang\nThrow slang across the map and watch both coasts change\nGrow fame one step at a time. Start with no name\n\"Breathe Slow\" banging in the front row sang by\nEveryone who came to the show, change the old game\nSee everybody doesn't flow the same\nSo take your gold fangs and fronts and say what you want\nBut understand that I've held your number from the jump\nIt's something sort of resembling your new favorite record and rap group\nGrab raw skill and toss it at you\nGet under your skin like a tattoo with permanent results\nThat's provided you have a pulse\nFull of useful information on life, love and hatred\nLearning from mistakes, the breaks and proper placement\nKnowing when to dish it out and knowing when to take it\nGod is the answer when all else is makeshift...\n\n", "album": {"title": "Backbreakanomics_(2003)&&431", "genre": "Christian Hip Hop", "year": 2003}}, {"title": "Breathe Slow", "href": "Breathe_Slow&&3774", "artist": {"unique_name": "Mars_Ill"}, "lyrics": "It's the beginning of the 9th inning and I'm winning\nYou'll find me mind-bending inside of each five-minute time limit\nAnd it's documented, we're breaking bones of contention\nFine tuning what's spinning and expanding my dominion\nThese upper-handed dimensions all contributed to the folklore\nGot rappers raising their standards, fans demanding what they'd hoped for\nCramming letters in a bottle. We'll just call it a test tube\nMy style is Aristotle mixed with Krush Groove (So Just Move!)\nAnd watch my verses cut through when you hear the words I Love You\nBreak off a piece of my heard tucked into every record groove\nAnd you'll walk different in these corrective shoes\nBut you'll recognize the revolution and act out what most don't get to do\nYou'll take what's meant for you, no longer survive on what they pass down\nWin or lose, you'll live your life knowing you never backed down\n'Cause man shall not live by the bottle alone\nI keep a fist raised to the sky so you can follow me home, it goes?\n\nIf you know like we know, BREATHE SLOW\nBREATHE SLOW?(Repeat)\n\nUntil my body cracks the pavement and shakes the face of the basement\nLacing the foundation with scars that sacrifice is bound to leave\nBreak inner-city boundaries so suburbanites are down to see\nThis cultural way of life and how music is more than sound to me\nBut freedom's lungs are heavy from pushing these smoke signals out\nAnd we've become so disillusioned that we're scared to notice\nThe eviction notice speaking its clout with screams and shouts, but trust me\nClarity's waiting there on the other side of your focus\nSo snatch the breath from blasphemy emphatically\nTransform naturally, control the art before it masters me\nBreathe slow and hold the hand of whoever you can reach for\nTouch the ones you've never seen before till the common good is restored\nTill the homeless are all execs and capitalism yields to ethics\nTill janitors live in mansions and schoolteachers can push a Lexus\nTill beef is deaded and debt is erased or collected\nTill the projects and country clubs are now and forever connected\nI'll speak my messages till they get it\nUntil you're touched by something sacred and love is all that you're left with\nBlessed is the head that shares the crown that he possesses\nConsider yourselves my brethren and this song is my confession\n'Cause man shall not live by the bottle alone\nI keep a fist raised to the sky so you can follow me home\nAnd all your problems can't be solved by one call on the phone\nI keep a fist raised to the sky so you can follow me home, it goes?\n\nRight before you rock a show, BREATHE SLOW\nWhen a promoter owes you dough, BREATHE SLOW\nWhen your career doesn't blow (up), BREATHE SLOW\nYou bounced five checks in a row, BREATHE SLOW\nIf you're tired of being po, BREATHE SLOW\nYou can't see the status quo, BREATHE SLOW\nYou got more cons than pros, BREATHE SLOW\nYou got fisticuffs to throw, BREATHE SLOW\nAyo, your boss told you no, BREATHE SLOW\nSay Mars ILL told you so, BREATHE SLOW\nYou gotta suffer to grow, BREATHE SLOW\nShine your light until you glow, BREATHE SLOW?\n\n", "album": {"title": "Backbreakanomics_(2003)&&431", "genre": "Christian Hip Hop", "year": 2003}}, {"title": "Piecemeal", "href": "Piecemeal&&6528", "artist": {"unique_name": "Mars_Ill"}, "lyrics": "I'm the explicit version without the illicit cursing\nI sit atop these radio-friendly missing persons\nA diversion from the 9-to-5 grind that you've been working\nAn answered prayer, we strike the match that keeps desire burning\nThis perverted graduating class is looking for the backdoor\nIt goes disco, ska, neo-soul and rapcore\nCollision cracks a smile on a pile of shredded documents\nThere's only so long you'll piggyback on our accomplishments\nYou tried to say that it was virtue versus common sense\nGuilt trip, that's all it is, so swallow pride and call it quits\nThe vaulted lips can fall off with the crabs in a bucket\nIn a land of rusty logic and 500 dollar budgets\nBut I can't believe the hype. See it's not the way that I'm programmed\nI read between the lines and fingertips when you fold hands\nIn five years, they'll know what I know and you'll have no fans\nAnd I'll still be making classic records as an old man...\n\nIf you know the words, you can sing these songs\nAnd keep your hands to the sky so I can read your palm\nWe break it into pieces so all ears can listen\nWe break it into pieces so all ears can listen\n\nThere's a lot of politicians and lottery tickets selling folly\nParlor-tricking hollow promise breaking hearts and wallets\nEconomics downtrodden. The stock market is struggling\nAnd all the sorrow's packaged up and Fed-Exed to the government\nSubsidizing happiness, mandate what you believe in\nBut knowing's more than seeing now we're choking on the freedom\nThat we're breathing, and we all take a beating\nWhen we treat God like a distant cousin 'cause we're so ashamed\nAnd faith is more than Sunday School and sermons on the weekend\nSpeaking loud and pointing fingers and deciding who's to blame\nBlatant accusations knock fam out the frame\nI write the way I write because there's power in the name\nAnd Christ is not a catch phrase or bumper-sticker tag line\nIt cheapens what He did and who He is to all his people\nWe're on different pages of the same book. Believe me, that's fine\nJust don't get offended when Dust drops the needle...\n\nToo hot for TV, radio, magazines and movies\nPut in work off the clock while the sign reads \"Off-Duty\"\nSign verses, \"Yours Truly,\" pollute the stream of consciousness\nI'm calling public libraries and begging 'em for sponsorship\nI'm the type of guy that's real easy to get honest with\nNever mind the fact that in rap I'm like a monolith\nThe archetype pondering breaking the bonds that hold us\nIn a monstrous move that's reminiscent of the Kold Krush\nMold my will till it resembles divine covenents\nShare the cup of Christ inside of this blessed suffering\nDivide my publishing so the word can spread and scatter\nOver every inch of global territory much faster\nCast lots for a chance to advance my point of view\nIn an avalanche of rap fans and it all starts with you\nIf all hearts could do their part beyond what we feel\nWe'd make it in one shot. But for now, we'll do it piecemeal...\n\n", "album": {"title": "Backbreakanomics_(2003)&&431", "genre": "Christian Hip Hop", "year": 2003}}, {"title": "Planes and Trains", "href": "Planes_And_Trains&&7061", "artist": {"unique_name": "Mars_Ill"}, "lyrics": "(Verse 1: Pigeon John)\nI live on the road, a modern day hobo\nTrained to eat quick and expect the low blow\nGet what you can from a dried up hole\nIn the land of the lost, cowboys in the sand\nAnd my soul is the coal, and my life is the flame\nAnd it's burning to earn all the lights and the fame\nAnd it's turning to ash every step towards cash\nAnd I'm losing it fast so I mash on the gas\nBut it's too late\nMy fate is a broken-hearted freshman even before my first date\nAnd I smile at my call, another yes, yes y'all\nWith every summer, there's fall\nSo I just rock in my chair while they rock to the beat\nA whole trainload of fresh meat\nAnd it's so sweet how they dream, their young hearts beam\nBut they really don't know what it means, but they will though...\n\n(There by subway train) Another day booked, I'm a fish on a hook now\n(There by subway train) It's too late to turn out my ride till I die now\n(There by subway train) Hitching a ride into town with my hands out\n(There by subway train) I gotta go now, gotta go now, gotta go now...\n\n(Verse 2: Manchild)\nTook my car to the MARTA station, train to the airport\nFeet to the bare floor, fists to declare war\nFame as a flare, tore pain from your stare\nUsed the game as a springboard, my name's at you're in-store\nKick to the snare drum, get here to there, son\nThey stick to the chair like chicks that get their hair done\nSpit this to spare none, rhyme liquid in rare form\nCommit to prayer born, brought heat to stay warm\nRap is my two cents, backed by the movement\nSacrificed my words to give you Pigeon John and Blueprint\nPleased just to thank you, hang with a strange few\nFive to the Deepspace, stay the same just to change you\nPen to the notepad, mind to the starshine\nKnee to the groundwork, 'cause right now is our time\nPlane to the down south, MARTA to the train stop\nWalked to the car and drove back to the block...\n\n(Verse 3: Blueprint)\nAre we there yet? Let me know, I'm feeling restless\nFrom traveling up what feels like stair steps\nAnd I hope it doesn't make me weak when I start to question\nHow far I'm willing to go to deliver this message\nBut the point of no return is where we're all at\nIt's easier to push forward than to go back\nAnd since I can't go back to life before rap\nI'ma play this game and boost all my stats\nI was born at a time when you earned respect\nFor the rhyme and the way you made words connect\nNot the money that you made or the girls you sexed\nA concept you obviously haven't heard of yet\nI did more shows in a month than you did in your life\nAte gas station food, stayed up late nights\nMet a couple women that I'd like to make my wife\nAnd realized that I'd travel anywhere for mics...\n\n", "album": {"title": "Backbreakanomics_(2003)&&431", "genre": "Christian Hip Hop", "year": 2003}}, {"title": "Next Door", "href": "Next_Door&&5016", "artist": {"unique_name": "Mars_Ill"}, "lyrics": "If the eyes are the windows of the soul, then the mouth is the door\nWhere the pieces exit freely way beyond your control\nAnd they're not yours anymore. Walk tall in bent stride\nAnd propaganda lies on the gentle side of genocide\nWords are used, broken, twisted and misquoted\nThe gossip was probably true the first time somebody told it\nAnd slander's just a well-intentioned public exposition\nThat should have been handled man to man as something different\nThe bum decisions are done and repeated like that\nBite my tongue in half as an example of how to fight back\nWrite raps and raise a family. Build with the like-minded\nHonor hides itself in strange faces. I'm always glad to find it\nI'm reminded of the wonder of this world in which we live\nHow we kill ourselves to have but find freedom when we give\nClimb reason and forgive in a quest for all that is\nI'm standing right beside you 'cause this is where I live\n\nI'm the voice in the distance, the image in the foreground\nDon't have much, but what's mine is yours now\nCan't put your finger on it, but you've seen me around\nWherever you're at, I'm just a couple doors down\n(Repeat)\n\nIt's like 4 in the morning and I'm still here\nWasn't till 3:45 that I started thinking clear\nConcern, anger, sadness, and now my heart is blinking tears\nTake these necessary steps to my art can reach my peers\nI've abused my voice so much that it's hard to sing this year\nAnd my own songs can't echo in my set of ringing ears\nPages filled top to bottom with confidence and stinging fear\nThat no one understands what I speak and they can't hear\nSo I'll say it twice as loud and I'll mean every word\nCan't keep it in my mouth until their peace is disturbed\nFrom the least to the first, we can see where you hurt\nAnd we dedicate this now, every beat, every verse\nEvery breath, every thought, every prayer, every stage\nEvery show, every moment, every night, every day\nEverything that we say and everything that we do\nIt's dedicated to you. It's dedicated to you...\n\nThe moments that I'm walking through affect the way I talk to you\nAnd this is what I'm called to do. It's almost like I'm stalking you\nYou're tired of falling through the cracks from all the broken promises\nAnd it's tough to hear the voice of reason through these busted monitors\nAnd as honest as I am, I can't hide behind the fa&#231;ade\nI just wanna bring my people a little closer to God\nIf I'm martyred on MARTA, it was probably my time\nBut we're here now, hands on, transforming your mind\nSo if I ask you how you're doing, don't smile and say, \"Fine.\"\n'Cause it's written all over your face honey, and I ain't blind\nMe and mine, we spill our guts, 'cause without it, we'd go nuts\nThe music is therapeutic, so just let it pick you up\nAnd hold you tight. Move a little closer to the light\nBe careful when you listen 'cause it might just change your life\nAnd when you see me in the supermarket, just smile and say, \"Hello.\"\nAnd add me to the list of all the people that you know...\n\n", "album": {"title": "Backbreakanomics_(2003)&&431", "genre": "Christian Hip Hop", "year": 2003}}, {"title": "Blackbox Artist", "href": "Blackbox_Artist&&3828", "artist": {"unique_name": "Mars_Ill"}, "lyrics": "It's like Boom-Bap, original rap\nWe take it back and move you forward just to tear it in half\nBoom-Bap, original rap\nWe take it back and move you forward just to tear it in half...(Repeat)\n\nI'm a rebel without a pause\nPlay tape\nClaymation action-figure transforming the norm and changing shape\nStill face to the face with the grace that it takes\nTo escape all the hate and calculate each back-break\nCommunicate the Creator's thoughts with every breath\nControl my stride, no man can divide and make me half-step\nPass the solid ground to spaces to the left\nIf you've got something left to throw, I got something to intercept\nThis is harder than it looks. This is better than it sounds\nThis is everything it took to separate me from the ground\nThis is levitation 101. We tread upon the clouds\nAnd make a name for Mars ILL till it fills your mouth\nWork it out, make optimists out of the cynical\nI like to scramble words around until I make them sensible\nOne-dimensional voices cry like primadonnas\nWhile we stretch hip-hop from Sugar Hill to Futurama...\n\nI got a strong mind. It doesn't have to be spoon-fed\nI treat my audience with respect and my dialect is interjected\nInto conversations worldwide, a piece of heaven injected\nInto the blind, scales fall from their eyes\nIt's all to my surprise that a sound could move the masses\nTake my everyday observations and press them onto plastic\nLessons automatically grabbing your fascination\nWhen delivered into action my masters of rap relations\nA revolution in music we loosen the chains that hold you\nDon't say you weren't aware because I told you\nThey sold too many souls on the auction city block\nWrists slit on Wall Street, snake-eyes and risky stocks\nMy life hits a third shift frame of mind\nI understand your struggles because they're mine\nI spit a trail for you to follow what you thought you couldn't find\nPast and present intersected inside of God Divine...\n\nThis earth is my place of birth\nI want the universe to know God for everything it's worth\nBreak the cycle till it hurts between the lines and in the margins\nKilling time and changing life inside a studio apartment\nSacrifice the hardship for those wearing a target\nMaximize compassion till it smashes through the market\nNever call it quits, we've got to finish what we started\nBuild until you touch the sky or till you're in the coffin\nIt's all in the patterns, stitched and gathered at the seams\nWe come together to interpret your dreams and what they mean\nSo thanks for coming out and thank you for listening\nThanks for making it to the end of the track and acting interested\nYour time and energy are valuable as well as limited\nThe fact that you chose Mars ILL is quite considerate\nHope to see you around real soon just for the sentiment\nWe have to know the past to realize what vision is...\n\n", "album": {"title": "Backbreakanomics_(2003)&&431", "genre": "Christian Hip Hop", "year": 2003}}, {"title": "Sunstep", "href": "Sunstep&&5996", "artist": {"unique_name": "Mars_Ill"}, "lyrics": "It's a common theme. The world is monotone and mean\nIt's grown into a full-blown bag of bones that holds reserves of self-esteem\nAnd it's worse to melt a dream away with nothing there to replace it with\nSmashed hopes never heal and when it peels away, his faith is stripped\nThe paces trip the walk and talk is cheap but still in stock\nPublic outrage screams for justice, looting shops and killing cops\nThe wheels can't stop because it's downhill and the music's up to loud\nFingers plug their ears, now shouts rang out and reason's not allowed\nBelievers got to proud 'cause we held the magic backstage passes\nNow they act like fascists, blocking all the gates to heavenly access\nAnd that's just when the package has no doorstep left to land on\nBlacklisted seekers wander wondering what it means to be transformed\nThey can't see because the pastor's lingo wasn't made for their people\nWhite-collar congregation makes contributions to his ego\nAnd it's evil and it hurts and it tears us all apart\nAnd I swear a man can blind you with the blackness in his heart\nThe shattered parts of speech are hard to reach in times of need\nThe cuts are deep, but I can't bleed unless I think it helps you see\nI'll stand against oppression although they claim it sets me free\n'Cause even when I'm speaking life I know that death is deaf to me...\n\nGather in together where the sky meets the basement\nGotta make the world a better place where you take it\nFace to the sunrise, feet to the basement\nWalk everybody, just walk, walk\nGather in together where the sky meets the basement\nGotta make the world a better place where you take it\nFace to the sunrise, feet to the basement\nWalk everybody just walk, walk...(Repeat)\n\nGo for the uprise, huddled in the playground\nCuddle the women and kids. Tell 'em to stay down\nFellowship with anybody willing to work\nThen sell a bit of land between heaven and Earth\nCatalog the converts. Carry cross for the crippled\nBury every soul that falls anywhere inside the middle\nBang your head against the backdrop. Block out the bad thoughts\nCut out the trash talk, ready for the blast off\nBang your head against the backdrop. Block out the bad thoughts\nCut out the trash talk, ready for the blast off\nBang your head against the backdrop. Block out the bad thoughts\nCut out the trash talk, ready for the blast off...\n\nI wanna be a better man. I wanna strip the flesh from spirit\nI wanna write the songs that people sing that inspire them to be fearless\nNever changing my appearance for moments edited and altered\nFull of awkward things to say today for the lucky seventh caller\nI've considered every offer on its merits before I refused it\nAnd that's mainly on the basis of their generic brand of two-cents\nIf there's land beneath the cruise ship, then it's time to rock the boat\nIf your label is a nuisance, then it's time to let 'em go\nIf it's time for execution, make sure to protect your throat\nIf you're losing your grip, hold tight to the end of the rope\nIf you're broken or you're broke, take a breath and count your blessings slow\nIt's feast or famine. Sometimes you starve, sometimes you choke\nSometimes you think, sometimes you know\nSometimes you pay, sometimes you owe\nSometimes it burns a hole inside but you're too proud to let it show\nReap or sow, keep breathing slow because we need to know the difference\nThere's a time to walk on the sun, but there's a time to keep your distance...\n\n", "album": {"title": "Backbreakanomics_(2003)&&431", "genre": "Christian Hip Hop", "year": 2003}}, {"title": "PSA #428", "href": "PSA_Number_428&&8702", "artist": {"unique_name": "Mars_Ill"}, "lyrics": "Yeah, we got something else to say, believe it or not\nWe don't claim to represent each element of hip-hop\nI'm eloquent on the mic, flip language, that's what I do\nEnlighten fresh subject matter and deliver it straight to you\nIn the vein of Pharaoh and Chuck D, I still feel lucky\nTo be able to share the vision and describe the way it struck me\nInterrupting the senseless noise that ClearChannel services\nResurgence and revival to defeat this sense of worthlessness\nAnd Dust\n\n(Scratches)\n\nWell Dust completes the thought that I began\nHis words are drums, he's talking now, but can you understand?\nWell I can, and there's a legion of fans that get it also\nHis audiomatic scratch patterns are all pro\nHit your torso full force, a course of future things to hear\nPress your head against the speaker. Catch this double-feature\nMake believers out of fence-riders and critics in one verse\nBut, yo, I got something to clear up first\nSee MC's are the mouthpiece and always the first to give props\nTo every person that's ever windmilled or knows how to uprock\nBut the b-boys could care less about the way you flow or rhyme\nThey don't even listen to any rap after 1989\nSo take the time. Take a minute and take a good look\nThey live inside the breaks and stay addicted to the \"Good Foot\"\nShould you ever meet one that says he has my album\nTake a picture for me 'cause that's rare, one in a thousand\nAnd graf-writers, well let's be honest\nYou don't really like my music and I can't read the words you're bombing\nI mean, who am I kidding? I've seen burners that moved me\nAnd I like to ride the train and let the pretty colors soothe me\nBut I don't vandalize, I'm afraid someone might shoot me\nAnd I'm available if any of y'all ever need to speak through me\nBut I won't push it anymore, see I'm giving y'all some leeway\nFor now, I'll speak on behalf of myself and plus my DJ...\n\n", "album": {"title": "Backbreakanomics_(2003)&&431", "genre": "Christian Hip Hop", "year": 2003}}]