[{"title": "Ahab", "href": "Ahab&&6838", "artist": {"unique_name": "MC_Lars"}, "lyrics": "Call me Ahab, what, monomaniac\nObsessed with success unlike Steve Wozniak\nOn the hunt for this mammal that once took my leg\nWith my warn down crew and my man Queequeg\n\"You're never going to find him!\" He's a big sperm whale\n\"The ocean is enormous!\" Shut up, we're setting sail\nThis scar that you see that runs down my face\nHas scarred my soul and inspired this chase\nMental sickness has got me on the run\nFull speed ahead! This is American fun\nThere is wisdom that is woe, so welcome to my life\nIt was fine until Moby scarred me like a knife\nTowards thee I sail, thou unconquering whale\nTo stab my spear into your white tail\nThe first one to stop him gets this gold doubloon\nNow excuse me while I go be melancholy in my room!\n\n(Got a low low feeling around me)\nBad trip thanks to Moby Dick!\n(And a stone cold feeling inside)\nPeg leg, sperm whale, jaw bone, what!\n(And I just can't stop messing my mind up)\nWhale crash so fast\n(Or wasting my time)\nOh no, oh no!\nThe ship's got a hole, plug it up, plug it up!\n\n\"We're never going to find this white whale,\nAre we captain?\"\n\nHey Ishmael... can I call you annoying?\nGrown up Beluga in the deep blue sea\nSwims so fast and swims so free\nWith the heaven above, Moby Dick stressing me\nAnd this crazy drenched crew below\nCall it idiot pride, or call me Oedipus\nMy main tragic flaw: \"But what about us?\"\nIt's your battle too, crew, man vs. beast\nAt least have respect as we sail south and east\nAnd north and west, look I'm doing my best\nWhile the rain keeps pouring\nWe're exhausted and stressed\nPip went insane when he almost drowned,\nSo profound when he shrieks like a little sailor clown\nRandom ships we met warned us of our doom\nThey said our boat would be our tomb\nNear the Mariana Trench, deep and oceanic\nWe spotted Moby Dick so white and titanic\n\n(Got a low low feeling around me)\nBad trip thanks to Moby Dick!\n(And a stone cold feeling inside)\nPeg leg, sperm whale, jaw bone, what!\n(And I just can't stop messing my mind up)\nWhale crash so fast\n(Or wasting my time)\nOh no, oh no!\nThe ship's got a hole, plug it up, plug it up!\n\nI said, \"You took my leg, and for that you must die!\"\nI threw my spear and hit Moby in the eye\nHe charged the boat, it began to sink\nI said, \"How about that? Hubris really stinks!\"\nI didn't think that it would end like this\nPride met fate, this captain got dissed\nLet it be a lesson, revenge is never sweet\nSo I stomp my peg to this Supergrass beat!\n\n(Got a low low feeling around me)\nBad trip thanks to Moby Dick!\n(And a stone cold feeling inside)\nPeg leg, sperm whale, jaw bone, what!\n(And I just can't stop messing my mind up)\nWhale crash so fast\n(Or wasting my time)\nOh no, oh no!\nThe ship's got a hole, plug it up, plug it up!\n\n(Got a low low feeling around me)\nThat's it, thanks to Moby Dick!\n(And a stone cold feeling inside)\nPeg leg, sperm whale, jaw bone, what!\n(And I just can't stop messing my mind up)\nWhale crash so fast\n(Or wasting my time)\nOh no, oh no!\nThe ship's got a hole, plug it up, plug it up!\n\n", "album": {"title": "The_Graduate_(2006)&&5174", "genre": "", "year": 2006}}, {"title": "Straight Outta Stockholm", "href": "Straight_Outta_Stockholm&&5984", "artist": {"unique_name": "MC_Lars"}, "lyrics": "Check this C major!\n\nComin' straight outta Stockholm, a fun boy named Lars,\nSurvived Loma Prieta, Mad Cow, and SARS.\nI hit you with these flows like your name was Nancy Kerrigan\nHere and back and there again, atypical American.\nThird generation Swedish, second gen. Aussie,\nAm I street enough for this? Sometimes I'm \"Paranoid\" like Ozzy.\nSee it used to be punk rock for about four years,\nI played lead guitar, we dissed Britney Spears,\nAmphoteric the name, Central Cali band,\nLocal shows, t-shirts, EP's, no plan,\nJust chilling with the crew slamming power chords,\nThey wanted more guitars but I got bored.\nI was born to rock heads and fill them too,\nBut did the world really need another Blink 182?\nStuck on this Earth like glue since 1982,\nCooked up my own post-modern salmagundi stew.\n\nStraight outta Stockholm, lap-top rap,\nAmerican iconoclast, alien boom-bap,\nCali's my home, baby, West Coast boy,\nI get more love than Helen of Troy.\n\nStraight outta Stockholm, lap-top rap\nAmerican iconoclast, alien boom-bap,\nI make rap fun, friendly, fresh and new\nMC Lars in the place, yeah boy, I thought you knew!\n\n\"But... were you actually born in Stockholm, Lars?\"\nNo, but my family on my Mom's side is Swedish-American.\n\"Uh... okay.\"\n\nComin' straight outta prep school, on the mike at assembly,\nClass clown, straight A's, running KSPB.\nPebble Beach, sheltered high school, like a nun on Mars\nThe Horris was Dr. Quin, Heavyweights gave me Lars.\n\"So how do you spell it? Yo, what's the website?\"\nIs it really that hard? \"Morris\" with an H - all right!\nAnd okay yo today see I'm still experimenting,\nVenting and presenting never misrepresenting.\nAnd it's not quite rap, not quite pop,\nAlien hip-hop Lars punk rock,\nIf I make the big time I'll still sit up in my room,\nMy brain on the keyboard and I'll try to resume,\nSuch a great story that I'll always behold,\nI'll look back on this when I'm 80 years old.\nLondon, New York, UK tour, NY demo,\nTickled as can be, when I tickle you like Elmo.\nSo much to say, new sounds to try,\nLaptop, costumes, local buzz, and why?\nDon't ask me, buddy, but you're bumpin' me now!\nAmalgam for the future revolution like Mao.\nYou're right when I grab the mike, I do what I like,\nI sit with a pen by the full moon light.\nEuphonic epiphany like Keat's lyre trope,\nI am it, iambic's rap's last hope.\nMy Grandma says I have rhyme talent, and I love her.\nI flow lethal, Weapon? Lyrical like Danny Glover.\nI flip your paradigm manhole cover,\nMutant reptiles, surprised what you discover.\nBut I still like Bob Dylan more than any MC.\nMost depress me, like Hepatitis B.\nReverse them like Pi when they step to me\nNine five one four one point three.\n\n", "album": {"title": "The_Laptop_(2004)&&7569", "genre": "", "year": 2004}}, {"title": "Generic Crunk Rap", "href": "Generic_Crunk_Rap&&37", "artist": {"unique_name": "MC_Lars"}, "lyrics": "[Club promoter:] Lars you're on in ten minutes. You ready?\n[MC Lars:] I guess but... I still got to write some lyrics.\n[Club promoter:] All right, just remember it's crunk night.\n[MC Lars:] In that case, I guess it won't be a problem.\n\nThis popular subgenre is brought to you by materialism.\nWe'd like to thank Bentley, Aliz&#169; champagne, and Sean\nJean clothing. We'd like to thank the record industry for\nMarketing hip-hop stereotypes to 12 year olds and a pop\nCulture that unquestioningly consumes vapid,\nSuperficial entertainment.\n\nPhrase about my gun, rhyme about my loot\nPhrase about these haters I sometimes have to shoot\nRhyme about my clothes,\nProps to my hometown (Carmel Valley!)\nLyrics that say nothing - cause that's how we get down\nPhrase about my clique, don't step to me punk\nGratuitous rhyme about keeping it crunk\nBig ups to our genre, we do it our own way\nIt's just too bad our songs don't have anything to say!\n\nGeneric crunk rap! (What) Generic crunk rap! (Yeah)\nGeneric crunk rap! (What) We don't mess around\nGeneric crunk rap! (Yeah) Generic crunk rap! (What)\nGeneric crunk rap! (Yeah) You like our dirty sound\n\nBuy cars (Get crunk) Take shots (Get crunk)\nHave sex (Get crunk) Spend money (Get crunk)\nBuy cars (Get crunk) Take shots (Get crunk)\nHave sex (Get crunk) Spend money (Get crunk)\n\nPhrase about my car, rhyme about my crew (Volvo!)\nRap about how much more crunk I am than you\nRhyme about my rims, rhyme about my bling\nChorus where I scream 'cause I don't know how to sing\nRhyme supporting guns, and also drinking 40's\nMisogynist rhyme about banging lots of shorties\nRhyme about my dough, and then some made up lyrics\nGet off the gas you swinga, check the deuce, yo sabiirit\n\nGeneric crunk rap! (What) Generic crunk rap! (Yeah)\nGeneric crunk rap! (What) We don't mess around\nGeneric crunk rap! (Yeah) Generic crunk rap! (What)\nGeneric crunk rap! (Yeah) You like our dirty sound\nBuy clothes (Get crunk) Hennesy (Get crunk)\nEscalades (Get crunk) Spend money (Get crunk)\nBuy cars (Get crunk) Take shots (Get crunk)\nHave sex (Get crunk) Spend money (Get crunk)\n\n<a href=\"/wiki/Grandmaster_Flash\" title=\"Grandmaster Flash\">Grandmaster Flash</a>, I'm sorry but we're killing hip-hop\n<a href=\"/wiki/KRS-One\" title=\"KRS-One\">KRS</a>, I'm sorry but we're killing hip-hop\n<a href=\"/wiki/Run-DMC\" title=\"Run-DMC\" class=\"mw-redirect\">Run-DMC</a>, I'm sorry but we're killing hip-hop\nBut who can argue with the charts\nWhen we're sitting at the top?\n<a href=\"/wiki/Rakim\" title=\"Rakim\">Rakim</a>, I'm sorry but we're killing hip-hop\n<a href=\"/wiki/Public_Enemy\" title=\"Public Enemy\">Chuck D</a>, I'm sorry but we're killing hip-hop\n<a href=\"/wiki/De_La_Soul\" title=\"De La Soul\">De La Soul</a>, I'm sorry but we're killing hip-hop\nAnd we're making so much money\nThat we ain't about to stop!\n\nCoca-Cola! (Get crunk) Nike! (Get crunk)\nMcDonalds! (Get crunk) Disney! (Get crunk)\nFox Network! (Get crunk) Armani! (Get crunk)\nGap Clothing! (Get crunk) Mercedes! (Get crunk)\nDKNY! (Get crunk) Courvoisier! (Get crunk)\nPrada! (Get crunk) Wal-Mart! (Get crunk)\nChucky Cheese! (Get crunk) Ralph Lauren! (Get crunk)\nG-Unit sneakers! (Get crunk) Louis Vuitton! (Get crunk)\nI'm just playing Lil Jon. You know I love you.\n\n", "album": {"title": "The_Graduate_(2006)&&5174", "genre": "", "year": 2006}}, {"title": "Download This Song", "href": "Download_This_Song&&1710", "artist": {"unique_name": "MC_Lars"}, "lyrics": "It's 2006, the consumer's still pissed\nWon't take it anymore so I'm writing a list\nDon't try to resist this paradigm shift\nThe music revolution cannot be dismissed\n$18.98 Iggy Pop CD?\nWhat if I can get it from my sister for free?\nIt's all about marketing Clive Davis, see?\nIf fans buy the shirt then they get the mp3\nMusic was a product, now it is a service\nMajor record labels: Why are you trying to hurt us?\nEpic's up in my face like, \"Don't steal our songs Lars,\"\nWhile Sony sells the burners that are burning CD-R's\nSo Warner, EMI, hear me clearly\nUniversal Music, update your circuitry\nThey sue little kids downloading hit songs\nThey think that makes sense\nWhen they know that it's wrong!\n\nHey Mr. Record Man\nThe joke's on you\nRunning your label\nLike it was 1992\nHey Mr. Record Man\nYour system can't compete\nIt's the New Artist Model\nFile transfer: Complete!\n\nDownload this song!\nDownload this song!\nDownload this song!\n\nI know I'm rhyming fast, but the message is clear\nYou don't need a million dollars to launch a career\nIf your style is unique and you practice what you preach\nMinor Threat and Jello both have things to teach!\nI've got G5 production, concept videos\nTouring with a laptop, rocking packed shows\nThe old-school major deal? It makes no sense\nIndentured servitude, the costs are too immense!\nTheir finger's in the dam but the crack keeps on growing\nCan't sell bottled water when it's freely flowing\nRecord sales slipping, down 8 percent\nIncreased download sales, you can't prevent\nSatellite, radio and video games\nChanged the terrain, it will never be same\nDid you know in ten years labels won't exist?\nGoodbye DVD's, and compact disks!\n\nHey Mr. Record Man\nWhat's wrong with you?\nStill living off\nYour catalog from 1982\nHey Mr. Record Man,\nYour system can't compete\nIt's the New Artist Model\nFile transfer: Complete!\n\nDownload this song!\nDownload this song!\nDownload this song!\n\nYou know, we just wanted a level playing field.\nYou've overcharged us for music for years, and now we're\nJust trying to find a fair balance. I hate to say it, but:\nWelcome to the future.\n\nDownload this song!\nDownload this song!\nDownload this song!\n\nHey Mr. Record Man\nThe joke's on you\nRunning your label\nLike it was 1992\nHey Mr. Record Man\nYour system can't compete\nIt's the New Artist Model\nFile transfer: Complete!\n\nDownload this song!\nDownload this song!\nDownload this song!\n\n", "album": {"title": "The_Graduate_(2006)&&5174", "genre": "", "year": 2006}}, {"title": "If I Had A Time Machine, That Would Be Fresh", "href": "If_I_Had_A_Time_Machine,_That_Would_Be_Fresh&&7295", "artist": {"unique_name": "MC_Lars"}, "lyrics": "My friend Aileen made a time machine\nBut was keen on keeping it shiny clean\nTo travel back in time had always been my dream\nSo I hatched a scheme and jacked the pod like Ween\nAD 33 maybe you would see me\nTelling Jesus his friend Judas was untrustworthy\nYou think that's fresh? Well just you'd wait\nI'd battle rap Chaucer in 1388. I'd tell Lincoln in 1865\nGoing out to plays alone was somewhat unwise\nIn 1963, I'd make JFK's day\nI'd say, \"before you go to Dallas, wear this helmet, okay?\"\nIn 2001, I'd make the world all right,\nI'd go back to 9-11, and cancel all flights\nIn my time machine, you couldn't get with me\nBecause E equals this squared MC\n\nMy T-to-the-I-to-the-M-to-the-E. M-A to the C-H-I-N-E\nMy T-to-the-I-to-the-M-to-the-E. M-A to the C-H-I-N-E\nHey Albert Einstein. Throw your hands in the air.\nProps on that whole Theory of Relativity thing.\n\n", "album": {"title": "The_Graduate_(2006)&&5174", "genre": "", "year": 2006}}, {"title": "Stat-60", "href": "Stat-60&&1027", "artist": {"unique_name": "MC_Lars"}, "lyrics": "9 O'clock class feels like five, asleep at three, so sleep deprived\nSTAT-60 satisfies 2C, the math GER, not the one for me\nThe Central Limit Theorem? Speak English\nThe Sum of Squares? I don't need this\nBut I'm positive, studying hard, gotta pass this, no holds barred\nBut essay due last Thursday man, Moby Dick I understand\nUp till five in the library, Meyer Lair, kind of scary\nAsleep at eight then up at ten, missed the lecture can't pretend\nI get the null hypothesis... on Tuesday's test, I was dissed\n\nGot STAT-60 on my mind\nIn my notes and in my rhymes\nChi-squared values all the time\nEasy quarter? Not this time\n\nWhy'd you have to go and make things so complicated, Professor Thomas?\nNever are the quiz score grades ever inflated, but you taught this:\nYou get involved in radio, work really hard, get your own show\nBut whoops, you slip, and play a track, uncensored as matter of fact\nThe FCC gets on your back, the station manager says it's whack\nThe probability that you&#213;ll loose your show on 90. 1? 1. 0\nLet's say that you're late for class, racing down peddling fast\nYou live in A, class is at B, integrate time and velocity\nThe probability that you'll crash your bike\nIn White Plaza on the way to Psych,. 34 on your cell phone,. 85 if you hit a cone\n\nLet's say you meet this hot sophomore, she likes you, you can't ignore\nX the months that you date, P the probability that it's great\nYou break up but you still kiss, you're not discrete it's continuous\nLate night hook ups nebulous, thin line friendship no big fuss\nWeekly sessions on the phone, made the right choice, you're on your own\nGood to be single all alone, degrees of freedom you can't clone\nBut calculate E of X, you're at a party you see your ex\nThe probability that your heart breaks in 2\nShe's with someone new and it's not you\n\nS-T-A-T sixty, baby\nS-T-A-T sixty, baby\nS-T-A-T sixty, baby\nS-T-A-T sixty\n\nI'm going to pass this class, so... you know\n\n", "album": {"title": "The_Laptop_(2004)&&7569", "genre": "", "year": 2004}}, {"title": "Rapgirl", "href": "Rapgirl&&1443", "artist": {"unique_name": "MC_Lars"}, "lyrics": "The following is an entirely fictional account.\nAny similarities between people living or dead is entirely\nCoincidental... just kidding.\n\nShe fell from the sky on a black October night\nShe wrote these funny songs and every one was tight\nShe asked me for advice on jump-starting her career\nBut I'm staring in her eyes as she's talking in my ear\nSuburban rap queen, I wrote this song for you\nSuburban rap queen, what's an MC to do?\nSuburban rap queen, every Biggie needs a Kim\nSuburban rap queen, sometimes you lose, sometimes you win\n\nRapgirl, Rapgirl, I like you a lot\nYou've got what it takes to rock that Lars emo spot\nRapgirl, Rapgirl, now tell me what to do\nWhen the playback is too quiet and the\nSong's already through\n\nThis is called a breakbeat!\nIt's the musical element hip-hop\nWas founded on back in 1969.\nThat's educational.\n\nShe fell from the sky with a superhero icon\nWe battled in the studio like, \"Hey, yo, is this mic on?\"\nI went down for the count, she went up on the beat\nI told her she was hot because stuff like that is sweet\nShe attacked me with her similes like killer bees at a park\nI came back with a metaphor, an angry great white shark\nThe bass line that she struck threw me flat on my back\nSo I came back with a track in a lyrical attack\n\nBecause girls are so confusing, and I guess they'll always be\nI should just become a monk, resign to celibacy\nThen I'd never have to worry about what a hug might mean\nSee these girls who want to be your friend\nMay be just what they seem\nWe had burritos in your dorm and talked about Dizzee Rascal\nWe wrote a song together, recorded it, and that's all\nRomantic love is fear of waking up alone\nIn Redwood City with platonic voice mail on your phone\n\nRapgirl, Rapgirl (Rapgirl, Rapgirl)\nSuburban rap queen,\nI wrote this song for you\nRapgirl, Rapgirl (Rapgirl, Rapgirl)\nSuburban rap queen,\nWhat's an MC to do?\n\n", "album": {"title": "The_Graduate_(2006)&&5174", "genre": "", "year": 2006}}, {"title": "The Roommate From Hell", "href": "The_Roommate_From_Hell&&5796", "artist": {"unique_name": "MC_Lars"}, "lyrics": "(Feat. MC Chris)\n\n(Intro, MC Nate)\nHey, Welcome to Mirales orientation\nMy name's Nate and I'll be your RA for this year\nToday we'll be moving into our dorms and building community\nSo go get your keys from the main office,\nCome back, and get ready to meet your roommates\nAll right?\n(All right all right all right)\n\nHe was the roommate from hell\nHe was the roommate from hell\n\n(Verse 1, MC Lars)\nSatan was my roommate, so junior year was hell\nHe lacked social skills and had a pungent smell\nWhen your roommate is the devil it can be extremely wack\nPutting posters on the wall of Trapt and Nickelback\nUntil the break of dawn he'd be mutilating sheep\nIt's 4 A.M. Satan, can you please go to sleep?\nI can't have girls over when the dorm smells like Sterno\nWhen did room 56 become Dante's Inferno?\nHe likes death and destruction, I like radio and art\nHe likes holding down Christians, and reading Jean Paul Sartre\nWhile I'm going class studying my notes\nHe's eating baby fetuses and sacrificing goats\nHe tricks the freshmen girls into eating apples\nHolding black masses down at the campus chapel\nShould have never moved in (but no) wish I were dead\nShould of found a place off campus on Craig's List instead\n\nHe was the roommate from hell\nHis name was Lucifier\nSomeone call a priest\nAnd bring the crucifer\nHe was the roommate from hell\nLeaves his pitchfork in my bed\nI'm in a satanic panic\n'Cause he is messing with my head\n\n(Yo)\n(Wut)\n[Chris] (pass that giant balloon of helium over here yo)\n[Lars] (okay, but wait... Satan, that's too much!)\n\n(Verse 2, MC chris)\nBoy you need a bitch slap, not my fault we're mismatched\nYou geek out over Beakman's World, I dig on World of Witchcraft\nYou thinkin' that I'm riff-raff, huffin' on a dishrag\nI am just a player, play Slayer then I kick back\nI know I reek of sulfer, leave the shower curtain open\nI come home drunk, make crank calls to Queens and then Hoboken\nBut college is like Salem, all these bitches be so smokin'\nIf you're thinkin' that I'm leavin' then I'm thinkin' that you're jokin'\nI gotta share my bunk with this post-punk chump\nCalls this place a dump, says you've been through all my stuff\n\"I wish you'd go to hell\", I say \"Hey, that's where I'm from\"\nBlasts Death Cab and Devo, he's too emo to get crunk\nI was a very nice boss down in Paradise Lost\nI have very nice bling 'cause my minions mind floss\nColleges is knowledge at a very high cost\nGotta go do some blow with that ho Kate Moss\n\n(Outro, MC chris)\nLars you're causing laughter\nWhen you call yourself a rapper dude\nHow many Dead Milkmen albums are there named after you?\nI always got beer, I always got weed\nBest roommate ever if you ever asked me\n\n", "album": {"title": "The_Graduate_(2006)&&5174", "genre": "", "year": 2006}}, {"title": "Mr. Raven", "href": "Mr._Raven&&8928", "artist": {"unique_name": "MC_Lars"}, "lyrics": "We got EAP in the house tonight\nEdgar Allan Poe\nAmerica's favorite anti-transcendentalist\nWe're takin' this back, way back, nineteenth century style\n\nWho's that (who's that) rappin'?\nWho's that rapping at my chamber door?\nMr. (mister) Raven\nAll up in my grill like \"Nevermore\"\n\nKick it\n\nOnce upon a midnight dreary, while I kicked it weak and weary\nDark and cold just like Lake Eerie, Brand New sample, someone clear me\nWhile I nodded nearly napping, suddenly there came a tapping\nUp like, \"What?\", this thunder clapping in my brain like graphic Halflings\nStaffing me, I put down Milton. Cell phone mute like Paris Hilton\nOpen window, halfway built-in. Times a changing like Bob Dylan\nTwenty-pound bird black as could be, cold feet cold eyes aimed straight at me\nGrim face, grim stare, death carnivore, quoth that raven \"Nevermore\"\n\nWho's that (who's that) rappin'?\nWho's that rappin' at my chamber door?\nMr. (mister) Raven\nAll up in my grill like \"Nevermore\"\nWho's that (who's that) rappin'?\nWho's that rappin' at my chamber door?\nMr. (mi-mister) Raven\nAll up in my grill like \"Nevermore\"\n\nWho's that (who's that) rappin'?\nWho's that rappin' at my chamber door?\nMr. (mister) Raven\nAll up in my grill like \"Nevermore\"\nWho's that (who's that) rappin'?\nWho's that rappin' at my chamber door?\nMr. (mi-mister) Raven\nAll up in my grill like \"Nevermore\"\n\nI miss Lenore, my Annabel Lee, taken by angels from me\nAlone with books (hey that's me!), harbinger of death visiting me\n\"Can I help you, evil prophet? If you got a problem, look, I'll solve it\"\nHe checked my hook, DJ revolved it, perched on Pallas, chalice dropped it\n\"Tell me sir, please, if you can. Am I good or evil man?\nWhat can I say, what can I do, when will I be rid of you?\"\n\"Nevermore,\" quoth he at me, hating on this fresh MC\nSatanic raven, Niche glee, killing me softly like the Fugees\nNow I feel worse, my verse is terse, joy inverse just like Fred Durst\nCall a nurse, disperse my thirst, put this process in reverse\nWish I'd had some warning first, MC Lars, '88 hearse\nNow I'll never be Slug or Murs under that black raven's curse\n\nThe raven's eyes still have the seeming of a demon that is dreaming\nLamplight over him still streaming, hear me screaming, hear me screaming\nMy soul still floats there on that floor and shall be lifted nevermore\nAfflicted calm, like Michael Moore, canonized piece, US folklore\n\nWho's that (who's that) rappin'?\nWho's that rappin' at my chamber door?\nMr. (mister) Raven\nAll up in my grill like \"Nevermore\"\nWho's that (who's that) rappin'?\nWho's that rappin' at my chamber door?\nMr. (mi-mister) Raven\nAll up in my grill like \"Nevermore\"\n\nWho's that (who's that) rappin'?\nWho's that rappin' at my chamber door?\nMr. (mister) Raven\nAll up in my grill like \"Nevermore\"\nWho's that (who's that) rappin'?\nWho's that rappin' at my chamber door?\nMr. (mi-mister) Raven\nAll up in my grill like \"Nevermore\"\n\nWhose house? Raven's house\nWho's that? Who's that rappin' at my chamber door?\nWhose house? Raven's house\nMr. all up in my grill like \"Nevermore\"\nWhose house? Raven's house! Who's that?\nWho's that rappin' at my chamber door?\nWhose house? Raven's house\nMr. all up in my grill like \"Nevermore\"\nI said, whose house? Raven's house\nWho's that? Who's that rappin' at my chamber door?\nWhose house? Raven's house\nMr. all up in my grill like \"Nevermore\"\nWhose house? Raven's house\nWho's that? Who's that rappin' at my chamber door?\nWhose house? Raven's house\nMr. all up in my grill like \"Nevermore\"\n\nWho's that?\n\n", "album": {"title": "The_Laptop_(2004)&&7569", "genre": "", "year": 2004}}, {"title": "The Dialogue", "href": "The_Dialogue&&3087", "artist": {"unique_name": "MC_Lars"}, "lyrics": "(Feat. Ill Bill)\n\nOne night, backstage at Irving Plaza at a Madball show\n\n[Lars:] Hey yo Ill Bill - will you sign this for me?\nI found it at Amoeba it's the Green CD\n[Bill:] No doubt kid, what's your name?\n[Lars:] It's MC Lars\n[Bill:] Word, Howie Abrams is a mutual friend of ours\nHe played me your joint Lars... What'd you think of it?\n[Bill:] I think it's bugged out, it's hot\n[Lars:] Thanks, I like your last record a lot. Your lyrics are\nGraphic, much like your brother Necro, is he psycho?\n[Bill:] I don't know, it really depends though\nHe's Psychological, half psycho, half logical,\nHalf businessman, half put-them-in-the-hospital\n[Lars:] Business and art, there's a very fine line\nThere's the person that you are\nAnd the person when you rhyme\nBut the best MC's bring both intertwined\n[Bill:] I agree, that's when the best of both worlds collide\nWhen the realness pops off one time for your mind,\nAnd your words cause the people in the crowd to riot\n\nAs many places I've been. As many people I've met\nAs many haters I've dissed. There's people that I respect\nAs many times as I've failed. As many times as I've won\nAs many lives as I touch. The dialogue has begun\n\n[Bill:] I grew up on heavy metal and hip-hop\nThe energy was the same to me, it was insane to me\nIt made me want to rage against the machine\nPick up a guitar and scream into the mic like Run-DMC\n[Lars:] Nine Inch Nails, Primus, \"Weird Al,\" and King Missile\nInfluenced me like a postmodern epistle\nGeeked out on my Performa looping digital drums\nPlaying rock guitar in punk bands just for fun\nWho's your favorite rapper? Bill... Rakim, G Rap and Kane\nKRS, EPMD, NWA, Public Enemy, Shante and LL Cool J\nI could keep naming MC's all day,\nWhat type of metal stuff you listen to?\n[Lars:] Old school Slayer CD's, Biohazard and\nBile were the bands for me\nThe first time that I ever heard Chuck D\nWas the Anthrax CD, \"Attack of the Killer B's\"... chorus!\n\n[Lars:] So Bill, what's your take on censorship?\nPoliticians on a church/state fusion tip?\n[Bill:] I speaks my mind while kids I went to high school with\nBleed on the sands of Kabul hit, it's bullshit,\nLars what you think of it?\n[Lars:] Out in Iraq, a lack of dialogue\nBetween the people is whack!\n[Bill:] In fact I speak militant like Black Panthers\nThese gas prices got my people\nWith seeds having to gank pampers\n[Lars:] The answer is not plutocracy.\nThe answers is not hypocrisy,\nThe answers is true democracy\n[Bill:] The answer is the dialogue constantly\n\n[Lars:] Hey yo Bill, we should do a track together\n[Bill:] Word, word, let's do that\n[Lars:] Wait, we just did\n\n", "album": {"title": "The_Graduate_(2006)&&5174", "genre": "", "year": 2006}}, {"title": "Space Game", "href": "Space_Game&&5302", "artist": {"unique_name": "MC_Lars"}, "lyrics": "You can take away my space ship\nYou can take away my space suit\nYou can even take away my space lasers\nBut you can never, ever take away my space game\nI broke through the carbonite that's how I got free\nJabba, back up, because there's no stopping me\nPost-modern player, sample-tastic.\nFlow's ekphrastic, I get drastic\nHey, watch the plastic, yo, I name check\nAnd leave you drowned in space oobleck\nPlayer of the future, watch me go!\nSith girls scream when they hear my flow\nThese alien chicks reproduce with spores\nSo I go where no MC has gone before\nHey Fry, look, we can still be friends\nI won't ask Leela out again. Sci-fi, I try, I fly solo\nShoot your landspeeder up just like Bolo\n\"What's with Lars, and what's with his name?\"\nNever mind that ish, 'cause I've got space game!\n\nDarth Maul can't stop me (I'm on fire tonight)\nBoba Fett can't stop me (I'm on fire tonight)\nVader can't stop me (I'm on fire tonight)\nSpace player bowling up like dynamite\nDr. Smith can't stop me (I'm on fire tonight)\nQ can't stop me (I'm on fire tonight)\nEven Hal can't stop me (I'm on fire tonight)\n\nBecause I've got space game and it feels all right\nIn 2112, all the players play on\nEveryone bumps Rush and that \"Tom Sawyer\" song\nI took the red pill, and high fived Neo\nHey what should I sample? \"If it sells pick Dio!\"\nYo Morpheus, look, you're a real cyber punk\nBut your friend Trinity has junk in the trunk\nAnd I'm from Mars, and she's from Venus\nShe has ovaries and I have a light saber\n'Cause I get more play than Captain Kirk\nHe found out and went berserk like a jealous jerk\nBut no puny Vulcan death grip can paralyze me\nI said beam me up Scotty, and then I got free\nPrincess Leia said that my flows are tight\nSo I said I supposed she can spend the night\nA long time ago in a galaxy far away...\nMC Lars got some space age play!\n\nT1000 can't stop me (I'm on fire tonight)\nMagneto can't stop me (I'm on fire tonight)\nEven Zod can't stop me (I'm on fire tonight)\nIt's tight, don't even try to bite, the sci-fi style I incite\nMr. Spock can't stop me (I'm on fire tonight)\nThe Wrath of Khan can't stop me (I'm on fire tonight)\nThe Borg can't stop me (I'm on fire tonight)\nBecause I've got space game and it feels all right\n\n[MC Lars:] Yo DJ Hal! Bring that beat back\n[Hal 9000:] I'm sorry Lars, I'm afraid I can't do that\n[MC Lars:] So what can you do?\n[Hal 9000:] I can play this awesome guitar solo\n\nThis song is futuristic, so hardcore\nHey T.S. Eliot! Please shut the door\nBecause modernism is so pass&#169;\nThe postmodern revolution is here to stay\nIn the house tonight because of Frank Lloyd Wright\nThe bass goes \"boom!\" like dynamite\n\"Yo, Wright was a modernist!\"\nYeah I know that, all right,\nBut you can't rhyme \"Bob Venturi' with \"dynamite\"\nSee it's Guernica Part II when I storm the stage\nI draw fans like Warhol draws soup cans on the page\nDid I say postmodern? Well, that was a lie!\nI've been post-postmodern since junior high\n\nEzra Pound can't stop me (I'm on fire tonight)\nVirginia Wolfe can't stop me (I'm on fire tonight)\nJoseph Conrad can't stop me (I'm on fire tonight)\nI excite the modern mind like a ray of light\nFranz Kafka can't stop me (I'm on fire tonight)\nWallace Stevens can't stop me (I'm on fire tonight)\nE.E. Cummings can't stop me (I'm on fire tonight)\nI've got postmodern game and it feels all right\n\nYes I'm an alien, I come from outer space\nYes I'm an alien, I came to rock this place\n\n", "album": {"title": "The_Graduate_(2006)&&5174", "genre": "", "year": 2006}}, {"title": "Signing Emo", "href": "Signing_Emo&&6445", "artist": {"unique_name": "MC_Lars"}, "lyrics": "Once upon a time, in the city of Los Angeles...\n\"Marty, Marty listen to me. Bring me something the kids will cry for.\nGet out there, and get us stoked!\"\n\nMeet Marty, major label A&amp;R scout, forty years old, gut hanging out.\nRed Ferrari, Marty living in L.A. bumps another line to get through the day.\nDumped by his girl, he paid for her liposuction,\nHis friends call him \"Money\", in his introduction.\nAnd Marty knows nothing but claims to know it all,\nLose the flat screen TV if he drops the ball.\nYou're as good as your last hit, find the next big thing.\nIf he doesn't bring the bling, his cell phone won't ring.\nWhat's the trend, what's new? What's a label scout to do? Office life, Marty 11:32.\nThe label pres. calls and yells, \"Sign more emo!\"\nHow about screamo? \"If it sells, sign Nemo,\"\n\"We're down 2%, and BMG knows,\nMy Daughter likes Dashboard, so get me one of those!\"\nHe checks AP.net, the Scout and more,\nYelling band names to his assistant through the door.\nThe kids like this, who cares if it's great?\nSo he signs a band called Hearts that Hate.\n\n\"Marty... we've got a hit.\"\n\nCry tonight. My hands around your hands.\nI won't let you die tonight.\nCry tonight. My heart's in your hands.\nI won't let you...\n\nHearts that Hate, Marty goes to their show, up in the club and here we go.\nMarty sees a girl in a Simple Plan shirt with a Senses Fail boy, that'll never work.\nHe finds his label friends in the corner they huddle,\nAn emo cattle auction, they penetrate the bubble.\nThey talk about Victory and signing TBS,\nDissing the same bands they just tried to impress.\nSo the lights go down, the crowd starts to scream,\nHearts that Hate have hit the scene.\nBlake on vocals, and lead guitar,\nHe does a backflip, \"Look how different we are!\"\nThey show up at the studio to record it,\nA TRL, Billboard Modern Rock hit.\nThey auto-tune Blake, but he can't tell.\nHe says, \"I've got perfect pitch, damn I sing well.\"\nProTools, Logic, cut, copy, paste, quantized solos and quantized bass.\nSigned, sealed, deliver and sent, across the U.S. and the single went...\n\nMomentum builds, but it all caves in.\nIndustrial comes back, the pres. needs a NIN.\nMarty finds a new band called \"Fetal Coil\"\nAnd Hearts that Hate try to keep their fans loyal.\nThey re-work their sound for album number two,\nAs \"Machines of Hate,\" but their career is through.\nThey break up and work pushing mops and brooms,\nBlake gives guitar lessons in his living room.\nBlake gives guitar lessons in his living room,\nBlake gives guitar lessons in his living room.\n\n\"Can you teach me track five Mr. Blake?\"\n\"Hey, I wrote that song and it goes like this!\"\n\n", "album": {"title": "The_Laptop_(2004)&&7569", "genre": "", "year": 2004}}, {"title": "Hurricane Fresh", "href": "Hurricane_Fresh&&6368", "artist": {"unique_name": "MC_Lars"}, "lyrics": "Oh snap, you know this track is fly, so get crunked up and don't ask why.\nPost-rap, post-punk, post-Kurt Cobain, post Kool Moe Dee post-House of Pain.\nChuck D told me I had to be me so I bought the Public Enemy CD.\nI ripped one track in .mp3, \"ill Lars Ulrich came after me.\nI said, \"It's me your lost nephew\", he said, \"No way, that can't be true.\"\nI kicked him with my Converse shoe all the way to Timbuktu.\nOf Wolf and Ulrich, Sad But True, he lived there for a year or two.\nHe mastered Puppetry alone, justice for Sean Fanning clones.\n\nNow that's fresh. Now that's fresh, that's fresh (get fresh).\nNow that's fresh, that's fresh (I get fresh).\nNow that's fresh, that's fresh (get fresh). Now that's fresh.\n\nMy Dad's named Bob, he toured with me, when a UK label put out my CD.\nI got mad props from the BBC, but hip-hop heads still don't get me.\nSo I take a chance, I rhyme white but so what? I like James Brown and Beyonce's butt.\nWhatever your race I'll Friendster you and rent two Spike Lee NetFlix too.\nAnd I still rock shows and try to dance, still rock Simpsons underpants.\nAnd I still like Rush and Dr. Dre. I still keep bumping N.W.A.\nI get fresh on the mike like a milkman on duty,\nSo burn this disco to the ground and baby shake that booty.\nI attack the track like a Steve Segal movie. 3D fresh, not 2D fruity.\n\nNow that's fresh. Now that's fresh, that's fresh (get fresh).\nNow that's fresh, that's fresh (I get fresh).\nNow that's fresh, that's fresh (get fresh). Now that's fresh.,\n\n05 so live, I've been doing this for years,\nMaking money 'cause I'm funny with this music of the spheres.\nAnd I dance! Hey, watch me dance.\nGoofy MC's can't be me even if they had the chance.\nPondora have you seen Persephone?\nHades rabies got me going like KRS-One.\nWhy is that? (I don't know) MC's act like they don't know.\nI poison this track with a Scorpion flow.\n\nBecause I rock the mike like a hurricane.\nBecause I rock the mike like a hurricane.\nBecause I rock the mike like a hurricane.\nBecause I rock the mike, hurricane fresh!\n\nNow that's fresh. Now that's fresh, that's fresh (get fresh).\nNow that's fresh, that's fresh (I get fresh).\nNow that's fresh, that's fresh (get fresh). Now that's fresh.\n\n", "album": {"title": "The_Laptop_(2004)&&7569", "genre": "", "year": 2004}}, {"title": "Internet Relationships (Are Not Real Relationships)", "href": "Internet_Relationships_(Are_Not_Real_Relationships)&&9972", "artist": {"unique_name": "MC_Lars"}, "lyrics": "Internet relationships are not real\nYour heart people steal but identities conceal\nSo here's a tale of warning for girls and boys\nLaptop computers can be dangerous toys\n\n[DARYL47:] In the chat room, I inspect. Who's here tonight? ASL check\n[CarolBabe69:] I'm 20/f from the UK. Send me an IM and I'll make your day\n[DARYL47:] I'm 22 and my name is Daryl\n[CarolBabe69:] Nice to meet you Daryl my name is Carol\n[DARYL47:] What do you like Carol?\n[CarolBabe69:] I like to go to shows. I collect comic books and vintage clothes\nWhat do you like?\n[DARYL47:] I like to skate. I play rock guitar, but I'm not that great\nI like to go on dates and I like to stay up late\nI live in San Francisco and hang on the Haight\n[CarolBabe69:] Do you like the Golden Gate?\n[DARYL47:] I did when I was eight\n[CarolBabe69:] Maybe I can come and visit?\n[DARYL47:] Maybe you should wait\nSee I'm really forty-seven, I have kids and a wife\nI weight 300 pounds and I really hate my life\n[CarolBabe69:] Are you serious?\n[DARYL47:] Yes\n[CarolBabe69:] Well, I've got a secret too. I'm not 20 years old, I'm really 32\nI only have one leg and I like to sniff glue\n[DARYL47:] You lied to me Carol\n[CarolBabe69:] Well, you lied to me too\n\nIt's not normal to have an Internet girlfriend.\nOnline relationships are really just pretend\nUnplug your heart, upgrade your system.\nGet, get off the Internet\n\nBob went on MySpace for hours a day.\nTalking to girls from Moscow to LA\nBut people can surprise you from behind a screen\nListen to this verse and you'll see what I mean\n\n[SueChick1990:] Hi, I'm Susie, I like your profile\nI checked out your pics and I like your style\n[BOBSTER MAN:] Sounds good Susie, I'll be your friend\nWe can message each other again and again\n[SueChick1990:] Comment on my pics and post on my page\nJoin my groups and guess my age!\n[BOBSTER MAN:] You must be 18, how could you not?\nYou can't be in high school you're just too hot\n[SueChick1990:] Let me send you pics for your personal collection\nI hope they inspire you and give you a smile\nSusie sent Bob pics that were borderline obscene\nThe cops showed up at his door - she was only 16\n\nIf you don't believe us here's a final story\nAbout a boy named Marcus and his online girlfriend Lori\nBehind the monitor, truth is hidden from your eyes\nMarcus didn't know but he was in for a surprise\n\n[MARCUSP:] We've been dating for a while but let's cut to the chase\nI don't know what you look like, and I want to see your face\n[Laurie69:] But what does it matter? You know who I am inside\n[MARCUSP:] What if you're not a woman and this whole time you lied?\n[Laurie69:] You got me there, I'm not really a female\nI'm a guy who pretends to be a girl through email\n[MARCUS:] So this is why it's bad to meet women online\nLiving life behind the screen is a total waste of time!\n\nInternet Relationships (Are Not Real Relationships)\n\n", "album": {"title": "The_Graduate_(2006)&&5174", "genre": "", "year": 2006}}, {"title": "Six Degrees Of Kurt Cobain", "href": "Six_Degrees_Of_Kurt_Cobain&&6606", "artist": {"unique_name": "MC_Lars"}, "lyrics": "Move over Kevin Bacon, 'cause I've got a new game\nIt's called \"Six Degrees of Kurt Cobain\" \nThe man was an icon of Generation X \nA sound between Joy Division and NOFX (what?) \nLet's dissect this album called \"Nevermind\" \nProduced by Butch Vig of Garbage not Sublime \nButch toured with U2, who wrote a song called \"Bad,\" \nJust like Michael Jackson, this next part is rad \n\"Weird Al\" made fun of \"Bad,\" and Nirvana too \nIt brings us back to Kurt (here we go) (round two)\nKurt was in a band with Mr. Dave Grohl \nDave was in Scream, that's the band not the movie \nCourtney loved to scream for a band called Hole \nShe married Kurt Cobain and had a troubled soul \nSome people said she killed him, but that could be a lie \nKurt wrote a song called \"I Hate Myself and Want to Die\" \nCourtney Love landed \"Man on the Moon\" \nWhere Jim Carrey sang a song \nFrom the Mighty Mouse cartoon \nDanger Mouse not Mighty Mouse worked with the Beatles \nHe mixed them with Jay Z the whole thing was illegal\nSpeaking of illegal Jack White did some time \nHe hit another guy and assault is a crime \nSo \"Get Behind Me Satan\" was loved by Rolling Stone \nWhich leaves us with a cover... Kurt Cobain all alone. \nIssue 897... check the cover.\n\n", "album": {"title": "The_Graduate_(2006)&&5174", "genre": "", "year": 2006}}, {"title": "UK Visa Versa", "href": "UK_Visa_Versa&&5759", "artist": {"unique_name": "MC_Lars"}, "lyrics": "Hey England... let's kick it.\n\nCops without guns and the NME.\nShould I watch the BBC or should I watch the BBC?\nLook at these crazy coins, is this Lord of the Rings?\nPounds and pence and Princes and Queens?\nFlipside experience, well not really.\nMore familiar than Russia or Chile.\nUp for cricket or squash, or the London zoo?\nLook, you hate George Bush and we do too.\nFab music scene, though, UK bands are ace,\nAnd you guys are the most polite of the human race.\nFish and chips, crumpets, bangers and mash,\nShakespeare, Donne, Sid Vicious and the Clash.\nYou love our movies, we kind of like yours.\nWe love the way you talk, \"please help help us in these wars.\"\nYou stopped staying \"fab,\" we stopped saying \"groovy,\"\nOur Scotland is Canada; you saw the South Park movie.\n\nI love England and visa versa,\nAmerican perspective in these Visa verses.\nTea time? Jolly good! Caffeine rush.\nLook, a red a phone booth and a double-decker bus.\n\nI love you England, so let's both ignore\nThe Boston Tea Party, and that silly East Coast war.\nOxford, London, and Guildford too,\nRockin' your P.A.'s when I come to visit you.\n\nThe Florida incident? Democracy at work,\nBut we've still got love for your boy Edmund Burke.\nIf it weren't for us, you'd be speaking German,\nBut then we gave you Hanson and Pee Wee Herman.\nYou gave us the Beatles, and you gave us the Who\nWe gave you Kris Kross and Vanilla Ice too.\nYou gave us \"Chicken Run\" and the Teletubies,\nWe gave you McDonald's and got you chubby.\nYou think we're all Trailer Trash obnoxious and noisy.\nBut that's just Springer, Ricki Lake, and Boise.\nWe're friendly and fake and proud of our nation,\nOverweight, wasting gas, hedonic civilization.\nWe're sue-happy mad overworked compulsive winners,\nStrong facade but insecure, just think Seymour Skinner.\nWe're obsessed with image, old age and fat,\nTechnology, death, and our dogs and cats,\nThe superbowl, shopping, S.U.V.&#213;s and money,\nSanta Claus, hygiene and the Easter Bunny.\nBut bigger is better and we love our TV\nFrom L.A. to Boston, to Nashville, Tennessee.\nAnd yes 1/4 of Americans own guns\nIn case you come back to punish your sons.\nBut Mother Britain listen, there's still a tie that binds us,\nThe U.S. isn't perfect, you don't have to remind us.\n\n", "album": {"title": "The_Laptop_(2004)&&7569", "genre": "", "year": 2004}}, {"title": "Hot Topic Is Not Punk Rock", "href": "Hot_Topic_Is_Not_Punk_Rock&&2021", "artist": {"unique_name": "MC_Lars"}, "lyrics": "(MC Lars is more punk than you) \n\nGo! Books about Evanescence (Are not punk rock!) \nGuns 'n Roses watches (Are not punk rock!) \nHello Kitty iPod cases (Are not punk rock!) \nRob Zombie lunch boxes (Are not punk rock!) \nSlipknot binder paper (Is not punk rock!) \nTinkerbell pillow cases (Are not punk rock!) \nLed Zeppelin air fresheners (Are not punk rock!) \nTupac incense burners (Are not punk rock!) \n\nHot Topic is not punk rock! (Hot Topic!) \nHot Topic is not punk rock! (Hot Topic!) \nHot Topic is not punk rock! (Hot Topic!) \nHot Topic is not punk rock! (Hot Topic!) \n\nMisfits candle tins (Are not punk rock!) \nICP throw blankets (Are not punk rock!) \nBeaded Elvis curtains (Are not punk rock!) \nTalking Lambchop plush dolls (Are not punk rock!) \nAC/DC hair clips (Are not punk rock!) \nSpongebob wristbands (Are not punk rock!) \nSex Pistols boxer shorts (Are not punk rock!) \nDischord back catalog (Okay. Maybe that's punk rock.) \n\nHot Topic is not punk rock! (Hot Topic!) \nHot Topic is not punk rock! (Hot Topic!) \nHot Topic is not punk rock! (Hot Topic!) \nHot Topic is not punk rock! (Hot Topic!) \n\nHot Topic is a contrived identification with youth subcultures to manufacture an anti-authoritarian identity and make millions. The $8 you paid for the Mudvayne poster would be better spent used to see your brother's friend's band. \n\nDIY ethics are punk rock \nStarting your own label is punk rock \nG.G. Allin was punk rock. \n\nBut when a crass corporate vulture feeds on mass-consumer culture, this spending mommy's money is not punk rock!\n\n", "album": {"title": "The_Graduate_(2006)&&5174", "genre": "", "year": 2006}}, {"title": "IGeneration", "href": "IGeneration&&2717", "artist": {"unique_name": "MC_Lars"}, "lyrics": "And people tried to put us down, when iTunes bumped a post-Cold War sound.\nMy generation sat the mecca of malls, Times Square, I'm there, Viacom installs.\nSo we hit the net while the Trade Center fell, New York met Hollywood, we ran like hell.\nNo Vietnam for us, yo, Iraq it's on. So who agree upon this cowboy Genghis Khan?\nThe choice made, baby. Hey we'd take it back, logged in dropped out, MTV took track.\nThey sold it back to us and claimed no correlation. The iMac, iPod, iGeneration.\nAnd I'm waiting for the day we can get out. The world is ours, that's the story no doubt.\nWant to be more info super highway traffic, want to be more than a walking demographic!\n\n\"Hey! You're part of it.\" Talking about the iGeneration.\n\"Yeah! You're part of it.\" Talking about my iGeneration.\n\nSee the iGeneration knew organization meant optimization and unification,\nWhen imagination gave participation in creation of culture a manifestation.\nThe Berlin Wall fell and out we came, the post-Cold War kids laid claim to AIM.\nLOL, OMG, yo, BRB. Space, colon, dash, closed parenthesis.\nWe sat at our laptops and typed away, and found that we each had something to say.\nWeb-logged our fears, our hopes and dreams. Individuated by digital means.\nFiber optic lenses, DVD, Coca-Cola, Disney and Mickey D's.\nFlat mass culture, the norm that took hold I hope I die before I get sold.\n\nThis is the I-N-T-E-R-N-E-T ge-na-ra-tion, see?\nThis is the I-N-T-E-R-N-E-T ge-na-ra-tion, see?\n\n", "album": {"title": "The_Laptop_(2004)&&7569", "genre": "", "year": 2004}}]