[{"title": "Right Up My Alley", "href": "Right_Up_My_Alley&&636", "artist": {"unique_name": "MC_Ren"}, "lyrics": "Oh yeah...\nYou know what I'm sayin'...\nWe peel mothafuckin' cops around here...\nYou can't come around here talkin' that shit\nYou'll get a mothafuckin' bullet in your head and wind up dead\nYou know what I'm sayin', I'll send you home in a bodybag you fag\nAnd I'm 'a tell you somethin' right now -\nDon't come to the alley with that bullshit [bullshit]\nHey Ren, who's talkin' shit?\nHey nigga where that shit happenin' at lo'?\n\nRight up my alley I see things and scenes\nBut you know it ain't over till the black nigga sings\nAnd he's singin' the blues and holdin' shoes\nWhile he's zippin' off booth\n'Cause every week he see a nigga's killed in the news\nIn the alley all the hard hits kicking\nDon't permit the suckerz 'cause they ride the mothafuckaz\nNiggaz gettin' high and high till they grw-p (grow-up)\nSo fucked up - they start shootin' at the cops\nSo ladies complain but there ain't shit they can do\nOr run dead in the house slap the bitches with a shoe\nI sell my dope and I ain't ashamed to say it\n'Cause I got Benz and mothafuckaz won't pay it\nIn the alley - Bitches sell pussy real cheap\nWaitin' 'round the trick when the fucka fall asleep\nBitches 15-16 got the claps\nAnd crabs in their pussy crawl around in the naps\nSometime ho's would tore jams in the toes\n30 ass cloth, with boogers in their nose\nRoamin', Roamin' lookin' for dick to suck\nWalk around in the dayz like they don't give a fuck\nIn the alley ...\n\nHey man, look at these mothafuckin' basehead bases ...\n\nNigga you pop a gang of shit but ah nigga\nWhere you from?\n\nRight up my alley niggaz trip cars that they stole\nAnd niggaz outside look for wayz to get swole\nTakin' turns, zippin' on the 40 oz\nPoppin' some funky shit by the D.O.C\nI'm with my nigga little nation or my homey named snoop\nMy nigga DJ train he hittin' corner in de coop\nPullin' up I give him gat - axin' if he pullin' work\nLookin' like a straight G - with some cockeis and a T-shirt\nWe sit at the table wrappin' bones\nWhile the little BG'z fight with the sticks and the stones\nTryin' to get a name for the self yo but why\nSo all the little buckets gettin' the G into a driveby\nTake down some rifles 'cross-town\nThey're back to the alley where they can't be found\nPolice come around and try to find 'em\nBut the whole fuckin' scene is standing right there behind them\nOpen up fire on the pigs now they cook\nThey did'nt know what hit 'em 'cause the niggaz had to get 'em\nIn the alley ...\n\nOfficers down, officers down, we need assistance in the alley ...\n\nYou're talkin' shit but where was you nigga?\n\nStandin' in the alley with my nigga Juvinalle for a while\nThis nigga try to rush it but the fool was livin' fall\nTryin' to get a name pretended on the wrong wayz\nMy brother cock de fuck out to his ass in the dayz\nPeople crowded 'round like a fly on shit\nEverybody had to stand 'cause there ain't nowhere to sit\nThis little punk he was new to the alley\nHe grew up with some white mothafuckaz in the valley\nNow he's on his back lookin' up in all these faces\nI bet he won't open up his mouth in no more places\nAnd he don't know, he won't go but now he has to go\nMy brother picked him up and started hittin' him some more\nThen every nigga had to get a turn\nTo make sure that this mothafucka learn\nNiggaz kickin' him - hittin' him with bricks\nCheck it, and my homey lit his big ball bite off his dick\nAnd to top it off he pulled my brother at the scene\nHe emptied up his click with the whole 15\nIn the alley ...\n\n", "album": {"title": "Kizz_My_Black_Azz_(1992)&&7911", "genre": "Gangsta Rap", "year": 1992}}, {"title": "Comin' After You", "href": "Comin%27_After_You&&9701", "artist": {"unique_name": "MC_Ren"}, "lyrics": "(Feat. Ice Cube)\n\n(MC Ren)\nIn case you didn't know my flows grows for sure\nI'm makin' sure you niggaz don't try me no mo'\nWeak shit you talkin' and I'm surprised it's sellin\nRuthless self niggaz full of felon's who the fuck you tellin'\nBraggin bout money where that shit be at\nAfter videos all that shit we never see that\nBitches with big asses blunts and big cars\nShot callin niggaz pissy drunk in them tittie bars\nRen assasinatin, all of these\nWack ass rappin' niggaz that say they sellin keys\nAnd fuckin' hoes and smokin' a million blunts a day\nShooting a hundred niggaz and saying he walked away without a scratch\nSome Rambo shit side a head\nLivin' with yo' mama talkin' 'bout a hundred grand\nNigga please, who the fuck you think you talkin' to\nReal niggaz comin' after you, we after you\n\nYou fake ass ballers who we talkin' to\n(We comin') Lyin' on records bout what you do\n(We comin') The shit y'all doin' is played out and through\n(We comin') You come with that shit we come after you\n\n(Ice Cube)\nIt's the Don Daddy with the Villain, who you killin'\nOh we hate em, come verbatim with this cap peelin\nTop billin, make a million\nPaparazzi, chase us through the tunnel in the Maserati\nNow they got me on Hard Copy didn't have to shoot Versace\nYet you still wanna watch me\nMotherfuckers wait they whole fuckin' life and aday\nHopin that we can reunite N.W.A.\nAll purpose, try to serve us, gettin' nervous, mo' murders\nShit can just turn into the service\nStandin over the carcass\nYou look like the kind of nigga that'd press charges\nWe the largest, we the biggest, we the Niggaz, With the Attitudes\nWee longitude you latitude, have some gratitude\nTo the niggaz that started this shit\nBeen around forever BITCH, we smart at this shit\nDon Mega... MC Ren... Ren, Ren!\n\n(MC Ren)\nI make the Planet Groove nigga mo' than BET\nYo' bitch tied up phoning home like E.T.\nSo kick in that fifty grand\nBefore you find body parts nigga in Japan\nA motherfuckin lyricist nigga top cop\nI'm makin' hits with yo bitch ass talkin' bout\nThat same old shoot 'em out I'm smokin' fifty blunts\nThat's why yo' shit ain't comin' out for like fifty months\nAin't nobody tryin' to hear your nigga outdated\nYour wack ass quit tellin' niggaz that you made it\nI'm never faded like a ghost Villain disappear\nBuy some shit to resurrect my dick the next year\nNinety eight ninety nine to the earthquake\nHow much garbage these mothefuckers go and make\nYou better shake, fuck that here I come strong\nBest believe Ren will rock the shit all night long\n(Best believe) We out\n\n", "album": {"title": "Ruthless_For_Life_(1998)&&8564", "genre": "West Coast Hip Hop", "year": 1998}}, {"title": "Must Be High", "href": "Must_Be_High&&7213", "artist": {"unique_name": "MC_Ren"}, "lyrics": "These niggas be actin' like I fucked\nAnd didn't call 'em for weeks\nLike they wantin' a nigga dick\nIn between they butt cheeks\nThey staight bitchy\nWithout their bleedin' and Kotexes\nThe villain that go to Texas\nNigga got a plan full of O's and X's\nWhat's yo' game plan?\nNiggas be sayin' you sabotagin' me\nBut yo' bitch be suckin' my dick,\nShe be tellin' me that you dodgin' me\nLike Piazza, a nigga gots ta,\nKeep my roster, with bitches slidin' home,\nNo lickin' yo' shit, yo' bitch is gone\nNiggas be thinkin' they Makaveli,\nTryin' to bring drama\nSoon as these niggas whoop that ass,\nYou talkin' Dear Mama...\nBut face to face, these niggas be cheesin' like Velveeta,\nLookin' smoked out,\nHitin mo' pipes than Peter\nStuck with broke hoes, broke ?? and ??\nPussies that they be fuckin',\nUsed up and sideways\nStretck marks for days,\nShe about two-hun,\nGotta get pissy drunk,\nTo fuck her and have fun\n\nThese niggas and hoes act the same,\nCan't tell 'em apart,\nAlways runnin' 'round\nLookin' for some shit to start.\nThese bitches run they mouth,\nNigga, constantly\nAll in mine, nigga\nAll the time\nIt ain't my fault\nThat yo' punk ass broke\nMad, 'cause you only got\nStress to smoke.\nI heard that shit that you was plottin'\nNigga you can try\nTo fuck with MC Ren,\nBut you must be high\n\nNiggas be high because\nThey workin 9 to 5\nBut the Villain be hibernatin'\nWakin' up at 5... PM\nYou see them niggas be bitchy because\nI won't let 'em up on my team\nAnd give 'em a title like Hakeem,\nI'm peelin' caps like tangerines\nTellin' niggas I should\nBreak 'em off chips\nGet 'em in clubs free\nAnd take 'em on trips\nFree-Loadin' ass niggas\nLose all they sense\nWhen they think they gon' floss\nOff my expense\nNiggas be goin' corner to corner\nBringin' up the bill\nAskin questions like the popos\nTryin' to see if I made a mill'\nThen they take that weak shit\nBack to they home fo' pillow ??\nShe shakin' her head like you tellin' the truth\nBut she want yo' ass to walk\nWhat the fuck you expected?\nAlways bitchin' at me\nWhen she fuckin' yo' ass,\nNigga she be seein me.\nGo look in the room,\nA costume, fo' haloween,\nOf that black nigga, you know who\nSo you can live yo' dream\n\nI hear yo' ho punk bitches talkin' shit,\nTryin' to have some say\nTellin' other hoes they wouldn't\nGive me no time of day\nStill livin' with they mommy\nShe babysittin' while you fuckin'\nGettin' county cheques and money\nFrom them niggas that you dick suckin\nBut nigga, why these bitches all in mine?\nWhy, nigga, hearin bullshit all the time?\nHoes from high school be wishin\nThey coulda got wit this dick\nYou know how they be in the car-hop clicks,\nMuthafuckin' tricks\nNow these hoes jockin'\nLike all up on my style\nYou broke bitches,\nHow you like me now?\nActin' like makin' cheese is a muthafuckin' crime\nIf I said \"drop yo' panties\",\nBitch you drop 'em in a dime\n\n", "album": {"title": "Ruthless_For_Life_(1998)&&8564", "genre": "West Coast Hip Hop", "year": 1998}}, {"title": "I Don't Give A Damn", "href": "I_Don%27t_Give_A_Damn&&368", "artist": {"unique_name": "MC_Ren"}, "lyrics": "Who wanna step into the room?\nWhere that nigga Ren be at, makin' shit that's phat\n'Cause in '95 I gotta hustle for yo ass\nDroppin' shit like in the past\nRated double X, you in trouble when I hex\nNiggaz that be actin' like hoes of the opposite sex\n'Cause fool I'm a soldier with a regiment\n10,000 niggaz marchin' to your residence\nFuck the president and his red, white, and blue\nI never leave a clue with the shit that I do\nSport the black 80, creepin' with the flashlight\nComin' with this phat shit just last night\nThe mad scientist from the center of the Earth\nDroppin' crazy shit whenever I drop a verse\nNiggaz in a rage, wanna see me in a cage\nBut um, I cocked the gauge when the ink hits the page\nFuck a grammy show and your mammy so now\nWhat the fuck ya gonna do when I bust out the zoo\n'Cause ya don't know really who you're fuckin' with\nYou're fuckin' with the nigga Ren with the phat shit\nAnd I don't give a damn\n\nDamn, damn, damn, damn, damn, damn\nAnd I don't give a damn\n\nThree strikes for who? A nigga fallin' in the trap\nWhat can I do to keep from fallin' off the map?\nI ain't your everyday nigga just with a rhyme\nI'll give ya that I don't give a fuck frame of mind\nMake ya wanna shoot the police in the back\nI'm crazy like Hady, 'cause devils be shady\nThe great elephant nigga hangin' on box\nA buffalo soldier without the dreadlocks\nI don't give a damn, I created this shit\nWith the real niggaz way back in '87\nNiggaz walkin' on my footprints in nine five\nFools hit 'em foul, can't hit a line drive\nSo get the hell away from my throne or a zone\nMy b-boy stance and shit is kinda full grown\nFuck the police 'cause I still feel the same\nAnd fuck a lotta niggaz bein' whack at the game\nI don't give a damn\n\nWho be talkin' shit about the great elephant?\nRen be bustin' raps, niggaz bustin' caps\nThe bitch made nigga killa, that's who I be\nWhen bitch made niggaz come and try\nBe a politician kidnapp, who gives a fuck about 'em\nNigga never gave a fuck, I can live without 'em\nNiggaz wanna journey down the black brick road\nThey can see me changin' in an I don't give a fuck mode\nThen I explode, better hide your neck\nYa new whack niggaz never get my respect\nThen center of the Earth is where I dwell\nYour shit never sell, I got 'cha trippin' in a livin' hell\nSo back the fuck out my way, that's what I'm sayin'\n'Cause I'll be havin' hypocrite niggaz balls hangin'\nAnd othe bitch niggaz, be go lickin' 'em\nBut Ren just keep on pickin' 'em and slam\n'Cause I don't give a God damn\n\n", "album": {"title": "The_Villain_In_Black_(1996)&&6612", "genre": "West Coast Hip Hop", "year": 1996}}, {"title": "Live From Compton 'Saturday Night'", "href": "Live_From_Compton_%27Saturday_Night%27&&7710", "artist": {"unique_name": "MC_Ren"}, "lyrics": "(MC Ren's answering machine)\nYeah, who dis?\n(Cold187um)\nYo, this Hutch man, oh what's up?\n(MC Ren answering machine)\nWhat up nigga, what's happenin'? Yeah, check this out\nI ain't even in right now, ah so leave a message at the beap\nI'll get back, peace\n(Cold187um)\nYo what's up man, it's me man, pick up the phone, nigga\nIt's Hutch man, what's up?\n(MC Ren)\nHey, what's up dog? Hey nigga what time is man?\n(Cold)\nHey I don't know, man, I'm just sayin' man, I was just callin\nTo see what's poppin', man, what's goin' down\n(MC Ren)\nNigga I'm about to rest, dog\n(Cold)\nAww, man Saturday 'n' shit and you talkin' about rest?\n(MC Ren)\nMan, what you talkin' about,\nI was at that motherfuckin studio nigga, all night\n(Cold)\nMan lets go get some 40s, bitches, something man, do something\n(MC Ren)\nHey, hey fuck what you gonna do\n(Cold)\nAw, aw it's like Ren, Ren what's up?\nAw nigga gonna hang up on a nigga, shit\n\n(MC Ren\nCome on and step on in, no turnin' back\nWhile I drop shit that have your mind turnin' black\nNigga I break God damn necks, when I drop verses\nAnd blind your sight, from the shit that I recite\nLive from Compton it's Saturday night\nBut ain't no joke, 'cause I don't play that shit\nNiggaz you know I ain't no motherfuckin comic\nDroppin' street knowledge, plus a nigga Islamic\nHoodrats they do the hoochie boogie for a fuck,\nBut that shit don't be workin\nWhen I'm rollin' in my truck, the farthest they get is a big wheel\nFor real, and bitch-made-niggaz get they caps peeled\nWhen I walk, puts a hole in the floor, with the steel toe\nAs if you didn't know, now that you know nigga act like you knew\nAnd if you continue trippin', motherfuck you\nI'm walkin' with my niggaz,\nWith the help of 187 on this tight ass track\nSo step the hell back, and you can't afford to sleep\nBecause my shit gets deep\n\n(Cold187um)\nOk, time for me to rustle more shit, represent to the fullest\nEverytime that I'm spit, get cha lit\nGet cha lifted, get cha high as you wanna go\nBreakin fools off that wanna floss your gold\n'Cause I hate flossers and I hate braggers\nI hate short stoppers and I hate laggers\nOn the real, niggaz be wanna Free Kick It pass\nSo they can beat your shit, and jack your ass\nI give 'em 187 times to try\nBut on the real, they better off committin suicide\nSlide me the tech Ren, so I can show 'em\nThat I'm not to be trusted, and not to be fucked with\nAnd definitely not that motherfucker they wanna press they luck with\nI keep it goin' uncut, and if I get mad enough\nI shoot they whole fuckin' set up\nAnd don't say I didn't warn ya\nIt ain't funny, when you be a victim by the corner\n187 be the gate keeper\n'Cause where I'm from, the shit gets deeper\n\n(MC Ren)\nMy shit gets backed up for days and days, it's hard to sleep\nMy shit is too deep,\nWell how in the hell am I gonna deal with new niggaz\nThat be comin' hollerin wolf, and ain't put out shit yet\nRollin' down the street in my 4-5-0\nThrowin' wack niggaz shit out my window\nCause rarely do I see niggaz that be comin' with that funky ass shit\nThat make you say fuck ay, go shoot a nigga down,\nBut here comes that black nigga that they call Ren\nMakin' niggaz go and act crazy again\nNiggaz be fuckin' fools for the hell of it\nSome down old niggaz better not come this way\n'Cause I just don't give a fuck, 'cause I get in a baby gangsta mode\nBitch slappin niggaz with my fist\n'Cause I insist I'm a hell of a lyricist\nBut my roots in the street\nKillin' playa haters over some wicked ass beats\nMe and my niggaz come and get your ass\nThen me and my niggaz beat up on that ass\nCause me and my niggaz, nigga love the creep\nWhen the shit gets deep, it gets deep\n\n", "album": {"title": "The_Villain_In_Black_(1996)&&6612", "genre": "West Coast Hip Hop", "year": 1996}}, {"title": "Shock of the Hour", "href": "Shock_Of_The_Hour&&487", "artist": {"unique_name": "MC_Ren"}, "lyrics": "Rumdidditty dum dum, rum didditty dum dum\nRum diddity dum dum dum\nThe shock of the hour, Armageddon\nJudgment day has come\n\n(Laywiy)\nNow it license lights with million knights the divides and canyon\nThe shock of the hour has come to devour the evil, deceivers, and Satan\nAmong shin, among men, you wicked, whisperin' devil\nGet deep in the flames of hell for the lies you babble\n6 6 6, the mark of the beast and the number of man\nIs S, see yes you just confessed the antichrist is caucasian\n'Cause you made from God and God is man, created on six\nThe art deceivers made believers outta my people and the crucifix\nThe symbol of death, the sign of Christ, and christa was weak\nHe came from Krishna, God of the Hindies, so get weak for your black feet\nNow call on your false God, from Zeus to Borta\nTo Armen, Diana, I call on Ela\nYou wastin' for peace for a feast on the blood of Kings\nYou ancient Babylon, America, all form in griefs\nAs the apocalypse, spits your eclipse, engulfed darkness\nThe dragon is bound in a bottom less pit\nNow fear the doom of death, from the tune of Ruffiah's trumpet\nThe return of Esop is the legion, the Messiah is coming\nThe angles over hell will chastise with pain\nThose who worship deplicit darkness and kept his name\nBlesses to the seven souls, 'round the throne from El Villione\nAnd pieces how you take this to the prophets and the puzzled\nSo devils, run here we come, ready to fight\nThe shock of the hour is power when the clock strikes midnight\n\n(MC Ren)\nIn the twinklin' of an eye, motherfuckers gonna die\nWatchin' baby bomber planes rip across the sky\nFallin' on your Jesus, comin' for the pork chop\nWake ya out your sleep, shit is deep, about to wreck shop\nBombs goin' down a mile deep, pushin' up a mile high\nNigga ain't allowed to cry while they disbelieve his God\nFakin' with your Malcolm X picture on the wall\nMotherfuckers shoulda listened when you got your final call\nThink your doin' the brothers a favor by buyin' a paper\nShoulda read your paper, it tells ya the devil raped ya\nStripped ya of the scripture, blood ya then he crypt ya\nGave you a corner, some bitches, and called you that nigga\nAnd then he pimped ya\nYou're mind is a waste, so now you got a taste\nThe chastise bitch ya shoulda took heed of what the wise said\nNow you're bent outta shape with no power\nFuck up and waited for the shock of the hour\n\n(KAM)\nWhat's the whole comin' to for someone who was snakes?\nJust a gang a rain, hail, snow, and earthquakes, makin' milk shakes\nVanilla killa, 'cause it's Judgment Day\nThe kinda shit that turn your baby's hair gray, so you pray\nThat it stop before you drop, for goodness sake\nDamn I'm seein' shit that make pregnant women's water break\nOughta make a run for it but you can't move\nYou terrified of somethin' that a law had to prove\nSo there you lie motionless and gave up the ghost\nYou finally arrived at the day you dreaded most\nIt's the shock of the hour\n\n", "album": {"title": "Shock_Of_The_Hour_(1993)&&8214", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "You Wanna Fuck Her", "href": "You_Wanna_Fuck_Her&&842", "artist": {"unique_name": "MC_Ren"}, "lyrics": "You wanna fuck her, do you wanna fuck her,\nThe bitch is a ho, yo I thought I'd let you know\nYou wanna fuck her, nigga you can fuck her,\nThe bitch is a ho yo I thought I'd let you know\n\nThe bitch is a stripper but thinks she's a star\nStill rides the bus, can't afford a fuckin' car\nTry to be the shit, needs a foot up the ass\nYa stanky stanky bitch get a new bus pass\nI see her all the time gettin' kicks from hard dicks\nYour pussy really stinks, who the fuck bought you drinks\nAt the club, waitin' till two\nSo you can have a niggaz dick shoved in you\nYo, don't know the meanin' of cleanin' your cock\nYa burnt seven niggaz, yo, around the block\nYou always leave a trail, 'cause your pussy, it smell\nFuckin' ho, ya need to quit thinkin' that you're the shit\nYour stomach fulla nut and just flushed a baby\nYa dumb fuckin' bitch yo ya must be crazy\nSo get back in your place ya little bitch I ain't no sucka\n'Cause all my niggaz fucked her\n\nWell here we go in this video bitch\nCrabs on her pussy, got no choice but to itch\nYo, she suckin' niggaz dick for two seconds of airtime\nWent so fast, didn't see your triflin' ass\nAlways at the functions fuckin'\nAlways into somethin', fuck it, you ain't worth nothin'\nYou're like a disease that's what you are\nFucked the Whole Click in the back of my car\nThen had the nerve to leave a stain on my seat\nI shoulda slapped yo ass for doin' the same to my sheets\nEvery week you're on Soul Train\nLookin' like a ho, doin' the same fuckin' thing\nStretch marks, lookin' all nasty and shit\nTryin' to keep down your shirt to prevent from gettin' hurt\nBut 'cha brought it on yourself ya ho\nYa lost a stupid bitch and don't know where the fuck to go\nSo quit tryin' to pretend\n'Cause you'll get broke down by a nigga named Ren\nSo peep it out real slow\nNext time you about to pimp a ho\n\nIf ya wanna fuck her think again\nShe might not be the type of bitch you wanna put your dick in\nBut she might suck a good dick, yo, and make ya nut quick so\nNever let her go 'cause she's nothin' but a ho\nBut then again she might start to bitch 'cause she's nothin' but a bitch\nShoot the bitch, a dead bitch, then bury the bitch, a gone bitch\nWhat else can I say to take the place of that?\nI saw my nigga DJ Trane shoot a bitch in the back\n\n", "album": {"title": "Shock_Of_The_Hour_(1993)&&8214", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Mind Blown", "href": "Mind_Blown&&2895", "artist": {"unique_name": "MC_Ren"}, "lyrics": "(MC REN) You know what Hutch man, I let one of these bitch made niggas get\nAway with somethin' the other and uh, I shouldn't a let him get away with it.\n\n(Cold 187) Put a foot to his ass.\n\n(MC REN) What did you say? Put a foot to his ass?\n\n(Cold187) That's right man...\n\n(MC REN) Wow, that beautiful man, wow, that's what I'm gonna do to him, put\nA foot to his ass. You know what Hutch man, I think I'ma adopt that formula\nFor myself man, wow.\n\n(MC Ren)\nNigga I'm the black giant puttin' shit down\nYou niggas aren't familiar with my sound\nI'm shockin motherfuckers like water and a live wire\nMakin' niggas feel the fire like Richard Pryor\nThe Great Elephant, the Bitch made nigga Killa\nI'm steppin on you niggas like a Godzilla\nA living legend like Shaq\nThe beginning and the last Moheekan\n'Cause I be seekin' to have niggas tweakin through the weekend\nI gives a fuck about the radio and faggot sounding disc jockeys\nBust yo fuckin' mouth like we playin' hockey\nI stick and move like rocky 'cause I'm cocky\nA motherfuckin nuclear bomb couldn't stop me\nI throw a bottle at the mirror and make it shatter\nNiggas in LA shut the fuck up and make ya shit fatter\nI'm lookin' for the niggaz with the skills\nNot the niggas that woke up this morning saying they wanna rhyme\nYou can always tell white niggaz by the clothes that they wear\nI bitch slap the niggaz tie em' up in a chair\nDon't gives a fuck if baby yellin' that it ain't fair\nCause you know this nigga Ren, nigga just don't care\nYeah, I'm that motherfucker sittin' on my throne and it's on\nGot you niggas mind blown\n\nIt ain't no turnin' back when ya on a mission\nFor the opposition\nNiggas keep on wishin\n\n(MC Ren)\nI don't give a fuck I'm a real nigga\nNiggas swingin' on my dick cause my nuts bigga\nBlow they motherfuckin brains like a sawd off\nI bust that funky ass shit then they hawd off\nFuck a mother fuckin' record deal could have been a pimp\nBut I'm that nigga puttin' fear in ya fuckin' ear\nSo raise the fuck up, when niggas be bumpin that shit\nWanna suck this dick? wanna fuck that trick\nI gotta heata when I need a nigga\nMy niggas smoke a fuckin' pound of blood\nLeaving bitch made niggas in a puddle of blood\nI gives a fuck about em', I just kick it on the block\nAnd handle my shit, with my motherfuckin nigga Rocc\nSo fuck a crew nigga I'm all alone\nWhen I'm spittin' fly shit on the microphone\nAnd I'm that black nigga sittin' on my throne\nAnd it's on, got you motherfuckin mind blown\n\n(Big Rocc)\nNiggas get sprayed like Raid I have em' droppin'\nMoppin, shootin niggas up like Charles Bronsen\nJ Rocc, a nigga playin' it for keeps, so keep\nFuckin' up in the Compton streets, yo Ren pass a nigga that 38\nSo I could set all these bitch made niggas str8\nNow tell me, do you wanna take it toe for toe strap for strap\nI'd rather bust a cap in your fuckin' back\nTake a look, what you see is a crook, breakin every rule in the book\nI try my best not to get locked up\nBut at the same time I steady be fuckin' up\nAt the shack, niggas be sippin on that yat\nBreakin off a freestyle on my nigga Hutch's track\nIt's Big Rocc once again it's on and I got you motherfuckas str8 mind blown\nYeah\n\n", "album": {"title": "The_Villain_In_Black_(1996)&&6612", "genre": "West Coast Hip Hop", "year": 1996}}, {"title": "Still the Same Nigga", "href": "Still_The_Same_Nigga&&6858", "artist": {"unique_name": "MC_Ren"}, "lyrics": "\"Hey pull over there dawg them my niggaz over there\"\n\"Aight\"\n\"What up niggaz? Y'all seen that punk ass nigga Ren?\"\n\"Yeah that nigga came through yesterday\"\n\"Y'all seen that nigga video?\"\n\"Na, I ain't seen that nigga's shit yet man\"\n\"Man, that nigga's shit whack any way, aight dawg\"\n\"Aight nigga\"\n\n\"Hey nigga put this in\"\n\"Though you didn't like that nigga, man why you always listenin' to his shit\"\n\"'Cause nigga, I'm on his nuts fool, just turn that shit up\"\n\"Man pass me the phone, yeah man what's happenin'?\"\n\"Yeah, so, we be there in a minute\"\n\n\"Hey man, turn on the TV\"\n\"Yeah nigga roll up that weed\"\n\"Fool, you got some papers?\"\n\"Yeah it's in the room on the dresser\"\n\"Hey man I don't see 'em\"\n\"Hey man look in the closet\"\n\"OH! Damn nigga, what the fuck you doin' in the closet, fool?\nScared the fuck outta me, whassup?\"\n(BANG!)\n\n(CHORUS) (repeated)\nAnd check it out y'all (Yo, I'm still the same nigga)\n\nThis nigga be creepin' on fools all day and night\nI got determined millimeters nigga, fuck a fight\n'Cause niggaz don't scrap no mo', that's a no no\nFools get hot, they shoot yo' ass on the spot\n'Cause bitch made niggaz get fucked like a ho\nBut be outta work like that nigga Arsenio\n'Cause niggaz be talkin' shit behind my back\nWishin' they could get they hands sweatty on my nut sack\nI ain't from Ohio, but I'm a player\nSo pussy ass niggaz what the fuck ya gotta say a\nPoppa gotta brand new bag when I rock\n'Cause niggaz on the corner sellin' shit out the ziplock\nUh, but me and my niggaz sit back and relax\nWhile I fuck it up bustin' on them tight ass tracks\nYeah, you niggaz know where you can find me\nI'm kickin' back in Compton with my niggaz behind me\nStill the same nigga\n\nI used to be a magician, but a nigga gave up tricks\n'Cause my assistance was fuckin' too many dicks\nSo I start my mission, leave my residence\nFuck it, nigga makin' dead presidents\nBut niggaz be wantin' they hands in my pocket say gimme\nFor a penny, all they feelin' is the jimmy\nLike Rick James I'm bustin' out on the funk\nNothin' up my sleeve, the shit is in the trunk\nBut don't make me bop that shit, and it's on\n'Cause I can get rocky like Sylvester Stallone\nNiggaz shootin' stones, motherfuck a sly\nIf I wanted to I could hit ya with my third eye\nThen you'll be in a deep sleep\nSo bring the band by, 'cause nigga chokin' like I mad fly\nI'm still takin' niggaz out\nWith the shit that's droppin' out my mouth\n'Cause, I'm still the same nigga\n\nYeah minute you win it, a nigga ain't a loser\nIt's a black nigga hittin' corners on a beach cruiser\nOr you might catch a nigga in a Chevy\n'Cause my motherfuckin' shit is so heavy\nRap skits kicked to the curb, they gets no play\nWhen I'm rollin' in the 4-54 in L.A.\nFuck the radio and they format\nI got bitch made nigga killa wrote on my doormat\nSo niggaz don't ring my bell\nI gotta bad attitude and I'm mad as hell\n'Cause I break God damn necks with my rhymes\nNiggaz in the street don't wanna fuck with mine\nDevil's be askin' what I did\nTell 'em I make funky ass records, plus I built pyramids\nBut niggaz in the streets I'm a good fella\nIn the trench like Gotti, and the umbrella\nStill the same nigga\n\n", "album": {"title": "The_Villain_In_Black_(1996)&&6612", "genre": "West Coast Hip Hop", "year": 1996}}, {"title": "It's Like That", "href": "It%27s_Like_That&&1273", "artist": {"unique_name": "MC_Ren"}, "lyrics": "I be the one that they be pullin' off that fool on the flow\nAfter we be goin' toe to toe\nI holds mine, never do I be talkin' no shit\n'Cause niggaz that be talkin' that shit, always get it\nPunk ass niggaz go face down in a river\nOther niggaz deliver, fuck when then buck\nThey give a damn about you and your mamma\nSo get the fuck up outta here nigga and take the drama\nBack to your set, back to your hood\nTo your kickin' spot, your street or your block\nYour crib or your rest, your mamma's address\nNiggaz gives a fuck, still I catch two to the chest\nAnd then it'll be on like some after school shit\nFuck a gun, a got to knuckles sayin' I'm getting one\nMy niggaz say I clown too much\nWhen I'm layin' phat shit with my nigga hutch\n\n(Cold 187um)\nSay what? It's like that nigga\n(MC Ren)\nYeah, it's like that nigga\n(Cold 187um)\nWhat? It's like that nigga\n(MC Ren)\nYeah it's like that nigga\n(Cold 187um)\nSay what? It's like that nigga\n(MC Ren)\nYou know it's like that nigga\n(Cold 187um) (follows this pattern of vocalist)\nLet them playa hatin' fools know the real how you feel\nIt's like that nigga\nYeah, it's like that nigga\nSay what? It's like that nigga\nYeah it's like that nigga\nSay what? It's like that nigga\nYou know it's like that nigga\nYo, well big Rocc step up and show 'em why you don't give a fuck\n\n(J Rocc)\nSo it's on, I told my niggaz to grab the chrome\nFuckin' with Rocc ya catch shots to your dome\n'Cause I don't give a fuck, that's the feelin'\nScoop up the Villain, it's time to do some motherfuckin' killin'\n'Cause I be kickin' shit, I'm thinkin' back in the days\nWhen we used to scrap at the Compton Parades\nI be throwin' vicious blows like Mike Tyson\nRocc greatest hits, nigga I'm the shit\nMake the wrong move, then it's fucked up results\nNiggaz can't cope, yo them shots he provoked\nComin' with that G style, make you hoes wild\nGot my criminal record locked up in Rockford Files\nHank at the shack, yo I call my Ponderosa\nClockin' mo' dollars than a Cali Stock Broker\nYou can call me you're all around nigga\nI loot, I shoot, if I how I kill a crew\nSo pass me a hog like a King in the clutch\nFuckin' up shit with my nigga Ren and hutch\nAnd it's like that\n\nBig Rocc represent, uh, It's like that nigga\nYeah, it's like that nigga\nSay what? It's like that nigga\nYeah it's like that nigga\nHell yeah, it's like that nigga\nYeah it's like that nigga\nSo MC Ren make the move to just come again\n\n(MC Ren)\nI be that nigga that put Compton on the map\nSo you bitch made niggaz step the fuck back\nMy throne is a corner wherever I lay my hat\nPolice always show up wherever they say I'm at\nThey say real niggaz don't die but niggaz be dyin' everyday\nThem devils be screamin' on niggaz\nAnd niggaz be actin' like hoes in every way\nBut I'm a God damn soldier it's my time to rule\nCallin' hits like the mafia, nigga from a bar stool\nHit after hit, every record is the same\nStill getting mine out here in the rap game\nNot a black Caesar, more like a black Pharoh\nThe gorilla killa devil in a double barrel\nUh, sawed off and hauled off here I come again\nPeace to all my people in the pen, 'cause Ren\nWill keep all my shit comin' phat\nSo whack fools take this it's like that\n\nYeah, it's like that nigga\nYeah, it's like that nigga\nHell yeah It's like that nigga\nYeah it's like that nigga\nSay what? It's like that nigga\nYou know it's like that nigga\nYeah, let them playa hatin' fools know the real, how you feel\nIt's like that nigga\nDamn, it's like that nigga\nSay what? It's like that nigga\nYeah it's like that nigga\nSay what? It's like that nigga\nThe shit is like that nigga\nSo all you bitches better duck\n'Cause we really don't give a fuck\n\nIn the 95, in the 95\n\n\"Ain't that phat\n\n", "album": {"title": "The_Villain_In_Black_(1996)&&6612", "genre": "West Coast Hip Hop", "year": 1996}}, {"title": "Behind the Scenes", "href": "Behind_The_Scenes&&1703", "artist": {"unique_name": "MC_Ren"}, "lyrics": "Behind the Scenes\n\n\nNow this is the bitch who made straight A's,\nBut never got a look out of the house back in de\nDayz\nAnd when she was at school she gave people dirty\nLooks,\nShe always carried books and thought me and my\nFriends were crooks,\nYou always see the bitch in her classes,\nShe never wore pants she wore a dress and some\nGlasses,\nTeachers used to brag, she was the teacher's pet,\nAnd the nigguz used to brag how much they wanna get\nHer wet,\nUsless to aproach her 'cause she didn't talk,\nBut you would say \"fuck it\" when you saw the bitch\nWalk,\nAss hanging out by the pound,\nAnd that's the reason why niggaz wanted to get her\nPanties down,\nShe kept to herself in the hallways,\nAnd never looked at niggaz like all day,\nAnd when the last bell rung she was gone,\nSo one day I decided to follow the bitch home,\nHer mother was at work she would'nt get home till\n6,\nSo it was time for ren to put the bitch in the mix,\n'Cause back in the school it was every nigguz dream,\nSo now it's time to get a closer look behind the\nScene!\n\n\"All the pimps, the hores, the pulldaggers, the\nCocksuckers,\nGave 100$ bill just to see\"\n\nNow I made it to her house but she would'nt let me\nIn yo,\nSo I said fuck it, snuck around to the window,\nShe get into the room and start to undress,\nNow I'm biting on my lips saying \"damn this bitch\nIs blessed!\"\nThe doorbell rung, it was the nextdoor neighbor,\nAnd he was asking her, could she do him a favour,\nShe grabbed de nigga's hand and took him in the\nRoom,\nAnd laid on the back as he fucked her with a\nBroom,\nHe said he wanted to go but then she said,\nShe wanted him to eat the pussy so she grabbed his\nHead,\nAnd he started eating it like a thanksgiving dinner,\nHe made the bitch come and then he put his dick up\nIn her,\nShe scratched up his back with her claws,\nBut she was screaming so loud he had to gag her\nWith his draws,\nAnd after they finished fucking yo the bitch took a\nShower,\nTo wash off the sweat from the last half hour,\nThe bitch put out some bud and then she started to\nSmoke,\nTook a swig of Jack Daniels and made a few lines of\nCoke,\nThe nigga said \"shit, gotta go\",\nBcuz this innocent little girl is a ho!\nYo behind the scenes!\n\n\"Nobody in ... my neighborhood\" MiX\n\nNow I went back to school the very next day,\nAnd I knew that my niggaz won't believe what I had\nTo say,\nI told them what I saw and nigguz said \"yeah right\",\nSo I told the mothafuckaz to come over there\nTongiht,\nNow there's 10 real niggaz at her window,\nWaiting to see a ho like at a matinee show\nThey thought that I was lying 'cause we waited 1 hour,\nAnd when we started to leave the bitch walked out\nDa shower,\nAss hanging out as she laid on the bed,\nHer bottomlips was hanging and she started\nFingerbanging,\nHer daddy walked in and started beating her with a\nBelt,\nThe bitch was so hot she made the leather start to\nMelt,\nBut she was liking it,\nYelling \"daddy give it to me harder\",\nThen he took off all his clothes and start fucking\nHis daughter,\nMy niggaz outside did'nt believe what they would\nSee-some,\nAnd when her mama got home, they turned into a\nThreesome,\nHer mama ate the pussy while her daddy doggystyled\nIt,\nThe family prayed together and they also laid\nTogether,\nI could'nt take no more 'cause I was too much of a man,\nSo I jumped right through the window with my dick in\nMy hand,\nThe family didn't mind and kept doing what they was\nDoing,\n'Cause now it was even it was 2 against 2,\nAnd 'bout a couple minutes after I was in,\nAll my niggaz jumped in all 10 yo behind the scenes!\n\n\"This is a bitch who did the whole crew\"\n\n\"Yes daddy I love you\"\n\n\"She like suckin' on dicks ... and lickin' up\nNut... and she'll even take a broomstick up the butt!\"\n\n", "album": {"title": "Kizz_My_Black_Azz_(1992)&&7911", "genre": "Gangsta Rap", "year": 1992}}, {"title": "Do You Believe", "href": "Do_You_Believe&&107", "artist": {"unique_name": "MC_Ren"}, "lyrics": "\"And you have believed those ideas and concepts\"\n\"And you have believed those ideas and concepts\"\n...\n\nHow de fuck can you believe, that people turns to spirits?\nDon't run with that bullshit because I don't wanna hear it\nThe shit that you learned in the church - it only was worth\nA bottle of piss, now lemme tell you what you missed:\nJesus was'nt white like the lion devil told you\nHe's the same devil that brought you from Africa and sold you!\nMade you take the white men's name and now you're one with the same\nPlayin' all of his devilish games\nHo' runnin' 'round in 93' with your slavemaster name\nLike a Fool happy as you can be\nBelieve it in a burnin' hot hell\nBut the only hell you got was in the white men's jail cell\nThe devil owns every fuckin' thing\nI doubt you can't make it unless you can tap or fall or sing\nNow niggaz will be trippin' 'bout the shit I'm 'bout to speak\nHow can you go from the streets turnin' to chicks and eatin' pig feet\nLookin' for dope face turnin' to a hog\nMothafuckaz happy you ain't died from the smog\nNiggaz got these white devil bitches for the ho's\nDon't bring 'em in the room 'cause the bitches are doomed\n...\n\n\"And you have believed those ideas and concepts\"\n\"And you have believed those ideas and concepts\"\n\nIf you see a nigga with a white ho' beat his mothafuckin' ass\nRemind a mothafucka of what happened in the past\nLet me tell you somethin' that I think you oughta know\nHe's the same devil that came from ... 30 years ago\nThen you got niggaz that's blacker than the night\nRunnin' 'round town sayin' their best friends are white\nNiggaz like that are gonna hang up from a tree\nAnd burn 'em up aloud and let everybody see\n'Cause in 93' we'll come and burn down your store\nWhen niggaz sign up ... 54'\nIf you hate the devil you should fall right then\n'Cause all we're lookin' for is a few good men\nSo niggaz here we go here we go it's a trip\nThe devil separates you by a blood and a crip\n'Cause he knows if you're together yo we'll beat off in his ass\nGo to white neighborhood and start to blast\nNigga you believed ...\n\n\"And you have believed those ideas and concepts\"\n\"And you have believed those ideas and concepts\"\n\"And you have believed those ideas and concepts\"\n\"And you have believed those ideas and concepts\"\n\"And you have believed those ideas and concepts\"\n\n\n(Fade out, cya)\n\n", "album": {"title": "Shock_Of_The_Hour_(1993)&&8214", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "One False Move", "href": "One_False_Move&&1303", "artist": {"unique_name": "MC_Ren"}, "lyrics": "Badung Bang\n\nRen your dangerous, you know you bat like a week\nRen your dangerous gun shots from Juagardonlee\nDangerous, me know you bat like a week\nRen your dangerous, gun shots from Juagardonlee\n\n(MC Ren)\nMove, now let me fall into the groove\nBreakin' niggaz off but I break 'em off smooth\nUsed to try to pimp, but the ho's got old\nA nigga can't remember how much dope that I sold\nIn my youth, the shit is the truth, go to jail for the proof\nNiggaz makin' records sellin' two copies\nTryin' to fuck with me because your rap's sloppy\nNow back in your cage your wings are short\nYou tall, dirty motherfuckers dig the basketball courts\nI can tear ya ass up in a rhyme\nBut I won't mention your name, 'cause that's a waste of my time\nSo I call my niggaz, Chip and Dollar Bill\nScoop up to the hill when we move in for the kill\nNever retreat you dirty nigga take a seat\nBig motherfuckin' feet, with your wack assed beats\nSo train \"What up?\" cut 'em with the shape\nMake the nigga walk the plank, the dirty nigga always stank\nNigga better raise like the Titanic\nAin't from Atlantic, but I'll make your ass panic\nAnd that's only one step, pride is kept\nA glass of piss weigh as much as your rep\nNigga your through\n\nOne false move and a motherfucka's dead\n&gt;From one Nine millimeter shot to the head\nOne false move and a motherfucka's dead\n&gt;From one Nine millimeter shot to the head\n\n(Da Konvicted Felon)\nQuad is kept, I step\nWith the nine millimeter come\nComplicated with the gat to the back of the devil's head\nThen I pull the trigger till he dead\nRed rum, all I can see when I close my eyes at night\nDreamin' of vision of murderers comin' with butt, while Satan's out to fight\nI ain't rappin' to tight\nYou're fuckin' with a motherfuckin' madman\nThat don't take shit from a redneck chick\nYou can put your mouth up my steel dick\nAnd suck until I pull my trigger come, ejaculate my gun\nWhat'll be done, when I be makin' your blood run\nInto the stretch\nAnd motherfuck that white trigger that got his fuckin' ass beat\nMany be pussy poppin' can't attail for that knee\nBut not so many as I gave so much a buck, buck from me\nBuck, but it gets it up, I'm tryin' to defend my own skin\n&gt;From a nigga who loves crackers, so come and ya jack 'em\nSleep with the enemy and get treated as such\nThe convicted followed no bust, and lust for you\nTo make that one false move\n\nOne false move and a motherfucka's dead\n&gt;From one nine millimeter shot to the head\nOne false move and a motherfucka's dead\n&gt;From one nine millimeter shot to the head\n\nBut if every nigga grabbed a nine\nAnd started shootin' motherfucker's it would put 'em in line (2x)\n\n(Dollar Bill)\nI was never the one to run with the pack\nBut was the mastermind for settin' up the jack\nSo if they every saw my beamin' it wasn't from crack\nI musta been beamin' them grubs to hit the sack\nAnd let me remember the days of way back\nWhen everybody was homies and no one played that\nRockin' 'em, sockin' 'em, knockin' 'em out the box now tell me what's up\nLook at me wrong fool, you get tossed up\nI mean fucked up, you lucked up\nI didn't come out a long time ago, with the fast or the slow flow\nAnd callin' me wack, no that's a no no\nThe style just so wild, while your style just so-so\nNasty, they can't pass me, it's too fast see\nNiggaz that blast fast I don't let 'em blast me\nUsin' my mind like a nine millimeter to abuse\nSo don't make one false move\n\nOne false move and a motherfucka's dead\n&gt;From one nine millimeter shot to the head\nOne false move and a motherfucka's dead\n&gt;From one nine millimeter shot to the head\n\nMany more will laugh and suffer, many more will laugh and die\nOne false move, and it's an eye for an eye\n\n\"Yeah, I'm ready to die today\"(repeat out)\n\n", "album": {"title": "Shock_Of_The_Hour_(1993)&&8214", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Keep It Real", "href": "Keep_It_Real&&2980", "artist": {"unique_name": "MC_Ren"}, "lyrics": "'That's what the fuck I'm talkin' about\nThat real shit nigga'\n\nLiving room packed, laid back on the flow\nNiggaz can't see me on the madden with Frisco\nI'm runnin' fools straight to the dirt\nWhile my man Train talkin' on the phone, the evil curse\nNiggaz waste gas drivin' down the same streets\nAnd hood rats wishin' for the passenger seats\nFlag 'em down, like they flaggin' down to get a taxi\nToo good to ride a bus, drinkin' is a must\nAnother day kickin' back, the scientist is hard at work\nThinkin' how to get paid, kickin' back in the shade\nOr call Will and Temple where my homie down by Zeenie\nWith the bald head it's too hot for the beanie\nSittin' on the porch niggaz run the stop sign\nHookers sell they bodies 'round the way ain't hard to find\nRight in the corner of McDonald's parkin' lot\nPeepin' out their hair 'cause that spot is hot\nAnd that's real\n\nNigga gotta keep my shit real\nLettin' punk niggaz know how the fuck I feel\nPussy ass niggaz always wanna be around\nA nigga like Ren when I put that real shit down\n\nRandy up the street cuttin' up the fresh fade\nAnd Compton P.D. around the corner 'bout to raid\nThe yellow helicopter hangin' 'round like a gnat\nAnd hood rats yellin' out a car where the party at\nMy robbin' train go and get a duce\nAnd niggaz 'round the way don't give a damn about a gang truce\nBut I gotta lotta love for my people\nAnd like they ain't tryin', niggaz just keep dyin'\nI won't be like most niggaz and just come\nAnd shoot my video in Compton and disappear for a year\nWe make fools like that shake the spot\nOne for the treble jack yo ass in the parkin' lot\n'Cause handkerchief headed niggaz come around fakin'\nBraggin' 'bout that money they be makin'\nBoot lickin' butt dancin' niggaz just better chill\nBefore I tell 'em how I feel and that's real\n\nYeah, uh, break it down\nAll y'all busta ass niggaz\nDo it like this, 1995\nUh, yeah, come all y'all fake ass niggaz to this\n\nGoin' to the pad hit the beach up on the pager\nHere comes Korleone up the street in the mini-Blazer\nWhile the dominoes start to get shakin'\nThe same time that the barbique start bakin'\nI don't eat swine, but I take a turkey burger\nI can't fade worms, that books' full of terms\nHomies pass by, some stop and conversate\nOn a gang a topics we start to debate\nOn why in black neighborhoods is always towed down\nAnd white neighborhoods ain't one piece a trash 'round\nSo we gotta do for self and quit bitchin'\nRecycle black dollars so we can roll Impalas\nEvery street got their own rap artist\nOn every cover every brother got a gun tryin' to look the hardest\nBut some deserve a slap 'cause they laid down they strap\nWhen they hear that's a rap and that's real\n\n", "album": {"title": "The_Villain_In_Black_(1996)&&6612", "genre": "West Coast Hip Hop", "year": 1996}}, {"title": "Shot Caller", "href": "Shot_Caller&&1430", "artist": {"unique_name": "MC_Ren"}, "lyrics": "(Feat. Big Rocc and Tha Chill)\n\n(VERSE 1: MC Ren)\nNiggas in the hood lookin' at me crazy\nTellin' niggas like they wanna fuck my old lady\nSame fuckin' shit every day at 8 o'clock\nNigga, start my day off raisin off the cock\nI throw the khakis on, with the t-shirt\nNever knowin' when a nigga might hit the dirt\nI'm thinkin', how in the fuck can I get high quicker\nMix the blunt with some muthafuckin malt liquor\nThese niggas that I love, I don't trust em, but I stay close to em\nIn case I gotta do em\nWe from the same set, but that don't mean shit no mo'\nI be premeditatin with the .44 (.44)\nMy hoe be tellin' a nigga to peel they caps back\n'Cause I know where them niggas hide they shit at\nShit be on my mind, return a shot call\nBroke as fuck, it's about to get hot, y'all\n\n(CHORUS: Big Rocc)\nNiggas starvin while you're home with the mills\nNiggas killin' while you're doin' dope deals\nOut flossin, throwin' 100 $ bills\nTime to set yo ass up for the kill\nDeath of a shot caller, who can you trust?\nIt might be your number 1 nigga that bust\nA cap, he's the next one to take charge\nSmoke him and his bitch in his backyard\n\n(VERSE 2: MC Ren)\nA nigga's sittin' on the curb\nHear that nigga come bumpin with the suburb\nGot my niggas on point, same niggas he be fuckin' hoes with\nAnd rollin' up the blunts when he wanna get lit\nHomie, when that nigga put the mutahfucka in park?\nThat's the signal, little nigga, pump 3 in his heart\nDon't feel shit, 'cause it's real shit, he a bitch\nNiggas in the hood doin' bad while he gettin' rich\nOff this shit we be killin' niggas fo'\nCan't make a move less this muthafucka say so\nNigga, fuck that, I'm runnin' this shit\nI'ma look him in his eyes when his punk-ass gettin' hit\nBut if you miss, nigga, I'ma kill you\n'Cause if he get away, muthafucka, then we all through\nFuck 3 shots, nigga, add 2\nAnd handle what the fuck you gotta do\nKill the shot caller\n\nMan, you know we been smokin' niggas for this muthafucka\nThis nigga ain't paid us shit, man\n(I know, dog)\nHold up, hold up, hold up, dog\nMan, gimme the gat, I - damn\nHey nigga, you got my muthafuckin money?\nNigga, fuck yo money, nigga\nNo nigga, fuck you\n(*Shots*)\nOh shit, oh shit...\nDamn!\n\n(VERSE 3: Tha Chill)\nThese O.G.'s got me twisted like twizzler\nGot me heated and hot, and all I'm thinkin' is killin' ya\nPeelin ya cap back, like Starter, fool\nI'm comin' to get you niggas off my block, so I pack a full\nGlock with big slugs, and you know I buck no doubs\nCause you know a nigga steelo, how I did them fools a week ago\nOne week passed, I'm hearin you wanna wet us\nWhen you see Ren, Rocc, Tha Chill, you're puttin' on the jetters\nWhat the fuck? These niggas tryin' to bust on me?\nSo I'm cockin up the can and ready to make them do some gas\nAnd do some flippin, and all that\nCause niggas out here shot call, get they ass jacked\nAnd that's the main fact, big payback for you punk muthafucks\nDisrespectin the crew, it's mandatory that I buck\nAss down from Comptown, Mr. Shot Caller\nGonna be a fast faller if he ain't a fast talker\nFast walker, or better yet better be a fast runner\nChill on the scope with the cannon, finna gun ya\nDumpin 9 to the gut like \"Nigga, what?\"\nThis ol' B.G. big baller, fuck the muthafuckin shot caller\n\n", "album": {"title": "Ruthless_For_Life_(1998)&&8564", "genre": "West Coast Hip Hop", "year": 1998}}, {"title": "Kizz My Black Azz", "href": "Kizz_My_Black_Azz&&9768", "artist": {"unique_name": "MC_Ren"}, "lyrics": "You kiss my black ass because you sucked my dick off\nMy balls are fallin' out of your mouth when you cough\nThis is for the people in the business, the people in the streets\nAnd most of all it's to the wack muthafuckas with wack beats\nFools on the streets wish they was in my shoes\nCause every day they wake up, they see me on the news\nI'm hittin number one the first week that I'm released\nAnd my muthafuckin business and my bank account increase\nBitches ride the poke and niggas ride the sack\nSo I guess that you can say they're both caught in the impact\nNiggas in my neighborhood ain't about nothin'\nThe po' broke muthafuckas think I owe 'em something\nBut I don't owe 'em shit but a 'what's up' for a hello\nAnd ask for a job, the answer is, \"Hell no\"\nGo back to the corner with your brew and be angry\nCause lookin' at me crazy, that shit ain't gonna change me\nBut some of them are cool, and they know who they are\nThe ones that used to kick it with me when I couldn't afford a car\nBut the others talk shit behind my back\nThe main muthafuckas always sayin' they gotta rap\nWait to make a record like it happens overnight\nBut the rhymes are always sloppy and they're never ever tight\nThen they get pissed when I tell them that it's wack\nBut Ren ain't a pussy, so step the fuck back\nAnd kiss my black ass\n\nI'm tired of rappers with live instruments on the stage\nSave the shit for parades\nAnd while you're at it, why don't you dress like a clown\nAnd draw yourself a permanent frown\nCause the pioneers didn't draw bands in the blueprints\nBecause it wouldn't make sense\nRappers doin' this should retire\nNiggas lookin' like Earth, Wind and Fire\nPeople don't go to rap shows, so they can hear a band\nIt's like a man tryin' to fuck a man\nIt defeats the whole purpose\nIt's like a fish tryin' to swim on the surface\nA big circus, all that's missin' is a tent\nBecause the shit ain't worth five cents\nSo a nigga like Ren'll take a stand\nTo say a real rap artist don't need a band\nAll you need on the stage is meat and bones\nSave the band shit for Quincy Jones\nAnd no more singin' on the breaks, please\nThe shit is spreadin fast like disease\nAnd for them I'll be a cure, pure\nYou know that I know I'm sure\nSo I'ma trap on my lure\nEvery hypocritical muthafucka that's suckin with the rap\nGive him a real nigga slap\nKiss my black ass\n\nNow rappers in the business talk shit behind my back\nJust because their shit ain't sellin and people call it wack\nBut when I go to clubs, I get the utmost respect\nThem jealous muthafuckas know I clock crazy checks\nSayin' I wouldn't sell if I didn't cuss\nBut while they fuss, I'm goin', gone, they goin' dust\nBarely standin the light of the lime\nLife's a bitch with some pussy-ass rhymes\nBut they always on my dick when they see me\nI think beneath that point, they wanna be me\nI don't break my neck to be in other niggas' videos\nStandin around like hoes\nBut them other niggas gotta do it for pub'\nBecause nobody recognize them in the club\nAnd when they see me they wanna kick it, so people'll stare\nQuit swinging on my dick hairs\nAnd as soon as I leave, the muthafuckas start yappin\nRun they mouth like a bitch, better than they do rappin'\nAnd I don't need a crew\nBecause a crew can't do shit that a real nigga can't do\nSo to all y'all niggas that's down with a crew\nHow does it feel ot be number two?\nKissin' another nigga's ass so you can slick sign a autograph\nAnd move people out his path\nAnd that's the reason I'ma diss you\nStuff your mouth with tissue\nAnd kiss my black ass\n\n", "album": {"title": "Kizz_My_Black_Azz_(1992)&&7911", "genre": "Gangsta Rap", "year": 1992}}, {"title": "All Bullshit Aside", "href": "All_Bullshit_Aside&&292", "artist": {"unique_name": "MC_Ren"}, "lyrics": "Yeah, check this out, Ren is back in this mothafucka for 93'\nFor all y'all punk ass niggaz that thought I was'nt gonna do this shit,\nBack there talkin' all that shit, won't believe me and my shoots,\nFuck all y'all niggaz 'cause I come back hard 93',\nSo all you punks mothafuckaz check yourself niggaz!\n\nI killed that bitch that waited 40 ounces\nStart hittin' my switches 'cause my 40 bounces\nLean to the side like a mack would do\nOr I can come off like a G and mothafucka I'll jack you\n'Cause niggaz be talkin' that shit 'cause I'm fuckin' the rest and I can't scrap\nWho needs to scrap, my niggaz commin' from de back.\nSo bitches hold your panties up, tick your tits\n'Cause mothafuckin' Ren is makin' mothafuckin' hits\nStill sportin' cackies keep my dick in my dickies\nOnly wave 'em up when bitches wanna give 'em hickeis\nOther than that, I'm lookin' up for #1\n'Cause #2 I did'nt trust so my nigga had to bust\nBurry him in the back another weedplants\nMy niggaz said it was the reason why the weed is so dope\nGrab another bitch twist the panties off the top\nOpen up my mouth and let the old English drop\nBuzz for a minute - could'nt walk a straight line\nBut that shit don't stop Ren from writin' a rhyme\nAnd punk mothafuckaz can't hide, from a nigga\nHomicide all bullshit aside ...\n\nKick it ...\n\nYeah, put de fuckin' bullshit aside [oh yeah, yeah]\nYeah, put de fuckin' bullshit aside [you wanna fuck with me?]\nYeah, put de mothafuckin' bullshit aside [nigga step off nigga!]\nYeah, put de mothafuckin' bullshit aside [mothafucka]\n\nTake donations from my niggaz for de booth\nI thinkin' of gettin' a case better yet I get two\nSlap up de phone 6 3 2 15\nBitches ring the bell - it's a fuckin' tight jeans\nA kiss on my chick but my dick is gettin' jealos\nShe whispers she want suck and when we're not around de fellows\nFuck that shit, bitch, do what you gotta do\n'Cause when you're fuckin' with Ren ho' my niggaz peoplez too\nNow I'm zippin' on my blue black car\nThinkin' of the times in the blvd\nI saw people out there gettin' gangsta shit\nNiggaz shootin' every night - niggaz lootin' and shit\nSendin' niggaz straight to the coffin\nAnd this type of shit in the streets it's very often\nThe shit is like an everyday thang to me\nA lot of niggaz on my block I have 'em slang for me\nBut that ain't shit, my true niggaz stay down\nDe plasma hard G'z don't be fuckin' around\nAnd why would you even think to hide,\nNigga 'cause you got all bullshit aside, check it ...\n\nYeah, put de fuckin' bullshit aside [yeah nigga]\nYeah, put de fuckin' bullshit aside [nigga you think you can fuck with me?]\nYeah, put de fuckin' bullshit aside [that is not what I said]\nYeah, put de mothafuckin' bullshit aside mothafucka\n\nTrain came in in some cackey shorts\nAnd he came up on the hand at the basketball court\nTakin' niggaz money shootin' dice at the pawn\nThe mothafucka starts to leave when it starts to get dark\n'Cause Ren has don't got no mothafuckin' name,\nWhen he's shot by a nigga from my mothafuckin' game\nThe niggaz in de house just kickin' it\nBitches on they're knees straight lickin' it\nRen is in control, bitches call me the mesaiach\nI zip on some old drink fool so I can stay higher\nCakeys is krist, fresh from the surplus\nMy little nigga ball starts to pull up a fass\nSo now they drunk his beer so he put out a tattoo\nSo we walk the tommy dog that's the will nigga anthem\nSo Juvi' pass the movie it's \"American Me\"\nThe only movie that's allowed to be watched by a G\nNow bitches just commin' out of blockz and flatz\nSo you can hear a smokin' ho's yo for rockz and blantz\nTakin' these bitches for a ride, treat 'em all like\nHo's all bullshit aside ...\n\n", "album": {"title": "Shock_Of_The_Hour_(1993)&&8214", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Mr. Fuck Up", "href": "Mr._Fuck_Up&&6783", "artist": {"unique_name": "MC_Ren"}, "lyrics": "* (NOT Cash Money -- MC Ren's brother) \n\nMy niggaz call me Grinch and yes I'm known to be a fuck up\nLoaded clip, folded sticks, my lifts and double cuffed up\nPut my stick so nigga feel my pockets with the dollar\n'Cause they rock keep the stock in a private prison parlor\nGrinch you did it, your black ass really did it\nGive Bone the microphone and let him kill it\nGive Bone the microphone and watch me beat you like a cop\nLil' G from the hall so the maggot won't stop\nAnd plus I'm packin' punches always keep a good grip\nMy homies call me Bone from the Whole Damn Click\nI live like a mack and keep the bitches on my dick\nYou sorry sap sips still hangin' on my shit\nCompton is the heart and that's where we all from\nThe jackin' goin' on in the hood and in the slum\nAnd don't be caught slippin' while we dippin' the 4\n'Cause Ren'll grab his nine and watch him smoke 'em from the door\nAnd then we make a dash and put that ass in the air\nTrue checkin' done by the true fuckin' player\nI'm headed to the cut with straight chronic in my pock\nRainin' make 'em kill 'em 'cause I'm servin' 'em spot\nAnd that's how it's done I keep it flowin' like a sailor\nMy beats are large my feats are star, some called me Chuck Taylor\nThen I call the Juvy 'cause I know we gotta Coupe\nDon't worry 'bout a damn we got the end, we gettin' loot\n\nThen call me Mr. Dopeman when I'm chillin' in the spot\nMy niggaz call me Bishop when I'm rollin' with my glock\nThe crackers call me bandit when I'm runnin' from the cops\nAnd the bitches call me daddy when I'm tearin' up the cock\nYo the title's Mr. Fuck up so I figure that I'm fucked\nGot no luck, shit, gotta go and earn a quick buck\nBoom boom, is the sound of my cannon\n'Cause I'm a nigga with a motherfuckin' gun master plannin'\nI'm a crazy ass nigga makin' motherfuckers fall\nA nigga from the streets hangin' in the fuckin' hall\nI place where we smoke bud and niggaz get bent\nAnd when it comes to music put on MC Ren shit\nNow everybody chillin' and the bitches gettin' freaky\nTook a trick to the room now she gots ta lick me\nLickin' out my ass hole like a fuckin' groupie\nI'm through now I cleans up and call my nigga Juvy\nHeadin' downstairs my niggaz hand me a 4-O\nSmokin' the extension you know it's the indo\nNow I'm feelin' high like I'm sittin' on a cloud\nThe dust that we kick I guess we live our lives foul\nBeware of the nigga that they call J-Rock\nThe party's goin' through but I still got my glock\nI'm watchin' for the bad apples in every bunch\nAnd if it's necessary motherfucker we can thump\nOr get a fuckin' pump, put a hole in your chest\nSlugs goin' straight through a bullet proof vest\nMatters gettin' worse if I have to drop the dogs\nBeat ya in your face yellin' till ya hit the hall\nSo smalls, get your fuckin' 9 and your clip\nAnd let these motherfuckers know what's up on the Whole Click\n\n", "album": {"title": "Shock_Of_The_Hour_(1993)&&8214", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Nigga Called Ren", "href": "Nigga_Called_Ren&&9809", "artist": {"unique_name": "MC_Ren"}, "lyrics": "Ten years muthafucka'z, these bomb ass raps hooked up wit ant banks\n\nMade the bay bridge collapse ren's rap[voice]\nBitches be havin' claps and crabs on a day\nI came outta state, like a movin yay\nIt's all about ren and banks like hoo riders\nMuthafuckin compton niggas got them true riders\nIndustry full a shit make a nigga shake spots\nThese muthafuckin clones bitin bone and pac\nFuck magazines I get five mics who the source\nWit all this street shit my niggas took it by force\nTen years ago the villain revealin a new text\nGuaranteed legendary endorsin big checks\nBroke off to sex real niggas don't die\nNigga thinkin' you the shit cause ya homie lie\n\nChorus[all you bitch ass niggas wanna ride wit me\nKnowin' damn well you can't come inside wit me\nNow the villain is back again who is it\nThe black nigga that they call reeeeen\n\nRen's rap verse 2\nBitches be havin' signs readin ren come and fuck\nVillain be meditatin have the trick feel we matin\nHands off controllin they minds like remotes\nCompton niggas be shovin they dicks down them deep throats\nI'm compton most wanted like eight and chill\nFuck the radio and the bitch dianna still\nWe don't be givin' a fuck like niggas shermed up\nHeard I was fuckin' wit banks got yo ass turned up\nLyrically I can't be fucked wit wit a pen\nBitches be sayin' they pussy hurt again by that nigga ren\nI niggafied like them do foself soldiers\nStreet niggas comin' up slangin straight bolders\nToo much dick to swallow got yo ass about to choke\nWhen I nut yo face creamy white like you sniffin coke\nFuck that my muthafuckin dick weighs a ton\nI see you bitch niggas wanna run uh,\nRen's rap verse 3\nThese niggas ridiculous makin' me laugh like jamie foxx\nShackin wit they mommas actin' like they fort knox\nClone niggas created them all like yakube\nWonderin why they gettin' booed imitatin icecube\nCacky suits niggas permed the fuck up\nIn eighty seven its cool in ninety seven burn the fuck up\nWest coast full a droughts wit no clout\nMost of y'all muthafuckas don't know what y'all talkin' bout\nGot niggas drinkin' ya poison like jim jones\nVillain be shippin gold in three muthafuckin time zones\nBut the villain residin on fault lines\nAmaeture niggas thought they could duck but caught mine\nRight jabs and bruce lee kicks and back flips\nHooked up wit this nigga from the bay to stack chips\nBig thangs reedit that shit I be the fattest\nBlack muthafucka real nigga status uh\n\n", "album": {"title": "Ruthless_For_Life_(1998)&&8564", "genre": "West Coast Hip Hop", "year": 1998}}, {"title": "Fuck What Ya Heard", "href": "Fuck_What_Ya_Heard&&2748", "artist": {"unique_name": "MC_Ren"}, "lyrics": "Always carryin' a Mack 10, know what I'm sayin'?\nRen is a nigga that you don't wanna fuck wit'\nAlways carryin' a Mack 10 know what I'm sayin'?\nRen is a nigga that you don't wanna fuck wit'\n\nIn '93 I'm wreckin' shit so you can fuck what ya heard\nI'm droppin' plenty shit like a motherfuckin' bird\nI steal gangsta boogie if I gets my boogie on\nPut my finger in my chrome keeps 'em fuckin' wit' my dome\nTellin' me to shoot all these niggaz that I hear\nBitchin' gossip in my ear, I hear this shit every year\nNigga still talkin' like a bitch\nMad 'cause another nigga tryin' ta get rich\nI see ya tellin' niggaz, yo Ren is gonna fall\nBut I think ya dumb ass had too much of the 8 ball\nYour own motherfucker don't know\nThat Ren can play ya low, ya didn't know I'd fuck your ho\nNow the kid that you're claimin', yo you're very quick to claim\nBut to me it's just my gear with another fuckin' name\nAnd niggaz wanna know what's the word?\nSo peep it out, you can fuck what ya heard\n\nYeah fuck what ya heard, fuck what ya heard, what ya heard\nYeah fuck what ya heard, fuck what ya heard, what ya heard\n\nAlways carryin' a mack 10 know what I'm sayin'?\nRen is a nigga that you don't wanna fuck wit'\nAlways carryin' a mack 10 know what I'm sayin'?\nRen is a nigga that you don't wanna fuck wit'\n\nNiggaz gimme looks like they wanna try and thump\nThinkin' Ren is just a chump, in the trunk I got the punk\nShoot it in the crowd, I shoot a niggaz in the back\nAll my niggaz in the shack started fuckin' in the lack\nSome niggaz rolled up and said the truce was dead\nTrain said fuck it, shot the nigga in the head\nAnd it's on, all y'all niggaz get to your post\nTrain just killed a nigga so we gotta do a ghost\nDip back to the hood, sip the 40 on the way\n'Cause the niggaz from my motherfuckin' hood don't play\nAnd ya still wanna know what's the word\nNigga fuck you and fuck what ya heard\n\nAlways carryin' a mack 10, know what I'm sayin'?\nRen is a nigga that you don't wanna fuck wit'\nAlways carryin' a mack 10, know what I'm sayin'?\nRen is a nigga that you don't wanna fuck wit'\n\nHe say, she say, who gives a fuck what they say?\nScreamin' off at mayday the shit is goin' my way\nNiggaz can't believe that I'm so much of a G\n'Cause I don't let skanky bitches sit up under me\nNow y'all niggaz out there y'all swear y'all can scrap\nGet your ass kicked makes ya wanna try to rap\nSprung on a ho yo smokin' all your weed\nFuckin' with a bitch that ya really don't need\nThe click, my niggaz from the click pimps hoes\nRich, Train block my nigga, Bone and Jubee Lows\nThem fools can't even say a word\n'Cause a nigga don't give a fuck about what ya heard\n\nAlways carryin' a mack 10 know what I'm sayin'?\nRen is a nigga that you don't wanna fuck wit'\n(Repeat till end)\n\n", "album": {"title": "Shock_Of_The_Hour_(1993)&&8214", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Attack On Babylon", "href": "Attack_On_Babylon&&7527", "artist": {"unique_name": "MC_Ren"}, "lyrics": "\"Is America like ancient Rome?\"\n\"Is America like ancient Babylon?\"\n\n\"Come on, come on, come on, come on, come on.\nI wanna hear from you\"\n\nI told ya Ren'll be back with the niggaz in the Dodge and the camoflauge\nBut it after Tahj, a million niggaz no mirage\nCreepin' and we're creepin' in your little white Hutz\n20 million niggaz chantin' I don't give a fuck\nIt's on, the switch got flicked but who did it?\nWhen that shit was committed, fuck that was my mack\nNiggaz gettin' crazy 'cause Ren is in the front\nWith supreme wisdom, puffin' on a blunt\nTrain by my side tearin' up shit\nWith his bulletproof vest, still yellin' double S\nThe whole community is up in a rage\n'Cause niggaz be movin' closer to white motherfuckers'll make 'em as slaves\nAnd then they put these sell out niggaz on the TV\nTo try to calm down niggaz like you and me\nBut fuck that shit, 'cause my eyes are closed\n'Cause Ren ain't got time to be fuckin' 'round with them hoes\nSo I see ya at the grave where we bury 'em\nEven motherfuckers that went out and even married 'em\nNow it's time to attack take this motherfucker back\nBring it on, and it's on\n\nAttack, attack, attack on Babylon\n\nHere comes the doom, so listen to the tick of the tock\nCan't keep niggaz off your block, don't forget we got the glock\nAnd the sawed-off, and the trey 8's\nAnd the duce duce, and the niggaz in the pen breakin' loose\nSo Ren will conduct this, but I pull my dick and say suck this\nFor the niggaz that say fuck this\nThat ain't down, and step foot into the car\nTo commit the 187 with the nigga they call outlaw\nBut who gives a fuck who pulled the trigger\n'Cause I know some bitches that shot up a gang a niggaz\nGettin' off the reservations, breakin' up the docks\nDoin' this with 15 shots\nBabylon, a great look at the bitch while she fall\nDyin' like a motherfucker with no one to call\nNow it's time to attack, take this motherfucker back\nYou bring it on, and it be on\n\nWhere the fuck ya gonna run, when the fuckin' ground starts shakin'\nNiggaz don't be waitin', niggaz be constantly makin'\nNiggaz with no hesitation, a fuck up in this nation\nTo murder the caucasian, the Asian invasion\nSo here we come, come, come\nMy nigga Rhythm D is on the drum, drum, drum\nThe mayday, oh it's a dreadful day\nWhen no motherfucker can come out to play\nIt goes (5 gunshots)\nNiggaz lettin' off and the shit is all that\nSo stay inside the house if you ain't down\n'Cause you might get caught up you sad faced clown\nThen I'll bring ya to ya knees, fuckin' with these\nFuckin' with niggaz that's a hive a bees\nWe go stingin', but dumbass niggaz keep singin'\nNo time for singin', too busy swingin'\nSo it's time to attack, take this motherfucker back\nY'all brought it on, so now it's on\n\n", "album": {"title": "Shock_Of_The_Hour_(1993)&&8214", "genre": "West Coast Hip Hop", "year": 1993}}, {"title": "Hounddogz", "href": "Hounddogz&&2942", "artist": {"unique_name": "MC_Ren"}, "lyrics": "The year is 87'\nBack in the 12th grade G\nWhen I used to hang with CH to the IP hangin' in the halls\nTryin' to get the young bitches ridin' my ballz\nWe got dissed 'cause we were jog' and kept to ourself shyo\nBecause it's all about self\nWe used to try to get the number and the name\nBut back then - they wanted mothafuckaz in the dope game\nWe used to try to fuck with ho's\nIn our graduatin' class there was no woman givin' up the ass\nWe go to a dance, we see ho's rollin' eyes on my crew,\nBut what the fuck can I do?\nThey would'nt even give a nigga like me a chance thou [why?]\nBecause my feet was my transport\nYou ax 'em to dance they start to riff\nAnd on the way home niggaz never gave us a lift\nBut now the tables turned around\nEvery mothafucka and his mom would wanna be down\nI see the bitches at the clubs, the same ones\nThey're thinkin' they're fine and also runnin' the same line:\n\"What's up Ren, we used to be in the same class\"\nI'm shakin' my head yeah, now listen to line ass\nThey ax me what have I been up to,\nKnowin' damn well I made money for my record sales\nI zip on my drink and say see ya\n'Cause only a four leg and pregnant mud can be ya'\n\nPeople that used to hate me\nNow when they see me they speak first\nBut used to demon raps 'cause I cursed\nThey used to say I would'nt make it 'cause I use profanity\nAnd call myself a Nigga With an Attitude\nBut once again the tables turned around\nNiggaz tryin' to be down - walkin' up like a hound\nEspecially the ones that never had nothin' to say\nNow they talk to me like enow and everyday\nAxin' me what's up with Eazy\nOr Dr. Dre, yo did he marry Miss She'ly?\nOr did the D.O.C get his voice back,\nAnd niggaz think I'm mean when I say I'm not a magazine\n'Cause when I come around I wanna kick it\nThe ... is axin' me for concert tickets\nThe same fools, that used to go to my school\nWhen you see my on the streets just chill and be cool\nSo if you really wanna be down -\nDon't crowd around a nigga like a hound!\n\nThe hound-dogs, they come in all shapes 'n' sizes\nJackin' 'round Ren with a gang o' surprises\nNothin' but a groopy in sheep's clothin'\nThe shit makes me lough when the homies want an autograph\nI feel like I'm on a talkshow\nBecause they ax all the questions then say they gotta go\nNever wanna know how I'm makin' out\nAll they wanna know is when my alboum's commin' out\nOr ax me - 'Yo Ren, when are you goin' on tour?'\nI tell 'em 'the same time like I told you before'\nThen there's always one beggin' for me to kick hm down\nFor pissin' on my leg I never knew you you fuckin' hound!\nSo go back to your home and fetch yo' bone\nAnd quit retrievin' on mine 'cause nigga you got your own\nAnd talk about me behind my back - nigga please!\nSo much of a hound, all you're missin' is your flees\nScratchin' all day because you're itchin'\nYou're tryin' to get news wishin' you was in my shoes\nBut trippin' like that you'd never be down\n'Cause Ren don't likes a fuckin' hound -\nYou straight hound-dog!\n\n", "album": {"title": "Kizz_My_Black_Azz_(1992)&&7911", "genre": "Gangsta Rap", "year": 1992}}, {"title": "Final Frontier", "href": "Final_Frontier&&6033", "artist": {"unique_name": "MC_Ren"}, "lyrics": "Hey, hey Ren, hey check this out loc\nHey man I've been hearing a gang of niggas\nTalking a whole lot of unnecessary bullshit man,\nWhat if one of 'em trick ass niggas\nCome at you the wrong way loc'?\n\n(MC Ren)\nI'll beat a niggaz ass on the trick just for the hell of it\nThere the motherfuckin piece of pussy there's no tell of it\nI don't give a damn I'll beat a nigga like he's stole somethin'\nAnd then I'll let the motherfucker know where Ren is comin' from\nI'm from Compton everybody's on the wagon\nI'm looking for niggaz that's thinkin'\nThat they're the shit, that's who I'm taggin'\nNever asking questions I just go right in and do it\nAnd if you're thinkin' that you can fuck with Ren\nYou bitch already blew it\nLike I said before, fools want up in my shoes\nBut after fuckin' with me\nThey're givin' up rap, and they're singin' the blues\nMe and DJ Train dropping bombs like a P2\nSo you should get the picture or if not, you get a preview\nThat we don't take no shit\nCause MC Ren ain't a nigga that you wanna try and fuck with\nKick a little ass in my spare time\nTo keep myself occupied when I'm not bustin' up a rhyme\nWritin that shit that ya love to hear\nCause MC Ren is the final frontier\n\n(Black guy) Who is it?\n(White guy) The black nigga that they call Ren\n(Black guy) Who is it?\n(White guy) The black nigga that they call Ren\n(Black guy) Who is it?\n(White guy) The black nigga that they call Ren\n(MC Ren) Ya fuck with me ya gotta fuck with a Mack 10\n\n(MC Ren)\nNow throw your hands in the air and let me see ya slap a hoe\nStart the violence goin' on through an MC Ren show\nI don't give a fuck if niggaz is fightin in the crowd\nI only got one concern, that's my vocals pumpin loud\nI'm standing on the stage I got my niggaz to my right\nI bust a couple of verses\nThen jump in the crowd and get with the fight\nI hit a nigga off in the head with a chair\nThe reason for that, the motherfucker he was standin there\nThen DJ Train will grab the gauge - just in case a motherfucker\nTalks shit; he'll be the victim on the front page\nHe's on his way to the morgue - to kick it with the rest\nOf them motherfuckers that I gave free room and board\nSo when ya at my show\nLet me see ya throw your hands up in the air and slap a hoe\nCause that's the only noise I wanna hear\nCause MC Ren is the final frontier\n\n(MC Ren)\nThe final frontier makes an average nigga wonder\nWhy they do a couple of records and then they go up under\nTry to copy Ren but Ren just can't be duplicated\nMotherfuckers makin' pussy shit so I come in and fade it\nSlap the niggaz like bitches if they have to talk back\nPut my foot so deep in their ass they have a hole and not a crack\nThe shit just makes a nigga laugh, cause niggaz be comin' up to me\nAskin me why did I leave size 10 Nike in that ass\nI tell 'em I had to do it was part of the plan\nTo try to stop the fools jacking off by the hand\nPutting wack records in the make\nBy usin' R&amp;B fuckin' singers in the god damn breaks\nTry to go commercial but they started out street\nThat's reason why they're still drivin' their two feet\nThinkin' they can diss Ren's flow, but singin' and dancin\nDon't go with the format that I be usin' in my show\nIt's just hardcore niggaz actin' crazy on the stage\nWearing gangsta clothes yo and spittin' on the hoes\nDoin' that shit that ya love to hear\nCause MC Ren is the final frontier\n\n", "album": {"title": "Kizz_My_Black_Azz_(1992)&&7911", "genre": "Gangsta Rap", "year": 1992}}, {"title": "Voyage to Compton", "href": "Voyage_To_Compton&&9324", "artist": {"unique_name": "MC_Ren"}, "lyrics": "Mhhmmm\nThat's right\nTake a voyage\nWhere?\nAll the way down\nDown where?\nDown where?\nDown where?\n\nNiggas be thinkin' the Villain has stopped givin' Compton props\nNigga you smokin' off that muthafuckin stress\nThat your ass was chokin\nCPT, I'm straight out, that's my muthafuckin heart\nYou can't tear me apart, they gave a nigga a start\nIt's crazy niggas in that bitch, plenty hoes to match\nPlenty pussies to fuck, and plenty bitches to catch\nNiggas be doin' what they got to do, family's a need\nCompton niggas hit that pussy so hard, make it bleed\nNiggas hittin switches, and movin pounds of dope\nSo cluck-head muthafuckas got they rocks to smoke\nNiggas be killin' other niggas when they get in they path\nWhite muthafuckas gives a fuck, they sit back and laugh\nThese undercover tight bitches be playin' the tease\nGot my dick hard as fuck but she want the pennies\nNiggas be hatin' 'cause I'm doin' what the fuck they wanna do\nNiggas still be havin' love for you (be havin' love)\nUh!\n\nCompton (he's back to you)\nCompton come back to me (he's back to you)\nI know, I know baby\n\nNiggas be at the park, tryin' to set the pussy up for the night\nBaby you can suck this dick just as long as you don't bite\nGo back to the crib, we do that soopafly scene\nFuck your ass in the tub, rub my dick with vaseline\nMake my shit stretch all down your throat\nQuit tryna talk with that shit in your mouth just write a note\nOr use sign language if you need some air\nI'll chase your ass around the room, fuck that pussy anywhere\nI'm just a Compton nigga, no matter where the fuck I be\nNiggas don't get high, with me, I'm just writin what I see\nIt's reality that's all a real nigga know\nAll that \"Slob/Cuzzin\" and bullshit - it gots to go\nAll these niggas know, Villain kickin the real\nI gives a fuck how these muthafuckas feel\nNiggas hate me 'cause I'm doin' what the fuck they wanna do\nNiggas still be havin' love for you (and I know)\nCheck it!\n\nCompton (he's back to you)\nCome back, come back to me, yeah\nOh...(he's back to you)\nOh... I know, I know\n(He's back to you)\nLalalalala... lalalalala\nCompton, Compton (he's back to you)\nCome back to me\nOh... no no no no...\n(He's back to you)\nOh... Compton... Oh...\n(He's back to you)\nOh... no no no no no...\n(He's back to you)\nOh... Compton come back, come back to me baby\nI... I wanna tell you baby oh... no no no no... lalala... Oh... I...\nOh... Compton... come back to me\n(He's back to you)\n\n", "album": {"title": "Ruthless_For_Life_(1998)&&8564", "genre": "West Coast Hip Hop", "year": 1998}}, {"title": "Mad Scientist", "href": "Mad_Scientist&&5443", "artist": {"unique_name": "MC_Ren"}, "lyrics": "Darkside is were I'm commin' from all alone,\nStrangeling niggaz is fakin' on the microphone,\n'Cause I've bin around and I'm a be around again,\nWho is it? The black nigga that they call Ren,\nWon't be brackin' on a nine dubble M,\nMy still talk kids turn tricks and you sticks 'n' stones,\nSo say wuzz up to my niggaz on the sidewalk,\nBut all my black the jack so I can night stock,\n'Cause carry a big stick for niggaz that never shot\nBeabe gall alwayz talkin' 'bout the trigga, just to get\nPayed and make it all routin, if I crack pop they runnin'\nForm tha scene'. There's to many recordz out that ain't\nSayin' nothin', and fake az radio stations ain't playin'\nNothin', shit gotta get back, it's time to MC, to many\nNew niggaz ain't sure like L.B.\nI wanna be L and only care from the crean.\nAposse like a bitch they get put it in the magazine,\nGet away - French, you ain't right all, you ain't the\nSource. Niggaz wanted to get with me, but your shit was\nHorse. Ploakin' in my cliss the warz for competition.\nIf a crit nigga hang around they get a listen.\nTry to peep in my note book, but lost a leg. Got\nParalised neck up from what you read, a mad scientist...\n\nMenacy control we always diss guarente who they doubt\nA fuckin' mad scientist...\nMenacy control we always diss guarente who they doubt\n\nWeak az niggaz keep I.N.S, but who can come and fade\nThe mad scientist. I've bin away from the public, cause\nI am a enemy. with the black peane disappear like Houdini.\nGod of the univers I control your soul, shaking niggaz up\nFrom the bottom of the north pole. In my double S four\nFifty four with my size ten still towe showe to the floor.\nIt's simple, don't wanna make it complicated, 'cause ya\nSimple minded niggaz might get frustrated, with ya bang-\nBang boogie, 'cause Ren heard enough, 'cause niggaz don't come\nWith the funky stuff, that I used to hear in 83 and 84,\nWhen shit had to be hardcore, ciminal minded,\nYou've bin blinded, I'm lookin' for some shit like that\nBut can't find it, 6'n the mornin', police at my door,\nNiggaz don't make that kinda shit no more, sippin' az\nNiggaz make way, 'cause Ren don't play that shit, I'm screamin'\nMayday, a fuckin' mad scientist...\n\nSneaky, sneaky is how I creap up on ya, I clear my throat\nAnd then I drop bombz on ya, now be onest did ya think\nThe villain releit knew niggaz come out get out the work,\nThat I put in, figure the pin and I write to the hands feels\nOf the writes\nShit down and dirty you were swear these apetaitis. I be creating\nWut ya body longs for and fake az niggaz this is who the song's for,\nA mad scientist, but I won't make a frankers dine, I just write\nA rhyme, now I blow ya fuckin' mind. You can't follow this I did'nt\nLeave a sitch, you can't fool the 5 procent that means tray repesentin'\nI'm wokin' up light and livin' civilized, the messager elaise yo,\nThey opened up my eyez. And the B boyz stand on my throne in black\nNiggaz scared as hell because the villain is back from the sinner\nOf the earth I'd makin' way like a goffer, nigga by my self, I'm\nTakin' over, on a mad scientist...\n\n", "album": {"title": "The_Villain_In_Black_(1996)&&6612", "genre": "West Coast Hip Hop", "year": 1996}}, {"title": "Who Got That Street Shit", "href": "Who_Got_That_Street_Shit&&6854", "artist": {"unique_name": "MC_Ren"}, "lyrics": "Nigga who the fuck got that street shit (Compton niggas)\nNigga who the fuck got that street shit (Park's niggas)\nNigga who the fuck got that street shit (LA niggas)\nMy nigga who the fuck got that street shit (Real niggas)\n\n(MC Ren)\nA motherfuckin fiend, before I became a teen\nThe villain was fuckin' with bitches instead of cones or ice cream\nNiggas be killing the villain like aids with whack rhymes\nThese niggas don't be havin' no lyrics\nAll they talk about is nines and chronic\nThe villain be doing that but I can switch up\nKick some unreleased shit nigga pick your bitch up\nThe villain be killin' you niggas that's running with clicks\nRen be own em'\nNiggas be running with clicks 'cause they can't do it on they own lonesome\nFrom CPT to NYC, I keeps it hot\nBitches be worshiping a nigga with shrines and parking lots.\nTen years of damage motherfucking rap god\nTraded in the Dayton's on the foe with 3 tripods\nThe villain be travelling at the speed of light, 'cause I might\nBe uniden-tah-fied if I come whack, mothefuckers late at night\nNiggas be waking up forgetting the whole thing\nNigga it ain't over till the hoe sing, bitch sing it\n\n(MC Ren)\nAin't shit changed, still making bitches pussy's hot\nHanging with niggas from Compton carryin big glocks\nFucking em' car hops trippin' off some paint and gold D'z\nBitches be happy to hold these\nHanging with rap niggas like Lez and Joe Clair\nNiggas from Compton multiply and seen everywhere\nMaking your spot hot attract the feds and protest\nKidnapping bitches and make the scene grotesque\nReal niggas and bitches niggas hanging out\nCPT dwelling shots reigning out\nSelling coke, hoes taking dicks down they throat\nBitch niggas coming up pissin all you find is a ransom note\nNew release, promotin fucking police\nCrooked motherfuckers hot 'cause I won't give em' a piece\nMC motherfuckin REN back at cha'\nNiggas bit my shit the villain ain't mad at cha'\n\n(MC Ren)\nA nigga sittin' on the curb rats catch whip lash\nSame hoes when I was little, fucking niggas for cash\nNow they baby mommas 'cause they wanted niggas with dope\nStuck with stretch marks and niggas names tattered by they throat\nSome on they tittys, ankles and ass\nEvery neighborhood got these stankin tricks from the past\nThey be at the clubs, pussy's used up\nThey tiitys six feet, there stomachs lookin' bruised up\nReal niggas turn the light out\nNigga till they child's through\nThese hoes today be havin' niggas rob you\nJust to come up, so niggas can fuck em' with cheap weed\nMakin' motherfuckers go and drop a week seed\nThinkin' they max Julie fake ass macks\nAll the hoes shake the spot once they smoke up your chronic sack\nWho's getting played nigga you or the hoe\nThese bitches be fuckin' you and your doe\nNiggas fuck it!\n\n", "album": {"title": "Ruthless_For_Life_(1998)&&8564", "genre": "West Coast Hip Hop", "year": 1998}}, {"title": "Bitch Made Nigga Killa", "href": "Bitch_Made_Nigga_Killa&&4320", "artist": {"unique_name": "MC_Ren"}, "lyrics": "1995 and Compton's still up in this motherfucker\nYeah, this album's dedicated to all you real niggaz\nBut most of all it's dedicated to you bitch ass niggaz\n\nWho is it? The bitch made nigga killa\nI'm swingin' on niggaz ever time I feel 'um\n'Cause niggaz walkin' 'round with they're ass out\nSo I'll be droppin' funky shit till they pass out\nThese bitch made niggaz swingin' on the dick\nBack the fuck up before I have a fit\nI'm peelin' niggaz caps, makin' gang of snaps\nBe true to this shit with hard motherfuckin' raps\n187 bitch slappin' on the track\nMakin' fools break theyself like as if it was a jack\nKeep a big stick just incase I gotta swing\nThe heater is the mack, stashed at the shack\nSo while your rollin', date is in your force mobile\nJust remember motherfuckers the shit caps I peel\nNiggaz just a piece of cheese for a hood rat\nFalsin' for a hooker and I never understood that\n'Cause it's the same old shit everyday and every night\n'Cause nigga Ren won't put it down if the shit ain't tight\nSo listen to the funk as I deal 'um\nTo a bitch made nigga, I'm the bitch made nigga killa\n\nYou know the color the villain's in black\nBitch made niggaz better watch they back\nYou know the color the villain's in black\nBeatin' niggaz ass and it's like that\n\nAnd I'm stalkin', walkin' in my khaki suit\nTryin' to see what niggaz I'm a have to shoot\nThis ain't a bang-bang boogie like the new booty flow\nNew niggaz tryin' to do the shit I did years ago\n'Cause if it ain't rough it ain't E-motherfuckin' nuff\nYou bitch made niggaz, here to call you're bluff\nPull your ho card, like my nigga cab said\nCrack my big stick up against your damn head\nYeah, radio suckas never play me\nBut you can hear bitch made niggaz on daily\nRen gonna have to put his foot down\nMotherfuckers ain't gonna like how it's put down\nSo mic check one, whatever I don't give a damn\nMe be ready to slam, when I hit the jam\nSo yell controversy when I bust a rhyme\nNo more irresitable bitch made niggaz in '99\nBlack reign is coming, niggaz it's bad weather\nWhenever 187 and Ren get together\nAnd listen to the funk as I deal a\nBlow to these bitch made niggaz, I'm the bitch made nigga killa\n\nHypocrite niggaz always runnin' they mouth\n&gt;From the north, to the east, to the west, and south\n'Cause the freaks come out at night\nAnd all bitch made niggaz be comin' 'cause you have no friends\nSo don't come around playin' double-O 7\n'Cause your ass might get caught in a two-eleven\nNiggaz don't call me 'less the video is poppin'\nOnly come around when my new shit's droppin'\nNiggaz ain't nothin' but some hound dogs I betcha\nYou bitch made niggaz didn't know I was the bitch catcher\nI'll choke ya with a grip\nStranglin' motherfuckers not come correct, so don't slip\nReal niggaz don't die, so I'm still alive\nFuckin' up shit in '94 and '95\n'Cause I'm livin' like a hustler\nBusta, heard you was talkin' that shit so ya musta\nThought it wouldn't get back to me\nNiggaz ya shoulda thought a million times before you tried to do me\nBut listen to this funk as I deal a\nBlow to you bitch made niggaz, I'm the bitch made nigga killa\n\nYou know the color, the villain's in black\n\n", "album": {"title": "The_Villain_In_Black_(1996)&&6612", "genre": "West Coast Hip Hop", "year": 1996}}, {"title": "CPT All Day", "href": "CPT_All_Day&&5137", "artist": {"unique_name": "MC_Ren"}, "lyrics": "(MC Ren:)\n\nI fuck so good I make dike bitches straight\nAnd give 'em mo love jones then Lorenz' tape\nNigga outta state been to every nigga hood\nGets treated like Farhekahn, the shit is all good\nNiggaz be on their knees like their ready to suck a dick beggin\nLike niggaz about to beat they ass caught for bootleggin\nThe Villain be havin' keys to black holes in space\nHoes beggin a nigga to lick my nuts for a taste\nDick be so huge, givin' 'em over bites like Monefa,\nBe hard to leave the room when she undress that black moon,\nMy shit explodin more than Timothy McVeigh,\nFuck with me I'll take yo ass off the L like K day\nCompton niggaz fighting more than MGM Grand\nFucking bitches looking like the real Roxanne\nNiggaz know they can't fuck with me,\nIt's CPT all day howz it gone be niggaz?\n\n(T-Girl:)\n\nNiggaz in Compton don't give a mad fuck,\nWhere the fuck you from nigga\nWhat the fuck up?\nCPT nigga that's how it gotta be\nCall my niggaz from the from the Hub if you wanna fuck with me.\nNiggaz in Compton don't give a mad fuck,\nWhere the fuck you from nigga\nWhat the fuck up?\nCPT nigga that's how it gotta be\nCall my niggaz from the from the Hub if you wanna fuck with me.\n\n(MC Ren:)\n\nI don't be givin' a fuck I be making these niggaz/bitches pissy\nComin' at me with that bullshit y'all can miss me, A REAL NIGGA\nYou know y'all niggaz used to wanna be,\nTo hard motherfuckers like me and E [Eazy-E],\nFull of freaky tails like Short, Gotta killa appettite,\nYo bitch chose me 'cause I could fuck her all night\nYou niggaz worse than Deangelo bitin Prince\nOr heavy D biting Biggy, I'll slap yo ass silly\nReal niggaz made Will Smith leave Philly not Jada\nThese bitch niggaz turnin' into Ren hatas\n'Cause I still get paid for writing\nThat street shit that they play that make mothufukkas start fightin\nSo come on, hop on my nuts like everybody did Greenbay,\nStill won't believe it like the screenplay,\nYou wack niggaz tryin' to walk around proud\nYou muthufukkin groupies ain't allowed.\n\n(T-Girl:)\n\nNiggaz in Compton don't give a mad fuck,\nWhere the fuck you from nigga\nWhat the fuck up?\nCPT nigga that's how it gotta be\nCall my niggaz from the from the Hub if you wanna fuck with me.\nNiggaz in Compton don't give a mad fuck,\nWhere the fuck you from nigga\nWhat the fuck up?\nCPT nigga that's how it gotta be\nCall my niggaz from the from the Hub if you wanna fuck with me.\n\n(MC Ren:)\n\nI gives a fuck, you niggaz mad 'cause I made your bitch hot,\nI saw you slap her ass in the parking lot\nCompton niggaz like me be born macks\nAdd it to this fuckin' nigga if you wore black\nGang shit change, Compton still the shit niggaz know\nIn this rap shit Compton Niggaz all pro\nThat street shit, y'all niggaz know who made the best\nCompton niggaz holding down the whole fucking west\nNobody tryin' to see yo ass like that movie Booty Call\nMo suave than MJG and 8ball\nNiggaz mo bitchy than that nigga Genuwine\nThe bitches are free, but stupid niggaz buy the wine\nCompton niggaz be takin' pussy, on GP\nOr they be down to suck yo dick if you MC\nBut if you ain't the viialin hold yo dick in yo hand tell 'em give me\nThe bitches strip tease like Demi.\n\n(T-Girl:)\n\nNiggaz in Compton don't give a mad fuck,\nWhere the fuck you from nigga\nWhat the fuck up?\nCPT nigga that's how it gotta be\nCall my niggaz from the from the Hub if you wanna fuck with me.\nNiggaz in Compton don't give a mad fuck,\nWhere the fuck you from nigga\nWhat the fuck up?\nCPT nigga that's how it gotta be\nCall my niggaz from the from the Hub if you wanna fuck with me.\n\n(MC Ren:)\n\nBitch niggaz that's how it gotta be\n\n(T-Girl:)\n\nPunk bitches that's how it gotte be\n\n(MC Ren:)\n\nBitch niggaz that's how it gotta be\nCall my niggaz from the Hub if you wanna fuck with me.\n\n(T-Girl:)\n\nPunk bitches that's how it gotta be\n\n(MC Ren:)\n\nBitch niggaz that's how it gotta be\n\n(T-Girl:)\n\nPunk bitches that's how it gotta be\nCall my niggaz from the Hub if you wanna fuck with me.\n\n", "album": {"title": "Ruthless_For_Life_(1998)&&8564", "genre": "West Coast Hip Hop", "year": 1998}}, {"title": "Who in the Fuck", "href": "Who_In_The_Fuck&&6458", "artist": {"unique_name": "MC_Ren"}, "lyrics": "(Feat. Eight Ball and Mjg)\n\n(MJG)\nA natural fact:\nThat I pimp tracks and freak around\nThe game got cracks in them pipes,\nIt's leakin' town\nMy lines blow yo' mind,\nYo' senses remain puzzled\nAttacked by the weight of the bass\nIn yo' chest,\nEightball, MJG, MC Ren,\nNevertheless\n'Cause we's the most\nMy real-ass lizards,\nLet's make a toast,\nAnd sing aloud to bustas,\nAnd force 'em to get ghost\nAnd coast to coast\nWe shows loves in Network,\nWhile some try to impress people\nAnd get hurt.\nDeep thoughts cloud my conscience\nAs I curl,\nUp in the corner on hand,\nAnd then I hurl\nCall my girl\nTell her I'm drunk\nAnd can't make it\nI tried to drink the whole damn bar\nAnd couldn't take it\nThat's aiight!\n'Cause come sunrise,\nI'm still rollin'\nMy nuts the only title I'm claimin'\nAnd still holdin'\n\n(Chorus- MC Ren)\nNow who in the fuck\nWanna come and represent?\nYou bitch ass niggaz,\nY'all be too hesitant\nI, take my black ass\nDown to the south\nBitches wanna fuck me\nWhile I'm in the Suave House\n\nNigga, who in the fuck\nWanna come and represent?\nOh, I know you suck that dick,\nActing too hesitant\nWe, MJG, Eightball, Villain,\nMake that straight nigga shit,\nThat's how these niggaz feelin', Uh.\n\n(Eightball)\nGuess wo popped up,\nStraight up out the cuts\nWith lyrical buckshots\nSpillin' all a nigga guts\nTouch whoever witness,\nStrays when I displays,\nA thousand different ways to get paid\nWith a phrase\nDays go by,\nI be hibernatin' gettin' high\nDreamin' 'bout L.A.\nPenetratin' somethin' fly\nDown in H-Town,\nOr somewhere in the Mound,\nAll eyes on me, baby,\n'Cause I get around\nWe be like, connected\nWeak-ass niggaz get ejected\nOoze like slime,\nDig this hines when we wreck shit\nUncut, coast to coast,\nSlangin' audio dope\nManglin' MCs, leavin' 'em,\nDanglin' from ropes\nBoast, tryin' to be doper than most,\nIn my profession\nMe and the villain, microphone killin'\nNo blood spillin'\nPhat raps with much cheddar\nIn the tellers,\nEightball and MJG and MC Ren,\nForeva!\n\n(MC Ren)\nFuck that, bitches, the villain be\nOut in Houston, Tex.,\nTo fuck with them niggaz from Suave\nWho wanna flex.\nBitch niggaz got kidnapped,\nWith dicks in they mouth,\nFo' fuckin' Compton niggaz, and\nNiggaz from down South,\nEightball, MJG, where you at,\nSpace agent?\nY'all prob'ly got all the bitches pagin'\nSuckin' 'casian.\nWritin' left nuts,\nChapstick and lips,\nWhile bitch-ass niggaz spendin' chips,\nJust to see the hips\nSouth-West connection,\nBitches bow tha fuck down\nFuck how them other niggaz sound\nVillain be hated by niggaz because\nThey bitches pussies throb\nReady to slap that ho,\nEvery time a head bob, niggaz be killin' me,\nGot that nigga T-Mixx,\nPull the fuckin' remix\nIf these words don't hurt you,\nNigga, got them stones and sticks,\nAnd some Compton-ass niggaz\nTo make you fade to black\nWith some crazy Houston niggaz\nIn the cut in the back\n\nFade to end\n\n", "album": {"title": "Ruthless_For_Life_(1998)&&8564", "genre": "West Coast Hip Hop", "year": 1998}}, {"title": "Ruthless for Life", "href": "Ruthless_For_Life&&2956", "artist": {"unique_name": "MC_Ren"}, "lyrics": "The saga continues right before your eyes\nThe saga continues cause its do or die\nThe saga continues right before your eyes\nYou know why? (why?)\n'Cause I'm ruthless for life\n\nNigga ten years passed and we still up in that ass\nWill I make it or continue and\nLook at all the shit you in\nEazy does it like happy like the shit we used to do\n5 niggaz comin' out the C-P-T so fuck you\nTime changed for the good\nNiggaz in the hood be comin' up feel it\nCan you set it off, for again, you know you should\nYo let's that this shit back\nTo 1989\nWhere this nigga shoot and bust and niggaz know they couldn't find\nDream Team lovers\nEgyptian fan base\nFeelin' on the scene, all the fools got erased\nThrew a mothafuckin' monkey wrench up in the rap game\nSince I hooked up with E, shit ain't ever been the same\nOpened up doors for the niggaz that be thinkin'\nThat your flows be on tizight\nBitin' what I wrizite\nJokin' when I recite\nFeelin' manuscripts\nWhen I MC, if it ain't rough it ain't me\n\nYo mothafuckin' G'z, nigga like Eric Wright\nYou can floss for your bitch, but you know this shit is tight\n'Cause when y'all niggaz started rappin', who'd you try and be?\nI'ma slap you cause you lying, if you don't be sayin' me\nOr the other 3, that the FBI be phone tappin'\nShoot the government before you niggaz started rappin'\nNow its ? city, I gotta bomb it like Iraq\nUse my alias, spend my nights at the shack\nRuthless attack all the way to two thou\nTry to block it out, but you never knew how\nAnd when I walk through the crowd\nI'm seeing mothafucka's bread\nI hear their bitches sayin' ask MC Ren\nMakin' fools sway when I roll to King Tet's\nBecause I started cussin' all you fools gettin' checks\nRuthless for life, see that be my state of mind\nY'all can kiss my black ass one more time\n\nI run a hundred miles just so I can MC\nVillian want that bomb so I get with L.T.\nAin't nothin' changed\nWe find 'em, fuck 'em, then flee\nWhile you hatin', pillow talkin', with that bitch, she want me\nNiggaz weed crazy, Dre and Snoop turned you out\nNow y'all cristal sippin', y'all niggaz be trippin'\nMake the West look like ass, all full of shit\nInvest in drug money, shit, still gettin' in\nWhat it take for y'all quit\nRuthless got it on lock\nY'all shootin' videos tryin' to look like Pac\nHere we come, here we come, blowin' up your spot\nMy little brother Jubee and the big homie Rock\nFull circle, all this shit gon' repeat\nWhen this shit drop, niggaz clownin' in the streets\nThe saga continues right before your eyes\nWho really gives a fuck?\nCause this is ruthless for life\n\nChorus till end\n\n", "album": {"title": "Ruthless_For_Life_(1998)&&8564", "genre": "West Coast Hip Hop", "year": 1998}}]