[{"title": "Prick Faced Bastard", "href": "Prick_Faced_Bastard&&199", "artist": {"unique_name": "MDC"}, "lyrics": "There's a guy at my work Really hard to know\nGotta' put up with him Just to make your dough\nHe can only feel big When he puts you down\nHe thinks he's somebody In this nobody town\n\nHe's the king of chumpsville Really nothing special\nDoesn't care if he's hated Wants you to get intimidated\nYells at you and me Says to go faster\nWhen I know he is just A pricked faced bastard\n\nLikes to tell me I'm so weird\nAs he says it I can smell his fear\nAlways tries to say things To put me down\nI keep right on smiling While he keeps his frown\n\nHe's the king of chumpsville Really nothing special\nDoesn't care if he's hated Wants you to get intimidated\nYells at me Says to go faster\nWhen I know he is just A pricked faced bastard\n\nIt really seems I've known him all my years\nHe likes to think He's well geared\nHe's just a foreman Works hard for the master\nWe all know He's just a prick faced bastard\n\nAnother day on the job I see him and I smile\nJust passing through He'll be gone in a while\nSaying bye soon I'll walk right past you\nKnow you for what you are A lame ass prick faced bastard\n\nHe's a user and a liar An abuser for hire\nNothing but a bully People will get tired\nHe'll fade and be dated Too long overrated\nWe all know He's just a prick faced bastard\n\nHe's the king of chumpsville Really nothing special\nDoesn't care if he's hated Wants you to get intimidated\nYells at me Says to go faster\nWhen I know he is just A pricked faced bastard\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Timmy Yo", "href": "Timmy_Yo&&2156", "artist": {"unique_name": "MDC"}, "lyrics": "This is a song for one of the godfather's of punk\nAll the rock star bullshit he wasn't afraid to debunk\nLabeled himself a musical commie\nWhen in fact he was everyone's mommy\n\nGave the kids a good place to go\nAnd the unheard of bands somewhere to show\nNow he is dead for over five years\nWhere are all the tributes for all your careers\n\nNOFX for years made their way\nLaughing at what the political punks had to say\nTaking the piss out of everyone's anger and passion\nWhile being a shill for the warped sneaker tour fashion\n\nEpitaph, you make us cry and laugh\nAs you kick back and rake in the cash\nYou're the chief magnate of the music money machine\nYeah and you could say you fucked up the scene\n\nRaking in fucking millions in dough\nWhat does the scene have to show?\nShrewd business men, you made your big score\nFor the bands charging thirty dollars at the door\n\nWell you fat cats slap yourselves on the back\nYour greed and piggishness are documented facts\nYou all think you're special and swell\nReal punks everywhere hope you burn in hell\n\nSo this song is for you Timmy you were true blue\nYou could see where it was going, you already new\nBad Religion hanging out with Britney Spears\nPink and Rancid helping each others careers\n\nSell yourself out for better distribution\nIt's an old line, a shitty solution\nNow you're part of the music conglomeration\nSelling your punk attitudes to the whole nation\n\nSo I am sorry if it all doesn't mean shit to me\nThis music was supposed to set us free\nNot to buy houses up in the Hollywood Hills\nAll you beautiful so talented people give me the chills\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Nazis Shouldn't Drive", "href": "Nazis_Shouldn%27t_Drive&&2971", "artist": {"unique_name": "MDC"}, "lyrics": "They shouldn't be driving day or night\nThey can't think left, they can only think right\nThe sun reflects off their bald head\nLike Ian Stuart they're going to wind up dead\nNazis... shouldn't drive (their cars)\n\nThey should've paid attention in driver's ed\nInstead of hating foreigners, queers and reds\nKeep your eyes on the highway you loser thug\nNow you're squished on the highway like a bug\n\nIan, Ian, King of the Pit, no friend to you or me\nAh! Watch out for that tree!\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Long Time Gone", "href": "Long_Time_Gone&&9826", "artist": {"unique_name": "MDC"}, "lyrics": "I remember a funny man who used to make us laugh\nBut the proof of his truth--they cut his life in half\nA caustic wit that cut a bit--opinions were too strong\nHe must have rubbed somebody wrong\n'Cause he's long time gone\n\nI remember a crucial man--played strat' with his left hand\nTunes he chose of \"Gold and Roe\" and \"Castles Made of Sand\"\nSocial ills--hi conscience willed a different type of song\nSang about \"lead\"--click, BANG! He's dead--he's long time gone\n\nI remember an ebony prince who taught his brothers pride\nSaid the black man's loss--just another cross on which another prophet has died\nSome people wanted them leaderless--a race of hungry pawns\nTheir solution to his revolution: To make him long time gone\n\nThough some will object when you suspect\nThat they cause to affect the cause and effect\nWhen you reflect on lives that were checked\nStill in retrospect the truth was neglected\nThough some will protect the order they pecked\nFor failing to suspect the cleansing effect\nTill you they reject with a Haitian insect\nWith AIDS they infect by a bite on the neck\nLike the Nazi correct--kill and dissect\n\"The inferior Sect\", their race to protect\n\nI remember a gentleman who took his cause o far\nSaid not to be afraid but to parade and be just what you are\nDefied the name of guilt and shame, he proved his skeptics wrong\nMust have said something wrong, 'cause now he's long time gone\n\n(For Lenny Bruce, Jimi Henrix, Malcolm X, Harvey Milk and all.)\n\n", "album": {"title": "Shades_Of_Brown_(1993)&&5717", "genre": "", "year": 1993}}, {"title": "Prime Evil", "href": "Prime_Evil&&4557", "artist": {"unique_name": "MDC"}, "lyrics": "Born to believe... you are better\nTreat everyone like they are nothing but debtors\nYou are the one... the truly forsaken\nYou in your role as the head undertaker\n\nPrime Evil, Prime Evil, you are the one\nYou are the heaven and earth, you are the sun\nYou are the man who gets to hold the gun \nWhere will you hide when all this is done?\n\nThe more you prepare your torturous ways to hone your skill\nPress a human being, bend them to your will\nYou become what you think you're fighting against in the end\nHow will you make your peace and make your amends?\n\nUsing the electricity, smell the burning stench\nIn your designed special torturer's trench\nTry to change your clothes but you can't remove the smell\nEven your dreams will not release you from your hell\n\nPrime Evil, Prime Evil, you are the one\nYou are the heaven and earth, you are the sun\nYou are the man who gets to hold the gun \nWho will cry for you when all this is done?\n\nAre you still human? How is your sanity?\nNeed absolution, beg forgiveness from all humanity\n\nPrime Evil, Prime Evil, you are the one\nYou are the heaven and earth, you are the sun\nYou are the man who gets to hold the gun \nWho will cry for you when all this is done?\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Ballad Of G.W.", "href": "Ballad_Of_G.W.&&2347", "artist": {"unique_name": "MDC"}, "lyrics": "Come and listen to my story 'bout a boy named Bush.\nHis IQ was zero and his head was up his tush.\nHe drank like a fish while he drove a car about.\nBut that didn't matter 'cause his daddy bailed him out.\nDUI, that is. Criminal record. Cover-up.\n\nWell, the first thing you know little Georgie goes to Yale.\nHe can't spell his name but they never let him fail.\nHe spends all his time hangin' out with student folk.\nAnd that's when he learns how to snort a line of coke.\nBlow, that is. White gold. Nose candy.\n\nThe next thing you know there's a war in Vietnam.\nKin folks say, \"George, stay at home with Mom.\"\nLet the common people get maimed and scarred.\nWe'll buy you up a spot in the Texas National Guard.\nCush, that is. Country clubs. Nose candy.\n\nTwenty years later George gets a little bored.\nHe trades in the booze, says that Jesus is his Lord.\nHe said, \"Now the White House is the place I wanna' be.\n\" So he called his daddy's friends and they called the GOP.\nGun owners, that is. Falwell. Jesse Helms.\n\nCome November 7, the election ran late.\nKin folks said \"Jeb, give the boy your state!\"\n\"Don't let those colored folks get anywhere near polls.\"\nSo they put up barricades so they couldn't punch their holes.\nChads, that is. Duval County. Miami-Dade.\n\nBefore the votes were counted all the five Supremes stepped in.\nTold all the voters \"Hey, we want our George to win.\"\n\"Stop counting votes!\" was their solemn invocation.\nAnd that's how little Georgie finally got his coronation.\n\nRigged, that is. Illegitimate. No moral authority. Y'all come vote now. Ya hear?\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Destroying The Planet", "href": "Destroying_The_Planet&&5476", "artist": {"unique_name": "MDC"}, "lyrics": "Born so ahead in life it's all a game\nThere you rule so smug - with no shame\nPlan your life in the upper class\nYou're such a fucking selfish ass\n\nDaddy sets you up with all his cash\nTime to sober up from having a blast\nA DWI could ruin your career\nOr kill someone next to you who you hold dear\n\nWell you found God, you're such a holy creep\nIn church with all your buddies for the cameras you weep\nOn your knees, with the good book... you'll keep\nSmile to cover up just how much you want to sleep\n\nLife is a party as you sail through Yale\nAll your frat boy antics, still no jail\nHow many arrests on your rap sheet were erased?\nAs the courts always seem to lose your case\n\nAnd that year and a half in the National Guard\nWhere no one remembers you being in the yard\nA chicken hawk holy warrior for Christ\nWatch the war on TV and all the people getting diced\n\nCompassionate conservative you're full of shit\nWith the country clubbers you're such a hit\nFor tax cuts for the rich you will lie\nAs you plan for Social Security to die\n\nHow many lives were destroyed today?\nAnd no one can get married... if they're gay\nCarpet-bomb the world, collateral damage you say\nAnd just remind the Africans with AIDS to pray\n\nDestroying the planet while making the rich richer\nAnd still manage to make it to bed by nine\nGo for a jog and choke on a pretzel\nYou and your cronies are nothing but swine\n\nFuck you &amp; God Bless America\nFuck you &amp; God Bless America\nFuck you &amp; God Bless America\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Thanks For Giving Me What I Didn't Want", "href": "Thanks_For_Giving_Me_What_I_Didn%27t_Want&&6988", "artist": {"unique_name": "MDC"}, "lyrics": "Every November we're told to remember\nHow Indians and Pilgrims ate turkeys and pumpkins\nAnd thanked God for giving their new way or living\nSo every year that's what we do!\n\nIn October we're told how brave and how bold Christopher Columbus\nWho discovered and gave us new world to live in\nAnd thanks should be given\nSo every year that's what we do!\n\nThanks for giving me what I didn't want\n\nOn November eleven we tank all the veterans\nFor brace men who tried to win wars and died\nWithout them our country would be run by the Commies\nSo every year that's what we do!\n\nIn giving all his gratitude\nI hope you will not think me rude\nBut I really didn't ask for this\nAnd Chris Columbus isn't missed\nAnd Indians still try to resist\nAnd I am more of a pacifist\nSo war is quite low on my list\nAnd I rebel with a raised fist\nAnd I insist I'm getting pissed!\n\n", "album": {"title": "Shades_Of_Brown_(1993)&&5717", "genre": "", "year": 1993}}, {"title": "Spanish Castle Magic", "href": "Spanish_Castle_Magic&&4375", "artist": {"unique_name": "MDC"}, "lyrics": "It's very far away,\nIt takes about half a day,\nTo get there, if we travel by my a... dragonfly\n\nNo, it's not in Spain,\nBut all the same,\nYou know,\nIt's a groovy name\nAnd the wind's just right.\n\nHang on, My Darling,\nHang on if you want to go\nYou know it's a really groovy place\nAnd it's just a little bit of Spanish Castle Magic.\n\nThe clouds are really low,\nAnd they overflow,\nWith cotton candy\nAnd battle grounds,\nRed and brown.\n\nBut it's all in your mind,\nDon't think your time,\nOn bad things,\nJust float your little mind around.\nLook out\nHang on, My Darling, Yeah\nHang on if you want to go\nIt puts everything else on the shelf\nWith just a little bit of Spanish Castle Magic\nJust a little bit of daydream here and there.\n\nHang on, My Darling, Yeah\nHang on if you want to go\nIt puts everything else on the shelf\nWith just a little bit of Spanish Castle Magic\nJust a little bit of daydream here and there\n\n", "album": {"title": "More_Dead_Cops_(1988)&&7456", "genre": "Hardcore Punk", "year": 1988}}, {"title": "Let's Kill All The Cops", "href": "Let%27s_Kill_All_The_Cops&&8835", "artist": {"unique_name": "MDC"}, "lyrics": "Let's kill all the cops and throw 'em in bags\nSet it on fire on a pile of rags\nTime for a little anarchy on the streets\nDoesn't really matter if we all get beat\n'Cause the world is really going to hell in a handbasket\nThey won't be happy 'til we are all laying in caskets\nTime to start a riot and murder your boss\nFuck shit up even if the cause is lost\n\nSo let's kill all the cops, kill all the cops, kill all the cops today\n\nLet's kill all the cops it has a certain ring\nThey are not really real human beings\nThey got a job a uniform and a gun\nOf course they are stupid and devoid of fun\nSo it's time to party and go for it\nCelebrate all we can as it all turns to shit\nGive them the middle finger and tell them they smell\nLaugh in their face and tell them to go to hell\n\nSo let's kill all the cops, kill all the cops, kill all the cops today\n\nSo let's kill all the cops if not now then when?\n'Cause we can go to church and confess our sins\nThen tell the Pope to shove it up his ass\nJust like the priests who do it to the boys in class\nAnd those stupid nuns just stare in quiet\nBurn all the churches and let them watch us riot\nTime to turn it all upside down\nFrom coast to coast and in our home town\n\nSo let's kill all the cops, kill all the cops, kill all the cops today\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Radioactive Chocolate", "href": "Radioactive_Chocolate&&459", "artist": {"unique_name": "MDC"}, "lyrics": "Hershey, PA three miles near\nEmpty assurance, nothing to fear\nThe nuke is down\nPoisoned the ground\nHush it quick\nThe cows are sick\nAnd there's nothing like the face of a kid\nEating a radioactive chocolate bar\nForever and ever\nRadioactive chocolate forever and ever\n\nPoisonous fish, poisonous rivers\nCancerous kidneys, stomachs and livers\nThey don't give a fuck\nJust wanna make a buck\nRadioactive chocolate forever and ever\n\nBuy American, buy Hershey\nThey'll sell you death\nWith no mercy\nThey're gonna gain their wealth\nAnd risk your health\nRadioactive chocolate forever and ever\n\n", "album": {"title": "More_Dead_Cops_(1988)&&7456", "genre": "Hardcore Punk", "year": 1988}}, {"title": "Walking On Thin Ice", "href": "Walking_On_Thin_Ice&&2797", "artist": {"unique_name": "MDC"}, "lyrics": "The times they are changing but it's really the same old thing\nNow all the species are fading fast and it's the blue bird's last chance to sing\nAnd that we don't have to surrender, let those scumbags and let them have their way\nAnd it's really worse than that but we have already had a terrible day\n\nDid you hear about the polar bears are in trouble they're out walking on thin ice?\nNo more blue whales I guess that's really not too nice\n\nAnd remember that cute girl she came to town and became a junkie so quick?\nShe hangs out at a clinic and she's always looking sick\nShe had big dreams once but they all sort of melted away\nNow she's just hanging around trying to make it day to day\n\nHey and the rainforests are all gone, I guess that's kinda' sad\nWeather keeps changing, that's not good, it's rather bad\n\nBlack horned rhinos seem like old long lost friends\nSilver back gorillas are right near their end\nIllnesses that could have been cured by plants are now all long gone\nStill the darkest hour is the one before the dawn\n\nAnd we're all working hard, right above minimum wage\nWaiting for fifteen minutes and a friendly stage\n\nMr. President looks serious, I guess we need some more wars\nThe FOX news lady says we got old issues to score\nMomma's watching TV and praying there's no knock on the door\nA patriot for his country, warnings that he chose to ignore\n\nSmug politicians and movie stars all pose so tragically hip\nRearranging furniture on this sinking ship\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Selfish Shit", "href": "Selfish_Shit&&4037", "artist": {"unique_name": "MDC"}, "lyrics": "I don't wanna see\nI don't wanna know\nI don't wanna change\nI'm narrow, quick to change\nQuick to condemn\nQuick to lose my temper\nI've learned the tactics to control your behavior\n\nI don't wanna know\nThe truth means self-denial\nMy selfishness is hatred\nMy hatred is greed\nThe world owes me\nSee me in my selfish womb?\n\nI'll get what I want\nOr else I'll throw a fit\nDon't care who I take it from\n'Cause I'm the selfish shit\n\nLike a spoiled brat\nGreedy fat rat\nHaven't grown since birth\nA stillborn to death\n\nI manipulate the fools\nUsing people as my tools\nBuilt my defense and disguise\nBy mixing up the truth with lies\nI suck the life out of you\nI suck the truth out of life\n\nPeople are just toys in my game\n\nI'm the master\nYou're the whore\nI keep mine\nGive me yours\nBetray your trust\nLeave you poor\nIn a pit\nRich successful selfish shit\nCold and callous selfish shit\nDenying it\nSelfish shit\nEvery bit\nThe selfish shit\n\nSocialism for the rich\nCapitalism for the rest of you\nI train you, then drain you\nThen complain about you\nPleasing myself means everything\nWhile it's misery to everyone else\n\nMoney is power\nPower is death\nDeath is my life\nMy personal gratification\nMy justification\nFor the world situation\nMy self love\nHas become my outward hate\nThe world unconscious\nThe alter-ego\nThe selfish shit\nEvery bit\nThe selfish shit\n\nThe submission I employ\nThe pain I cause\nThe living hell I create\n\n", "album": {"title": "More_Dead_Cops_(1988)&&7456", "genre": "Hardcore Punk", "year": 1988}}, {"title": "Founding Fathers", "href": "Founding_Fathers&&4947", "artist": {"unique_name": "MDC"}, "lyrics": "Are the founding fathers terrorists or freedom fighters?\nAnd Paul Revere the famous night rider\nAnd Andrew Jackson the Indian killer\nA movie of his life could be a nightmare thriller\n\nHand out blankets with disease\nOur God is so much better we believe\nGenocidal times, get on your knees\nWe are the good guys or so we perceive\n\nSo back then they rebelled against the king\nThe U.S. in Iraq is really the same thing\nAll the radio hate disc jockey's rage\nScreaming we should blast them back to the Stone Age\n\nJust like John Wayne running up the hill\nSee how many Vietnamese he could kill\nDestroy the village to save it is part of the plan\nJust as letting African's die of AIDS is to steal their land\n\n\"Mommy, was George Washington a terrorist?\"\n\"No honey, he was a great man, the first president and an important slave owner.\"\n\"Mommy what are doing in Iraq?\" \"Honey we are gonna' teach these people how to be free.\"\nWe prop up the Saudi's corrupt regime\nDenied people's rights and justice so it seems\nAll done for convenience and all that black gold\nSend our boys off to protect our freedoms or so they're told\n\n\"Didn't they lynch black folks in the South\nAnd set them on fire and hang them from trees just like they did those men in Iraq?\"\n\"Oh honey, that was so long ago. We don't think about things like that.\"\n\nAll this hypocrisy makes us sick as hell\nOur murderous government think they're so swell\nCapture people deny them their rights\nAbuse them from Guantanamo to the Golan Heights\n\nAre the founding fathers terrorists or freedom fighters?\nTake land from the Indians in trade for a little cider\nRemember the only good Indian is one that is dead\nHow would it feel for it to be us instead?\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "No Place To Piss", "href": "No_Place_To_Piss&&8828", "artist": {"unique_name": "MDC"}, "lyrics": "Cold and filthy and out of hope\nYou'll find me at the end of my rope\nHuman garbage, more trash in the streets\nWave a white flag in total defeat\n\nYour food looks good through the window\nSee that cash out on the table\nBut the cops say begging's out of line\nBeing hungry is my latest crime\nCan't believe it's come to this\nNo way out, no place to piss\n\nNo honor, no mercy, but no shame\nI'm losing at a cheater's game\nI'm your product, you legacy\nAs long as there's rich men,\nThere'll be men like me\n\nNow I lay me down to sleep\nIn this cold hole my soul to keep\nIf I should die before I wake\nRemember me for my brother's sake\nHard to believe it's come to this\nNo way out, no place to piss\n\n", "album": {"title": "More_Dead_Cops_(1988)&&7456", "genre": "Hardcore Punk", "year": 1988}}, {"title": "Chicken Squawk", "href": "Chicken_Squawk&&5040", "artist": {"unique_name": "MDC"}, "lyrics": "When I walk into the store\nThey sell the chickens by the score\nBut eating dead birds just ain't for me\n\nI don't eat roast beef or fish\nPorky Pig is not my dish\nJust go ahead and let your chickens be\n\nIn chicken circles it's Adolph Perdue\nWants to feed featherless chicken to you\nI don't take orders from Colonel Sanders\nDo you?\n\nI don't wanna eat no hens\nNot even every now or then\nWanna let all the chickens be\n\nBawk, bawk, bawk...\nSwing to the east and swing to the west\nSwing with the chickens you love best\nCome on down and do the chicken squawk with me\n\nWishing Daffy lots of luck\nCause Elmer Fudd's a hunting duck\nThey're dreaming about their little fricassee\n\nAnd Bugs Bunny is a friend of mine\nEating him I'd feel like Frankenstein\nEating flesh seems pretty foul to me\n\nSo on Thanksgiving or Christmas Eve\nGive them turkeys a reprieve\nAin't no turkey got to die for me\n\nFoghorn, Leghorn wrote to me\nSay's MDC's all right by me\n'Cause we all learned to let our chickens free\n\nLordy Jesus this must be the end\nThey got us eating our cartoon friends\nEmancipate those little chickadees\n\nSwing to the east and swing to the west\nSwing to the chicken you love best\nCome and do the chicken squawk with me\n\n", "album": {"title": "More_Dead_Cops_(1988)&&7456", "genre": "Hardcore Punk", "year": 1988}}, {"title": "Sick Of It", "href": "Sick_Of_It&&9616", "artist": {"unique_name": "MDC"}, "lyrics": "Man oh man that's right I'm sick of it\nSick of everybody and sick of their shit\n\nSick of my TV set telling me what to do\nPretty empty faces all smiling right at you\nSick of Blink 182 and their goofy hijinx \nSick of their poppy music that really stinks\nI'm sick of all the rappers and all their bling bling\nHyped out fake anger they rhyme and sing\nSick of Classic Rock that's as old as dirt\nAnd old rock stars that look really burnt\n\nSick of George Bush that republican fat ass\nAlways talking war and tax cuts for the upper class\nSick of Bill O'Reilly and his spin free zone\nAll right wing propaganda laced in self-righteous tones\nSick of all the yuppies in their SUV's\nHow their selfishness affects you and me\nSick of how this country is turning out \nGreediness and self interest is what it's all about\n\nSick of George Clooney and the Hollywood jet set\nNicole Kidman so fucking good looking she never breaks a sweat\nSick of all the poseurs trying to make a scene\nSick of all us punk rock rockers, practicing looking mean\n\nSick of all you rednecks and your ugly stares\nTell you that you better beware\nYeah that's right, fucking sick of it\nIt's all truly, such a bunch a shit\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Born To Die", "href": "Born_To_Die&&6515", "artist": {"unique_name": "MDC"}, "lyrics": "I'm born to die\nI'm born to fry\nMy life in a cage\nShow my outrage\nI'm misunderstood\nI did what I could\nI made my try\nI was born to die\n\nGoin' home\nMy mind is blown\nI spilled my race\nI found my case\nI'm shot down on a fence\nI'm dead in self defense\nI live in a world of hate\nWith no regret a Nazi state\nA racist dream, a world of hate\nWith no regret a Nazi state\n\nNo war\nNo KKK\nNo fascist U.S.A.\n\n", "album": {"title": "More_Dead_Cops_(1988)&&7456", "genre": "Hardcore Punk", "year": 1988}}, {"title": "Time Out", "href": "Time_Out&&5789", "artist": {"unique_name": "MDC"}, "lyrics": "Time out clock now running\n\nHuman lemmings crowded hoard\nEver faster to the shore\nEver closing zero ground\nOfficial timer clock is wound\n\nTime out clock's still running\n\nFault line nukes fucking swell\nTerrorist ready to blow us to hell\nMachines hurry Ice Age\nRichter's gage raging sage\n\nTime out end of quarter\nTime out time in\nResume the slaughter\n\nGreat Barrier funeral wreath\nDead algae no air to breathe\nRuthless beyond belief\nSanity screams stop thief\n\nTime out end of quarter\n\nDrill and suck the ocean floor\nPump our mother like a whore\nEarth once claimed by insects black\nI fear in time they'll take it back\n\n(Oh brother good night what a sight)\nHold tight frost bite\n\nNice what a sight\nSlice of the ice\nChrist Jesus Christ\nDice sacrifice\nBands half time show\nSeconds left to go\nWe won we're still dead\nThe game but not the spread\n\nTime out clocks winding\nLight's out!\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Life, But How To Live It", "href": "Life,_But_How_To_Live_It&&1684", "artist": {"unique_name": "MDC"}, "lyrics": "Life But How To Live It -\nLife can get bumpy so get ready for a ride\nThink you got a plan but let me confide\nGot a few friends? You're luckier than most\nOn this map of life it's easy to get lost\n\nMake a wrong turn and it could cost you a lot\nBut let's hope you get more than one shot\nBut you got to try and get off your ass\nSometimes when you fall down it just means you've got some class\n\nThere are no promises anyone can keep\nNo one will cry for you, maybe your momma' will weep\nBe who you are let the players play their game\nBeing real is its own reward and it could keep you sane\n\nYou might just get to win some And there are so many more you lose\nAt least when you earn something You know you paid your dues\nAnd if something comes too easy You'll lose it just the same\nRemind yourself there is no sense Trying to lay the blame\n\nSo just remember you can run but you can't ever hide\nChoose your choices well they are yours to decide\nBe who you are and as they say, keep it real\nThere's nothing very long that you can conceal\n\nLife seems long but it goes by really quick\nBe a gentle person and don't be a lousy prick\nBe grateful and treat others the way you want to be treated\nDon't be sour grapes 'cause every now and then we all get cheated\n\nLife's a vibrating string, an illusion at best\nTry to get it better each time and forget the rest\nThere will always be pain - but it will pass\nTry to enjoy it 'cause it goes by so fast \n\nMake a wrong turn and it could cost you a lot\nBut let's hope you get more than one shot\nBut you've got to try and get off your ass\nSometimes when you fall down it just means you got some class\n\nLife's a vibrating string, an illusion at best\nTry to get it better each time and forget the rest\nThere will always be pain - but it will pass\nTry to enjoy it 'cause it goes by so fast\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Kleptomaniac", "href": "Kleptomaniac&&259", "artist": {"unique_name": "MDC"}, "lyrics": "Started out of necessity\nWe were so broke and so hungry\nIn this world of food for cash\nGot no choice its stuff and dash\n\nNow we got that dread disease\nBulging pockets full of cheese\nThe narcs are at the electric door\nI drop the goods right on the floor\n\nI'm a kleptomaniac\nWe're all kleptomaniacs\nNever ever give it back\nHey asshole what you looking at\n(Steal or starve is where it's at)\n\nFranco's got a special coat\nStole enough juice to fill a moat\nAl's ripping off some smokes\nReshelving those half empty cokes\n\nCruise the aisles and pocket goods\nThey'd jail us if they only could\nGet the cashier's dirty looks\nShe knows we're all a bunch of crooks\n\nYour inventory's short at Hughes\nCala Foods is paying dues\nSafeway's filing Chapter Eleven\nI pray we don't gotta rip off heaven\n\nWe ain't telling you what to do\nJust saying what we been through\nDon't come crying to us for bail\nWhen they drag your ass on down to jail\n\n", "album": {"title": "More_Dead_Cops_(1988)&&7456", "genre": "Hardcore Punk", "year": 1988}}, {"title": "Multi-Death Corporation", "href": "Multi-Death_Corporation&&6644", "artist": {"unique_name": "MDC"}, "lyrics": "We're the Multi-Death Corporation\nOpportune on any situation\nOur only concern: capitalization\nAnd world economic: domination\nProfits are made from global starvation\nRussian roulette for the world population\nWe need terror and repression\nFor third world exploitation\nGenerals plot extermination\nBank on death and devastation\nSick control, manipulation\nFrom the Multi-Death Corporation\n\nPromises of free expression\nCIA assassination\nState Department: no explanation\nBought and sold legislation\nTV \"news\" half information\nAmerica prays in isolation\nSick control and manipulation\nFrom the Multi-Death Corporation\n\n", "album": {"title": "More_Dead_Cops_(1988)&&7456", "genre": "Hardcore Punk", "year": 1988}}, {"title": "Shades Of Brown", "href": "Shades_Of_Brown&&8974", "artist": {"unique_name": "MDC"}, "lyrics": "They say the darkest hour is just before the dawn\nIn chess, without exception, white moves the first pawn\nThey called it \"Black Tuesday\" when the stock market crashed\nA fix in 1919 turned the White Sox to Black\nBlack balled, black magic, executioner's hood\nWhite hatted, white horsed, champion of good\nBlack knight of Dark Ages on the darkest night\nThe Pope walks in truth, head to toe in white\n\nWho started all this bullshit - were they looking for a fight?\nYou didn't have to be there to know that they were white\nBut when you're talking skin tone, let's not fuck around\nCause no one's really black or white, we're all just shades of brown\n\nBlack hearted, black beard on the briney deep\nOr the family outcast you call the black sheep\nDays of black plague - draw your final breath\nHeading for heaven white dying of Black Death\n\nMankind is preoccupied to keep each other down\nSome use superstition, a Bible or a crown\nAt best it's fear and ignorance, at worst, it's a sin\nNot God and country, king or crown, it's the pigment of our skin\nUsed to reinforce what's wrong or right\nIt's really just the presence or absence of light\nIn the blackest hour of the blackest day\nIt isn't mighty white of us, but we gotta say\n\nWhite when your marry, black when you die\nA racial hierarchy, a festering white lie\nWhite stands for ignorance, pure and sincere\nBut if you're talking bigotry it should be crystal clear\nThe new world becond, the immigrants came\nHomogenized their culture, anglicized their names\nThen they painted Jesus, blonde with eyes of blue\nNot a Nazarene, more a nazi than a Jew\nIn the black revolution with their Black Power found\nTill their leaders were all jailed or stomped into the ground\nAnd the final step ironic - to nail that coffin tight\nThe powder of enslavement in their glassine bags of white\n\n(Repeat chorus until this white male power structure falls)\n\n", "album": {"title": "Shades_Of_Brown_(1993)&&5717", "genre": "", "year": 1993}}, {"title": "No More Cops", "href": "No_More_Cops&&4211", "artist": {"unique_name": "MDC"}, "lyrics": "I dreamed last night No more cops\nIt felt alright No more cops\nNo need to fight No more cops\n\n'Cause no one needs to steal\nEveryone gets a meal\nIf it was only real\nWe'd need no more cops\n\nI dreamed last night no police\nAn army-less world doomed to peace\nAnd now as all my dreaming stops\nI see it clear, we need no more cops\n\nNo need to fear\nI'd want to cheer\nAnd I wish you were here\nBefore my slumber stops\n\nIt seems to me\nThat if we're really free\nWe need no more cops\n\nNo Holy War No more God\nNo more rent No more deeds\nNo more money No more greed\nNo more hate No more fear\n\nNo one unhappy No one sad\nNo one ripped off No one mad\nBut I awake Here instead\nI wish I had Stayed in bed\n\nI'd stay asleep in the deep\nAnd in my thoughts I'd keep\nNo more cops\n\nWhen life gets mean\nShare in the dream\nUntil you scream - no more cops\nI dreamed late last night\n\nNo more cops\nNo more cops\nNo more cops\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Pay To Come Along", "href": "Pay_To_Come_Along&&5465", "artist": {"unique_name": "MDC"}, "lyrics": "We don't need your Jah's fascist doctrine\nWe don't need to be so uptight\nHide your eyes from the truth\nNot to be free but to be right\n\nNew World Order of old world lies\nJesus dons a new disguise\nWhen people gave you homes and love\nYou gave back hate from high above\n\nCouldn't help us fight the fight\nGet together black and white\nReturned all support with abuse\nAnd intolerance beyond excuse\n\nBlack hardcore, hot and mad\nSuch good lyrics, it's so sad\nCould have taken up a stand\nBeen the most important band\n\nLooking out for number one holiest of guests\nSmoking crucial herb while ignoring all their debts\nThey have shown for all to see, being musically blessed\nMakes you no better than anyone else\nFrail and human like all the rest\n\nOh well, we tell you what it cost\nWe'll never know what was lost\n\nYour selfishness has been a burn\nA lesson bitter we had to learn\n\nWe don't need no Jah jive security\nWe don't need to be so uptight\nSee you hide your eyes from the truth\nNot to be free, but to be right\n\n", "album": {"title": "More_Dead_Cops_(1988)&&7456", "genre": "Hardcore Punk", "year": 1988}}, {"title": "Girls Like You Make Me Queer", "href": "Girls_Like_You_Make_Me_Queer&&9121", "artist": {"unique_name": "MDC"}, "lyrics": "From the beginning it was like that\nYou were so special the Maltese cat\nYou weren't being trendy or trying to be cool\nYou just could never... be anyone's fool\n\nPeople could tell by the way you strut your stuff\nSo flamboyant and so so buff\nWe could always never get enough\nNo one could touch you or ever call your bluff\n\nYou were the king and queen of Texas hardcore\nSo many universes for you to explore\nYou always said to \"kill from the heart\"\nKnew where you were going from the start\n\nYou warned about people talking behind one's back\nAnd about people and graces that they lacked\nFiguring it out... you always had a knack\nYour friends that loved you, you always cut some slack\n\nSo show your fine fine face\nNo one can take your place\nYou are so refined\nYou are one of a kind\n\nYeah that's right and no one is better\nNo one gets us happier or any wetter\nYou fit so fine like a favorite sweater\nNever let them hang their Scarlet Letter\n\nFrom the beginning it was like that\nYou were always so darn real and phat\nYou weren't being trendy or trying to be cool\nYou just were... could never be anyone's fool\n\nPeople could tell, you were so clear\nAbout the bullshit you could never adhere\nTime goes by, month to year\nYou said \"girls like you make me queer\"\n\nSo show your fine fine face\nNo one can take your place\nYou are so refined\nYou are one of a kind\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Poseur Punk", "href": "Poseur_Punk&&7710", "artist": {"unique_name": "MDC"}, "lyrics": "There you go scruffy and mean\nAll tattooed and pierced for the scene\nSmoking that cigarette to capture the pose\nAll the groovy looks for the clothes you choose\n\nEverything is about making you look good\nAs if other people and objects really could\nHey Mr. Peebrain it's about what's inside\nNot what's on the outside that is so contrived\n\nWhy don't you try just to be real All that vanity makes you a heal\nFind what you want and do it right And a little tip, it won't happen overnight\nLines like \"it's so heavy\" so clich&#233; It's so easy to predict what you will say\nAll that talk of inner pain Just another reason for you to complain\n\nThere you go scruffy and mean\nAll tattooed and pierced for the scene\nSmoking that cigarette to capture the pose\nAll the groovy looks for the clothes you choose\n\nSorry to shock you but it's time to wake up\nFar as I'm concerned I've seen enough\nI've said it now... so go figure it out\nBeing a poseur punk is not what it's all about\n\nPoseur punk, since the beginning of the scene\nPoseur punk, think you know what I mean\nPoseur punk, come on try to grow\nPoseur punk, had to let you know\n\nEverything is about making you look good\nAs if other people and objects really could\nHey Mr. Peebrain it's about what's inside\nNot about the outside that is so contrived\n\nWhy don't you try just to be real All that vanity makes you a heal\nFind what you want and do it right And a little tip, it won't happen overnight\nLines like \"it's so heavy\" so clich&#233; It's so easy to predict what you will say\nAll that talk of inner pain Just another reason for you to complain\n\nPoseur punk, you're living a dream\nPoseur punk, you are not what you seem\nPoseur punk, you're easy to see through\nPoseur punk, what are you gonna' do\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Welfare Line", "href": "Welfare_Line&&6016", "artist": {"unique_name": "MDC"}, "lyrics": "Oh, the line at the welfare line is way outta line\nAll the folks in the street, in the cold, in the heat, it's a crime\nLooking like a line or mourners stretching down the block and around the corer\nYes, the line at the welfare line is way outta line\n\nWell they say cutting AFDC isn't too race\nAll those welfare moms getting fat on all that cash\nWell, I heard a welfare mother's son say\n\"When I grow up, I'm gonna get me a gun\nAnd I'm off to Sacramento in a flesh\"\n\nNow all the folks who used to call us \"welfare bums\"\nNow are on that line mooching cigarettes and sniffing for crumbs\nAnd as sure as the sky is blue sooner or later it's gonna be me or you\n'Cause what comes around is familiar when it comes\n\nNow the poorest folks I know, just to eat\nHave to short the landlord and not pay the heat\nFor the crime or being poor\nThey get a three-day notice and a sheriff at the door\nYeah, the line at the welfare line is way outta line\n\nOh, the line at the welfare line is way outta line\nFor a meal or a taste, or a bite, it's a waste of time\nFor the want of cash to borrow, they'll tell you\n\"Sorry boy, come back tomorrow,\"\nIn a game designed to drive you out of your mind!\n\nOh, the line at the welfare line is way outta line\nAll the folks in the street, in the cold, in the heat, it's a crime\nLooking like a like of mourners\nStretching down the block and around the corner\nYes, the line at the welfare line\nThe line, like the rate of crime\nThe line, like a creeping vine\nOh, the line at the welfare line is way outta line!\n\n", "album": {"title": "Shades_Of_Brown_(1993)&&5717", "genre": "", "year": 1993}}, {"title": "Hail Satan", "href": "Hail_Satan&&7489", "artist": {"unique_name": "MDC"}, "lyrics": "People say you're stupid and fat\nAnd your face resembles the ass of a rat\nIn the schoolyard no one would play\nYou'd say \"Hi\" and they'd run away\nYour teachers all say you're dumb as shit\nYour guidance councilor says you should drop out and quit\nBut OZZY ain't got nothin' on me\n\nHail Satan!\n\nSo now I warn you\nYou'd better think twice\nFrom here on in don't play nice\nVoodoo dolls for you with pins\nThe world's gonna pay for their sins\nFor a while I was down on my luck\nBut now it's me you'd better not fuck\nCause me and LU' are working a spell\nLaugh now, 'cause we'll see you in hell!\n\nHAIL SATAN! (c'mon, everyone, sing along!)\n\nEven strangers point and stare\nYou've had it--you'd better beware\nHide in church and sing your psalm\nSee my pentagrams on my palms\nBetter stay and pray with the nuns\nWe've got you in the sight of our guns\nSo Sundays, its wafers and wine\nOr sign here on the dotted line!\n\n(Chorus, inexcusably horrid guitar-wanking)\n\n", "album": {"title": "Shades_Of_Brown_(1993)&&5717", "genre": "", "year": 1993}}, {"title": "This Land", "href": "This_Land&&5597", "artist": {"unique_name": "MDC"}, "lyrics": "This land is your land, this land is my land\nFrom Love Canal to Three Mile Island\nFrom the Livermore labs to the offshore rigs\nThis land was made for you and me\n\nAs I was walking the strip mined valley\nInto the city, the piss-soaked alley\nI felt kinda sickly, kinda Love-Canal-ly\nThis land was made or you and me\n\nThis land is your land, this land is my land\nBut tell the truth, man it's call the landlord's land\nWants money in his hand, or he'll call the policeman\nThis land was made for you and me\n\nThis land is your land (well, it's not MY land)\nThis land is my land (it was once the Indian's land)\nFrom California (where they got smog, man)\nTo the New York Island (you'll get mugged or murdered)\nFrom the Redwood Forrest (pool decks and patio furniture)\nTo the Gulf Stream water (hold your nose)\nThis land was made for you and me\n\nYou ask how we can do this to Woody, man\nWe know he'd understand and mourn the poison land\nWith head held in dismay at Prince William's death-bay\nOur fondest respects to mister G!\n\n", "album": {"title": "Shades_Of_Brown_(1993)&&5717", "genre": "", "year": 1993}}, {"title": "Born Under A Bad Sign", "href": "Born_Under_A_Bad_Sign&&1137", "artist": {"unique_name": "MDC"}, "lyrics": "Born under a bad sign\nI been down since I begin to crawl\nIf it wasn't for bad luck, I wouldn't have no luck at all\n\nHard luck and trouble\nIs my only friend\nI been on my own\nEver since I was ten\n\nBorn under a bad sign\nI been down since I begin to crawl\nIf it wasn't for bad luck, I wouldn't have no luck at all\n\nI can't read\nHaven't learned how to write\nMy whole life has been\nOne big fight\n\nBorn under a bad sign\nI been down since I begin to crawl\nIf it wasn't for bad luck, I wouldn't have no luck at all\n\nI ain't lyin'... [solo]\n\nIf it wasn't for bad luck I wouldn't have no kinda luck\nIf it wasn't for real bad luck, I wouldn't have no luck at all\n\nWine and women\nIs all I crave\nA big legged woman is gonna carry me\nTo my grave\n\nBorn under a bad sign\nI been down since I begin to crawl\nIf it wasn't for bad luck, I wouldn't have no luck at all\n\nYeah my bad luck boy\nBeen havin' bad luck all of my days, yes\n\n", "album": {"title": "More_Dead_Cops_(1988)&&7456", "genre": "Hardcore Punk", "year": 1988}}, {"title": "Going Nowhere Faster Than You", "href": "Going_Nowhere_Faster_Than_You&&6012", "artist": {"unique_name": "MDC"}, "lyrics": "We were going nowhere faster than you\nOur engines were racing hot and our skin turning blue\nOut of our skulls no sleep for a week\nYou could say we were major league tweeks\nWe were so strung out and having a blast\nPart of that white trash underworld criminal class\n\nWe were running those scams, living life on the lam\nLiving so crazy, eye always looking out for the man\nLowlife trash, bikers and assorted riff-raff\nCould you kick it down is what we used to laugh\nWe were so strung out and having a blast\nPart of that white trash underworld criminal class\n\nWe were strung, dumb and problems we thought we had none\nGenerational meth lab dysfunctional kinda' fun\nWe were going faster nowhere than anybody else\nSure as hell wasn't good for our health\nI know we just had to see how high we could fly\nJust hope you made it through to the other side\n\nWe would never front you off, but could you front me and pay you back real soon\nStealing mail, cashing checks, sweating it out in the heat of noon\nSnitch us out and we'll make you pay for it some day\nThick as thieves is what we used to say...\nGoing nowhere fast... nowhere fast... nowhere faster than you\n\nThen sure enough you're looking out from inside a cell\nTrying to figure a way out of this hell\nEasy getting hooked tougher getting out\nAnd if you make it then you got the right to sing and shout \nWe were so strung out and having a blast\nPart of that white trash underworld criminal class\n\nWe were strung, dumb and problems we thought we had none\nGenerational meth lab dysfunctional kinda' fun\nWe were going faster nowhere than anybody else\nSure as hell wasn't good for our health\nI know we just had to see how high we could fly\nJust hope you made it through to the other side\n\nWe would never front you off, but could you front me and pay you back real soon\nStealing mail, cashing checks, sweating it out in the heat of noon\nSnitch us out and we'll make you pay for it some day\nThick as thieves is what we used to say...\nWe were going nowhere fast, nowhere fast, nowhere faster than you\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Sleep A Little Less, Dream A Little More", "href": "Sleep_A_Little_Less,_Dream_A_Little_More&&1057", "artist": {"unique_name": "MDC"}, "lyrics": "Hey get out of your bed You're acting like a bore\nEverything's a mess Play it more hardcore\nDon't be playing dead We can hear you snore\nSleep a little less and Dream a little more\n\nWe're all in a bind It ain't so fucking fine\nGet up and start moving 'Cause now is the time.\n\nGet it to the groove And start to bust a move\nBetter shake your ass You've got nothing to lose\nShit's running low It's all out fucking war\nTime to sleep a little less Dream a little more\n\nSo what you gonna' do It's up to fucking you\nTime to make a stand And a freaking plan\nBacks up to the wall We are all kinda' sore\nTime to sleep a little less Dream a little more\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Long Day, Short Life", "href": "Long_Day,_Short_Life&&9490", "artist": {"unique_name": "MDC"}, "lyrics": "Long day, short life\nWake up the kids, kiss your wife\nWatch it go by so quick\nNo time to call in sick\n\nGrow up fast and off to work\nSurprised we don't all go berserk\nSweat it out in the day's sun\nTime to reflect, you barely get none\n\nLong day, short life\nWake up the kids, kiss your wife\nWatch it all go by so quick\nNo time to call in sick\n\nOut of it all, What'd you get?\nA little time to hedge your bet\nDrop dead in a ball of sweat\nWork your ass to stay out of debt\n\nWhat do you have to show?\nGoes so quick yet the day is slow\nKids grow up and out the door\nStare at the wall and down at the floor\n\nLong day, short life\nWake up the kids, kiss your wife\nWere you free? Were you a slave?\nRush, rush, rush, to the grave\n\nNow you get old and grey\nNobody listens to what you say \nIt seems as if you're just in the way\nFind yourself counting the days\n\nLong day short life... \nHope at least you still have a wife\nFinally you've got nothing to prove... \nHope it doesn't hurt just to move\n\nLong day short life\nWake up the kids, kiss your wife \nWere you free? You were a slave\nRush, rush, rush, to the grave\n\n", "album": {"title": "Magnus_Dominus_Corpus_(2004)&&8056", "genre": "", "year": 2004}}, {"title": "Pecking Order", "href": "Pecking_Order&&6887", "artist": {"unique_name": "MDC"}, "lyrics": "There seems to be a problem\nThe people won't behave\nThey seem to fear our power less\nThan what's beyond the grave\n\nThe clergy won't preach\nAll the doctrines we ask\nWe'll have to round them up\nSo we can take them to task\n\nWe'll blame the guerrillas for what has been done\nBurnt church of Jesus, the death of a nun\n\nThe church has preached resistance\nFor what the poor hold dear\nStronger than the army\nWe sent to instill fear\n\nA US torturer, designed just for you\nAgony guaranteed, they know what to do\nCIA assassins are coming with guns\nThe people will mourn for dead priests and nuns\nKill with no mercy, men and women of the cloth\nIneffective martyrs for the God they brought forth\n\nIs their retribution only time will tell\nAgents don't believe and the people live in hell\nWe'll destroy their faith\nIn their God and his son\nA plain wooden casket destined for a nun\n\nWe will not compete\nWith religious belief\nBurn the church, kill the priest\nLeaven them in grief\nUnlike their saviour they'll die with no cross\nShown their mortality they'll know who is boss\n\nDestroy their faith in their God and his son\nShow what we will do\nFor our power and money\nA blood spattered habit Amen\nThe Death of a Nun\n\n", "album": {"title": "More_Dead_Cops_(1988)&&7456", "genre": "Hardcore Punk", "year": 1988}}, {"title": "John Wayne Was A Nazi", "href": "John_Wayne_Was_A_Nazi&&2872", "artist": {"unique_name": "MDC"}, "lyrics": "John Wayne was a Nazi\nHe liked to play SS\nKept a picture of Adolph,\nTucked in his cowboy vest\nSure he would string up your mother\nSure he would torture your pa\nSure he would march you up to the wall\nSure he would hang you by your last ball\n\nHe was a Nazi\nBut not anymore\nHe was a Nazi\nLife evens the score\n\nJohn Wayne slaughtered our Indian brothers\nBurned their villages and raped their mothers\nNow he has given them the white man's lord\nLive by this, or die by the sword\n\nJohn Wayne killed a lot of gooks in the war\nWe don't give a fuck about John anymore\nWe all heard his tale of blood and gore\nJust another pawn for the capitalist whore\n\nJohn Wayne wore an army uniform\nDidn't like us reds and fags that didn't conform\nGreat white hero had so much nerve\nLived much longer than he deserved\n\nLate show Indian or Mexican dies\nKlan propaganda legitimized\nHypocrite coward never fought a real fight\nWhen I see John I'm ashamed to be white\nDeath bed Christian of this you avowed\nIf God's alive, you're roastin' now\nWell John, we got no regrets\nAs long as you died a long and painful death\n\n", "album": {"title": "More_Dead_Cops_(1988)&&7456", "genre": "Hardcore Punk", "year": 1988}}]