[{"title": "Deep Fried Frenz", "href": "Deep_Fried_Frenz&&5798", "artist": {"unique_name": "MF_Doom"}, "lyrics": "<b>Whodini:</b>\nBefore we go any further\nFriends\n\n<b>MF DOOM and Whodini:</b>\nAs you call 'em, they call you when they need something\nTrees for the blunt, the G's for the front\nI found a way to get peace of mind for years\nAnd left the hell alone, turn a deaf ear to the cellular phone\nSend me a letter or better, we could see each other in real life\nJust so you could feel me like a steel knife\nAt least so you could see the white of they eyes\nBright with surprise, once they finish spitting lies\nAsssociates, is your boys, your girls, bitches, niggas, homies\nClose, but really don't know me\nMom, dad, comrade, peeps, brothers, sisters, duns, dunnies\nSome come around when they need some money\nOthers make us laugh like the Sunday funnies\nFam be around whether you paid or bummy\nYou could either ignore this advice or take it from me\nBe too nice and people take you for a dummy\nSo nowadays he ain't so friendly\nActually he woulda even made a worthy enemy\nRead the signs, \"No feeding the baboon\"\nSeein' as how they got ya back bleeding from the stab wounds\nY'all know the dance, they smile in ya face, y'all know the glance\nTry to put 'em on, they blow the chance\nNever let your so-called man's know your plans\n(How many of us have them?) A show of hands\n(Friends) is a term some people use loosely\nI'm real choosy on what I choose to let crews see\nYou telling me, I try to act broke\nJealousy the number one killer among black folk\nFellas be under some type of spell like crack smoke\nGhetto Cinderellas, lead 'em right to your stack, loc\nJust another way a chick'll lead to your end\nI check the dictionary for the meaning of friend\nIt said, \"Person, one who likes to socialize with\nSympathiser, helper\" and that's about the size of it\nMost of the time these attributes is one-sided\nTo bolster the crime, they're apt to shoot you through your eyelid\nAnd they can't hide it, going wild like a white bitch\nSometimes you need to cut niggas off like a light switch\n(Click) And when things get quiet\nCatch 'em like a thief in the night, what a riot\nI first met Mr. Fantastik at a arms deal\nDon't let it get drastic, think of how your moms'll feel\nWhen it get for real, steel get to sparkin'\nEverything darken and ain't no talkin'\nFor somethin' so cheap it sure buys a lot of trouble\nYa better off focusing than tryin' to plot to bubble\nOr else it'd be a sad note to end on, the guns we got is\n(One's we can depend on friends)\nSome come in the form of codependence\nA lot of times only end up being codefendants\nTen bucks say they tell for a lower sentence\nAnd leave you up under the jail, begging for a penance\nIt don't make no sense, what happened to the loyalty?\nHonor amongst crooks, trust amongst royalty\nI'd rather go out in a blaze, than give 'em the glory\n(How many of us have) a similar story?\n(Friends) before lovers, we used to have some type of over-standing\nJust so when I let her get the man thing, she know its no strings\nWe could do the damn thing, but ho it's no rings\nJust how the tramp swings, will she see 'em again?\nThat depends on how good was the skins and could she memorize the lessons?\nIt ain't no need to pretend\nEven though she let 'em stab it, she know they just (friends)\n\n<b>Whodini:</b>\nFriends\nHow many of us have them? Friends\nOnes we can depend on, friends\nHow many of us have them? Friends\nBefore we go any further\n\nFellas, don't be silly\nI know who my friends are\nAnd the next nice neighborhood I move into, you guys'll get crackin'\n(Negro humor always escaped me)\n\nThe most powerful, the most mysterious monarch in all the world\nGuided by a fighting force than never sleeps, that never relaxes its vigilance\nFor none is as feared, none has as many foes as DOOM, the awesome ironclad lord of\n\n<b>Mr. Fantastic and Invisible Woman:</b>\nI know who Doom is\n(Then tell us)\nHe happens to be the most dangerous man in the world\nI'd hope we'd never hear from him\nI'd hope we'd never battle him\nBut now the worst has happened and I must tell you what we're up against\n\n<b>Mr. Fantastic:</b>\nI first met DOOM years ago\nWhen he wanted to be alone, alone to pursue his forbidden experiments\nOne day while conducting a secret experiment\n\nLater, when he recovered from his injuries\nInstead of having learned his lesson, DOOM was bitter, angry, vengeful\n\n<b>DOOM:</b>\nWhat have I done to myself?\nMy face, it is hideous\n\n<b>Mr. Fantastic:</b>\nHe traveled the world, seeking a cure for his disfigured face\n(I'm sorry sir, there is nothing we can do for you)\nHe traveled through remote villages, where strangers are seldom seen\nHe continued his search, never showing his face unless threatened by bandits who prey on travelers\nWho foolishly wander alone through their domain\n\n", "album": {"title": "MM.._Food%3F_(2004)&&6631", "genre": "Underground Hip  Hop", "year": 2004}}, {"title": "Guinnesses", "href": "Guinnesses&&9891", "artist": {"unique_name": "MF_Doom"}, "lyrics": "Running desperately low on food, they were forced to turn back\n\n(Well it should\nI despise him)\n\n<b>Empress staHHr:</b>\nSheitan never came so ill, he got skill\nMet a brother from the drill that gave my spine chills\nAll thirty-three nerves controlling my curves\nCommon sense just swerved every time I got served\nStress, frustration, empty rhetoric\nCold as winter in Connecticut, compassion lacking deficit\nThought it was love like sent from above\nYou not a soul-mate, more ways and actions of a primate\nWho by low and census coming faker than extensions\nPissed away all good intentions outta here. sister was missin'\nIntuition, maybe it was me\nI couldn't see, holdin' onto fantasy, getting bitten by reality\n\n<b>4ize:</b>\nWar wound, purple heart, love veteran\nMorphine, pain killers, drugs and medicine\nAnything just to forget the hurt\nIncoming, take cover, hit the dirt\n\nOn the front-line, there's casualties in the mind\nAnd the POW's get left behind\nMentally scarred for life, love is war\nAnd some chicks are just too hard to wife\n\n<b>Empress staHHr:</b>\nI shoulda deaded it from genesis 'stead of hittin' the Guinnesses\nNow I'm free falling, cursing at the street, bawling\nHe ceased calling, no appetite for feast darling\nSo deep, all in, I bet he never stop balling women\nForsake God for the scent of a man\nSacrifice a whole life for a slice, overstand?\nMaybe it's a lack of pigment, loneliness imagine figment\nOnly got the car tinted to pull extra G's in it\nDamn Jody, comin' with the okie doke, pokie poke\nSteady rockin' boats, got me aimin for ya throats\nSniper scope, weren't we supposed to elope?\nPropose then ya froze, I don't think that I can cope\n\n<b>4ize:</b>\nWar wound, purple heart, love veteran\nMorphine, pain killers, drugs and medicine\nAnything just to forget the hurt\nIncoming, take cover, hit the dirt\n\nOn the front-line, there's casualties in the mind\nAnd the POW's get left behind\nMentally scarred for life, love is war\nAnd some chicks are just too hard to wife\n\n<b>Empress staHHr:</b>\nConstant frustration, stemming from a no win situation\nRushing lust and fornication, adding to the complication\nPatience is a virtue, pain run deep when love desert you\nListenin' to whisperin', choosing chaos over discipline\nSimpleton, life should really be a piece of intimance\nRelationships strengthening, flower essence penstemon\nGentlemen my favorite shit so I've never forsaken it\nI persevere, make it fit, sculpting and reshaping it\nTaking sips off a fifth of it, passionate, intense\nIncense candles lit, scandalous\nEmotional bandages, why would he abandon this?\nGuess he couldn't handle it, the boss is magnanimous\n\n<b>4ize:</b>\nWar wound, purple heart, love veteran\nMorphine, pain killers, drugs and medicine\nAnything just to forget the hurt\nIncoming, take cover, hit the dirt\n\nOn the front-line, there's casualties in the mind\nAnd the POW's get left behind\nMentally scarred for life, love is war\nAnd some chicks are just too hard to wife\n\nLook\n(Oh boy, here we go)\n\nCome on you college boys wearing them faggotty-looking white shoes\n\nYa didn't wash your neck\n(Take a look at my neck)\n\nHold it right there you\nWhere you're going, there are no jokes\n\nI'm beginning to think that armor-plated gargoyle doesn't like me\n\n", "album": {"title": "MM.._Food%3F_(2004)&&6631", "genre": "Underground Hip  Hop", "year": 2004}}, {"title": "One Beer", "href": "One_Beer&&3410", "artist": {"unique_name": "MF_Doom"}, "lyrics": "I get no kick from champagne\nMere alcohol doesn't thrill me at all\nSo tell me why shouldn't it be true?\nI get a kick out of brew\n\nThere's only one beer left\nRappers screaming all in our ears like we're deaf\nTempt me, do a number on the label\nEat up all they MC's and drink 'em under the table like\n\"It's on me, put it on my tab kid\"\nHowever you get there, foot it, cab it, Iron Horse it\nYou're leaving on your face, forfeit\nI crush the mic, hold it like the heat, he might toss it\nTold him tell they stole it, he told her he lost it\nShe told him \"Get off it,\" and a bunch other more shit\nGetting money, DT's be getting no new leads\nIt's like he eating watermelon stay spitting seed after seed\nIt's the weed, give me some of what he's drooping off\nSoon as he wake up, choking like it was whooping cough\nThey group been soft\nFirst hour at the open bar and they're trooping off\nHe went to go laugh and get some head by the side road\nShe asked him to autograph her derriere, it read\n\"To Wide Load, this yard bird taste like fried toad turd, love, villain\"\nTake pride in code words\nCrooked eye mold nerd geek, with a cold heart\nProbably still be speaking in rhymes as an old fart\nStudy how to eat to die, by the pizza guy\nNo he's not too fly to skeet in a skeezers eye\nAnd squeeze her thigh, maybe give her curves a feel\nAnd the same way she feel it when she flow with nerves of steel\nThey call the super when they need their back, uh, plumbing fixed\n\"How there's only one left? the pack comes in six\nWhatever happened to two and three?\"\nA herb tried to slide with four and five and got caught like, \"What you doing G?\nDon't make me have to get cutting like truancy\nMatter fact not for nothing right now you and me\"\n\nLooser than a pair of 'Didas\nI hope you brought your spare tweeters\nMC's sound like cheerleaders\nRapping and dancing like Red Head Kingpin\nDOOM came do the thing again no matter who be blinging\nHe do it for the smelly hubbies\nSeeds know what time it is like it's time for Teletubbies\nFew can do it even fewer can sell it\nTake it from the dude who wear mask like a tarded helmet\n\nHe plots shows like robberies\nIn and out, one, two, three, no bodies please\nRun the cash and you won't get a wet sweatshirt\nThe mic is the shottie, nobody move, nobody get hurt\nBring heat, like ya boy done gone to war\nHe came in the door, and everybody on the floor\nA whole string of jobs, like we on tour\nEvery night on the score, coming to your corner store\n\nThere, it is done\nNow that the representative from South Africa has been mind programmed, all of the world's leaders on earth are under my control\nAnd when they meet tomorrow in special session, I, DOOM, shall be voted master of the world\nMy plan is foolproof but just in case\n\nAnd what about snow?\n\nAnd you keep your eyes open\nWhen I tell ya, start snappin'\n(Oh yeah, sure)\n\nUh, ladies and gentlemen\nI am risking my life to tell you with great concern that I must warn you\nI, I, you must listen\nMany among you, have, have, have their minds taken over\n(What a story, start snappin')\n\nDOOM, gosh, I wish I'd brought my autograph book\n(Your attempts at humor bore me)\nRight lead head\n\nYou're weird\n\nWhy is everyone staring at us?\n(Aw, I should have realized we must look like freaks to them)\n\nRelax masseur, just do your thing\n(Get a good grip on my)\nWhat? Why I'll bend your read out meter for ya, you little\n(Knock it off, Ben)\nWhat's the matter?\n(Oh, Ben)\nYou're nothing but a chicken head\n(You overgrown granite head)\n(Hold it)\n\n", "album": {"title": "MM.._Food%3F_(2004)&&6631", "genre": "Underground Hip  Hop", "year": 2004}}, {"title": "Hoe Cakes", "href": "Hoe_Cakes&&718", "artist": {"unique_name": "MF_Doom"}, "lyrics": "*Beatboxing is heard through the entire song*\n\n(MF Doom)\nKEEP YA HOES IN CHECK!(..Super!)\nI got this girl and she wants me to duke Her\nI told her I'd come scoop her around 8, she said \"Super!\"\nThat sounds great, shorty girl's a trooper\nNo matter what I need her to do, she be like \"Super!\"\nOwn his own throne, the boss like King Koopa\nOn the microphone he flossed the ring \"Super!\nAverage emcees is like a TV blooper\nMF DOOM... hes like D.B. Cooper\nOut wit the moolah, I let her get a outfit\nJus to cool her off she said niggaz ain't about shit\nI wonder if she meant it, I doubt it\nThe way it be in her mouth, she can't live witout it\nAnd can't live with this, handle yo bidness\nVillain'll stay on a scandalous hoes shit list\nOne pack of cookies please Mr. Hooper\nIts fun smackin rookies, he is the \"Super!\"\nLook like a black wookie when he let his beard grow\nWeirdo, brown skin'ded always kept his hair low\nRumor has it it's a S-curl accident\nDOOM was always known to keep the best girls backs bent\nSome say it's the eyes, some say the accent\nA lotta guys wonder where they stacks went\nI call her thunder thighs, with the fatty swolla\nOnly mess wit high rollas, do what daddy told her\nNo matter the city she with me to do the thang thang\nWork in the coochie, hooptie chitty chitty bang bang\nSame name on the titty as on the name ring\nPretty like Baby D off \"all in the same gang\"\nKeep my eye on her really don't trust her\nBut I treat her like a daughter, taught her how to bust a nut\nAnd the heat to turn beef to horsemeat chalupa\nTeach her how to hold it, of course he is the \"Super!\"\nSee most cats treat her like foofer\nOr beat her to a stupor, take it from the \"Super!\"\nYa need to make her feel cuter\nAnd lay down the G like Luther, everythin'll be \"Super!\"\nDo for her, keep her in a new fur\nSo she look sweet when she go to meet the \"Super!\"\nGot the buddha get the Grenadiers, twist it\nPut it in the air, come 'ere, kiss it\nListen here scooter, let her try to bag you\nWhen she's on the rag never let her fry the Ragu\nWhich will have you under some type of spell crying \"dag boo\"\nHer name on ya back in her tattoo\nWhether a bourgie broad, nerd hoe, street chick\nDon't call her wifey if you met her at the freaknick\nYou don't want her don't waste her time, I'll dupe her\nOh and be a father to ya child like the \"Super!\"\nHe keep his hoes in check\nSends 'em out to get glows from off frozen necks\nTell 'em take his clothes, leave him posin nekkid for real\nBetter yet, get 'em for the check off the record deal\nFind out where he keep the tek an the blue steel\nMake sure for extra wreck let 'em know how you feel\nAnd while he's runnin' down to all star weekend to ball\nI'm comin' with the U-HAUL!(Super!)\n(..Super!) (...Super!)\n\n", "album": {"title": "MM.._Food%3F_(2004)&&6631", "genre": "Underground Hip  Hop", "year": 2004}}, {"title": "Potholderz", "href": "Potholderz&&4635", "artist": {"unique_name": "MF_Doom"}, "lyrics": "(Dwight spits)\nI strive to be humble lest I stumble\nNever sold a jumbo or copped chicken with it's mumbo sauce\nTyson is a Fowl holocaust\nFill and gas your whole head up with poetry I'm fed up\nIgnore cordon bluh\nStand up get up\nLunge for your knife\nDon't forget your potholders\n\n(Mf doom)\nWhat\nThese old things\nAbout to throw them away\nWith the gold rings that make 'em don't fit like O.J\nUsually I take them off with oil of ole\nMC's is crabs in a barrel pass the old bay\nHot as hell and it's a cold day in it\nWorking on a way that we roll away tinted\nSome say the price of holdin' heat is often too high\nYou either be in a coffin or you be the new guy\nThe one that's too fly to eat shoe pie\n(Never too busy)\nNever too busy when it comes down to you and I\n(Swear to god)\nA lot of niggaz wish to die\nNeed to hold they horses\nThere's bigger fish to fry\nYour on the list\nIf not hit the number spot\nTen and a half Timbs is made to kick your bumbaclot\nCould have had a V-8\nF-150 quad cab but I'll be straight\nMoney comes and goes like that two bit hussy that night that tried to rush me\nDwight pass da dutchie\nSo I can calm down so they don't get it twisted\nTake it from the fire side it won't get blistered\nGot it\nWhat happened oh it's not lit\nThese metal fingers be holding hot shit\n\n(Dwight spits)\nWhen I was four I penned \"God Was Born in New York\"\nBack in seventy seven still got nan in the crescent\nThe effervescence of gods presence is thick\nUnlike vapor\nEscarole\nExtra roll\nWord to the baker\nPeace to the hard working ginger bread makers\nLooked her up and down said, \"Hmmmm, too much make up,\"\nPoor music taste\nTen years from being grown up\nRappers don't blow up heads do\n(Awwwww shit)\nMy name is Dwight Spits\nI'ma sonic addict\nI use to think it was merely a daily habit\nBorn under a bad sign\nI'm serious about this curse of mine\nI strive to flip it in the fine wine\nBarely born a virgin is what the stars said\nBlack not white red all over, though, like Elmo\nTwenty eight years have passed, I feel I'm peaking\nI make music every weekend\nIt's a chore\nA fact of life\nA labor of love\nI get mad love but I detest the labor\nAnd it's wages\nYou know death\nI'm serving life from this gift of god\nDon't forget your potholders my niggas\n\n", "album": {"title": "MM.._Food%3F_(2004)&&6631", "genre": "Underground Hip  Hop", "year": 2004}}, {"title": "Rapp Snitch Knishes", "href": "Rapp_Snitch_Knishes&&4810", "artist": {"unique_name": "MF_Doom"}, "lyrics": "<b>Mr. Fantastik and MF DOOM:</b>\nYo\n(Yo)\nMf doom\n(Mr. Fantastik) Mr. Fantastik\n(The villain)\nWhat up, nigga?\nAin't nothin', what's the word?\nWhat's cracking, boy?\n(Same ol' shit, kid, different day, you know)\nMan, rap snitches man, shit is bugged out\nMan, the fuck man\n(Shit, You tellin' me)\nNiggas running their mouth, telling anything, anything\n\n<b>Mr. Fantastik:</b>\nRap snitches, telling all their business\nSit in the court and be their own star witness\nDo you see the perpetrator? Yeah, I'm right here\nFuck around, get the whole label sent up for years\n\nRap snitches, telling all their business\nSit in the court and be their own star witness\nDo you see the perpetrator? Yeah, I'm right here\nFuck around, get the whole label sent up for years\n\nType profile low, like A in Paid in Full\nAttract heavy cash 'cause the game's centripetal\nMr. Fantastik, long dough like elastic\nGuard my life with twin Glocks that's made out of plastic\nCan't stand a brown nosing nigga, fake-ass bastard\nAdmiring my style, tour bus through Manhattan\nPlotting, plan the quickest, my flow's the sickest\nMy hoes be the thickest, my dro the stickiest\nStreet nigga, stamped and bonafide\nWhen beef jump niggas, come get me 'cause they know I ride\nTrue to the ski mask, New York's my origin\nPlay a fake gangster like a old accordion\nAccording to him, when the D's rushed in\nComplication from the wire testimony was thin\nCaused his man to go up north, the ball hit 'em again\nLame rap snitch nigga even told on the Mexican\n\nRap snitches, telling all their business\nSit in the court and be their own star witness\nDo you see the perpetrator? Yeah, I'm right here\nFuck around, get the whole label sent up for years\n\nRap snitches, telling all their business\nSit in the court and be their own star witness\nDo you see the perpetrator? Yeah, I'm right here\nFuck around, get the whole label sent up for years\n\n<b>Mf doom:</b>\nTrue, there's rules to this shit, fools dare care\nEverybody wanna rule the world with tears for fear\nYeah yeah, tell 'em \"Tell it on the mountain hill\"\nRunning up they mouth bill, everybody doubting still\nInformer, keep it up and get tested\nPop through the bubble vest or double-breasted\nHe keep a lab down south in the little beast\nSo much heat you woulda thought it was the Middle East\nA little grease always keeps the wheels a-spinning\nLike sitting on twenty threes to get the squealers grinning\nHitting on many trees, feel real linen\nSpitting on enemies, get the steel for tin men\nWhere no brains but gum flap\nHe said his gun clap, then he fled after one slap\nSon shut your trap, save it for the bitches\nMmm, delicious, rap snitch knishes\n\n<b>Mr. Fantastik and MF DOOM:</b>\nYou know what I'm saying?\n(It's terrible)\nCrazy, man, I'm just analyzing this whole game\nThis is bugged out, man, niggas is snitching\nTelling on they own self\n(It's a horror, yo)\nFuck around and get everybody bagged, man\n(Atrocities)\nFuck around and get yo mama bagged, nigga\nYou know your grandmama used to be bootlegging\nFake hustling nigga, hahahahaha\n\n", "album": {"title": "MM.._Food%3F_(2004)&&6631", "genre": "Underground Hip  Hop", "year": 2004}}, {"title": "Kon Karne", "href": "Kon_Karne&&5738", "artist": {"unique_name": "MF_Doom"}, "lyrics": "Darker than the East river, larger than the Empire State\nWhere the beasts to guard the barbed wire gate is on the job not my fate\nTired of the wait till the villain bring deliverance from the dire straits, fire at a higher rate\nWhy'd they make the liars, fliers scatter, buy a plate, isolate the wires\nTry the straight pliers if not the vice grips\nA real price saver way to acquire nice whips\nWhat a steal for real on wheels of steel\nStunner a funner summer number one meal deal bummer\nA bizarre phenomenon is your armor on\nTake your cash, Karma, or break your fast, Ramadan\nTransaction drama, aww come on Barney\nClack clack, pardon me, whack rap con carne\nHe came to feed the childrens like Sally Struthers\nAfter that he's going back to Cali where's the (Love is)\n\nWilder than the Nile, hold power like the great pyramids of Giza\nAnd stay leanin' like the tower of Pisa\nGive him something he can feel that's soft to squeeza\nRaw with the pen and on the mic off the hezza\nGet shot off that wide eyed talk\nIf he had a pot he'd still piss on the sidewalk\nCan't take the street out the street person\nLookin' for the perfect beat coercion into heat burstin'\nThey couldn't spot him on the spot date\nGot the only tape that comes with a free hot plate\nWhoever do get to see me sing\nWith the 3D ring sittin' stationary like B.B. King\nCan see how it really sting, it ain't no front row\nStanding room only at the motocross stunt show\nThe ruckus ain't up to Snuffleupagus\nMe and Sub is like the brown Smothers Brothers (Love is)\n\nVaster than the seven seas, bigger than Mount Kilimanjaro\nIf they don't know, fill them in tomorrow on the horror show\nA mental note, return Bob's record\nSwear to god before he gets a job, he robs Eckerd\nBlessed with a hot flow, tested, it got dough\nInvested in stress the best to finesse an opto\nAs I reminisce never forgot when I was very broke\nShot the Henny straight couldn't afford to cop the cherry coke\nOr should I say broke with wealth?\nTo know enough to give them just enough rope to yoke theyself\nPlan B before I take the ring and pawn it\nThe long arm of the law couldn't even put they fingers on it\nDog gone it, do the statistics\nHow he bust lyrics was too futuristic for ballistics\nAnd far too eccentric for forensics\nI dedicate this mix to Subroc the Hip Hop Hendrix\n\n<b>Boris and the freedom fighter:</b>\n<i>In my pocket, a note\n(It's from my father\nFrom the guard's whip, is this a trick?)\nWhy would I resort to trickery?\nYou're already a prisoner\nWhat do I gain by deceiving you?\n(You can't blame me for being suspicious)\nNo (Love is)</i>\n\n", "album": {"title": "MM.._Food%3F_(2004)&&6631", "genre": "Underground Hip  Hop", "year": 2004}}, {"title": "Vomitspit", "href": "Vomitspit&&7812", "artist": {"unique_name": "MF_Doom"}, "lyrics": "It's the beat, he hear it in his sleep sometimes\nBlare it in your jeep so your peoples can stare at them rhymes\nReal rhymes not your everyday hologram\nEven when ribs was touchin' never swallowed the ham\nHe'd rather eat a sand sandwich salad\nIt might need salt like your man's bland ballad\nA lot of stuff happens that the news won't tell yous\nBlues on L juice, snooze, all hell loose\nRake it, take it like the good, the bad, the ugly\nBreak it, rollin' through ya hood in the caddy buggy\nButter softly, leather flossy, fatty juggy\nAlways threw me off when she told me, \"Daddy funk me\"\nI'm like anywho's\nSeeds walkin' all out in street without any shoes\nI guess it's better than some funky socks\nYou need to get her some skips before she catch the monkey pox\nInstead she wanna hear the beatbox\nTake pills and make fake krills as sheetrock\nSing it, bring it, back to your laboratory\nWhile he's in his oratory glory, it's like a horror story\nThe mask is like Jason\nThey told the place not to let the basket type case in\nHe could be some kind of wacko\nWaitin' for the chance to heat the pipes like a crack ho\nHe busted in, blessed be the Lord\nWho believe any mess they read up on a message board\nIf so, I got bridges for the low low\nSame bitch a-go dry snitchin' to the popo\nHere, orange peel stogs for the whole tier\nFeel like I've been gone over a year, came home to old gear\nIt was the shit when I first scooped it\nAt least I get to sit out in New York and curse stupid\nPlead the fifth, sip wine stiffly\nPatiently come up and be spiffy in a jiffy\nGift for the grind, criminal mind shifty\nSwift with the nine through a fifty nine fifty\nWell edumacated, he heard it when he meditated in deep theta\nLet her hate the creep later\nDedicated cheap skata who keeps data\nSay he stay self medicated to sleep later\nSide effects is similar to sugar pill\nWhoever go next on the mic he put a booger, ewww\nAnd made his exit on some calm shit\nBegged him on the regular for kegs of more vomitspit (DOOM)\n\n", "album": {"title": "MM.._Food%3F_(2004)&&6631", "genre": "Underground Hip  Hop", "year": 2004}}, {"title": "Kon Queso", "href": "Kon_Queso&&234", "artist": {"unique_name": "MF_Doom"}, "lyrics": "(MF Doom)\n...Give it a sec for the pain to start\nThis wreck right here it ain't for the faint of heart\nThey thought they saw the worst verse\nFrom the team of G men who seem like nerds at first\nOnce they get to know us people dig us\nLeaders in the fight for equal rights for niggaz\nInventor of the more demented flow nobody doubt it\nThis go for if ya 'bout it 'bout it or rowdy rowdy\nWhatevers clever the master fold\nWho every hooka heard a but now HO NO\nIf we see tomorrow the next day classes\nThe villain in the back with the x-ray glasses (*Pause*)\nHave no fear the ninja here\nFeel 'em like the tinge in ya ear from drinkin' ginger beer\nWhen it's on loco head gon' lay low\nAnd heat it like beef patty coco bread con queso\nIf you say so lace the whole case load\nThey say he wear a metal mask in case his face show\nHe told 'em they flows is bitch talk and ayo's\nHis whole crew walk with pitchfork and halo's\nSay OH if you never worked a J-O\nAnd keep more cash then a stash in a peso\nOkay yo y'all know who to follow\nTie 'em up in the crib and leave the place hollow\n...Oh shoot the goose she's loose\nSo wild you couldn't chase it down with straight fruit juice\nFrown like the first time you taste cous cous\nStash the deuce deuce\nTroops askin truce truce\nToday on intense wreck week\nWe have the super villain in his own defense to speak\nIt's all part of my mental techniques\nAvailable to freaks and pencil neck geeks\nTrain the same brain to a insane train of thought\nOn a campaign trail he came to gain ya support\nCharge cash for a autograph\nSay some shit to make ya daughta laugh\nThen slaughta the ass\nSeem 'em on the big screen like Steve McQueen\nDo something and never be back once he leave the scene\nKeep more medicated pads then Stridex\nFor his own sidewrecks with no known side effects\nBefore you press charges use ya noodle\nSo what when he grab the mic he scratch ya cute cuticles\nKeep ya mouth shut everything'll be beautiful\nIt would be often rude to you now get back to ya hooty hoo\nDamnit it ain't worth the drama can it\nFrom the calm bandit eat rhymers like pomegranate\nSoon as he stepped in he lit the room\nBoom reschedule my noon with Britt Hume (Doom!)\nIn love with Mary Jane she's my main thing\nPulled her right from that webhead what a lame brain\nMaintain say it don't spray it\nWanna see ya girl again ya might as well pay it\nIf I had a dime for every rhymer who bust guns\nI'll have a cool mill for my sons in trust funds\nWhen I was broker than a broke dick dog\nI always kept a L to smoke in thick fog\nWhen it rain it sure do thunderstorm\nI got more rhymes in the summer than musty underarms\nOne two microphone checker\nFirst learned to neck off a Home-Ec homewrecker\nThis is back when he was like crib age\nWhen he hit the stage it's like a gauge to the rib cage\nBreak the mic like a rock star break a guitar\nJump off the stage like \"Yee haw!\"\n\n", "album": {"title": "MM.._Food%3F_(2004)&&6631", "genre": "Underground Hip  Hop", "year": 2004}}, {"title": "Kookies", "href": "Kookies&&5633", "artist": {"unique_name": "MF_Doom"}, "lyrics": "One little evening alone home\nEnd up with carpal tunnel syndrome\nAnd here I am, known for giving heavy back aches\nGrown and living off of Little Debbie snack cakes\nSupposed to be checking e-mails\nAll I got is messages from ass-naked females (Cookies)\nI don't know a Jenny\nShe said it's free and I won't owe her a penny\nAnd that's the last time I saw her\nBut thousands of more horrors on online Gomorrah\nAnd Sodom, they got 'em with they curls out\nAnd they got a better sales pitch than the Girl Scouts\nI wonder what I owe her\nFor a whole box of caramel coconut samoa\n(Night, night) Okay honey, sweet dreams\nNow it's time to get serious like Peek Freans\nA metal hand full, wipe it on the quilt\nWife wake up and I'm kill't over spilt milk\nLocked in, looking at your picture\nFully clothed winter and I right there with ya\nThinking about the last time I split your wishbone\nA man could only wish you could do the same till he get home\nFat chance, at least he get snacks\nThat will have to do till a brother get back\nUntil then, smack One-Eyed Jack\nAnd hope one of his peoples can hook him with a tri-pack\nThat's three different flavors\nChocolate, vanilla, and strawberry wafers\nActing all hard, bout to get beat up\nI'll show him what time it is once I get this sheet up\nSoon as he fell off the beat down\nAll I hear is, \"Thirteenth cell, put the sheet down\"\nDamn CO, what the hell do she know\nBesides the fact she wanna get dug out on the d-low\nA workaholic with a fountain in the ink pen\nOut in the mountains and I stopped drinking again\nIn the wee hours, he's gotten farther\nNeeding three showers, being hot and bothered\nThe whiz with her legs bent, pregnant\nGod bless the day she wondered where her egg went\nI need a L, it's hard to drink without it\nAnd could use some cookies but trying not to think about it\nWatching BET on jazz for knowledge on file\nEvery other commercial, college hoes gone wild\nSoft batch, I prefer the other bunch, like we got for lunch\nChocolate fudge butter crunch\n\nDon't mess with the Ritz Bits\nWheat Thins, Saltines, or Triscuits (No)\nMatzos or Cheez-Its\nCatch sugar fits every time that he sees a nice pair of\nChips Ahoy, double chocolate chunk\nSomething with the bubble and the junk in the trunk\nEven the Oreos, no matter what weather\nAlways kept 'em dipped in milk and stuck together\nIn the game he's shameless\nEven uses a codename Famous Amos\nIt's cheaper than a short stay at the day's inn\nAnd good like twenty-five cent oatmeal raisin\nGive a hand to who invented the camera\nNever mind the gingerbread man or the grandmas\nShh, make sure she don't wake from her dream chill\nOr get caught with a handful of cream fill\n(Cookies) It might seem ill\n\n(Go wash your hands)\nCookies\n(Oh, cookies)\n\nWe shall now vote for a new world leader\nI nominate DOOM\nAll in favor say, \"Aye\"\n(Aye) Oh no\n(Point blank)\n\nDOOM and Spider-Man:\nDOOM is master of the world\n(I'd sure hate to see that ugly mug of yours in my history book)\nYou've disturbed me for the last time\n\nThe Thing, Invisible Girl, and H.E.R.B.I.E.:\nHey you know something gang?\nThat DOOM ain't really all bad\n(What do you mean Ben?)\nWell on account of him, I'm having real good time I mean\nBetween you and me, I kinda like being black\n(Well maybe if we're lucky, he'll attack us once more and send you back Benjamin)\nHaha very funny, very very funny\n\nMr. Fantastic and Invisible Girl:\n(He must be mad)\nNo, if anyone can do it\nNevertheless let's get out of here while we can\n(Food, we need food)\n\n", "album": {"title": "MM.._Food%3F_(2004)&&6631", "genre": "Underground Hip  Hop", "year": 2004}}, {"title": "Beef Rapp", "href": "Beef_Rapp&&9105", "artist": {"unique_name": "MF_Doom"}, "lyrics": "(MF Doom)\nBeef rap\nCould lead to gettin' teeth capped\nOr even a wreath for mom dukes on some grief crap\nI suggest ya change ya diet\nIt can lead ta high blood pressure if ya fry it\nOr even a stroke, heart attack, heart disease\nIt ain't no startin back once arteries start ta squeeze\nTake the easy way out phony, until then\nThey know they wouldn't be talkin' that bologna in the bullpen\nSo disgustin, pardon self as I discuss this\nThey talk a wealth of shit and they ain't never seen the justice\nBust this, like a cold milk from out the toilet\nTwo batteries some Brillo and some foil, he'a boil it\nHe be better off on PC glued\nAnd it's a feud so don't be in no TV mood\nEvery week it's mystery meat, seaweed stewed [food, we need food!]\n\nHe wears a mask just to cover the raw flesh\nA rather ugly brother with flows that's gorgeous\nDrop dead joints hit the whips like bird shit\nThey need it like a hole in they head or a third tit\nHer bra smell, his card say: aw hell\nBarred from all bars and kicked out the Carvel'\nKeep a cooker where the jar fell\nAnd keep a cheap hooker that's off the hook like Ma Bell\nTop bleeding, maybe fella took the loaded rod gears\nStop feeding babies colored sugar-coated lard squares\nThe odd pairs swears and God fears\nEven when it's rotten, we've gotten through the hard years\nI wrote this note around New Year's\nOff a couple a shots and a few beers, but who cares?\nEnough about me, it's about the beats\nNot about the streets and who food he about ta eat\nA rhymin cannibal who's dressed to kill, it's cynical\nWhether is it animal, vegetable, or mineral\nIt's a miracle how he get so lyrical\nAnd proceed to move the crowd like a old Negro spiritual\nFor a mil' do a commercial for Mello Yello\nTell 'em devil's hell no, sell y'all own Jello\nWe hollow krills, she swallow pills\nHe follow flea collar three dollar bills\nAnd squeal for halal veal, in y'all appeal\nDig the real, it's how the big ballers deal\nTwirl a L after every meal [FOOD]\n\nWhat up\nTo all rappers shut up with ya shuttin up\nAnd keep your shirt on, at least a button up\nYuck, is they rhymers or strippin males?\nOutta work jerks since they shut down Chippendales\nThey chippin nails, Doom... jippin scales\nLet alone the pre-orders that's counted off shippin sales\nThis one goes out to all my peoples skippin bail\nDippin jail, whippin tail, and sippin ale\nLight the doobie till it glow like a ruby\nAfter which they couldn't find the Villain like Scooby\nHe's in the lab on some old Buddha Monk shit\nOverproof drunk shit, and who'da thunk it?\nPunk try an ask why ours be better\nIt could be the iron mask or the Cosby sweater\nYes, you, who's screwed by the dude on the CD, nude! [we need food!]\n\n", "album": {"title": "MM.._Food%3F_(2004)&&6631", "genre": "Underground Hip  Hop", "year": 2004}}]