[{"title": "New Oakland", "href": "New_Oakland&&2686", "artist": {"unique_name": "Mistah_F.A.B."}, "lyrics": "(Mistah F.A.B.)\nYeah yeah yeah look a man\nIt's yo boy Fabby Davis Jr.\nOf the mac pac man\nYeah I'm saying\nAnd uh niggaz be hatin' on the town mane\nSo what I did put together the bosses from there area so\nWe can really show how this shit go mane\nLook uh\n\nI got North got the East got the West with me\nSo I suggest you niggaz don't mess wit me\nSo nigga be cool cause you don't wanna squad 'em\nWe could do the fool but you want no problems\nPut that on something I put that on fathers\nI put that on something I put that on mammas\nI put that on something I put that on grandcedas\nYou run up on me GET YOUR MAN BEAT UP!\n\n(Mistah F.A.B.)\nBush ride, gas kill, 6 dueces, golden ville\nNigga its TREAL, homeboy tell you how it feel\nHigh off purple, oh we thizzin off a pill\nYou think we square, we polar bears\nWe doubt it if you want it but tha solja's hear\nFabby davis is the prince of the O\nThe freestyle king man and everybody know\nAnd uh I izz\nDown with thizz\nReppin the bay but you know its town bidz\nMy side is what chu forget about and that's what I'm hot about\nNiggaz that be hatin' but pimpin' that's not what its about\nIts about gettin' money gettin' close to a mill\nSo I got my niggaz from the Coast and the VILLE\nYou already know so don't ask what it do\nScraper full of rippas when you see us slidin through\n\n(G-Stack)\nWe savin' it ain't never havin' it\nYou better run in the club when we grabbin it\n'Cause we townin, my niggaz stay clownin\n36 roundin, my niggaz go down AND\nYou gotta know where I'm from like ROBERT D\nOr like FELIX WAYNE or like LIL DEE\nI'm from the V I DOUBLE L A G E\nYou must be dat phantom dumb if you ain't heard of me\nWe stack rice through tha hood like Yest?\nRollin' through the north and the west but I reps that east\nWhen I'm throwin' up my hood they mistakin for peace\n'Cause I'm 2 finger straighted 'cause I'm so OG\nAnd I'm rarely in the club 'cause I'm so low key\nBut I'm all through these streets like it\nDon't know me if wasn't for the hood what would I be\nAnother average motherfucker but I'll never Be a sucka\n\n(Bavgate)\nNiggaz wanna eat what I eat\nWanna take my plate but I'm BAVGATE king of the golden state nigga\nI'm a g like khakis and corduroy\nI'ma be Mob boy no DOY\nAll black pack TOYS I ain't goofy leroy\nYeah I set the decoy\nTo jack you boy\nAnd you don't want beef ill spray ya convoy\nTryna see me ill take you down boy\nI'm from the west where Huey P.Newton from\nBashs To AutoBans the feds thinking I'm taliban 4 nigga's snitched on me\nLike a telathon, shittt\nBavgate right here back with the tommy gun\nAnd I'm accurate homie like a And 1\n\n(Mistah F.A.B.)\nYeah y'all know mane you see there you have it\nTown Bidness act fullest mane North East West OakLand Mane\nY'all herd yadda booboo E A ski A Big Cuzzin Thank You for the Beat\nMane know what I'm saying yeah We Fucks Wit It YEEE YEE\n\n", "album": {"title": "Son_Of_A_Pimp_(2005)&&7078", "genre": "", "year": 2005}}]