[{"title": "Post Mortem", "href": "Post_Mortem&&1478", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "(Vast Aire)\nVision is blurred yo\n\n(Mr. Lif)\nThis is the last chapter\nBombs hit who? Crushed what?\nOver there? Oh my god, oh dear\nI was hmm... I think I was *h* movin somewhere\nAbout to paint my fear bright glare not quite clear\nStay blinded to the light of possibilities\nThink I heard the screams of those in my proximity\nOn how they started thinking wishfully\nGuided by fear I'm suddenly aware\nPlease, is anybody out there?\n\n(El-P)\nIt was a gentle fission kiss on my block\nAnd hot light like a baby breathing sigh a terrain\nAnd now my name is merely left\nSuckin on brain exist before the final flash\nThe emotion of pretty details of a life I had passed\nNow my warm night in Brooklyn is ash\nFalling from the snot of loosies that I choked\nAround the corner from class\nBefore the moments when the moon can move fast\nAnother summer slowly growing with the friendships\nThat would end with a blast\nOr how the hours could so blissfully lag\nShe slid her tongue between my lips and I gasped\nTold my dawgs and they laughed\nNow we're combining our cash at last\nA pack of smokes and a flask\nHopeless liquor with a (??gas path a maa??)\n\n(Jean Grae)\nConvert to atheism denounce god pronounce religion dead\nFaith in nothing trace my wrists with razors\nI refuse to wait for the blades to erase my spirit\nDeath - faced with it - run to it - not from it\nSwallow all the pills in the medicine cabinet\nChase it with a bottle of 151 hug mommy\nHead outside the smashed windows in trash my hotel lobby\nBreak the grip off the time at last\nI find I get to him up Wish I did more sinnin\nGet a strap on run up in two women\nLaid in the middle of a highway wait for pain to hit me\nStill a can with people lootin screamin come and get me\nFinally it was porn shop biggest gun crowded street\nBlow my brains to hell - I'm gone - and let the devil come for me\n\n(Akrobatik)\nWhat's the chance that I'd be one of the last ones left of my preceders\nThe Earth Crusher came before I could even conceive a fetus\nBut I did go from nothing to misunderstood elitist\nWho tried to tell his people to rise instead of acting like defeatists\nBut what good is that? 'Cause we're now all goin' to hell\nLike some kid playin' in his class out talkin' before the bell\nI died believing in righteousness but I could have indulged more\nCause giving in to temptation don't seem that raw no more\nI heard some airline offered flights into space\nI shoulda took it to see earth before they matched up the place\nI thought I'd be alone when they finally came to get me\nBut nobody gotta miss me because they all comin' with me\n\n(Mr. Lif)\nOur horizon was accessorizing we bred more need\nBest believe this be the equation of greed\nI need a new car and thus new breaks\nAnother tune-up with lube\nWhatever's put together shall be unscrewed\nIn times of famine we made more food\nFood made more people\nIt's all explained within the cycle of evil\nWould I trade it all?\nCruisin down the highway on a bright summer day\nGazing out a plane to see the earth from miles away\nWatchin the patriots win the super bowl\nGrabbin that fumble from Ricky Prole\nOr my stereo provided me with rhythm and soul\nI don't know, all I know is I feel guilt for\nEvery single thing I've ever bought and sold\nI shoulda been at more demonstrations\nPlanted bombs in corporations\nMurdered CEO's and cancelled TV shows\nBurned billboards and torn posters\nI coulda read more\nFinally I get to meet this god they left us dead for\nAnd its ill, its power to the form of a bill\nTo which people killed by manipulated free will\nConscience be the crucifix a chopping block for poppycock\nAnd I can feel our spirits drop upon these streets I oddly walk\nEnough talk! Here's my last chance to cherish a thought\nMy flesh is fully melted and my stomach's in a knot\nSo to my love I hated to leave you alone\nParted my zone passion took me to places and my life was a poem\nBaby I was on my way home about to catch a flight\nOur meeting has dissolved in radiation and light\nLove you gave me made me shine\nYou're gorgeous with a powerful mind\nYou lifted my spirits and strengthened my spine\nI'm at peace with my life cause knowin' you was divine\nYou made me see eternal beauty in a world that was dying\nNow we're all ground by the grind\nOut of luck and out of line, out of signs\nAnd now we're out of time...\n\n", "album": {"title": "I_Phantom_(2002)&&1109", "genre": "Hip Hop", "year": 2002}}, {"title": "Heavy Artillery", "href": "Heavy_Artillery&&1074", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Usually I'm at the bottom of the sea, dormant\nBut every now and then I call upon the torment\nSo I emerge, feel the rays of the sun surge with power\nThen prepare to tear and devour\nAnd after that's understood I let my sounds blare like Underwood\nAfter this, lightning and thunder could\nCrash in the sky and project down to the terrain\nThe heat makes blood bubble in your veins\nWaves of energy channel through your feet in the form of a beat\nRally back your troops, retreat\nAbort mission cause you know can't compete\nYou're weak, fuck a backup plan, delete\nCause after the mega-charge\nI grow mega-large\nIncrease in size so no one survives\nYou can't believe what you see before your eyes\nYes, the god Lif has returned to terrorize\nArmed forces came out ready to brawl\nBut at a hundred stories tall niggas look small\nThis is the part where I stomp on Kong\nRip through the city, crush and romp\nThe [bus sailed]? at my frame but hit the flesh\nMy eye beam connects, burns shit up and wrecks\nLyrical Teks, slash necks\nBlood splatters all over my specs\nBody parts are found in tape decks\nSo visual you can't watch the scene\nIf you press stop the gears lock and pop your spleen\nThen I start to finish em: metaphor, simile\nMr. Lif has broken out the heavy artillery\n\n(I got artillery\nKeep aware\nI got artillery\nLyrics are ammo\nYou ready?\nI'm always prepared for warfare\nGet ready\nTime to drop this real heavy)\n\nRelease the crack and then summon the gods\nI defeated Zeus and Thor, now they want more\nI call on the rains so now let it pour\nTo soften up the ground so I can bury the gore\nBook me for a show son, send me on tour\nWhere niggas are fair game up in the airplane\nI'll battle everybody aisles A through Z on the free\nBut none of them are fuckin' with me\nWatch how I maneuver this\nHype rhyme past the stewardess\nWithout her even noticing\nYes, I found an opening\nYou lost cause you weren't focusing\nNow your dome's hot and smoldering\nOpen up the hatch so I can drop out the cargo\n'Cause I'm known to blaze stars just like the argo\nThese rhymes are going far beyond your belief\nI'm like the Golden Child: each and every day I eat a leaf\nGimme the wreath, I'll have a feast\nGain knowledge of self then I plan to conquer the beats\nAnd I'll build back your mental piece by piece\nGiving brand new life to the mentally deceased\nBut after this the situation gets truly hazardous\nTorturous, disastrous\nImagine this: experiencing hell right after bliss\nIn this experiment I'm the catalyst\nWelcome to the realms where money is God\nAnd they tamper with your brain till you're a spiritual fraud\nAs you focus on these words and enter the mind state\nI slow down your pulse then increase the rhyme rate\nFall into deep psychosis, what's the prognosis?\nOsmosis: underwater diffusion\nWelcome to the realms of liquid illusion\nWhere stationary things appear to be movin\nLook at your speedometer, how fast are you cruisin?\nThoughts race, images flash, you're gonna crash\nBut maintain your focus and move with agility\nCause Mr. Lif has broken out the heavy artillery\n\n(I got artillery\nKeep aware\nI got artillery\nLyrics are ammo\nYou ready?\nI'm always prepared for warfare\nBring a bulletproof vest and get ready)\n\n", "album": {"title": "Emergency_Rations_(2002)&&9074", "genre": "Hip Hop", "year": 2002}}, {"title": "Take, Hold, Fire!", "href": "Take,_Hold,_Fire!&&8755", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "(Mr. Lif)\nTake my check\nTake my intellect\nTake my self-respect\nBan my dialect\nHang me from a tree\nSlice my neck\nTake my head as a monument of the hatred of opposites\nTake the time to sell my culture\nCount how you profited\nTake a break\nTake two\nWhat's it gonna take to make you\nUnderstand the man I equate to\nI create crews\nOne thousand, two thousand\nFuck it, bring the whole central housing\nTake a trip to free brothers from penitentiaries\nJudges steady handing out centuries\nThat nigga got life for growing weed\nAh! See the plan?\nHe could never be a man\nNever get to help his fam\nJust like Apartheid that didn't die back in '91\nParents were subject to interference\nIf they caught you late trying to raise a son or daughter\nThey'd use a gun or a knife as they summoned slaughter\nAnd I wish I could ring the blood out of your clothes\nGive you back your afros and your strong black nose\nBut what's done is done\nWho's gone is gone\nOnce again, the sun illuminates bodies at dawn\nAnd I yawn and grow weary\nSuccumbed to old theory\nThat strips my wits of thoughts I used to hold dearly\nSo clearly the gold nearly ended existence\nA young brother who hungers, lying there shiftless\nA rich brother who hovers, hoarding his riches\nA fatal divide\nActs of the colonized\nIt's a worldwide unwise data that leaks when we speak\nRepeats till decency depletes\nThen leaks through our moral fabric forming havoc\nWe're left reminiscing what was written on a tablet\nIt's a path we've forgotten - lost in our heads\nAnd I know they're listening - so P.S. fuck the feds!\n\n(Aesop Rock)\nAnd I know they're listening - so P.S. fuck the feds!\nHold weight, hold water, hold your head above the latter\nWhile I'm at it, hope your story holds a little when it matters\nThe mold inside his holding cell became proof of the leak\nNow he holds his tongue behind his teeth in a room with police\nOne call alloted, tried to holler at his cousin\nWho couldn't hold his liquor, let alone hold the discussion\n20 seconds in he pass out on the hold button\nTill his quarter ran out with the dreams of ever holding something\nNo, it isn't folklore - Yes, it's morbid\nIf he hold heat, he'd probably hold grudges, not horses\nWe grew up in the hold it now hit it\nWhen hold it down meant it was better to hold the crown, not the image\nYou bow to a gimmick, you bound to hold back the incentive\nWhich your friends will hold against you\nWhen you haul back to the village\nFall back, crawl back to the killers\nWho couldn't hold a candle to the actual definition of \"illest\"\n\n(El-P)\nLittle man said I was fired\nUnder artificial fire up in the sky\nFlorescent tungsten hovered over cubicle design\nInterrupted just before final synaptic nerve could fire\nAnd I lost count right as I got up to the last digit in Pi\nWhat a fiery piece of trash (bastard)\nWhy, I ought to fire the boomstick in your face and tell the tribe that it was (magic)\nYou tried to take my soul but now it's (fire in the hole)\nAnd I'm fired up\nWalking through the office firing automatics\nYou didn't start the fire - you simply sparked it\nNext time you light a fire under my ass better hope that you're flame retardant\nArson is in my bent heart - you're begging to see the (billow)\nOf the smokes of the fires of Odin - enter the fire starter\nSee, every little monotonous moment that I punched the clock was equivalent to furnace fuel\nIn the form of a (fiery rock)\nWelcome to trial by fire measured in Celsius\nYou can fire me from the job but I promise I'm walking out the office healthiest\n\n", "album": {"title": "Mo%27_Mega_(2006)&&2313", "genre": "Hip Hop", "year": 2006}}, {"title": "Collapse", "href": "Collapse&&6762", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "I notice that you mentioned your opinion\nOh, now they got a couple of things to say too\nWhat should I do?\nListen or leak crimson?\nAll over the floor from my wrists\nThere, now you've got Lif\nSome natural, authentic, completely genetic\nInherited fate trait\nHe was eclectic but he didn't make great\nStatus is a trendy little song on a dub plate\nGive it some spins and it begins to wither\nMy nigga\nWhat's up, my nigga?\nLet's show and prove\nMake moves this winter\nRent a whip and start riding\nLook into my eyes and see those two worlds colliding\nI wanna be home making records\nNow I'm in the studio and all I wanna do is be home\n(What's stopping you?) Who's that?!\nMove back!\nDrive me to the hospital, I'm at the point of collapse\n\nSorry, baby girl, your man is out on tour\nThe floor may drop out if I don't walk out\nHandle my B.I.\nSee, I think I might have just missed my own life 'cause I'm working tonight\nAnd the pressure {*4X*}\nSales, interviews, touring, performing at my peak\nMan, I need sleep {*2X*}\n\nNow what truly defines one's life?\nIs it the legacy they left behind?\nWell, this music seems to be mine\nIt's been nine interesting years in the game\nNot too much has changed\nI've still got a saw to hack up your frame\nPerformed at all your favorite festivals\nSome cats do one show and blow\nMy destiny to live on the low\nIt's got me locked in the basement\nIn the winter in December\nOpen window, cold toe\nFace down on the futon rocking yesterday's attire\nWoke up early feeling uninspired\nStaring at my album outline\nAt this point I've drafted up about nine\nNew Lif, yeah, it's about time\nMaybe you've seen me on stage with Ace, Came to Perceptionists\nOr read an article on how my verbal weapon is\nWell, regardless how you got here, feel fear\nKick the kick, stomp the snare, goodbye the hi\nWatch the rhythm die then resurrect\nAs I recollect\nAncient black intellect\nErase and redirct\nYour collective minds to check a selective rhyme\nDetail\nAvailable at retail, griotmatics\nIpod and Treo addicts gotta have it\nIt's black magic that'll wrinkle time's fabric\nHave you heard of Lif?\nWell, maybe, sorta, perhaps\nListen up and let me guide you to the point of collapse\n\n", "album": {"title": "Mo%27_Mega_(2006)&&2313", "genre": "Hip Hop", "year": 2006}}, {"title": "Brothaz", "href": "Brothaz&&5776", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Now count how many levels that I smacked you back to oblivion\nMy heights olympian\nI'm from the Caribbean, Barbados\nAll fatal\nStyles that I construct and conduct in a manner like Banner\nSky scanner, eye jammer\n40 miles above Highlander with my grammar\nI shitted on Bush and tried to cap Santa\nRap vandalizer\nVerbal brutalizer\nWho's the wiser, me or he\nWho moves to grow flesh in test tubes\nI have mastered such degrees in less moves\nMy discipline\nEnvisioning\nRitalin\nFDA approved, we lose\nMedication taking brute forces\nThey battling and tallying losses\nSee how costless holocaust is?\nHelicopters now replaced by flying saucers\nOver the ghettos where some brothers are taught to bust shots\nTo get a lot of what is had by the haves not the have nots\nRaps drop pun your brainstem\nThis is Lif aka codename Mayhem\nWhat made you think that I wouldn't come back with a bloody axe\nAnd some muddy facts over tracks?!\n\nUp in the ghetto we're taught to bust shots\nThat's a bird in the bush and a fine line to walk\nGet down, stay down\nHold up, back the fuck up\nGet up, stay up\nHold up, back the fuck down\nBrothers is taught to bust shots (repeated)\n\nFact one:\nAmerica don't give a fuck about you so get off it\nI'm not a prophet they just want the profit\nThey make you want it so you cop it, soon you can't stop it\nYou're addicted\nBut low on doe so you get evicted\nFact two:\nDarfur's in a state of emergency\nIt's genocide\nCode red classified\nIf this was Kosovo it'd be over, bro\nBut it's brothers so it equals no coverage, mo' suffrage\nPeople drawn and quartered\nCastrated, slaughtered, burned, disgraced\nGang raped, displaced\nWhile the rest of the world just turn face to chase\nSome economic goals\nBalance the lost souls\nBut live it up\nWe 'bout to burn in hell 'cause god knows\n\nFact three:\nThe Bush Administration's worth nothing\nJust fuck 'em!\nThrow 'em in the barrel, buck 'em!\nOh, you ain't know them flood waters was coming?\nYou can't smell that African blood running?\nOh, to y'all niggers is worthless or something?\nFuck Clinton too!\nYou ain't really down because you live uptown, bitch\nRwanda!\nCheck out what we're looking at here across water\nIn the ghettos, brothers and sisters, it's self slaughter\nHow could colonized minds lead to such uncivilized times?\nMaybe the tribes were harmonious and you were erroneous\nIt's no fun\nIn fact, it's sin under the sun\nAnd son, in the event you meet some cops just run\nOr maybe walk real slow and lick shots at Po\nNot with the gun this times, through intelligents lines\nYou see, they look strong externally, internally they're dying\nJust elevate\nWhen drama escalate, you just shine!\n\n", "album": {"title": "Mo%27_Mega_(2006)&&2313", "genre": "Hip Hop", "year": 2006}}, {"title": "Status", "href": "Status&&9490", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Status\n\n{Lif}\nI was mad dip\nButterfly collars and shit\nChains from the slave ship\nDreads with the wave kit\nBifocals and wing-tips\nVelvet pants and a velour coat\nLooked in the mirror\n\"Damn I look dope\"\nFolded up the singles in my loot-clip\nPut a sock in my pants on some Uncle Luke shit\nDressed to impress\nNow I'm ready to go\nThe club is twelve blocks away\nAnd I got no loot, so\nI walk ten and take a cab for two\nBlack duct tape over the hole in my shoe\nI've got the hottest dance steps:\nRunning Man, Cabbage Patch\nPlus the Robocop, then I bring back the Walk\nJaws will drop, and all the ladies will flock\nBrothers thinking, \"What he got that I ain't got\"\nI'll tell ya fella, it's written in my best seller\nIt started to rain, I got no umbrella\nThe walking turned to running\nStill I look stunning\nCovered enough ground before my\nTaxi could summon\nGot to the spa and hopped out at the front\nTripped over the curb, limping 'cause my toes were stubbed\nThen I tried to give pounds to people I didn't know (\"yo, what's up y'all!\")\nAt Lucy and Joe's, my destination was the back door\nNot because the bouncer told me not to come back\nI'm just sneaking in the club because I got it like that\n\n{Insight}\nI remember when you used to be broke\nIgnored when you spoke\nAnd people would take you for a joke\nYou used to go to the club, and look like a scrub\nBut couldn't afford the admission\nFrom outside you're looking in\nWaiting for a chance to slip by\nYou slide through the back door\nBut you wasn't supposed to be there\nYou'd look like an idiot if you got caught, but you didn't care\nJust as long as you got your groove on\nIt was smooth sailing, they was playing the Thong Song\nYou're feeling shorty with the boots on\nCutting through the crowd sideways, it's time to move strong\nTo cool kick it, say something slick off the top\nFlash your jewels, fix your suit\nFidgeting with your wristwatch\nBut while you was in the corner acting the big shot.?\nThey threw on some hip-hop\nPeople got on the dance floor\nAnd a bouncer saw you standing at the corner near the door (\"Hey you!\")\nHe started walking your way, to muscle you out\nSince you refused to pay\nSo there was nothing for you to say\nWhen he blew up your spot\nAnd threw you out the front to the floor\n(\"I told you not to come back here!\")\nPast the bar on the right through the double doors\nYou mumbled and swore, stumbled and tripped on the pavement\n(\"Goddamn.\")\nPeople in line started laughing (\"Haha!\")\nWhen they threw you half-ass\nScreaming that you wasn't allowed back in\nBut that was back, acting like nothing happened\nYou patted your Tims off, depressed from embarrassment\nIt could have been fresh, it would have been lavish\nOne day you'll make it and won't have to deal with this madness\n\n*Scratches* \"My status is the maddest\"\n\n", "album": {"title": "I_Phantom_(2002)&&1109", "genre": "Hip Hop", "year": 2002}}, {"title": "Success", "href": "Success&&2069", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Success...\n\n(Mr. Lif)\nThis is rock bottom y'all, I never expected it\nIn order to be businesslike you must meet the prerequisite\nLeave your culture at home, smile, don't be too proud, too wild\nYou may suffer, just don't cry out loud\nThis notion of proffesionalism is like an exorcism\nForced to give your life away while you're earnin' a livin'\nThese thoughts had stopped me from rejoinin' the work force\nBut now the situation I'm in, just seems to hurt more\nMaybe it won't be bad, maybe it'll be good\nI could use a little structure in my life, maybe I should\nTake my suit and tie out of the closet\nTry shinin' my shoes and brush the fuckin' dust off of my wallet\nLet's consider the prospects, make a couple phone calls\nNow so many interviews you know I got next week\nI'm strictly goin'from the bottom to the peak\nI'm ready focused and determined to get back on my feet\n\n(Aesop Rock)\nDaddy had a name tag that said, \"Busy Working\"\nMommy had a milk carton that said, \"Missing Person\"\nJohn had a new baseball glove, with nobody to learn with\nThat's oil and water trying to mix on the same surface\n\n(Mr. Lif)\nI got a job at a business place I chose not to name\nAsk me how did I achieve this so quick? Yes you may\nBack when I was &lt;? ?&gt; compiled a stunning resume\nI didn't value way back then, but boy it helped today\nI'm pushin' every single thought of rebellin' away\nI'm workin' real hard, and my pockets are swellin', and hey\nCan you believe I met the girl of my dreams, I swear she's meant for me\nWe've been together over 2 years, goin' on 3\nWe married on our 4th anniversary\nBought a house and turned a room into a nursery\nFor the bouncin' baby that we're expecting in June\nI sat in that delivery room from noon, to noon\n24 hours of labour then the nurse asked me his title for the paper\nYou know, so the government can chase ya'\nFirst name: John, Last name: Insignificant\nI'm smiling like a proud dad; I got the birth certificate\nGo to the house and here's my &lt;?&gt;\nAnd I looked around and nothing's good enough for her or him\nSo my 8 hour days became 9; 9 slid up to 10; a subtle slip up to 11 and then\nAnd after a 12 hour day, I too little energy to say 'I love you' to my baby\nOr play daddy to J, and I thought this was the way\nO be a husband and a father\nI guess I could've looked in her eyes, and seen I lost her\nBut it wasn't my fault, I'm workin' hard, it couldn't be\nI've been successfully existing as a member of this family\nI was so convinced the household had to always be complete\nI didn't realize the only thing that's missing is me\n\n(Mr. Lif)\nThere was never any talk of divorce\nI can't believe how focused I was in the face of such a huge potential loss\nThought I signed a greivance with the boss\nIn fact, I was mad at my wife, as if she's trying to knock me off course\nBut I still visited the florist, to get her flowers\n(When the last time I did this?) Hmm... not since our wedding shower\nI got home and I was greeted by the fact we'd been deleted\nI was someone that my wife and child thought they no longer needed\nAnd before I could say, 'Where's John?'\nI looked down and he was clingin' to her arm\nI realized-ed that I'm wrong\nI blacked out and by the time I came to, they were gone\nBut somehow I sat and shook my head, and then I carried on\nAnd I still completed 3 weeks of work, before my breakdown\nThe ambulances came and I got medicine to take now\nAnd it's hard to get a job when you been treated and released\nSo both my relationship and my career had deceased\nIt took years to put myself together, piece by piece\nAnd thank God I found a woman that's propitiate with me\nAnd I'll never let this happen again, it's not to be\nI'm ready focused and determined to get back on my feet\n\n(Aesop Rock)\nDaddy had a name tag that said, \"Busy Working\"\nMommy had a milk carton that said, \"Missing Person\"\nJohn had a new baseball glove, with nobody to learn with\nThe oil left the water and the water kept searchin'\n\n", "album": {"title": "I_Phantom_(2002)&&1109", "genre": "Hip Hop", "year": 2002}}, {"title": "The Unorthodox", "href": "The_Unorthodox&&9121", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Mic check, check check check\nHere's some funky fresh hip hop shit for 3000\nLong after we've laid to waste all areas surrounding\nBass pounding, souls jumping, and you're pumping your fist\nYou've never heard a stiff body ripping like this\nSee I was stripped of my identity, conquered by the enemy\nAnd now I'm faceless in the 21st century\nYou may kind of vaguely remember me, or maybe not\nWhat it Ted or was it Scott, homo sapien or robot?\nSerial number: aye carumba\nSo you look at me real deep in my eyes and then wonder\nHold up, I still have important things to say\nI go home and watch news after stagnating all day\nJust press play, cool out sit back and relax\nAnd gobble up another earful of these undelivered raps\nAnd just think that perhaps what we think matters\nDelve into yourself and rediscover once forbidden data\n\n(Spoken) Oh golly Lif that was really special\nOn the positive tip right? Well uh let me ask you-\nAs a matter of fact kid, why don't you hold up one second\nAnd let my DJ get busy on this shit - go on Fakts\n(Scratching)\n(Spoken) Ho hum, ho hum\nYo that was fresh, now what were you saying, man?\nYou've been gone for a while, no one's seen you\nWhat you been doing during your hiatus, man?\n\nI sat back, I drank beers, I shed tears\nI react, I see traps, I eats raps such as kneecaps\nScapula, clavicle, I call this ?????\nBones by the barrel-full, great meal nigga, I'm rather full\nThis section, digestion, blood rushes to intestines\nWhen we met I left a negative impression\nYet another state of metamorphosis\nI'm off keel, please pardon my awkwardness\nHere, let me start with this: here's a hint like ?????\nLet's calculate what you think my mental net profit is\nPatience, something I was forced to learn\nYou must truly tap into yourself to make the records turn\nSo here I go, words make wind blow\nI change the world from looking through my window\nAngle, strangle any sucker duck\nMy mind done went outside and fucked him up\nYou picked the wrong street nigga you're outta luck\n\n(Scratching)\n\n(Spoken) Oh man that was like totally dope\nThanks man\nYou know I MC too?\nWell you know what? I eat motherfuckers how's that?\nAs a matter of fact beat it kid\nI eat niggaz for real yo check this shit out\n\n(Spoken Skit)\nTestimony #2A (Insight)\nTestimony #2B (El-P)\n\n", "album": {"title": "Emergency_Rations_(2002)&&9074", "genre": "Hip Hop", "year": 2002}}, {"title": "Iron Helix", "href": "Iron_Helix&&5445", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "(Scratching) \"drop drop\" (scratching) \"drop it\"\n(Scratching) \"drop it\"\n\n(Insight)\nThe sun has risen, as it glistens\nThrough the trees like a prism\nI listen to the earth's rhythm\nThe wind speaks to my instinct\nWith the earth I'm in sync\nSharpening the blade of a spade\nWith the heart of a lion\nIn combat, though I'm real slick\nThe salt in the water help my scars heal quick\nCause see I mastered survival tactics\nAnd lasted weeks without sleep\nHunting for prey and while he rap its\n\n(Mr. Lif)\n(Rather primitive) Who's that?\n(I'm stats, DATs, money stacks, tax) Which language is that?\n(Identity with a little tyranny)\nBut I don't need chaos, I have peace and serenity\n(You won't find hell in me\nSee psychoanalysts for therapy\nCome prosper and live plentily)\nMy existence is heavenly\n(You were meant to be greater)\nAllow me to pray to my creator\n(Nigga you are the maker, life giver and taker\nTake control, you should feel safer)\nBut I don't even feel threatened\n(You need weapons and apparently a classroom so you can learn lessons)\n\n(Scratching) \"don't let them fool ya\"\n(Scratching) \"I'm here to school ya\"\n(Scratching) \"you need knowledge?\"\n(Scratching) \"open your eyes\"\n\nYour terminal is senseless\n(I'm rational and actual, here\nLet me send a fax to you)\nBut what is a fax?\n(Ah, curiosity killed the cats's\nSwimming pool and mattress, bust a book of matches\nCredit cards and debit cards)\nChecks, cars, incredible odds, devil gods, laws\nFederal generals headed for Mars with medical cards\nFixing Mother Nature's technical flaws\n(Hmm, you learn quickly, now you're with me\nMove forward and never look back in history\nFocus on your omnipotence, teach your infants this\nKiss the barcode on your wrist)\n\"Kiss\" all six senses are on point\n(Telekinetics?) naw, I didn't forget it\nUtilizing earth, I can mold dirt into flesh, summoning\nSandstorms, on the highest mountain I stand on\nI make the sky cry fire rock then ice will drop\nIts wind spin, your spirit and soul ascends then\n(Now you can blend in, lets hit the city streets\nSo we can get your feet accustomed to concrete\nBuild a strong fleet of soldiers\nTell them what I told ya\nWe'll chill on the moon when we're older\nAnd thank God that this Earth life is over\nDevour the sun and make the universe colder)\nExtol the master, spinning planets around my aura\nLike an orbit, set a mountain on shore twist my fingers\nAnd force this into a tornado, raw fatal\nI make grain flow, draining clouds into a rainbow\nI master math, infused bionics with biology\nPolice carry shotguns inside a robotic knee\nThe impact of my psychology can atomically wipe out\nAnd devastate as soon as I meditate\n(So why don't you demonstrate?) I think that I might\nDrop a bomb on Nagasaki just because it's in sight\n(You've arrived) leave the world (brutalize) sacrifice\n(Human lives) take flight (to fight) attack tribes\n(This will be the legacy of you and I)\nWho's you? it's just I\nAll opposition must die!\n\n", "album": {"title": "I_Phantom_(2002)&&1109", "genre": "Hip Hop", "year": 2002}}, {"title": "Friends and Neighbors", "href": "Friends_And_Neighbors&&1315", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Let me tell you 'bout this nigga named Franz, he had lots of plans\nInvolving pots and pans, with fiends for fans\nHe was a real mean one, traded all his niggaz in for a green thumb\nPose able, all weight was unloadable, despite his deformity all guns are hold able\nHad his boys on some soldier role\nThey were risking they lives saying they actions are notable,\nTorn apart for a purple heart\nThis brother had a strong start, but the kid lack street smarts\n\nHey meet James, he works at Ames to get a discount on M&amp;M's video games\nHe said his co-workers were lames, without brains\n'Cause he had struck a couple those for which he had aimed\nThis nigga used to buy grams from Franz uptown\nBefore he was buck bounced, connection is fucked now\n\nSix years pass and he's still there, helping this old lady with the mean stare\nShopping in a wheel chair, her name was Claire\nBut she changed it to Greta, to help avoid a stalker with a vendetta\nThe cat sent her ten letters, saying she was a hat to be backed in leather\nAnd very soon in her living room he met her\nWell dressed nightmare in a cashmere sweater\nBlue Collar guy with some death in his eye\nThe tattoo was sitting high, right leg and her thigh\nHe just wanna see how you respond\nWhen he give thrust to a knife from his powerful arm\n\nAnd finally police chief officer brief\nWho received a phone call from the nearly deceased\nHe lost his gentle side at the homicide attempt\nSee now every single thought of murder is tempting\nHe couldn't ask for a bigger day\nThe following week he spent his time staring at exhibit A\nA bloody knife that bore flesh and bone marrow\nAnd just before he headed home to his wife Carroll\nReported suicide on the other side of town\nFrantic mother claims little girl had fallen down\nHe's on the scene seeing paramedics on the ground\nMom and daddy can't move the boy hiding in his room and\nHis fellow officers are all trying to subdue her\nHead shake in disbelief saying he ain't human\nNext time assuming that the media excluded\nDisplayed on the (?)\n\nYour spirit's absorbed in generators and tanks, data banks\nYou're retracing your steps and drew blanks\nLook at all these lives to waste, it's a dark space\nAdrenaline starts to pump increasing your heart rate\nYou're caught now, imagination has gone wild\nYou look into the mirror and then you tell me 'who art thou'\nYou got to be determined like (?) when he fought (?)\nYou're brains been bust open cause this is a hard trial\nNo answer just a mental cancer, before you choke I hope you get a chance to\nFeel fear, cause this is a real scare\nI'm giving you three seconds to tell us how we got here\n\n", "album": {"title": "I_Phantom_(2002)&&1109", "genre": "Hip Hop", "year": 2002}}, {"title": "Jugular Vein", "href": "Jugular_Vein&&2140", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Well I have arrived\nAnd over the years I've tried to sit back\nAnd watch niggas that think they top notch\nWhat did I spot, niggas is sub par\nSo I came to claim your jugular veins\nFirst name (huh), Last name (whew)\nI'm still not ready to reveal my identity yet\nEnemies keep testin\nMay I step back and make a simple suggestion\nPlease don't approach, I'm highly unstable\nDon't pass me the mic cable, I'm fatal\nLet me nutshell my life story, but I got to hurry up\nAnd kick it, because the feds are lookin' for me\nOnce upon a time I had to slay crews\nAnd the story never ends like a treuze\nDescribe the process first they bruise\nThen blood ooze, Down streets and avenues\nCops search for clues, They found a black hoodie of mine\nAnd some raggedy shoes, you could be a casualty too\nTraces, I'm in various places, I look like everybody of all races\nOne of science's most spectacular cases\nA man of the earth to be discussed for ages\nThe un-just lust at the wars they wage us\nPass me the bong nigga, hold the papers\n\nI'm high now, niggas can die now\nEvery morning when I see the sun rise, I bow\nThen I stand up, Pick the land up\nGot the whole globe in my hand, what\nAm I disrupting your day, shhh\nListen up the universe has got somethin' to say\nI translate, while all of my jams wait\nAll life is clingin to the wings of man's fate\nAnd you can't clip the cords\nSo I find time for inner reflection when I'm bored\nMaybe I'm made of liquid metal like T2\nCause after you blast me my dome is see-through\nBut I heal real fast, Here comes a real blast\n12 mega bombs 'n' ash, And after I get rid of your frame\nWhy don't you come back to the crib and play some videogames\n(Doorbell) Thanks for checkin' me, sit on the couch\nPick up a controller and lets play Tekken 3\nWhoop that ass 4 times now you wanna switch\nYou can use Eddie now I'm Dr. Barsconovich\nLay on my back, spit in your face\nPump up the bass, take your shin sweep the leg\nYou startin to beg, stomp your nuts headbutt\nBreak your arm, nigga be ghost oh I forgot your already gone\n\n", "album": {"title": "Emergency_Rations_(2002)&&9074", "genre": "Hip Hop", "year": 2002}}, {"title": "Live From the Plantation", "href": "Live_From_The_Plantation&&5338", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "{*Alarm ringing*}\n\"Oh my fucking god man, ah. fucking serious\"\nJesus Christ, man. already?\nMan, time flies like a motherfucker.\"\nRise and shine!\nYet another day to toss away\nWhat does my clock display?\nIt says eight\nShit, I'm late for work again, so then\nI dip with my pad and my pen\nStep into the work place with my work face\nWince at my time card 'cause I'm scarred\nMad 'cause I sacrifice my day and gets me\nA trifling hourly wage of six fifty, nifty\nNow I'm off to slave quarters\nWith a whole bunch of other people's sons and daughters\nWorking so they can be mothers and fathers\nLaboring real hard, hoping the boss offers\nMore petty cash to his bums and paupers\nKissing his ass 'cause they hoping they prosper\nHere's the math:\nYou work a third of the day, away\nThe government takes a third of ya check, correct\nYou go home and drink 'cause you don't get\nAn ounce of respect, and your spirit is wrecked\nLife is a gift to be enjoyed, every second every minute\nIt's temporary, not infinite\nYet I find myself looking at the clock\nHoping for the day to fly by, so I ask myself \"Why?\"\nI'm doing this remedial work for second graders\nI'm an educator with mega-flavor, so\nMaybe I should just jump up and get ill\nMaybe I should let these people know they're being killed\nMaybe I should try my very best to chill, and get paid\n'Cause I gotta pay bills, raa!\n\n\"Excuse me brother, can you please stop making that noise\nSo I can talk? Thank you. Now the boss says he wants you to come up\nWith more copies of these checks, and the last thing he wants is you to\nMove the desk to the basement, and can I have this stapler?\"\n(\"Hey there champ, big boss man says you been late\n3 days in a row, better sharpen up\")\n\nAw, this fucking place sucks - same shit everyday\nLike to wring the boss' neck though, if only dreams could come true\n\nDead boss, somebody call Red Cross\nI guess he got caught up in my mental holocaust\nHow much did it cost?\nJust a little piece of my mind for peace of mind\n\"But he's bleeding!\"\nOh no, leave him. He'll be fine\nHe'll heal on his own\nIf you just give him some time\nConsidering the fact that his face is misaligned\nHis legs are over there lying right next to his spine\n\"Lunchtime!\" Huh? Oh, Jesus, must have been daydreaming\nMy boss walks by, he's looking just like an asshole\nSmiling because he jerks niggas for minimum cash flow\nHe's cool to my face but I swear I heard him laugh though\nTickled by the fact that I'm the modern day Sambo\nAnd just when I think that I'm about to go Rambo\nI call up my man and he says he understands, yo\nWe all are being murdered by a similar process\nWhether you work at the candy store\nOr slave at the office\nThe purpose of our life is just to serve the economy\nThey misinform our minds to paint a picture of harmony\nBut if you listen then you know that shits out of tune\n'Cause the function of our life is just to work and consume\nFuck reaching out to help the next, there ain't any room\nJust close your eyes and block your ears and march to your doom\nBut since I really ain't getting paid for my time\nI pulled out my pen and started writing a rhyme\nCan't you see that I'm busy, jerk?\nDon't you dare approach me with busy work\nTake another step and get hurt\nBy the man that embodies mad years of anger\nA cool bro, soon to be the Boston Strangler\nEverything inside of me is about to erupt\n'Cause a righteous individual dislikes the corrupt\nI knew he'd lock me up if I started a brawl\nSo I deaden, and I punch the clock the fuck off the wall\n\n\"Yeah that's right motherfucker\nYou can't keep underpaying people and mistreating them all the time\nThat's gonna resort to crime.\nAs a matter of fact, you know what?\nFaks, yo cut this motherfucker, man.\"\n\n9-1-1\n\n", "album": {"title": "I_Phantom_(2002)&&1109", "genre": "Hip Hop", "year": 2002}}, {"title": "Pull Out Your Cut", "href": "Pull_Out_Your_Cut&&9177", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Lif, a new state of mind, new state of being\nConstantly striving to understand what you're seeing\nFinding the courage to stop fleeing\nProblems that lie within\nSo this is where we begin\nSelf-esteem: something that's diminishin'\nLook upon the faces of the youth you'll see them witherin'\nSocietal pressures can be imprisonin'\nLook at the effects that they have on us all is rather rivetin'\nHow many women you know with eating disorders?\nHow much makeup on the faces of our pre-pubescent daughters?\nDudes are acting macho and they don't know why\nA famous never-written motto is that \"boys should never cry\"\nKeep all those emotions bottled up, now what's up?\nYou can't communicate once you became an adult\nSituations got brought 'cause you had lockjaw\nYour kids ended up learning about life from a pop star\nBut I feel that rap is more real\nMatter of fact this music's gotten me through many an ordeal\nI was laying on a stretcher kicking rhymes by Eazy-E\nAfter falling off my bike while holding food from Mickey D's\nSo I chilled, had to calm my mental state\nHappy with the knowledge that the music helped me meditate\nAnd while I'm healing waiting for this world to erupt\nYou can catch me sitting next to my crate pulling out cuts\n\n\"Pull out your cut\" (Rakim... scratched)\n\n<i>spoken:</i>\nYeah that's what I'm talkin' 'bout right there\nBut yo kid, yo I was buggin', you remember \"Watch Me Now\" by Ultramagnetic?\nOh of course dog, my favorite joint though was Gang Starr\nWhat's that joint? How's that joint go?\nWait, yo I think I remember yo\n\nI'll flip, you know I'll flip the script\nI said I'll flip, you know I'll flip the script\nThe Guru, he's been my idol for years\nRipping shit with Premier, making the b-boys cheer\nAnd the GZA, Investigative Reports\nHe, Ghost' and Raekwon, they didn't take no shorts\nPlus the R, 'cause that's the way that it has to be\nThese brothers redefined lyrical mastery\nAnd I could go on cold pulling cuts for days\nBut I got something to say about you rappers today\nYour rhymes drop in weak spurts so you bite till your teeth hurt\nBut I'm your dentist so meet my apprentice\nChucky, and Charlie Bronson from Death Wish\nI couldn't hoard all of these medical skills and be selfish\nIt's hard to say rhymes with no incisors or canines\nI kill all the weak minds, administer brain ????????\n'Cause I'm the type of kid that's on the positive tip\nBut that's because I suppress my urges to slaughter you quick\nBut this time I just can't fight the feeling\nThat's why I'm smiling as your small intestines dangle from the ceiling\nYou're over, as KRS has said on the track\n\"It means return of the real hard beats and real rap\" (KRS-ONE sampled)\n\n\"Pull out your cut\" (Rakim... scratched)\n\n", "album": {"title": "Emergency_Rations_(2002)&&9074", "genre": "Hip Hop", "year": 2002}}, {"title": "Get Wise '91", "href": "Get_Wise_%2791&&9539", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "(Verse 1: Edan)\nI be the E to the D-lux, A to the N-fo\nAll you businessmen ain't saying it again\nI got rhymes galore, much more than your\nRap dinosaur, poor self-claimed connoisseurs\nLiterature hurts when dealing with short skirts\nNever fess technique immaculate and effortless\nThe top of Mount Everest, yes the best bet\nExpress non-stop, all aboard to the core\nRaw relaxor, for the fact you're\nCraving, paving this route just like a tractor\nTaking the time, to be making a rhyme\nEquivalent to a prevalent shrine\nThat's dedicated to the utmost elevated\nWhether it's off the top or pre-meditated\nListener elixir my words be medicated\nThe verbs regenerated, the crowd was animated\nIf you're evaluating me, what would it be?\nNumber 1, 2, or 53?\nWell it really don't make a fucking difference to me\n'Cause I'll be doing this for eternity\nLearn to be the best MC that's steps ahead\nDidn't have a plan, so you was left for dead\nDidn't have a van so you rode your bicycle\nBirth and death is just a part of the life cycle\nWatching a ball game you want to be like Michael\nBut he can't be you, that ain't see through\nThat's the true facts don't idolize him\nLace up your kicks bust your ass to the gym\nDevelop your skills, explore and work hard\nKnow yourself and never desert God\nCause that's the free force, the infinite resource\nI used to eat spaghetti with tomato and meat sauce\nNow I rock veggies with the sauteed tofu\nDemolishing a pimp politician 'cause I'm supposed to\n\n(Verse 2: Mr. Lif)\nSo here's where it starts, I rip apart charts and break hearts\nBalance book knowledge with street smarts\nA man from your fleet thoughts he's found he's fucking fickle\nPass the sickle (chill) here's a riddle: now who abuses money from taxes?\nMakes a law then seals it from the people to make sure that it passes\nUsing evil's axis to access to all become fascists\nUsing our greatest fears to lash us\n(Usher?) No another sucker, he's got a bottom lip and no upper\nComing from the state down under\n(Tess?) Yeah she had a real good time there with her salt and pepper hair\nSending brothers to the chair\n(Bush!) Yeah you guessed it\nI could smell the dawn of armageddon when this dick was elected\nAnger stored in hangars, weapons and propaganda\nConveyed via camera penetrate the slander\nThose who dove into the pot that's melting\nBut waited eternally in line for a helping\nYou step before your turn, they bite your fucking hand like the ??? worms\nBreaking you down with more germs\nDisease is corrosive, light is highly explosive\nRhymes are cock and loaded, niggaz oppose Lif\nI'm wrecking your dome while I'm escaping your focus\nSo pick your savior nigga: Jesus, Michael, or Joseph\nI played when I was younger but those days have passed\n(Yo what you do now?) I rip frames and laugh\nI'm bombing your set like I'm a poet\nFour heads from four feds who got dizzy once they saw dreads\nYeah they represent power\nIt means that when you come too hard at me I'm going to charge you by the hour\nThey bonded together and now they're strong presumably\nMy locks are proof that there is strength in unity\nSo now it's possible, I'm the son probable I see through all the bull\nWhile you're in the huddle call the audible\nStop and realize you're the captain of a ship that has capsized\nWords from a brother who raps wise\n\n", "album": {"title": "Emergency_Rations_(2002)&&9074", "genre": "Hip Hop", "year": 2002}}, {"title": "Ultra Mega", "href": "Ultra_Mega&&107", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "14 16\" splitscreens all showing what you're viewing\nWhat you doing? Withering away!\nBlack Friday\nSale prices by Dionysus\nThe God of wine just bought a spine\nRise up from your couch\nGet it now, go out\nFollow the warm glow\n(We sense you)\nOpen the door\n(Who sent you?)\nOur advertising so we know why you're here\nWinter wear\nSummer wear\nIn board gear\nOutboard gear\nWe've got Korgs here next to the cords there\nSplit peas and greens\nSlacks with seams\nRight next to your kid's dreams\nStationary\nGonne elope?\nBuy a diamond ring and envelopes\nJust delete hesitation\nImplant impulse\nIn skulls\nRoam the aisles till it feels worthwhile\nNow bring forth your selection\nChoose your weapon\nCurrency, credit card, mega card\nIt's never hard\nWe aim to please\nDid you notice, we also have...?\nOh, you have?\nLet me grab a bigger bag\nNow walk through the scanners\nKeep us in your daily planner\nWe're a Master Store\nBut really mainly just Master!\n\nBuy more\nSave more\nWe're your saviour\nGet 6 if you trade 4\nChance of a lifetime\nHop in the right line\n$12.99 to hear a hype rhyme\nBuy more\nSave more\nWe're your saviour\nGet 6 if you trade 4\nWin a trip\nWin a a whip\nWe don't give a shit\nWelcome to the realms of the infinite!\n\n", "album": {"title": "Mo%27_Mega_(2006)&&2313", "genre": "Hip Hop", "year": 2006}}, {"title": "The Now", "href": "The_Now&&5623", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Daddy's got a new life now\nA new daughter and a new male child\nA new swagger wid some real style\nNew car new house brand new spouse\nLittle shitty dog named Pouts wid smile on his mouth\nWe'll be straight up we're forgotten cause developed a plan\nOnce the monkey takes some time to hang with his own fam\nHap' and gay to let ya know he still cares and such\nYa won't grow apart too much from bein' outta touch\nBut he wasn't there for him on the daily ghetto basis\nIn order to drop jewels I stay clear of the racists\nHeavy promises became weightless\nSincerity became faintless\nHe's praying for a Santa A-list\nTime is passin' by yet his scars remain ageless\nHe called him on the phone to say pop's\nThis'll take a minute of ya time\nBut his wishes were divined\nBy the disenchanted tone at the end of the line, hang up\nHe tried to look strong in front of mom back up\nJohn stop lookin' forward to the day you gonna see him on\nDry ya eye to eye and you'll receive an embrace\nFrom a lost heart that's pumpin' blood up to a guilty face\nHe's gonna try to find ways to make up for the last twenty nine days\nOr was it thirty, I think he heard me\nIn situations like this ya speech becomes wordy\nHe's got a hundred million ways to tell me not to worry\nBut this time I wasn't hangin' on his every sentence\nEars crippled by the pain and negligence so was the tendence\nHe spoke I couldn't hear a word I zoned into black I observed\nMy only thoughts were missin' out on love that I deserved\nTryin' to convince myself I'm weak within the mental\nThe silence breaks because your father's guidance is essential\nHe's lookin' down with a smile sayin' that the future will be great\nI don't see that dad, but what about the now?\nJohnny come and leave ya dad alone now\nYeah it's just you and momma now\nStop the cryin' now, just try to smile now\nTry to think of other things now\nMomma's got another date now\nYou can get through all the anger and the hate now\nCalm down and wipe ya face now\nI know it seems to be hard\nBut I promise you we'll make it through somehow\n\n*Scratching* \"And now\"\n\nLittle girl their firstborn their sunshine\nNever been a reader wrong get it right one time\nHere's how it goes, she's off to school an' dancin' on her toes\nAt an hour long ballet class then on to the piano\nTwo hours of repetition, emulatin' class with music compositions\nDo your homework with precision\nBy nine-o-clock she collapses in a heat of dizziness\nBut sleep so tomorrow you'll repeat ya busi-ness\nShe got straight A's a stroke of her stress\nThroughout her maydays but drawn up out the melees\nHer mom and dad tryna blame each other different ways she stop and gaze\nThinkin' how it drives her crazy when their voices raised\nThis the web that ruins most of her days\nFrom her perfection was expected\nAn exec that workin' hard without receivin' any raise\nAt night she cries when she lays\nThen she wakes up, washes up smiles and goes along like it's okay\nOn to high school, there's more intensity within her cycle\nShe's makin' all the guys drool\nHere comes the extra tight rules\nNo late, not with college on the plate\nPractice hard, study hard stay in focus keep ya head straight\nNow she's a nervouse wreck, lookin' to collect\nAnything that she can smoke swallow drink or inject\nWhen she was mentally gone she went to the prom\nHad dates and actually could sit down\nDiscuss relationships with her mom\nBut tell me how much pressure can a person take\nBefore they break and maybe crush this on a large enough escape\nSo one night she turned in but stayed up late\nAt her desk with a single piece of paper and a papermate\nHere's mom a federal team waked at daybreak\nWhat she saw made her knees shake the death of dear Kate\nThe note said here's the future of your fuckin' perfect child\nPlease be proud I'm livin' for the now\nDo your work, clean your room now\nTake the makeup off your face now\nEat your dinner now, get off the phone now\nLeave the boys alone now\nSaturday night, you stayin' home now\nGo to your room and sit alone now\nKatie with the needle how\nLook baby momma needs you now\nBreathe now, God why did this have to be now\n\n*Scratching of line* \"And Now!\" (until fade)\n\n", "album": {"title": "I_Phantom_(2002)&&1109", "genre": "Hip Hop", "year": 2002}}, {"title": "Earthcrusher", "href": "Earthcrusher&&7011", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Earthcrusher\n\nAt last, the day of the blast\nDisaster, welcome to the hereafter\nGovernment powers in conflict\nIn a world gone sick\nAnd they're heavily equipped\nWith arms to melt down cities and farms\nThe final stage witness the force of pure rage\nWhile we were all at work\nTrying to earn a wage\nThe targets are on lock\nThey're ready to engage\nFinally to put to use all of those years of bomb testing\nAnd biological questing\nFor better ways to destroy and torment\nNow let's feel what we've chosen to invent\nBlast off! Everybody stand clear\nMissiles are in the air to sever and sear\nThugs, executives and cops with tazers\nTrees are dust, skyscrapers are vapors\nI'mpact! Now nothing is intact\nTake cover, we're under attack\nDelivering oblivion, one already hit\nBut look out, here comes another\nEarthcrusher!\n\n\".\nThis is what we always feared could happen\nBut never dreamed it would\nNuclear holocaust\nAlready hit China, Korea\nNext destination: Japan\"\n\nNapalm scorched your backs\nAnd you ask where your tax dollars went to\nSo now they have sent you\nA demonstration, devastation\nFour billion degrees of presentation\nCourtesy of some major corporations\nYou might have had stock in\nBut money can't stop the toxin\nThey crippled your frame while you were walking\nNow your mouths frothing\nInhale, poison has replaced oxygen\nYour heart contracts, aorta snaps\nLungs collapse\nFluid exiled of urinary tracts\nIn this atmosphere to which nobody adapts\nNo more petty crimes, nickel sacks\nRap shows or raves\nSunshine and bullshit holidays\nJust radiation and tidal waves\nDeath to the modern day slaves\nRunning down the street with our arms raised\nAtheists now give praise\nThe sounds of nuclear bombs\nWhistle right past my ear\nHeaded towards Zaire\nMany have died, but you better believe\nThat more are bound to suffer\nEarthcrusher!\n\n\". 52 seconds since the last attack\nNearly a quarter of the earth's population wiped out\nAdded to the list of countries hit: Africa, West. uh, yo\nI really don't know what's going to happen\"\n\nWe support this through silence and complacency\nWhile our government ruled the world under masonry\nMade every nation regret their adjacency\nBrutal hostility, now we're facing the\nWorst burst of energy ever unleashed\nI could have sworn I heard them say that they wanted peace\nA quarter of the population is fully deceased\nIt's gotta cease, blood rush, my anger increase\nForce, with no remorse\nThey need diffusion, knock 'em off course\nAbout to unleash my own brand of holocaust\nGimme an ear mic, I'll start the air strike\nAimed at those who chose to\nSacrifice our lives 'cause they're uncivilized\nSurprise! Headed for the center of your eyes\nForty thousand megatons from my lungs\n*Whew*\nMy attack is stunning\nWhere the fuck are you running?\nIncoming! World wide assault\nI take out the US Government and then Russia\nEarthcrusher!\n\n\"This just in, uh. New Zealand hit. Australia\nI don't know what's going on. *screaming*\n. Is this the US? Yeah, I know we got\nMissiles on the pa-\"\n*BOOM!*\n\n*Rumbling* Oh my god\n\n", "album": {"title": "I_Phantom_(2002)&&1109", "genre": "Hip Hop", "year": 2002}}, {"title": "Return of the B-Boy", "href": "Return_Of_The_B-Boy&&2660", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Seconds after I have been swept off my feet\nOpen through the doors and in steps the beat\nComplete with medical packs and four fours\nLooked at me and said \"Damn this nigga need God&amp;\"\nBored, apart in the streets he got beat\nThe meat, a disenfranchised he left wheat\nMe, these images I couldn't ignore\nPersonas of the rhythm who just walked through the store\nThis man's slim, sported a red glim, noticing damage within\nWe remove bullets and pack skin\nThe kickdrum slur reopen my eyes, he say don't worry\nAt the clerk he say don't fire rounds in the flurry\nAnd I have bad, tied the hostages with his gat\nTold 'em break the fuck out and never look back\nThey have the form like Miyagi for the kamikaze\nThen they got me walking out pass the local paparazzi\nI see y'all re animated, sure kick get damned a flavor\nWe came to save ya and we came to, pull back the data\nI repay a major situation across town, my music is lost sound\n'Cause they had us locked down.\nThey meaning sucka rappers had us heard past\nComic clowns who be making shit sounds and laughs\nThen they facing masteries, just fittin' lack of pieces\nWhat's dope and hope that we accept the wack atheists, Jesus\nWhere's the chamber? Allow me the become the scum rearranged uh\nThey said \"focus ya anger\" and bring the rhymes that you wrote\nBecause these folks will hang ya\nI accepted their concerns turn to him and said\n\"Fuck that written shit I'll flip that kid off the head\"\nWhat about the feds? Ayo we left them a decoy\nWe didn't want the beats to know we brought back the B-Boy\n\nHip, Hip-Hop (I'm a bring it back)\nHip, Hip-Hop (I'm a bring it back)\nHip, Hip-Hop (I'm a bring it back)\nHip, Hip-Hop (I'm a bring it back)\n\nHip hop is so wack, the beats are fighting back\nAnd I was sent to attack, so I'm following the map\nX's mark the rappers out with two head with\nFerocious cademies that only need with the next spliff\nStep by step I'm headed toward the set to analyze the threat\nAnd make him regret, the day that we met\nI suspect he got a smooth box, I head into the rooftops\nWhere I'll make me strategy so I can splatter them\nThey were only half of them, five less rappers alive\nSo we can vibe the stand and then, dope they didn't coincide\nThey were half religious, and vicious, with dark wishes\nWhich is to assure the core of hip hop which is snitches\nI dropped dimes on how to travel back in time\nSo they can melt and miss the nine pioneers patterns to rhyme\nAnd I'm furious, seething at what I'm seeing\nSoon those niggaz won't be breathing\nI've seen what I got so I'm leaving\n'Cause I wanna, set up to stop up for the evening\nNiggaz hopped on my shit-list with a swiftness\nI'm about to rip this, come fear witness\n\nHip, Hip-Hop (I'm a bring it back)\nHip, Hip-Hop (I'm a bring it back)\nHip, Hip-Hop (I'm a bring it back)\nHip, Hip-Hop (I'm a bring it back)\n\nHip, Hip-Hop (I'm a bring it back)\nHip, Hip-Hop (I'm a bring it back)\nHip, Hip-Hop (I'm a bring it back)\nHip, Hip-Hop (I'm a bring it back)\n\nMic Check!\nWe had ill static, over illmatic, I reached for it\nThis nigga said I couldn't have it\nSo tragic they try to counter my magic, I'm rabid\nI reached for his fuckin' face and grabbed it\nNigga, how the fuck did you figure\nYou can Interfere with the music so potent\nThat I need to just go for a moment\nBefore I moved on.\nThen I heard two songs\nSpit flavor from those head up the 36 chambers\nI'm about to bring this nigga danger\nHe was elusive, an Uncle Tom carry a nuisance\nStrong and spiritually useless\nI gave him flashbacks, of niggaz gettin' treated like lab rats\nBeatin' with sticks and straps\nHidden with conscience, held a mirror up to his face\nThe motherfucker jetted out of the place\nWho's next to get me vexed this rapper making idle threats\nClaiming that he got contacts, I stepped to him slow\nLooked deep in his eyes, see another person was within him\n'Cause he's living a lie\nA rap nearly operation\nTold him that man was not meant to leave earth's population\nThese talks left him pacing, now he suffers from brain disintegration\nNo thoughts or information, it started raining visibility low\nThis had no effects on my abilities though\nTo murder an MC is standing procedure\nLooked and see this cat gone follow the leader\nBut I'm a cheater, the abdomen and chester leader\nThe primary feature, my intense earth to to bleed ya\nAll this blood stream, and I'm steadily aiming\nTo find the next nigga for naming\nThat's when the death sticks came in, hand me\nThis mega large nigga tried to brand me\nI thought the mega blast to enemies\nThen my mind aged to centuries\nFuturistic data, for a complex matter\nThis power left to cater, I can compete with the equator\nSmiled I can see him through the earth's vapors\nLooked him up and down, as we walked toward solid ground\nWhat mind, jaw dropped looked what I found\nClassics like Tribe Called Quest, De La Soul, EMPD and Run DMC\nBut when we get three feet\nCriminal mind takes a nation a mill, Time to kill\nRun DMC self titled, this nigga my arch rival\nSurvival, not liable, got up close and what I signed couldn't believe\nMy enemy was a genetic replica of me\nThat means self is the biggest tour\nIt could me the bigger fall, a truly vicious type of war\nSo now I'm thrown off, taken back to back, I didn't know how to react\nTo lack a plan of attack, but it was in full effect, connect\nHe didn't affect my intellect, but thoughts I couldn't accept\nImages of my grandmother in that old folks home\nBecame Very vivid in my dome, this method of rap is telepathic\nDamage of my mental fabric, hell a vibe or I have it\nCriminal I can't stand it, or understand it yet my torture was expanded\nBy thoughts that he commanded, had a vision of my uncle sitting down\nBy himself, meanwhile he's breaking down my physical health\nChronicle inseparable thoughts, to my head\n98 percent of which were absorbed by my dreads\nThe other 2 percent I accepted, just so I can feel the heat again\nHad a vision of my defeat of him\nSo now I'm back, strapped and intact\nIncreasing my brain waves to maximum impact\nThoughts were unholy, slowly up he looked me up and down coldly\nLike I'm the motherfuckin' chrome be\nAnd I am damned I dropped the mic from my hand\nSaw some open land so I ranned\nBut as the gem has past hearts, my man had blast shots\nBlood clots stopped circulation from my nog\nMy ego's dead my humiliation to mumble feeble shit\nSuddenly had a dream of desert eagle clips\nSo who's me, maybe this Uzi, cold hard and steel\nWith a sign that says use me\nI call on Susie, and tell what you see\nUsually, I wouldn't let a biter confuse me\nMuch of this instance, make a difference\nSo started to think with, the innocence fit infants incents of incest\nBurn in incense, I'm intense\nFunny how the powerful scent just dents his senses\nDon't even comment on the senses, I sent this razor sharp tone\nTo relentless, sequences that leap fences\nBeating all human kind to defenseless\nSo I shift for, never sick for\nWith a swift sword, clipped and flipped this mic for\nSpeechless, never with weakness\nHe tried to use the heat of his desire to beat Lif\nBe my guest, take a guess who was left to mess\nAnd at peace request\nI summoned the sun to burn a hole in his chest\n\n", "album": {"title": "I_Phantom_(2002)&&1109", "genre": "Hip Hop", "year": 2002}}, {"title": "New Man Theme", "href": "New_Man_Theme&&6952", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Now this is my escape from many things on many levels\nI couldn't settle the pedal these are words of a rebel\nCome and dance with the devil in the bloody meadow\nThe ground is metal from the armor of a soldier's medal\nI used to revel in the ways that were before me\nGo to school get a job c'mon you know the usual story\nI was 18 and just about to hit the college scene\nOn to Colgate, considered it prestigious and pristine\nWhat I mean I was told that in life there's a goal\nAnd this goal, those without it die unhappy and cold\nAnother unwritten code, a savage story that's told\nBy the media, the medium by which were controlled\nIt doesn't benefit the spirit or the soul so when I enrolled I went bold\nHere's the list of things I wanted to know: MYSELF\nAnd a list yet the jest professors are pissed tally up the classes I missed\nBut I did read books, opened up my mind, took a look within\nNoticed hip hop was oozing through my skin\nCut my demo at the end of '94\nAfter hustling to get loot, troopin' far and sleepin' on floors\nWent to college as an athlete, was feedin' a fade\nAnd came home as a dread who used his pen as a blade\nDid I make the right decision; well my folks don't think so\nI let them down I'm in my room I'm locking my door\n\nNew man\nI'm black, strong, intelligent man you ain't steering me wrong\nNew man\nI got heart, skill; follow my collar drop knowledge and build\nNew man\nThey can't hold me back, they can't hold me back\n\nMy once beloved room became hell; burning flesh is the smell\nThe temperature rose, my self esteem fell\nIn the morning I would rise to get some cereal\nThen return to my torture quarters for my slaughtering burial\nParalyzed by the tears from my fathers eyes\nCouldn't even raise my head to know the somber skies\nMom and I would sit and chat about me getting \"back on track\"\nShe'd leave, then I'd crawl into my lack of confidence trap\nWhat a vicious format\nThe system sets parameters for livin'\nBy using tunnel vision funneled to the money system\nAds are dads, sitcoms are moms\nDollars are our legs and arms, and our heart is a bomb\nDetonate if you hesitate to slave or matriculate\nYou'd better participate, survivals your interest rate\nFinancin' is Manson, hopes are held for ransom\nPowers dance and sorrows the anthem\nWell, let's return to this point in time where I'm\nStanding next to my ex job's \"Help wanted\" sign, you'll find\nMy mind overflowin' with adrenalin and energy\nI infuriated my enemy with my integrity\nEssentially, if you want to work there, don't mention me\nThey'll cut in half your pay and punch your face as a penalty\nI'm self empowered hit the showers, I'm on the road\nI'm goin' to the club, I'm out my crib, I'm lockin' my door\n\n", "album": {"title": "I_Phantom_(2002)&&1109", "genre": "Hip Hop", "year": 2002}}, {"title": "The Fries", "href": "The_Fries&&4413", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Go to the beach\nAnd realize that you got a scanline across your tanline\nAnd find microchips in your hands\nFluid in your grands\nAs a result of somebody else's plan\nThat nobody really understands\nEven though it spans across lands\nAfrican soils, Arabian sands\nIt's airborne yet it seeps through dams\nA new disease that you caught at Mickey D's\nIn your Quarter Pounder with cheese\nOrdered with ease\nSuper size please!\nCan you believe\nPeople ain't even survive through the drive through\nAnd they thought they were live too\nPulling off, pumping Rob Base, stuffing fries in their face\nOver a billion served\nWhat they never deserved\nSo as they drove away they swerved into the curb\nWith their heads on the steering wheel\nKids blacked out in the back with a fucking Happy Meal\nWhat a crappy deal\nBut it was only $4.99\nSo there's more people in line\nYeah, the plan's running fine\nThe parking lot is now a burial plot\nWhere you can park and rot if you can find a spot\nGovernment agents came swooping in\nRemoving men, women and children from the automobile\nWhat a steal\nNow the car's repossessed and sold at an auction\nThe people are dead but the money keeps talking\nProceeds go to building bigger bombs and missile launching\nThe masses respond by just watching\nHere comes the shit talking\nDid you hear about what went down?\nIt was plenty live\nCatch it tonight on FOX 25\nWorld's greatest mass murders\nEntertainment for all living observers\nYou'll probably watch it while you're eating some burgers\nGo ahead and gobble the lies - here's the fries!\n\nThe TV\nThey said the TV did it\nYou see me?!\nI'm in an easy clinic\nThey're checking my health, checking my pulse\nWhat's the result?\nYou've been in a cult with several adults\nOh lord!\nWhat shall I do?\nExorcism!\nHigh priest, unleash three extra rhythms\nHe's shaking and his cells breaking down\nHe skipped town\nWell, it's a manhunt now\nShots deflected\nWhat the fuck you expected?\nThought that I was that disconnected?\nYou're dead, kid!\nWho shall sustain this reign?\nNo one!\nAmerica is run by the few, the chosen\nAnd what's your name?\n\"Fair game\"\nTake aim\nYou can point at who you'd usually blame\nIt's a disappearing act but the structure's intact\nBreaking your back\nHey, I heard a vertebrae snap!\nGot healthcare? - no\nWelfare? - maybe... yes\nIf so, don't move - we could use that flesh\nJust a portion from a failed abortion contortion\nMind sterilized\nWe can't let those thoughts in\nWell, the FDA - they're not here today\nBut the FCC watching what you say\nSo let's calm down and take everything slow\nIf you feel that you must lick a shot then BO!\nFrustration\nLiving in a plush nation\nWanna wash the blood off your hands but you can't\nIt's on too thick - too many trips overseas\nTo disarm bombs or spread a disease\nYou got it?\nI got it?\nEpidemic!\nPanic!\nWidespread!\nNine dead!\nDid we lie down and pull the covers over our heads?\nGod damn it!\nGobble up the next planet!\n\n", "album": {"title": "Mo%27_Mega_(2006)&&2313", "genre": "Hip Hop", "year": 2006}}, {"title": "Phantom", "href": "Phantom&&1958", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "(LIF)\nCheck it out\nI been waitin', playin', for a long time\nX amount of thoughts carried out in my mind\nI turn on the TV, I see crime\nScript written diligently and aired on time\nPush the power button, now to devour somethin'\nOpened up my fridge and found nothin'\nDipped to my room with an aura of gloom\nWishin' I could write another tune\nBut my hands are paralyzed, plus my eyes\nWanna shed tears, but it's not possible, there's\nThe burden of things I couldn't bear\nFeelings weren't dealt with properly\nRemorse follows me\nWith his good friend, the threat of poverty\nHere's where I am, versus where I think I oughtta be\nThere's a certain chance I'm a victim of circumstance\nI take a look at myself and at first glance\nI see who I recently thought to be me\nBased on identities public and private\nBehold the radio pirate, ya nigga\nA felon, chillin' with a gun to your melon\nA pimp with his pockets swellin', a jester\nA slave with wounds that fester, the wanna-be\nPre-med 3-D dread an academic reject\nHopin' to detect life, erect what god gave\nHuman laws are laid, we go to war, come back\nAnd come up with more\nI'm kind, friendly, your worst enemy\nCharming, crass, and potentially\nDangerous, have you ever heard of such?\nI'm invisible and impossible to touch\n\n(EL-P)\nThis is not my beautiful melting identity\nThe thoughts that I can't manipulate for the safe line\nIs personal, one amongst many is the macro,\nMade from the pain of the fragile\n(Repeat 3x)\n\n(LIF)\nI still say fresh dope and things of that sort\nI don't shoot up, smoke crack, or take shorts\nYour thoughts are always welcome, I seldom\nWon't enter another's perspective, corrective lenses\nAre somethin' that I wear, so I can see the globe real clear\nLook, there's famine over there, plus the families in fear\nOf disease and distress that lingers in the air\nThese are the words of a man in purgatory\nWords of a simpleton living in oblivion\nIs this the model for life you will envision in\nFree as can be in a world of imprisonment?\nI dare you to check new territory\nAmerican dream? Time for another story\nOne where I don't choke to keep afloat\nI'm sick of livin' on false visions of hope\nWith a knife to my own throat\nStick of dynamite inside my overcoat\nBecause I know the ropes\nReality in this world is bought and sold\nA very limited scope of life is shown\nAnd I'm just one of the mold, fully controlled\nLeft to erode in my humble abode\nYou won't hear me because I got no loot\nYou don't hear me because you don't compute\nI'm docile, psycho, have you heard of such?\nI'm invisible and impossible to touch\n\nSingle mother, who are you? (I phantom)\nOffice worker, who are you? (I phantom)\nCaught up in the system, who are you? (I phantom)\nTryin' to earn a living, who are you? (I phantom)\nDepressed and uninspired, who are you? (I phantom)\nHard-workin', broke and tired, who are you? (I phantom)\nSeekin' education, who are you? (I phantom)\nCan't get ahead no matter what you do? (I phantom)\n\n", "album": {"title": "Emergency_Rations_(2002)&&9074", "genre": "Hip Hop", "year": 2002}}, {"title": "Home of the Brave", "href": "Home_Of_The_Brave&&89", "artist": {"unique_name": "Mr._Lif"}, "lyrics": "Now let's talk about self expression, true expression\nOpen your minds without question\nNo doubt, tell me what you're thinking about\nLet's try to set aside pride and clout\nCan you believe I feel the same exact way you do?\nYou truly do believe these modern ways have fooled you\nSystems exist so we never meet each other\nPretty soon from now that I'll long the word \"brother\"\nAnd that's true if they see you walking with a crew\nIf you don't know, that means more than two\nI'll tell you what they'll do\nThey'll pull over, hunt you over\nKick your ass, nightstick to your shoulder\nI know it's unjust, as if it wasn't enough\nIf you try to fight back they're locking your ass up\nAnd Chuck already told you that a cell is hell\nBut I'm waiting for the phone so I'll sit for a spell\nCall the guard, tell him I'm a piece of God\nWith no beliefs in his streets or his boulevards\nI eat, read so my mental is hard\nAnd the heat from my anger just melted the bars\nThey reach for their guns so I put them to sleep\nBreak the chains and put the shoes back on my feet\nHe's on the loose with no discernible scars or marks\nJust the mind of Mandela and the heart of Rosa Parks\nSo I dip, time to see the governor and mayor\nTell them life ain't fair and see if they care\nWell they do, but only if they are the heir\nSo they appear to have a heart and make a flair\nBut they haven't done shit for us and that's a fact\nTheir only function is to keep the funny money where it's at\nAnd it causes pain, stress\nAsk me if we need a different way of life (yes)\n\nHeadline: Bush steals the presidency\nHe needs the backing of the media what could the remedy be?\nThe country's headed for recession reminiscent of the Great Depression\nAre lives worth a world of power? Easy question\nPlanes hit the towers and the Pentagon\nKilling those the government wasn't dependant on\nIt's easy to control the scared so they keep us in fear\nWith their favorite Middle Eastern demon named Bin Laden this year\nBush disguises blood lust as patriotism\nConvincing the living to love \"Operation Let's Get 'Em\"\nBut when he realized we don't support their attacks\nThey needed something to distract, hmm, anthrax\nThis further demonizes Afghanis\nSo Americans cheer while we kill their innocent families\nAnd what better place to start a war\nTo build a pipeline to get the oil that they had wanted before\nAmerica supported the Taliban\nTo get Russia out of Afghanistan\nThat's how they got the arms in\nThey're in a war against the Northern Alliance\nAnd we can't build a pipeline in hostile environments\nHere's what your history books won't show:\nYou're a dead man for fucking with American dough\nThey killed several birds with one stone\nWhile you're at home with anti-terrorism up in your dome\nBut my eyes are wide open and my TV is off\nGreat, 'cause I save on my electricity cost\nAnd you can wave that piece of shit flag if you dare\nBut they killed us because we've been killing them for years\n\n", "album": {"title": "Emergency_Rations_(2002)&&9074", "genre": "Hip Hop", "year": 2002}}]