[{"title": "Mafia Convention", "href": "Mafia_Convention&&9235", "artist": {"unique_name": "Mr._3-2"}, "lyrics": "(*Talking*)\nHa-ha 2001 Mr. 3-2, boss of all bosses bitch\nThought I was going somewhere, motherfucking right\nI'm going to the god damn bank, know I'm saying\nKeep on talking down, you gon have a dick in ya mouth\n\n(Mr. 3-2)\nTalking shit, will get your ass kicked quick\nFucking with the G-O-V, nigga I'd do the hit\nImmigrate ya misplace ya, now they can't find ya\nPrincess cut invisible set, gon blind ya\nBoss of all bosses, number one mob boss\nAnd everybody wanna know, what Mr. 3-2 brought\nFuck my head a couple times, I'ma chunk it up as a loss\nThey screaming like it's the end though, I'ma fuck ya off\nFrom the North to the South, I demand my respect\nMan I'ma wreck, but ain't no plex\nLike dead for a motherfucker, to call me out my name\nGovernor down South, Southerner Street Game\nEverything's gravy, baby we in the do'\nSo I'ma get it while it's good, even break a couple do's\nReal playas get chose, swang down on 4's\nAnd I got more broads, than Versacci goglows\n\nThe mafia convention, is some shit I gotta mention\nBoys talking down on my name, like some hoes they be bitching\nI'm just itching, ready to scratch\nBig ol' heavyweighter, so it ain't no match\n\n(Mr. 3-2)\nReady to scratch ready to snatch ya, out of the frame\nI ain't bout to leave ya no fame, so I say no names\nUse to be my ace Boo-Koo, my number one nig'\nBut for that devilish shit you did, I oughtta kidnapped ya lil' kids\nGet rid, of your ass forever\nDelete ya mistreat ya, and teach ya with the Baretta\nBoys is scared of, Mr.-Mr. 3-2\nSipping on green mixed with rootbeer, A&amp;W\nShow my raw naked ass, on stage for real\nFucking with that Killuminati, Donny smith steel\nNow I chill kick back, counting hundred dollar bills\nWhat's the deal pop the seel, ride down on ya like it's kill\nX pills and hydro ponic, blowing a hunk of chronic\nNobody know where I sleep bitch, ya can't find me\nEvery major wanna sign me, I'm thinking seven or eight digits\nGreedy for the green, I gotta have a couple of mill tickets\n\n(Mr. 3-2)\nLoyal to my people, I call family\nThe ones who got love for me, unconditionally\nListen to me, the S.U.C. we clicked up\nPlay pussy in these H-Town streets, ya get bucked\nOn the come up, staying down\nSouthside mobster, connected underground\nOut of town networking, putting up clientele\nWe the shit fucking your bitch, and got the whole sale\nOh well we shot calling, triple balling moving fast\nIn these days of the last, that they hated on the mash\nI want it all and then some, living like a savage\nDon't play ya games at all, down and dirty for the cabbage\n25 point of karats, glassy ice on the piece\nEight thousand dollar drank, lost it in the streets\nI know the shit weak, that was out of control\nPlay with me if you want to, I'ma knock you out and go\n\n(*Talking*)\nTwo dollar gangsta ass niggaz, rotten ass hoes\n\n", "album": {"title": "The_Governor_(2001)&&1802", "genre": "", "year": 2001}}, {"title": "Don't Play", "href": "Don%27t_Play&&1634", "artist": {"unique_name": "Mr._3-2"}, "lyrics": "(*Talking*)\nY2K-1, the game has just begun\nGo down, S.U.C. don't play won't play\nAll day hogging, better get it\nGo get it, and come back with it\n\n(Mr. 3-2)\n2001, living in big houses big Benzes\nMr. 3-2, gon get paid to the ending\nMind on winning, big faces spending\nThe thug life of men is, mashing but no chicken\nYellow bone women, or the sugar browns\nSweet blacks, bring my stacks back from out of town\nYou know how I get down, real down and dirty\nMafia lifestyle, I don't think that you heard me\nWe gangstas still moving birdies, till thangs get better\nCheddar recognize cheddar, I'm a big head go-getter\nIn any kind of weather, 'cause I'm a universal playa\nAble to blend in, in the ditch or anywhere\nBaby I'm a baller, you ain't recognize that\nI stay looking good, and my bank account fat\nSo pull out the red plack, I'ma take my respect\n'Cause I'm real to this game, a true O.G. vet\n\nWon't play, don't play\nNever did, ever since a little bitty kid - 2x\nMob with us, or get mobbed over\nYou should of listened, to what your mama told ya\nMob bosses, accepting no losses in the struggle\nLet your mouth overlook your ass, you in trouble\n\n(H.A.W.K.)\nDon't play, won't play never did\nSplit your wig, smoke a cig\nDo you dig, what I'm saying I ain't playing\nI'll get the gat and start spraying, so start praying\nGun in my lap, as I quietly creep\nI'm bout to roll down the window, and put the whole block to sleep\nI'm playing for keeps, I'm in this shit to win\nLike a gauge spinning slugs, straight through your abdomen\nA right cross through your chin, God forgive me for my sins\nBut niggaz don't comprehend, that I don't have no friends\nRepresenting Dead End, till the casket close\nAnd real playas get chose, but fuck these nothing-ass hoes\nH-A-Dub-K, till I'm old and grey\nAnd if you get out of line, it's may-day may-day\nYou better move out my way, when you cross me in these streets\nOr back-back back-back, and give me fifty feet\n\n(BZE)\nWon't play don't play, never did my nigga\nHogging since a kid, my nigga\nIn your face with Street Game, B-Zo got official\nGulf Coast Texas raised, rich nigga\nThat's that nigga untamed, with my partna Jack Tripper\nThat really don't play, run around with a gauge\nTo get that AK, nigga top done raised\nPut on them Gucci shades, up on it displays\nWe don't play never did, pop the lid it sooths the soul\nH-A-W-K, make 'em pay the toll\nSouthside still hold, you niggaz and bitch no friends\nThat's straight from my T. Lady, straight to my kid\nI won't play cocked and ready, from my partna Hard Boy\nFor realer life Street Game, nigga that's my entourage\nDon't forget about my click nigga, they stay on the thoed\nI won't say your name nigga, you know how it go we don't play nigga\n\n", "album": {"title": "The_Governor_(2001)&&1802", "genre": "", "year": 2001}}, {"title": "Boss of All Bosses", "href": "Boss_Of_All_Bosses&&2411", "artist": {"unique_name": "Mr._3-2"}, "lyrics": "(*Talking*)\nThat's what it must be, that's right\nYeah, as I walk through the valley of death\nI shall fear no evil, or no man\nBut God is on my side, and with the Governor I'll ride\nThe boss of all bosses, and we ain't taking no losses\n\n(Mr. 3-2)\nI control that shit down South, so what's happening what's up with ya\nMr. 3-2, the new down South Governor\nWhite sheets cover ya slugs smother ya, it's a mafia hit\nAin't no stopping this shit, then you got's to die before you can get out the click\nWe profit in chips, moving around worldwide\nMy hustles grow and expanding, put our paper off a side\nReady to ride, and do dirt if I gotta\nUnload a seventeen shotter, got the Bentley Rolls dropper\nSipping muddy codien and leaning, the world is mine\nTrace a generation, nothing but killers in my bloodline\nIt's redesigned fuck and split the mind, to take over\nLoose lips sink ships, so motherfucker I'ma show ya overthrow ya\nI got these broads, up under you understand\nWhile you falling in love, the whole time I'm peeping your hand\nLil' broads bring the grands, and keep a G stack\nBut ain't no reason for the treason, I'm just a Governor like that\n\nThe boss of all bosses, down Southerner\nMr. 3 to the 2, the Governor\nGhetto politician, go and vote for me\nCause my whole cavulry, represent reality\n\n(Mr. 3-2)\nI'm a fool, so I act a fool on the track\nCut boys no slack, put bullets in they back\nUp close I could smell ya, blood splatter over me\nKiller for real, it's the G-O-V\nI got down and say, Vatos waiting on the word\nTo fuck boys off, over respect and birds\nI calm my nerves, but brain relaxer\nIt's the bill collector, and I'm a real bad actor\nBig blades on a tractor, chopping up the South\nAll the way to the East and West, yes they know what I'm about\nAll my cashers let it shout, if you feel this heavyweighter\nPieced up creased up, a million dollars later\nYou feel the do' maker, nigga like me\nIn this new millennium, the year 2G\nWho I be, S.U.C. my family to the end\nHope I don't hit the Penn, but if I do it's on again\n\n(Mr. 3-2)\nThrowed off connected, and I'm from the old school\nI lay down the law, and what I say rules\nStart busting with the tool, on them niggaz who be hating\nAin't nothing fly 'bout me, but my conversation\nAsk your lil' mama, or your main thang\nBout Mr. 3-2, CEO of Street Game\nLet the AK's rain, fully automatic assault rifle\nTrying to get my life right, and live by the bible\nIt's a thin line, between your body and a hundred pounds\nToday it's all good, tomorrow you six feet in the ground\nI'm out of town, with a broad that's fine looking jazzy\nWhile your whole family in black, carrying your casket\n\n", "album": {"title": "The_Governor_(2001)&&1802", "genre": "", "year": 2001}}, {"title": "G.O.V.", "href": "G.O.V.&&4340", "artist": {"unique_name": "Mr._3-2"}, "lyrics": "(Mr. 3-2)\nRaw and uncut, straight off the press\nI got a whole lot of shit, on my chest\nA vest won't save ya, from the slugs I'ma shoot\nStill the same nigga, God first then the loot\nG-O-V, you better respect me\nIf you respect living, nigga I hold the key\nTo life, it's wicked and shife of my situation\nSo bitch I do what I gotta, to get to my destination\nNiggaz hating you know that, but I'm still gon ball\nPockets overstuffed, trying to tear down the mall\nY'all tripping think I'm slipping, on my game\nWith a platinum piece and chain, hitting million dollar stangs\nLegal, you looking at the Chief Executive Officer\nMr. 3-2, the Governor Boss that's bossing ya\nLossing a, six hundred B-E-N-Z\nIn the year 2001, it's the\n\nG-O-V, that's me\nReality, is a must to me\nIt's the G-O-V\n\n(Mr. 3-2)\nNigga come on with it, bitch what ya tal'n bout\nWe could fuck it up knuckle up, or bust guns shots\nYou're hot and stressed out, but better not stood up\nThese motherfuckers, got the G-O-V fucked up\nHoe what's up, on my god damn paper\nYou prolly done tricked it off, 'cause you's a bitch by nature\nBitch by nature, nigga that's you\nCome short, what's in it my issue nigga I'ma sue\nNigga fuck you, and everything you stand fo'\nI showed love, and you actually tried to play me like a hoe\nNo bullshit, playtime's over\nMob with S.U.C., or get your ass mobbed over\nAll in your face, but Street Game going FED\nGetting head stacking bread, with J-Money and Infrared\n'Nuff said, cause boys don't like it already\nBut they can kiss my ass, and eat a dick I said it\n\n(Mr. 3-2)\nSouthisde playa, run through my blood and bones\nMr. 3-2, Fat Pat and Michael Dirty Corleone\nI'm the dirtiest of the dirty, in the Click\nDon't trust me round ya chick, if you love that bitch\nI made a switch had to change, to make some change\nNow I'm the big Boss, that call shots at Street Game\nThat's my name that's me, 360 degree\nI'ma bite scratch ya, got to get to the top of the tree\nQuit blocking a G, onto the V goal tending\nFuck all you fake motherfuckers, bitch I'm bout winning\nI ain't spending, or tricking with broads that's a no-no\nI laugh it for the doja and drank, fa sho though\nSolo riding fo' do', Cadillac Deville\nGotta holla at that H.A.W.K., mobbing nigga on the real\n'Cause if it pop off, I know he got my back\nReady to bring hat, for whatever it's like that\n\n", "album": {"title": "The_Governor_(2001)&&1802", "genre": "", "year": 2001}}, {"title": "Royalty", "href": "Royalty&&3820", "artist": {"unique_name": "Mr._3-2"}, "lyrics": "Copper platinum, silver and gold\nEven with lint in my pockets, I'm still gon hold\nSitting swoll down South, diamonds in our mouth\nWe gotta put it in your face, just to show you what we bout\n\n(Mr. 3-2)\nPlatinum tongue, platinum game platinum speaking\nPimping the streets, over these beats I'm freaking\nThugged out Iceberg, Gucci and coochie\nStrapped up at all times, I can't let these niggaz do me\nTaking this gangsta shit truly, keeping it playa\nGovernor of this rap game, the Boss Man with long hair\nSitting in a Versacci chair, calling shots\nStreet Game CEO, my pockets is addicted to knots\nWe bleed blocks and bust shots, and ride down on ya\nFrom Texas to NYC, all the way back to California\nYou's a goner I got to get ya, straight like that\nSquash the chat, erasing your feature off the map\nWhat's the hap's on my feddy, 'cause I'm coming to get it\nCan't mention this shit cold, but I'm leader ridiculous\nI'm wicked and stay true, to who loyal to me\nCopper platinum silver and gold, representing royalty\n\n(Billy Bad Ass)\nFor the love of this game doing the thang, loving this game\nWho's to blame, bitch read the chain\nInvisible set princess cut, spell my name\nFuck you know bitch, ain't no need to explain\nI keep a thing for aim, flip a V-12 with bang\n4.6 range, riding the South with terrain\nStrapped like Jesse James, the real gon feel my pain\nCheck my veins, and if I knock down the drugs\nCheck my block, and if I knock down a thug\nCheck my glock, it'll be eleven and one slug\nWith niggaz with mean mugs, thinking they seen slugs\nBut I was leveled and seen, with niggaz dicks in the mud\n\n(Billy Bad Ass)\nCopper, platinum, silver and gold\nPimps, killers, dealers and hoes\nIs all I know, riding close and slow from massive cold\nGot licks where I whip's, 36 to 84\nA Street Game contract, like big Shaq shit\nAnd the Governor got my back, for you niggaz with that jack shit\nYou don't know, you better ask\nCause Billy Bad Ass, will get you a toe tag bitch\n\n(Mr. 3-2)\nSitting swoll I'm cold, in this street game I play\nMe and Billy Bad Ass, ready to put work in cause it pays\nPunk watch what ya see, about royalty\nCause you don't wanna cross that line, in your L-I-F-E\nG-O-V, represent the almighty dolla\nFake niggaz speak like hoes, but real niggaz holla\nHolla-holla, if you ain't talking 'bout nothing\nBitch you better move around, get out my face and stack some'ing\nQuit fronting like you the man, 'cause I'm knowing you's a runner\nI'm a 3rd Coast Boss, with my lil' bro right up under ya\nHitting these streets like thunder, in a Benz on cutters\nMean mugging for the world, ready to kill a motherfucker\n\n(*Talking*)\nHa hoe niggaz we fa sho niggaz, kick do' nigga\nSmoke dro, fuck your hoe fa sho nigga\nRunning these broads bitch, royalty is money bitch\nKnow I'm tal'n bout\n\n", "album": {"title": "The_Governor_(2001)&&1802", "genre": "", "year": 2001}}, {"title": "Streets on Lock", "href": "Streets_On_Lock&&5387", "artist": {"unique_name": "Mr._3-2"}, "lyrics": "(*Talking*)\nUh-huh uh, yeah-yeah\n\n(Mr. 3-2)\nMafia boss, I tolerate no loss\nYou heard it from Mr. 3-2, Governor of the South\nBlood in blood out, connected affiliated\nG-O-V and Mike D, underground mob related\nMafia orientated, holding down the Gulf Coast\nCalling the shots controlling the block, it's cut throat\nDirty-Dirty is shady, better have some kind of heater\nRecognize who your family, and don't bite the hand that feeds ya\nI got dimes and senoritas, that's jazzy and bilingual\nLet her mix and mingle, watch the bidness she'll bring ya\nI know the lingo, got the numbers bring it in off the Interstate\nDealing with nothing but weight, and believe me it's all straight\nMaking moves like checkmate, can't be easily persuaded\nThese dummies is outdated, I'm Street Game educated\nOn the action what's happ'ning, when it's going down\nPut the ball in my paw, making boys move they town\n\nStreets on lock, (sitting on top and still mashing)\nGot the hood flooded, in control of the action\n(We going all out blasting, if it come to that)\n'Cause we heated and undefeated, ready to blast back\n\n(Mike D)\nI got the streets on lock, nigga flooded with drug shit\nYou wanna know how I stay rich, 'cause I don't show no love bitch\nIt's pure G's is in the jaw, no more no less\nI'm trying to triple up my figgas, out this block I'm pressed\nMi amigo Raphael Se, out this 9800 Block run\nMe and Threezie be somewhere in Amsterdam, in a coffee shop on one\nFuck the rap game, I need right now money\nI'm trying to peel off on Dotson, a hundred drilling you dummies\nHoes and house on Fondren, punk like the weight houses on Tre\nFumbling and tumbling haze, down teezy pop weight\nThrowing that ensemble, in the paper play 2K\nWe rumbling in the game, playboy the G way\nAnd respect my mind, cause me Michael Corleone\nBoss Hogg Miggity D, a 25 young Don\nAnd when you open that-a, the set vendetta\nSeem young foot on it, to put heat up under your sweater\n\n(Mr. 3-2)\nIsolated, I deal with a selected few\nStay in my circle of funk, and these niggaz is brand new\nEveything's confidential, keeping the code of silence\nWe deep in the streets, involved in organized violence\nBehind tint we riding, checking on my traps\nTurning blocks and corners, with the thang on my lap\nGot people's 'cross the map, ready for shit to pop off\nKill or be dead, snitches heads get knocked off\nThe streets we lock off, top down in the knot\nEverything is everything, but Screw-cial in the drop\nI'm dropping out dirty money, getting cleaner\nWith dangerous flows, on toes like a ballerina\nFelonies and misdemeanors, I gotta duck and dodge\nTo really be the boss of all bosses in charge, my entourage\nIs mobsters, my heritage and tradition\nPassed two generations, and they going to the system\n\n", "album": {"title": "The_Governor_(2001)&&1802", "genre": "", "year": 2001}}, {"title": "It's Rough", "href": "It%27s_Rough&&8171", "artist": {"unique_name": "Mr._3-2"}, "lyrics": "(*Talking*)\nHuh, it get rough sometime baby\nGotta make it over that hump though\nYou know I'm tal'n bout, shit\nEry'body feel that, can't frown on that note ha\nIt get strange and crazy sometimes, ha\n\n(Mr. 3-2)\nShit I'm going through it, trying to deal with it\nIt's a must I go get it, cause my pockets is addicted\nTo Benjamin Franklins, I'm thinking of capers to pull\nIn this screwed up world, where the jail house full\nNiggaz is locked in the game, with nowhere to turn to\nNot even a high school diploma, so what will I do\nLoved by few, and hated by many\nDown on my luck, and nobody offer me a penny\nRemember we sipped Henny, and blowed on doja\nFell off for a second, now nobody know ya\nGotta keep your composure, it's all work no play\nPutting in my groundwork, to see a better day\nStruggling we steady be hustling, to stay on feet\nWhat else I'ma do, baby my family gotta eat\nThat's deep but that's life, raw and uncut\nHow it really go down, this world is corrupt\n\nIt's rough, ya can't give up and lay down\nHad to what, had to raise up out them hard times\nIt get rough, believe me and could always love me\nSituations get crucial, and man it get ugly\n\n(Mr. 3-2)\nUp's and down's, smiles and frowns\nYou got people peeping round, when you broke they can't be found\nOut of sight out of mind, getting myself together\nWriting boys off like letters, 'cause they change like the weather\nDrastic measures I'm taking, when it come down to it\nAttacking drama in the making, and run right through it\nPursue it quick fast, raising up from the bottom\nCause no matter who you are, everybody got problems\nDon't let 'em get to ya, I know at points it's hectic\nJust staying focused keep faith, and put your game in perspective\nFeel my message, now take it for what it's worth\nComing straight from the heart, hitting it where it hurt\n\n(Mr. 3-2)\nI take the good with the bad, bad with the good\nCause you win some you lose some, keep that understood\nIf I could I would, everyday ain't for splurging\nHold on to what you got, stack knots and keep working\nIt's certain, that thangs always get greater later\nBreaking bread with my folks, twerking my money maker\nFakers fall behind, and never catch back up\nThe real remain forever, ashes to the dust\nIt's hard but it's fair, it could always be worse\nI keep G-O-D first, everyday I walk the earth\nFrom the dirt we came, and to the dirt we return\nWhen it's over and done, and this crooked world turns\n\n", "album": {"title": "The_Governor_(2001)&&1802", "genre": "", "year": 2001}}, {"title": "Move Around", "href": "Move_Around&&9205", "artist": {"unique_name": "Mr._3-2"}, "lyrics": "(*Talking*)\nMove around, be bout your way\nDo some'ing, beat your feet baby get on\nDo some'ing, you wait for me get you some currency\nHuh 2-G, go down huh, look feel it\n\n(Mr. 3-2)\nBaby beat your feet, I ain't even trying to hear it\nMove around or be down, I need no interference\nMove around, I got things to do people to see\nPlans in motion, keeping my hands on currency\nMove around, cause it ain't gon fall out the sky\nCats is caught up, playing the game too fly\nMove around, bumping with all that procrastination\nTrying to get over, with all that lame conversation\nBouncing and shaking, you gotta give me some space\nNew era bringing terror, we dropping it in your face\nMove around feel it now, I got everybody tweaking\nCatch the five going live, and worldwide we got 'em peeping\nRoaching and leaching, you trying to scheme on a plot\nI'ma let you have it, with the automatic glock\nYou better get out, if you know what's good for ya\nBe on your way, 'cause I don't really love ya\n\nMove around, if you ain't talking 'bout nothing\nMove around, all up in my face with that fronting\nMove around, be bout your issue or bump it down\nGet in where you fit in, or get left behind\n\n(Mr. 3-2)\nThe spot done got hot, so I gotta move around\nRelocate, can't be in the wrong place at the wrong time\nMove around, city to city state to state\nI got bidness to tend to, and money to make\nMove around, handle what and do what you do\nDon't be bringing that bullshit, round Mr. 3-2\nWho is you, I suggest you turn in another direction\nGo on with that plexing, scratch out and get to stepping\nMove around it go down, we got it crunk with no stopping\nYou think, I don't know some kinda way them people watching\nPaper's the only option, put it all on the line\nGotta hold to a nine, so it's best you move around\nOn the next thang smoking, no joking I'ma shake ya\nOn the flip taking trips, to Cancun and Jamaica\nTake a word of advice, be ready to make a track\nSo never get too comfortable, or live a bit relax\n\n(Mr. 3-2)\nMove around get gone, pass on by\nGive a playa room, taking the piece of the pie\nMove around I'm gritty and known, for boss hogging\nF-150 Harley Davidson, screens hauling\nMove around, quick fast and leaving no traces\nStacking big faces, on my notations\nPapers get cruel, and moves are made\nBy the big ol' boss, G.O.V. I'm Kool-Aid\nMove around, the game's begun and I'm on it\nStarving and I'm hungry, deleting all opponents\nI want it it's mine, gotta have it by all means\nLeaning off coedine, my pockets addicted to green\nMove around, I'm feeling me on how I grew up\nTurn out by this game, now I'm screwed up\nFor life forever, that's how it go down\nAnd if you really sick, come on and move around\n\n", "album": {"title": "The_Governor_(2001)&&1802", "genre": "", "year": 2001}}, {"title": "Tonight's The Night", "href": "Tonight%27s_The_Night&&7697", "artist": {"unique_name": "Mr._3-2"}, "lyrics": "(Mr. 3-2)\nLet's get it started get it popping, g-strings get to dropping\nGo on work your money maker, let me see that ass dropping\nThese broads be bopping, when they see me on dubs\nPulling up big body, valeting at the club\nWhat it is what it was, pimping what it's gon be\nSome dranks and conversation, now she going home with me\nIt's extasy, Mr. 3 to the 2 that's right\nSkip this club that you at, and put this thug in your life\nTonight is the night, girl call it like you want it\nNow boss it I'ma flip it, I'm all up on it\nSome'ing petite, sexy and sweet but pretty sweet\nI like 'em jazzy, classy and nasty under the sheets\nA dog in heat, and we can do it all night long\nWhile I get it and fit it, up in it like a thong\nWrong or right, do what you like you call it\nIt's your world, so go on get it started\n\n(Hook: Big T)\nTonight's the night, leave the club with hype\nTo have a freaky party\nPut a thug in your life, we could do it all night\nGet crunk, let's get it started\n(Do what you like, baby shake it let me see the merchandise\nMama what you working with between the thighs\nLooking like you can do it all night, that's right)\n\n(H.A.W.K.)\nDo what you like\nShake that ass, to the left and to the right\nOnly like it, if the pussy is tight\nWhen you sucking, make sure you don't bite girl that's right\nAnd tonight is the night, I'm gon freak with all you hoes\nGet naked, go on take off your clothes\nYou going home, with no panty hose\nThat's the way it goes\nReal playas get chose\nOpen your legs, and watch the pussy get drove\nGot you hotter, than a motherfucking stove\nYou nibbling all, on my ear lobe\nBout to explode, I keep hitting hard\nHave my penis, touching your spinal cord\nGot you hotter, and screaming oh Lord\nMy game is sharper than a sword\nI really don't bar, tonight is the night\n\n(Mr. 3-2)\nNow let's do it get to it, I ain't fin to play wit ya\nPut it on video, and I'ma snap a couple pictures\nFor my partnas on lock, ass and titties and your cot\nThis freaky dude don't stop, busting nuts in her mouth\nGovernor of the South, I done told you that\nBreaking in a broad back, call me the Fat Mack\nBig pimp hoe layer, and I never ever pay her\nMy number one rule, is the game ain't fair\nA yelling nigga with long hair, it ain't all about fucking\nPlus I'm all about my money, a bitch can't tell me nothing\nBachelor for life, will I ever take a wife\nThug forever, steady trying to get my shit right\nWith a packet full of ice, and a piece that's clean and\nYellows carnails, and sweet Lac broads fiending\nSteady juting scheming, all on the telly\nAnd I'm working it well, that's what all of 'em tell me\n\n", "album": {"title": "The_Governor_(2001)&&1802", "genre": "", "year": 2001}}]