[{"title": "Really Don't Want My Love", "href": "Really_Don%27t_Want_My_Love&&1526", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "(Intro - Ms Jade)\nNow let me count it off, now let me count it off, now let me count it off\nNow let me count it off, now let me count it off, now let me count it off\nNow let me count it off, now let me count it off, now let me count it off\n\n(Verse 1 - Ms Jade)\nYou had me turned out, as a young buck in a caddy truck\nGivin' me dough for air maxes and new traxes\nIt was cool when you let me breathe\nAfter we finished layin' up, you won't let me leave\nDamn I'ma adult now, mammi packed up the belts now\nYou all dumb high off the lie, playin' yourself now\nFuckin' up my groove, watch my every move\nTry and get me caught up, makin' up lies that ain't true\nI can't take this dumb shit, you startin' to irk me\nLayin' all them rules down like you birth me\nShit you the worst B, all try lock me\nEven got both my next door neighbours watchin' me\nYou gotta problem, somethin' that I can't solve wit ya\nI'm at the point were we split I will not miss ya\nI ain't your wife, damn sure ain't your child\nTrees gettin' to ya head, 'cause dumb chick ain't my style\n\n(Chorus - Missy Elliott)\nYou really don't want my love\nAll you do is smoke up them trees\nThen you wanna try to tell me what to do\nWhy you wanna put a little hold on me\nYou really don't want my love\nAll you do is smoke up them trees\nThen you wanna try to tell me what to do\nWhy you wanna put a little hold on me\n\n(Verse 2 - Ms Jade)\nI don't know what's wrong wit you, is you me dude or a detective\nTry to look at it from your perspective, but I can't\nYou wanna know where I'm goin', who I'm seein'\nAnd who I'm meetin', what I'm eatin', what I'm doin'\nWho I'm screwing, not you 'cause I can't stand how you tryin' to run me\nHigh all day, plus you don't really even love me\n'Cause if you did you would let me live, the facts will pop up in your brain\nThat I ain't no kid, and that no man gon' tell me how to breathe\nRight disease type, smoke cloudin' up your mind sight\nThink it's time you try again and get your little dust off\nBust off, now it's time to take the fuckin' cuffs off\nGo ahead, smoke laugh and joke wit ya homies\nBut do me a favour, when you sober don't call me\nI'm finished wit ya, I hope and pray that you ain't bitter\nUsed to have the goods, nowadays you don't deliver\n\n(Verse 3 - Missy Elliot)\nYou think you got me on lock, 'cause when my friends call I don't go\nBut this shit here's gotta stop, you be actin' like I'm on parole\nOh why you trippin', why you trippin', 'cause I can't take this too long\nOh do you call this big pimpin', oh... this is what you call big pimpin'\n\n(Outro - Ms Jade/ Missy Elliott)\nNow let me count it off, now let me count it off, now let me count it off\nNow let me count it off, now let me count it off, now let me count it off\nNow let me count it off, now let me count it off, now let me count it off\nYou really don't want my love\nAll you do is smoke up them trees\nThen you wanna try to tell me what to do\nWhy you wanna put a little hold on me\nYou really don't want my love\nAll you do is smoke up them trees\nThen you wanna try to tell me what to do\nWhy you wanna put a little hold on me\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "Ching Ching, Part 2", "href": "Ching_Ching,_Part_2&&6656", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "(Timbaland)\nHey, hey, what about my ching, ch-ching, ch-ching\nHey, hey, what about my ching, ch-ching, ch-ching\nHey, hey, what about my ching, ch-ching, ch-ching\nHey, hey, what about my ching, ch-ching, ch-ching\n\n(Timbaland)\nYou got the game all wrong\nMoving on the pain's all gone, oh\nGet back to do it in the next telephone\nCome up out that then bling bling in your neck lookin' wrong, oh\nHair did every week\nShoes are bout five hundred dollars up on your feet, oh\nHave you acting all extra\nGive me this, give me that, talking real reckless\nLike my name was Saint Nicholas\nSanta Claus, ho ho ho, talking ridiculous\nGirl you better go go go I'm getting sick of this\nAll you wanted was my doe I'm gettin' bigger chips\nPass on singer you would never lift a finger\nAll you did was bop to my beats and tell me that was?\nWhen did you act like a wife of Betty and my girl\nYou was steady living in a material world oh\n\n(Timbaland)\nThis goes out to my ballin crew\nThrow your hands up in the air if you feel me\nLove 'em all day, love 'em all night\nDon't get 'em girls roll doe\n\n(Ms. Jade)\nThis goes out to my chicks that flow\nPut ya dubs up in the air if you feel me\nGet 'em all day, get 'em all night\nCome up off that doe\n\n(Ms. Jade)\nSick of this song 'bout the money you spent\nBoo what about the money I leant\nTimberlands and the Sean John?\nYou forget about the times I went half on your rent, no\nBailing you out of jail\nMakin' sure you don't forget to go and see your P-O\nPiss test straight made you stop smokin' dro\nBut you home as your ? so you could work on your flow, ho\nI was your down ass bitch in the street\nBrawling niggaz I ain't never even flip\nYou had wondering eyes I ain't never even trip\nSpent a couple dollars\nNow you poppin' fly at the lip\nNigga I taught you how the game go\nL-B puffs dummy you was stinkin rainbow\nQuadripled a million you was thinkin' lame doe\nPermanent reminder you ain't dealin' with no lame ho\n\n(Timbaland)\nThis goes out to my ballin crew\nThrow your hands up in the air if you feel me\nLove 'em all day, love 'em all night\nDon't get 'em girls roll doe\n\n(Ms. Jade)\nThis goes out to my chicks that flow\nPut ya dubs up in the air if you feel me\nGet 'em all day, get 'em all night\nCome up off that doe\n\n(Timbaland)\nCome on girl I ain't even tryna hear that\nBetter off by myself I know you hear that\nAll you wanna do is takin' my money and argue\nStop playin' you be callin me tomorrow\n\n(Ms. Jade)\nYou must be crazy my bags is packed\nMinks in the back of the 'lac, a hundreds is stacked\nI don't want no parts\nGot a lawyer like Mr. ?\nMoney locked in, plus the streets watchin\n\n(Timbaland)\nWhat you gon' do without a pimp like me\nNo pocket money, no rich wifee\nNow ya mad at me wanna cause me pain\nIt ain't worked out now you tryna take my change\n\n(Ms. Jade)\nBout to take everything not just your change\nThat new ring you just got scoop your things\nParked in my driveway by the end of the week\nSo nigga, leave a message at the sound of the beep\n\n(Timbaland)\nThis goes out to my ballin crew\nThrow your hands up in the air if you feel me\nLove 'em all day, love 'em all night\nDon't get 'em girls roll doe\n\n(Ms. Jade)\nThis goes out to my chicks that flow\nPut ya dubs up in the air if you feel me\nGet 'em all day, get 'em all night\nCome up off that doe\n\n(Timbaland)\nThis goes out to my ballin crew\nThrow your hands up in the air if you feel me\nLove 'em all day, love 'em all night\nDon't get 'em girls roll doe\n\n(Ms. Jade)\nThis goes out to my chicks that flow\nPut ya dubs up in the air if you feel me\nGet 'em all day, get 'em all night\nCome up off that doe\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "Different", "href": "Different&&9262", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "Yo, yo, yo, why you looking at me?\nWhy you looking at me?\nWhy you looking at me?\nWhy you looking at me? Come on; tell 'em Jade\n\nPeople look at me wrong 'cause I dress different\n'Cause I talk different, 'cause I walk different\nPeople look at me wrong think I'm so different\nWear my hair different, make the world listen\n\nPeople look at me wrong 'cause I dress different\n'Cause I talk different, 'cause I walk different\nPeople look at me wrong think I'm so different\nWear my hair different, make the world listen\n\nPeople look at me wrong 'cause I\nHate women that wanna be other women\nSince they won I never fit in\nI'm a rock the world with no games or gimmicks\nPlan on winning ? limits\nYou hear it all in my sentence going\nShock up the world with something new and improved\nAin't stoppin' I'm makin' moves\nNo choices then I'm a choose\nThey can tell me to stop but it's obvious I'm gonna go\nThey say yes I say no you hear it all in my flow\nThis is young America steering you in your area, area\nDo what I want and that's period\nI get up and put on what I feel like putting on\nWhen I don't blend in people look at me like something wrong\nAs if I'm crazy, strange, weird or throwed off\nNew chick driving fast in a old car\nI'm still pimpin', still pimpin' just tryna make a living\nFrom the end to the beginning\nIt's a damn shame when you stick out thinking you insane\nRock everything from name brand to hand made\nThis is my life this is who I am I will not escape\nDon't want a piece of the pie I just want a bigger plate\nI'm just tryna live and watch how the plot thickens\nAin't no problem 'cause everybody's just a little different\nOpen your ears and eyes and make the world listen\nBe an original individual is my mission\n\nPeople look at me wrong 'cause I dress different\n'Cause I talk different, 'cause I walk different\nPeople look at me wrong think I'm so different\nWear my hair different, make the world listen\n\nPeople look at me wrong 'cause I dress different\n'Cause I talk different, 'cause I walk different\nPeople look at me wrong think I'm so different\nWear my hair different, make the world listen\n\nPeople is gon stare gon hate gon talk\nBut never will they expose what they doing in the dark\nIf you don't give a shit but you know you got it together, fuck it\nThey gotta put you down to make they-self feel better\nBlack or white, dark brown or light\nShort, thin and small, thick, big or tall\nAnd I think it's a mess we judged on how we dress\nHow many cars we got, how many bitches we pop\nIf a nigga got girls then he considered the pro\nBut if a girl got niggas then she considered the ho\nAnd if a white person hang around blacks he a wigga\nAnd if a black person hang around whites he a nigga\nAnd if we try to make it out the ghetto we a sell-out\nPressure gets so deep at times I wanna yell out\nThis shit is crazy it's time we take a stand\nFocus on ourselves and stop worrying about the next man\nIt's your prerogative tight pants are sagging\nCan't please 'em all with a hotter poppin' of has-beens\nIt's just the world we live in that amaze me\nPeople claim they real but most of them must feel gazy\nQuick to judge when they so artificial\nShit it's obvious I guess people just got some issues\nCounterfeit and crazy, so shady\nWhat else can I say; I'm just a different kinda lady\n\nPeople look at me wrong 'cause I dress different\n'Cause I talk different, 'cause I walk different\nPeople look at me wrong think I'm so different\nWear my hair different, make the world listen\n\nPeople look at me wrong 'cause I dress different\n'Cause I talk different, 'cause I walk different\nPeople look at me wrong think I'm so different\nWear my hair different, make the world listen\n\nWho are you to judge me?\nWho are you to really call me ugly?\nYou don't even know the half\nYou don't even know the half\n\nWho are you to judge me?\nWho are you to really call me ugly?\nYou don't even know the half\nYou don't even know the half\n\nWho are you to judge me?\nWho are you to really call me ugly?\nYou don't even know the half\nYou don't even know the half\n\nWho are you to judge me?\nWho are you to really call me ugly?\nYou don't even know the half\nYou don't even know the half\n\nPeople look at me wrong 'cause I dress different\n'Cause I talk different, 'cause I walk different\nPeople look at me wrong think I'm so different\nWear my hair different, make the world listen\n\nPeople look at me wrong 'cause I dress different\n'Cause I talk different, 'cause I walk different\nPeople look at me wrong think I'm so different\nWear my hair different, make the world listen\n\nPeople look at me wrong 'cause I dress different\nTalk different, Walk different\nPeople look at me wrong think I'm so different\nWear my hair different, make the world listen\n\nPeople look at me wrong 'cause I dress different\nTalk different, Walk different\nPeople look at me wrong think I'm so different\nWear my hair different, make the world listen\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "Ching Ching", "href": "Ching_Ching&&1919", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "(Intro x4 (Nelly Furtado))\nBa da ba ba ching ching ching\nBa da ba ba ba ching ching\nWhat about the money that I spent up today\n\n(Timbaland)\nTim took you from ghetto to class, how to hold your glass\nTo Fendi's to bags, for holdin' your cash\nPeople was seein' you pass, like right through the drapes\nI brought you the private, ounce wit the gates\nThinkin' that stuff make me faint, just whistle real fast\nCougars roll in the grass, same cat on your Jag\nWhy your keepin' them tabs, and callin' me for\nIt cost every minute, and you know I'm on tour\nAnd I'm deeply committed, although I'm forgettin'\nSometimes while hittin' it, different names would slip\nIf I been wit a chick, check me miss\nYour complexion switched, honey you been on trips\nBut you don't appreciate this, till your back in the Jetta\nNo iceberg you own, just Angelica's sweaters\nIf the steaks ain't T-Bone, you ain't properly fed\nHun tonight is bet burgers, no cheese on the bread\nAnd I say\n\n(Hook x2 (Timbaland and Nelly Furtado))\nWhat about my ching ching ching\nWhat about my bling bling bling\nWhat about the money that I spent up today\nWhat about his ching ching ching\nWhat about his bling bling bling\nWhat about his money that I spent up today\n\n(Ms. Jade)\nBoy you act like I need ya, came down wit amnesia\nRan to y'alls in the meters, nuttin' but hate in between us\nNow you come poppin' this shit, nigga I made you rich\nIntroduce you to Cris, flipped and secured your bricks\nEven though them kids ain't mine, let 'em call me mami\nI deserve them dollars, trip to the Bahamas and Porsche rotten\nI washed your clothes, put up wit your hoes\nNever fucked up yo dough, put the G in ya glow\nSo what you sweatin' me fo', I promoted them tours\nI was poppin' them fours, run in and outta them stores\nI cleaned up your spot, poured your brandy and scotch\nRazor blades to the rocks, even lied to the cops\nPlayed your wifey and mother, cousin, sister and brother\nAccountant lawyer and lover, I'm through dealin' wit suckers\nShuttin' and lockin' the door, bout to settle the score\nYou wastin' my time, nigga, but what about my nigga\n\n(Hook x2 (Ms. Jade and Nelly Furtado))\nWhat about your ching ching ching\nWhat about your bling bling bling\nSo what you spent up all your money today\nWhat about his ching ching ching\nWhat about his bling bling bling\nWhat about his money that I spent up today\n\n(Ms. Jade)\nBoy money ain't everything, married minus the ring\nFrequent Coach, mink, coats, cruises on ships and boats\nI gave you way more, can't there bout all your bulls\nSince day one it was ours it never was yours\nUh - look at the bigger picture, study the ghetto scripture\nHeld your back when you was broke frontin' 'cause now you richer\nNo frontin' in that there, Ms. Jade is everywhere\nEnough talkin' I'm through, my lawyer will be callin' you\n\n(Nelly Furtado)\nAll this money that he's spendin', you owe me everything\nI wanna tell him it's not his money, he tell me to go away, baby\nWish he'd only give me a chance to show him that I'm alive\nI'm gonna be there and you need peace and tender all up in his life\nYeah, yeah, yeah\n\n(Hook x2 (Timbaland and Nelly Furtado))\nWhat about my ching ching ching\nWhat about my bling bling bling\nWhat about the money that I spent up today\nWhat about his ching ching ching\nWhat about his bling bling bling\nWhat about his money that I spent up today\n\nBa da ba ba ching ching ching\nBa da ba ba ba ching ching\nWhat about the money that I spent up today\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "The Come Up", "href": "The_Come_Up&&7848", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "Yo, still hungry man\n\nYeah\nAy yo I'm bout to make moves\nAnd get this little bit of paper right\nThis broke shit got a bitch staying awake at night\nIt ain't a guy thing or a girl thing\nIt's a me thing getting high and drunk every weekend\nFuck drama I'd rather shine ???\nBlacks in the Cadillac no ice at all\nSeven-six ay ah bitch watch me ball\n?? Like a motherfucker dipping from the law, Awnaw\nKinda game is they playing?\nI got a gang a players call my gang to bang em\nA let 'em know that I'm all for the?\n? Say nothing young'n that shit is play doe\nPush the pedal to the metal hit the fuckin' floor\nAin't about the D-O-E then what you talkin' for?\nExpedition never slippin on a money mission\nShit is real when you ain't even got no pot to piss in\nThat's why I'm on the come up, for the come up\nWatch you niggas get done up who try to run up\nHowever, whatever the case may be\nYou tryna get it down down we can get it down down\n\nYeah, up late at night\nYeah, at the kitchen stove\nYeah, with them V-12's\nYeah, tryna make they ghost\nYeah, with the tekan gage\nYeah, sellin grey and beige\nYeah, 'cause the red and blue\nYeah, ducking the federals\nYeah, gotta keep the smash 'n' biz\nYeah, with the mansion runs\nYeah, fuck driving dog\nYeah, drug trafficking\nYeah, making illegal lefts\nYeah, making crazy rights\nYeah, code over moneyman\nYeah, never mind the ice\n\nThese motherfuckers ain't right\nMad 'cause I got my game tight\nYou never find a brawl who grind twice as hard\nUh, this money situation niggas acting funny on occasion\nBut that's on them 'cause that's time wasting\nMeanwhile I'm a be scheming for dockets\nStash in the sock drawer, nice little duckie\nWorking on a master plan to get the master cash\nParties and shit I'm a have to pass\n'Cause one day I plan to live it up\nUntil then you gon give it up\nMoneyman tell me what the fuck is up\nHere we go, here we go, here we go again\nRoll it up, light it up, pass it to a friend\nStacking it all whether it's twenty or a thousand\nOut to take my Philly off of welfare out of public housing\nWho me? I got bills to pay\nUntil then I'm gon make a way, is that okay?\n\nYeah, up late at night\nYeah, at the kitchen stove\nYeah, with them V-12's\nYeah, tryna make they ghost\nYeah, with the tekan gage\nYeah, sellin grey and beige\nYeah, 'cause the red and blue\nYeah, ducking the federals\nYeah, gotta keep the smash 'n' biz\nYeah, with the mansion runs\nYeah, fuck driving dog\nYeah, drug trafficking\nYeah, making illegal lefts\nYeah, making crazy rights\nYeah, code over moneyman\nYeah, never mind the ice\n\nThe smell of money got my trigger finger acting funny\nNo stoppin' me homies until I'm sittin' nice and lovely\nKeep puffin until I'm high as a bird\nWant the doe; fuck the crumbs give 'em to the birds\nOh my stars ain't asking no how come's\nFuck being patient I ain't waiting for the outcomes\nFuck you eating ? please don't get me started\nOut for the paper with that big face on it\n\nYeah, up late at night\nYeah, at the kitchen stove\nYeah, with them V-12's\nYeah, tryna make they ghost\nYeah, with the tekan gage\nYeah, sellin grey and beige\nYeah, 'cause the red and blue\nYeah, ducking the federals\nYeah, gotta keep the smash 'n' biz\nYeah, with the mansion runs\nYeah, fuck driving dog\nYeah, drug trafficking\nYeah, making illegal lefts\nYeah, making crazy rights\nYeah, code over moneyman\nYeah, never mind the ice\n\nHush little baby, hush little baby\nHush little baby, hush little baby (where my dutches and my weed)\nHush little baby, hush little baby (and my henny and my vodka)\nHush little baby, hush little baby (all you other motherfuckers)\nHush little baby, hush little baby (get off my dick)\nHush little baby, hush little baby\nLet's go, y'all can't fuck wit me and my nigga\nHush little baby, hush little baby (fuck it)\nHush little baby, hush little baby (Jade)\nMs. Jade to y'all bitches\nLet's go, come on, uh, ooh\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "Keep Ur Head Up", "href": "Keep_Ur_Head_Up&&158", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "(Nesh)\nOoh, oh, yeah\nKeep your head up to the sky\nDetermination in your eye\nYou can hold me when it's cold\nIf you can only let me know, oh\n\n(Ms. Jade)\nYoung girl lost, when is you gonna learn to love yourself\nTo trust him mean that you can't even trust yourself\nHe was a dog when you met him now you mad as shit\nYou can't change that man what you see is what you get\nAnd just because he throw you out don't let him walk over you\nHave some pride you're a woman make him respect you\nBrought bitches for him\nTook a couple stitches for him\nHe at his baby mom house while you wash his dishes for him\nHow you gon' play\nBelieve anything he say\nChoose him over your family on any given day\nI could tell you not happy crying yourself to sleep\nGotta hit out on his ass you still pushing his jeep\nYour career ain't pursuing it\nWhen miserable what's love got to do with it?\nI know it's hard but you gotta do what's right for you\nSee can't nobody hurl over obstacles in life but you\n\n(Nesh)\nKeep your head up to the skies\nDetermination in your eyes\nYou can hold me when it's cold\nIf you can only let me know, oh\n\n(Ms. Jade)\nMakes no sense\nWhat us ladies gotta put up with\nThe backbone of ya niggaz and we put up with\nEverything we hold y'all down when times is bad\nFuckin' sis for two years now you know you're the dad\nTryna escape responsibilities be a man\nAnd you won't even take a blood test nigga you ain't a man\nLie after lie said you'd always be there\nThat's fucked up 'cause the baby ain't asked to be here\nMan she gotta struggle\nShakin her ass in a thong\nTryna make ends meet, stressed out all alone\nScraping up pimper money tryna keep her head focused\nHard to stay strong when better days seem hopeless\nEverything happens for a reason it was written\nTried to make you stumble in this game but you didn't\nMight seem tough but it will be all right girl\nGet it together, do your thing, live your life girl\n\n(Nesh)\nKeep your head up to the skies\nDetermination in your eyes\nYou can hold me when it's cold\nIf you can only let me know, oh\n\n(Ms. Jade)\nGot turned out now you went and got loose at the panties\nWent from weed to pills to coppin nose candies\nAin't had a siege yet but you headed for the grave\nScrewin everybody don't give a shit about AIDS\nLettin niggaz run through you and use you up\nYou don't know that shit could mentally abuse you up\nA free suck in a big truck\nNeighborhood niggaz callin you a free fuck\nYour grandmother havin' thoughts of gettin' rid of you\nYour mom's smokin' you whorin that's pitiful\nAll kinds of thoughts is goin' through your head make a change\nAin't used it in a long time but you got a brain\nGet yourself together ma you better straighten up\nIt's hard as shit on your own plus you growin' up\nGo to school get a job make your own cash\nDo what them niggaz gon' say when you walk past\n\n(Nesh)\nKeep your head up to the skies\nDetermination in your eyes\nYou can hold me when it's cold\nIf you can only let me know, oh\n\n(Nesh)\nTake my hand\nI'm here\nTell me\nLa, la, la, la, la, la, la\nLa, la, la, la, la, la, la\nLa, la, la, la, la, la, la\nLa, la, la, la, la, la, la\n\n(Nesh)\nKeep your head up to the skies\nDetermination in your eyes\nYou can hold me when it's cold\nIf you can only let me know, oh\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "Dead Wrong", "href": "Dead_Wrong&&6281", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "(Timbaland)\nMs. Jade\nNate Dogg\nTimbaland\nWe head strong, we head strong\nWe head strong, we head strong\nMs. Jade\nNate Dogg\nTimbaland\nWe head strong, we head strong\nWe head strong, fricky-fricky, Ms. Jade\n\n(Ms. Jade)\nY'all know, pimp in my walk\nPimp in my talk y'all don't wanna start\nNiggaz can't ever play they?\nSo I quit dealin' wit yo ? with the cars\nI ain't got to price them things\nKeep it comin' cops rollin' like them things\nGet 'em for their cash and things\nGet a bitch ? if he gon' trash them things\nBuyin up all the bar\nStrummin like strings on a guitars\nThink one minute I'm up by the?\nNow you can steady stop gleamin the floor\nI spit shit for the drops\nIn a square bench truck nigga blastin The Lox\nBetter dial up the cops\nWait till they come I'm a show you what I got\n\n(Nate Dogg)\nHead strong\nEnd up on the pavement dead wrong, dead wrong\nRest of my chrome\nOnce I get my paper I'm gone, same song\nI drive for your?\nMan you must have made a wrong turn, dead wrong\nI gotta hold on\n'Cause niggaz in these streets is dead wrong, dead wrong\n\n(Ms. Jade)\nI been in the hood, hood\nBeen to the islands, been to the woods, woods\nSmoked by the lake, lake\nSeen niggaz love me, seen niggaz hate, hate\nLet me freak it one time, time\nSame in the dark and the same in the light, light\nGo get 'em on the grind, grind\nLike a fiend for the white in the heat of the night, night\nGet your wait up today, ??? still playin' them games\nHustle for ?, rings give me the chains\nOops my Betty ain't part of the game\nI got friends in the front\nHo's in the back, Nate Dogg in the 'lac\nTimbaland on the track\nBubba Sparxxx, Petey Pab and Sebast in the back\n\n(Nate Dogg)\nHead strong\nEnd up on the pavement dead wrong, dead wrong\nRest of my chrome\nOnce I get my paper I'm gone, same song\nI drive for your?\nMan you must have made a wrong turn, dead wrong\nI gotta hold on\n'Cause niggaz in these streets is dead wrong, dead wrong\n\n(Ms. Jade)\nWhy these niggaz hate hard\nSpit many flows, many styles, comin' way hard\nNever was known as a thug but you say you are\nThese ho's be walkin' round broke thinkin' they superstars\nThem things they get in cars, Awnaw\nNever been here before\nBut if you want a war you better make sure\nDog that you all the way down to the floor\nTrust then you walkin' out of the door\nGotta break lanes\nThey spittin' pork that ain't beef they don't say names\nIt's Ms. Jade motherfucker I will break Danes\nI'm from the 'hood\nBorn and raised I can take pain, name\nI can take pain, name\nSee it ain't that I'm great\nAnd it ain't that I'm paid\nAnd it ain't that I'm?\nI'm a bitch just came out the cage\nYou know you dead wrong so you ought to be afraid\n\n(Nate Dogg)\nHead strong\nEnd up on the pavement dead wrong, dead wrong\nRest of my chrome\nOnce I get my paper I'm gone, same song\nI drive for your?\nMan you must have made a wrong turn, dead wrong\nI gotta hold on\n'Cause niggaz in these streets is dead wrong, dead wrong\n\n(Nate Dogg)\nHead strong\nEnd up on the pavement dead wrong, dead wrong\nRest of my chrome\nOnce I get my paper I'm gone, same song\nI drive for your?\nMan you must have made a wrong turn, dead wrong\nI gotta hold on\n'Cause niggaz in these streets is dead wrong, dead wrong\n\n(Timbaland)\nAh, ah, you dead wrong\nAh, you dead wrong, oh\nAh, ah, you dead wrong\nYou dead\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "She's A Gangsta", "href": "She%27s_A_Gangsta&&222", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "Who da hell wan test me big guns and things\nSee me in the source book bitch frozen rings\nNever bin a follower always bin a leader\nY'all to need is get down on ya knees\nWhen you agreed I'm a gangsta\nSee me in a ball wit my niggaz\n? No dudes ain't afraid to pull da trigger\nGet shit trucked ima fuckin' icon\nNiggaz in da streets whispering 'bout my rock\n'Cause I'm da broad from da east\nSmelling like gucci and envy linen pants with\nThe crease\nYa wanna piece I don't think ya hand ready\nC 55 but I used to push da shell in\nFucked up tracks which y'all just rap\nNever touch paper most a y'all just act high these flights pimp rap\nMust tell y'all da truth I get it in\nBut y'all messed around in da boot\nWhat da fuck y'all suck comin' all y'all smuts\nPoppin' up worldwide everywhere like starbucks\nWhat da fuck y'all suck comin' all y'all smuts\nPoppin' up worldwide everywhere like starbucks\n\nShe's a gangsta not a prankster y'all\nNot a follower but a leader now can y'all feel dat\n[Timbaland:] she's a gangsta girl, she's a gangsta girl\n[Ms jade:] now can y'all feel dat\n[Timbaland:] she's a gangsta girl, she's a gangsta girl\n\nI got a sick giff, roll me a big spliff,\nCrazy when da mic palm in my black fist\nYou do it like you, I do it like dis\nMs jade powerful da project piss\nNow how y'all want play, spit it for da big pay\nI leave dat ass up in smoke like eminem and dre\nSemi auto a.k, do da shit da philly way\nWe roll out the ? just to get away\nBest 'bout time we settle this\nUp in da club throwin' bows acting ghetto-ish\nAnd if I stop I'm a still be a rebel chick,\nHey you fuckas lookin' quick\nPuffin' in a tin of it be da case like puffy did\nLegistyle I'm poppin' big, when I'm gone trust me I'm a still live\nTake but I'd rather give you fuckin' with the bigger kids,\nBigger ones, bigger funs, bigger foods,\nTimbaland give the beats\n\nChoosing down 95 with a cup in my hand\nHot grills large bills top up in da rubber band\nGot da anger math, wont let 'em burn me out\n'Cause I'ma strong black women ya grown black woman\nGames do I really play 9-5 bin paid\nPills are da grim shit, never fuck widda trays\nI don't care if it bothers you I'm still gon blaze\nSo sick like a virus that never goes away\nHey hold ya breath you can smell da success\nSpit 16 if da pit pat on your chest\nYes I'm so blessed ya cats is so stressed\nYeah da streets bin talkin' 'bout my pin a due da rest\nFuture mapped out, money linked all in\nI'm a saturate da game then sink y'all in\nSnakes fates and dick riders what I despise\nOut to take it all over and will not compromise\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "Feel The Girl", "href": "Feel_The_Girl&&3559", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "(Intro Timbaland (Ms. Jaded))\nLadies and gentlemen\nLadies and gentlemen\n(Ms. Jade) Lay lay lay ladies and gentlemen\n(Ms. Jade) Ladies and gentlemen\n(Ms. Jade) Ladies and gentlemen\n(Ms. Jade) Lay ladies and gentlemen\n(Ms. Jade) Skrip skirt skrip lay lay\n(Ms. Jade) La la la lay\nEarr err err\n\n(Verse 1 Ms. Jade)\nMs. Jade's the name comin' to ruin the game\nBringin' the thunder and rain, bus or a train or a plane\nMe and my girls shrivel all over the world\nMakin' you stumble and hurl, braids, ponytails and the curls\nI got them folk pumpin' and movin' around\nJumpin' and gettin' it down, sweatin' and workin' it now\nNo question, gonna throw on them clothes tonight\nSo set them bows tonight, engines gon' hum on the bikes\nNo matter if he black, peurto rican or white\nStiletto heels tonight, free chicken wings and some rice\nI got your dude lickin' my toes and stuff\nWhat wha wha wha what, light the chronic up!\nI know y'all gonna love when I do it\nI do it professional like Duro and Clue\nDoin' it all for the loot\nY'all better get y'all asses up out the seats\nSweat runnin' down your cheeks, virgins turn into freaks\n\n(Chorus Timbaland (Ms.Jade))\nFricka fa frick feel the girl\n(Ms. Jaaaaaaade)\nFricka fa frick fa frick feel the girl\n(Ms. Jaaaaaaade)\nFrickida frick fa frick feel the girl she'll\n(Ms. Jaaaaaaade)\nLight the chronic up!\n(2x)\n\n(Verse 2 Ms. Jade)\nYa bet was lost, time to set it off\nShoppin' at the mall, don't care what it cost\nConcerned about who be in my sheets\nYou got beef with me? Then don't speak to me\nLike how my flow different kinda pace\nGarbage and the waste, please get out my face\nYou wanna taste? Miss me like I'm Mase\nYou wanna taste? Lick me William H.\nI'm leavin' y'all toothless like Gerome\nRollin' on the chromes, two ways and the phones\nThis Philly chick ain't wit this silly shit\nBlunts and dutches licked, scrapin' up for rent\nRat smugg-el-in', like the government\nKeep 'em bub-bel-in', take it on the chin\nSo now they all duckin' from the slugs\nKisses and the hugs, just cut up the rug!\n\n(Verse 3 Ms. Jade)\nI ain't gon' stop, till I'm satisfied\nChain hangin' like Nas, see right through the lies\nY'all never knew a dame could be so tight\nKillin' and feelin' it right, gettin' it on tonight\nWe keep it real, type of chicks we are\nGettin' nice at the bar, bang it loud in your car\nI'm from the town, niggas gon' hold me down\nLost but now I'm found, watch me snatch the crown\nI clear my throat, ladies spit what I wrote\nTakin' off my coat, stuntin' tryin' to poke\nWe in the back, countin' and peelin' the stacks\nCombin' and brushin' the tracks, y'all can't hold me back\nI'm comin' out switchin' and changin' your route\nTakin' it to the house, bills and large amounts\nI got the club bouncin' and shakin' they frames\nGlass fillin', puff and then pass, if your feelin' in Philly then dance\n\n(Outro Timbaland)\nFrid fra frick fra feel the girl\nFrid fra freaky freaky feel the girl\nFreh freh freh feel feel feel the girl\nShh doha doha digga doha doha fra fricky fricky feel the girl\nFra fridicka feel the girl\nFra freh freh freh freh freh feel feel feel feel\nFra fra freaky feel\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "Step Up", "href": "Step_Up&&6448", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "Ms. Jade's the name comin' to ruin the game (Do It) (repeat 3)\n\nI got a master plan knocking these bum broads outta my way\nJust came in the door and they got somethin' to say\nTell 'em step up if they wanna act hard\nI don't need no great big bodyguard\nOnly dump dimes when it's time to blaze the L\nYou can do it just as long as you don't hurt ya self\nPull up, hop out start spitting like the A.R.\n1-5 cake or sky high oh my\nGot the science and the formula for hatin' chicks\nAnd whatcha do, if you don't like me you can suck a dick\nI'm smoother then a pair of lizard skins in '88\nA lotta suckas portrayin us when we know they ain't\nGet the fuck outta here your dealin' with a rider here\nThe chef in hell's kitchen, I'm stayin here for alotta years\nAnd for my thugs, real bitches and all my hustlers\nKeep it movin I ain't got no paitence for you bustas (DO IT)\n\n(Chorus paraphrasing Audio Two)\nStep up if you wanna get hurt\nMs. Jade's gonna pull your skirt (oh)\nStep up if you wanna get hurt\nMs. Jade's gonna pull your skirt (DO IT, OH)\nStep up if you wanna get hurt\nMs. Jade's gonna pull your skirt (OH)\nI am chillin' (OH), we is chillin' (OH), what else can we say? TOP BILLIN\n\nNow I don't mean to be rude cocky and arrogant\nI Guess that's just the PHILLY in me, and I don't even care\nI Guess that's just the PHILLY in me, and I ain't even scared\nThis rap game is a war and I done came prepared\nIt ain't nothin' to me to just pack up and leave\nBut why shouldn't I give it every breath that I breathe\nAnd why shouldn't I kill it every time that I leave\nWhen these fake mutha fucka's is so easy to read 'cause\nMy family got needs, my city need me\nSo I'mma do it from the muscle bitch believe me\nThink 'cause I'm with Tim that I got it easy\nBut that don't stop me from smoking up in the Crown V\nStayin sucka free, weed in the truck with me\nThis music biz keep a bitch puffin heavily\n3 in the mornin listening to Frankie Beverly\nI won't stop till the whole world lovin' me (DO IT)\n\nYou can Cha Cha Cha to this mardi gras\nI'm the sickest rap bitch you done heard thus far\nAnd it will get be-tta I'm bout my che-dda\nAnd no one gets hurt (as long as you let her)\nDo my thing whether 2003 swing\nOr I'm poppin' that thing thing and lockin the game mane\nWont fuck up my game plan, dealin' the same hand\nJust getting started and I'm only getting hotta mane\nSo getcha feet into the heat start lurkin\nA dollar or a million I'mma be the same person\nMs. Jade bout to take this shit\nAnd even if I'm through with y'all couldn't catch my twist (DO IT)\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "Get Away", "href": "Get_Away&&8052", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "Repeat 2x\nI gotta get away (Why Nesh)\nCause females don't get along with other females\nThey keep scratching me and pulling me at my coat tail\nBehind my back tellin' me to go to hell\n\n\nY'all know I represent for the chicks\nBut this girl so petty it me makin' me sick\nPlottin and lookin' and watchin tryna pick up my twist\nAlways wanna know what I'm doin' and see who I'm wit\nI don't know why she focus all her free time on me\nPeakin out the window when she hear me jingle my keys\nRight now I'm thinkin' that it's to the point she wanna be me\nThis broad is quick to copy every time I get a new weave\nLookin' on the name of bags when I bring somethin' home\nSingle black female, I honestly think something is wrong\nSit on my steps talk on my phone\nShe quick to go get her phone\nThat ain't the type of shit you do when you normal and grown\nB***h go read a book or check a flick out or somethin'\nGot to admit I gotta get a way\nCause B***hes be buggin\nThis kiddy situation gon make me come at her chin\nThe funny thing is when we was younger we used to be friends\n\nRepeat 2x\nI gotta get away (Why Nesh)\nCause females don't get along with other females\nThey keep scratching me and pulling me at my coat tail\nBehind my back tellin' me to go to hell\n\n\nGot this girl round my way that's a trip\nTrickin for twenties young dummy and quick wit her lip\nGet dressed and change her clothes if she thing you look better than her\nHatin' on every female that's doing better than her\nDon't know what it is I guess she got some low self esteem\nDealing with brothers friends and cousins causin a scene\nPurposely mess with n****s with girls just to start beef\nAnd she don't really care if she known as a hore in the streets\nYou know the type of girl that you speak to that's about it\n'Cause she the type of girl that smile behind you back talkin' shit\nIn the club wit her homies keep her eye on your dude\nSoon as you get up go to the bathroom she makin' her move\nTurnin' her nose up at people actin' jealous and bitter\nThat hate gone get her\nLook in the books and wanna be thinner\nWas raised as quitter\nThat's why she act the way that she do\nContent bein a savage\nActin' like a got d**m fool\n\nRepeat 2x\nI gotta get away (Why Nesh)\nCause females don't get along with other females\nThey keep scratching me and pulling me at my coat tail\nBehind my back tellin' me to go to hell\n\n\nThis other chick musta got it confused\nI've been focused and cain't nobody take me out of my groove\nHangin' around in the corner store rollin' her eyes\nA year ago beatin' my ear up 'cause she wanted to ride\n\"I'm sayin' won't fly me out to LA, get on a hook\"\nI'm thinkin' to myself this broad must be as dumb as she look\nHandled this situation well like I always been doin'\nWhen away for a while came back my name is in ruins\nThey say she tellin' people that I'm broke and ain't got a dime\nAnd that she really wanna battle wit her trash ass rhymes\nGuess that's the price you pay for fame being a star in this world\nThis verse I'm talkin' 'bout a guy that's actin' just like a girl\nJockin me sweatin me ridin' me and doin' it tough\nYou'll never get no where doin' that female stuff\nGuess that's the price you pay for fame being a star in this world\nThis verse I'm talkin' 'bout a guy that's actin' just like a girl\n\nRepeat 4x\nI gotta get away (Why Nesh)\nCause females don't get along with other females\nThey keep scratching me and pulling me at my coat tail\nBehind my back tellin' me to go to hell\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "Big Head", "href": "Big_Head&&535", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "(Feat. Timbaland)\n\n(Intro - Timbaland)\nOne time *freak freaky* uh um\nTwo time *ah two* uh um\nThree time *uh uh* uh um\n*Freaky* four times *freaky* Ms. Jade\n\n(Verse 1 - Ms. Jade (Missy))\nInterupted Girl, Girl\nRepresentin' for the whole world, world\nMakin' it my du-ty\nTryna show off, thinkin' they can move me\n(Here we go again) one time\n(Never take me off my grind)\nAnd I do it true, true\nDuty is my number one rule, rule\nLook I'm grown, grown\nHaters I'm leavin' 'em long gone, gone\nGot 'em with they (Hands up high)\nTwisted at the bar I'm feelin' (All right)\nShow 'em what they (Need to ride)\nDancin' until they feet hurtin' (All night)\n'Cause I stack cheese, cheese\nI'm whatever it's gonna be, be\nUh, and it's all to the good\nNever been Hollywood 'cause I stand for the hood\nIt's a different (Day now)\nWatch how I'm makin' the game (break down)\nSee me doin' it. it\nI'm 'bout as good as it's gonna get, get\nUh, Philly chick get it down\nIf the flood is comin' I promise I ain't gon' drown\nMake the music (Move you)\nSpittin' that crazy flow you can (Groove to)\nUh, Beat Club on the rise\nAnd I got got g-got my eyes on the prize\n\n(Chorus - Ms. Jade and Timbaland)\nGet your big head on the floor\n(Get your big head on the floor)\nYou ain't ever seen me move like this\nGet your big head on the floor\n(Get your big head on the floor)\nYou ain't ever seen me groove like this\n(2x)\n\n(Verse 2 - Ms. Jade (Missy))\nWe done did it now, now\nWatch you put your money on me now, now\nMake you feel free, free\nYou ain't even on the same league, league\nFrom the wild (House parties)\nSippin' martinis under the (Palm trees)\nYou can light it up, up\nSick sound leave niggas stuck, stuck\nWhat's really goin' on, on\nPilin' in till the break of dawn, dawn\nUh, switchin lanes in the truck\nAnd we know it's gonna catch up but we still gettin' drunk\nLet's get (Rooms for the night)\nIt's a Timb track so you (Know it's tight)\nUh, stackin the ching, ching\nAnd its obvious I'm gonna cute little vibrant thing\nTear the floor (Up in the club)\nRepresentin' for my real (Chicks and the thugs)\nWhoa from the bottom to the top\nGot ya self a gun and get prepared for the glock\nUh, and it's all to the love\nTwist up your 'dro get your drink for your mugs\nUh, and it's all to the love\nTwist up your 'dro get your drinks for your buzz\n\n(Outro - Timbaland)\nUh-uh, break it down for me\nUh-uh, break it down for me\nUh-uh, break it down for me\nUh-uh, he-he\nGet your big head on the floor\nYou ain't never seen me move like this\nGet your big head on the floor\nYou ain't never seen me groove like this\nGet your big head on the floor\nYou ain't never seen me move like this he\nGet your big head on the floor\nYou ain't never seen me groove like this hehe\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "Jade's A Champ", "href": "Jade%27s_A_Champ&&8242", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "Whoa (Jade the Champ)\nWho am I (Jade the Champ)\nWhoa (Jade the Champ)\nWho am I (Jade the Champ)\nI got 'em, I got 'em (Jade the Champ)\nI got 'em, I got 'em (Jade the Champ)\nJade the Champ, Jade the Champ\n\nBig dreams and hurt feelings\nCall me Jade the Champ\nI put the weight on my shoulders where other bitches slack\nWho else you know can breath life into a murdered track?\nI done see what y'all can do, nevermind that\nLike the old mixed with the new, like a Philly throwback\nTake your best shots, I promise I'ma throw back\nWe can take it back to the days of the cadillac\nJumps out\nAnd handle that\nHeat melts your candle wax\nMaybes and matter facts, Ms. Jade's the fucking champ\nPlay the low and kill you softly like Roberta Flack\nAnd then they, And then they mad 'cause I'm stating facts\nAnd then they, And then they hate when I cop the cat\nThat old nursery rhyming this shit ain't about that\nMy flow I mix between one-eighty proof and six packs\nSpit circles around you, see if you could get back\nBefore you jump best know exactly who you getting at\n\nChampion, watch the people call my name (Jade the Champ)\nChampion, watch the people call my name (Jade the Champ)\nChampion, watch the people call my name (Jade the Champ)\nChampion, watch the people call my name (Jade the Champ)\n\nHo Ho, this thing is real you could play it back\nThey said I couldn't do it, now look at me, Jade the Champ\nA lot of squads is out, but Tim, he got the\nAnd we ain't worried at all cause y'all pretty wack\nI been bending and cracking tracks, call me Jade the Champ\nSee it coming, eyes in back\nBlaze up a twenty sack\nY'all need team participation, what's really up with that?\nAnd so they, and so they, drill when you getting stacks\nBut they don't know shit until it's sitting in they lap\nThey handle it in more ways, make 'em holla back\nIn the ring with the thing thing, make me twist your cap\nYou fools is selling your soul for a little plaque\nLet's take it back to the hood where niggas is shooting craps\nAnd everybody rapping, we ain't do it for the stacks\nI bet they really really pissed 'cause they knowing that\nThe robe is crested and steamed and is nicely packed\nClubs in the backpack, lights off, that's that\n\nWho am I (Jade the Champ)\nWho am I (Jade the Champ)\nWho am I (Jade the Champ)\nWho am I (Jade the Champ)\n\nChampion, watch the people call my name (Jade the Champ)\nChampion, watch the people call my name (Jade the Champ)\nChampion, watch the people call my name (Jade the Champ)\nChampion, watch the people call my name (Jade the Champ)\n\nOh oh, it's kind of hard being Jade the Champ\nBut Ima do exactly what them losers said I can't\nGotta stay on my toes and I ain't afraid of that\nYou niggas pimp on, I leave you where your gators at\nThis is for every person that I owe, I'm paying back\nAnd every nigga turned groupie, I know you heard of that\nPeople that smiled in my face and talked behind my back\nFor every dream that got lost, I promise I'm winning back\nTo all my peoples that knocked, we gone bounce back\nAnd all the babies in the hood, gotta announce that\nI can't give up, I won't give up, I crown myself the champ\nSo I don't think y'all want to see me when I'm really amped\nAin't no stopping me, I'm a long way from breaking man\nI'm Ms. Jade, bout to show you how to take a chance\nCorner full of rappers, show you how to take a man\nA squad full of thugs, show you how to break a man\nNiggas full of pride, show you how to make them dance\nThey can't stand to walk in my shoes and my favorite pants\nBefore you try know exactly who you getting at\n(Jade the Champ)\n\nChampion, watch the people call my name (Jade the Champ)\nChampion, watch the people call my name (Jade the Champ)\nChampion, watch the people call my name (Jade the Champ)\nChampion, watch the people call my name (Jade the Champ)\n\nChampion, watch the people call my name (Jade the Champ)\nChampion, watch the people call my name (Jade the Champ)\nChampion, watch the people call my name (Jade the Champ)\nChampion, watch the people call my name (Jade the Champ)\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "Count It Off", "href": "Count_It_Off&&2117", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "(Feat. Jay-Z)\n\nNow let me count it off (3x)\nHey you, blow your whistle\nNow let me count it off (3x)\nHey you, blow your whistle\nNow let me count it off (3x)\n\n(Verse 1 Ms. Jade)\nI know it's rare, but niggas they feel me everywhere\nI'm from the land of white tees, Vickie's and Roca-Wear\nNY guys spit at cats, do-rags\nPop it in turn it up, bang my shit in they Jags\nI got dem niggas in LA crip walkin' in the truck\nAtlanta, down south bamma's, you know they get it crunk\nNow I'ma float on, roll me somethin' to smoke on\nYou hope I go away, continue to get your hope on\nRap game, regardless I stack change\nThe same affect as the game\nMs. Jade is tha mutha-f-in' name\nI got a L-O-C-K down the freeway, BK back up to Philly\nWon't stop till they kill me\nI get it done, rap chicks see me and run\nOnly mixin' coke with the rum\nAin't scared, niggas be bums\nYou wanna see me, beats fuck up ya hooptie\nSuburbans, Benz or the two seats\nMajor numbers the first week\n\nNow let me count it off (3x)\nHey you, blow your whistle\nNow let me count it off (3x)\nHey you, blow your whistle\nNow let me count it off (3x)\n\n(Verse 2 Jay-Z)\nUh, come on if you comin', get down with it now\nUh, come on if you comin', get down with it now\nYeah, it's young Vitto, voice of the young people\nRoc C-E-O, hot hits for the P-O\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}, {"title": "Why U Tell Me That", "href": "Why_U_Tell_Me_That&&2950", "artist": {"unique_name": "Ms._Jade"}, "lyrics": "Yo this one's for all my ladies\nThat been through a similar situation like this\nIt don't matter what color you is, how old you are\nWhere you from, what you've done\nAll chicks been through somethin' like this\nListen\n\n(Verse 1 - Ms Jade)\nIf I had that thing on me woulda shot you right then\nIf I had that thing on me I woulda popped you right then\nNigga, yeah you played me and said you was down for me\nAnd If I ever had beef you had the full pound for me\nFuck your trucks, fuck your niggas, fuck your bitches and shit\nI'm through wit you, yet I'm still gonna handle my shit\nFinancially there when I needed you but so the fuck what\nYou stopped callin', came through wit that bitch in your truck\nBet you expected me to cry nigga, I smoked fly nigga\nAnd I'ma be striaght from now till I die nigga\nFuck you and everything you stand for\nI shoulda knownn not to never fall in love wit a whore\nFooled yourself, like I wouldn't ever get it together wit out you\nListen up wasted skin I'm much better without you\n\n(Chorus - Lil' Mo)\nNiggas you toyed wit my teenage years and my womanhood\nI hate you, hope I make it understood, Good bye\nWhy you tell me that you love me, why you tell me that you care for me\nWhen you didn't do it\nWhy you thought that you was there for me\nWhen you wasn't at all, all, all\nWhy you tell me that you love me, why you tell me that you care for me\nWhen you didn't do it\nWhy you thought that you was there for me\nWhen you wasn't at all, all, all\n\n(Verse 2 - Ms Jade)\nTook me to the spot that you like to gamble at\nHad my boys in the spot that you liked to gamble at\nLuckily you was may day, walkin' around like it's ok\nBig man in the streets, huh, yeah ok\nLead me on, told me I was gonna be your wife\nNice cars, big house, living a beautiful life\nYeah it's true I stopped fuckin' wit you plenty of times\nBut I change plans wit my girls for you many a times\nStepped back and thought about the dumb shit you put me through\nBroke alota niggas heart's 'cause I was fuckin' wit you\nHonestly I'm kinda glad that I learned from my mistakes, nigga\nBe a better person, fly bitch, get this cake nigga\nYou gonna see I was the best you had\nYou say you love me and you sorry, well that's too bad\n\n(Chorus - Lil' Mo)\nNiggas you toyed wit my teenage years and my womanhood\nI hate you, hope I make it understood, Good bye\nWhy you tell me that you love me, why you tell me that you care for me\nWhen you didn't do it\nWhy you thought that you was there for me\nWhen you wasn't at all, all, all\nWhy you tell me that you love me, why you tell me that you care for me\nWhen you didn't do it\nWhy you thought that you was there for me\nWhen you wasn't at all, all, all\n\nNigga if you see me in the street, I don't want you to speak\nAnd if I ever have a show. I don't want you to go\nIt' ain't no comin' back to you 'cause, I'm hatin' you now\nAnd usually when I hate a nigga then I'm layin' 'em down\nI can't seem to understand why I fell for you\nPushed keys overseas, went to jail for you\nWhen you got knock, I came through wit the bell for you\nYou had beef, I was there bustin' shells for you\nI risked my life, shit I did a fuckin' ? for you\nIf I ain't miscarry woulda had a kid for you\nI shoulda robbed all that fuckin' coke I hid for you\nYou gonna play me after everything I did for you\nI'm pissed off I know you here the fuckin' anger in my voice\nStay around, blow town, you make the choice\nBut if your here when I come back\nI'm still on your ass\nI'm mad as shit, I'd probably wind up killin' your ass\n\n(Chorus - Lil' Mo)\nWhy you tell me that you love me, why you tell me that you care for me\nWhen you didn't do it\nWhy you thought that you was there for me\nWhen you wasn't at all, all, all\nWhat you tell me that you love me, why you tell me that you care for me\nWhen you didn't do it\nWhy you thought that you was there for me\nWhen you wasn't at all, all, all\n\nYo I just wanna thank the guys\nThe guys who, who made us feel like this\nMade us understand how strong we are as women\nYeah, I know my ladies understand what I'm sayin'\nYeah y'all know what you gonna do\nTake it on the?\n\n(Chorus - Lil' Mo)\nWhy you tell me that you love me, why you tell me that you care for me\nWhen you didn't do it (yeah come on bounce back)\nWhy you thought that you was there for me\nWhen you wasn't at all, all, all\nWhat you tell me that you love me, why you tell me that you care for me\nWhen you didn't do it\nWhy you thought that you was there for me\nWhen you wasn't at all, all, all\n\n", "album": {"title": "Girl_Interrupted_(2002)&&1803", "genre": "Hip Hop", "year": 2002}}]