[{"title": "Gut Shot", "href": "Gut_Shot&&2765", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "These photographs that hang on my wall meant everything \nLooking back they all seem like a fading dream\nBut waking now I know that it's just a fallacy\nI rub my eyes and face reality\n\nHow could I just sit and ignore all the signs\nWas it easier to say it was fine?\nNow the words are out in the open air\nI try to make it right but you don't care\nContent to be blind, not to see\nHappy to follow, not to lead\nBut now that I've regained my sight\nI won't be losing sleep tonight\n\nPut up a wall I can't tear down\nThere's no reason, you don't have to shut me out\nSuddenly it seems that you're too good for me\nRemember when we were like family?\nNow you've ruined everything\n\nWith everything passing day the space between us only grew\nWhatever happened to the person I once knew?\nAnd there were time I called you almost every single day\nI know you'd see my name and put your phone away\n\nFunny how expendable some things can be\nLike our friendship and your negativity\nYou look down your nose at me with such disdain\nYou're so much better, \"friend,\" how is the cocaine?\nYou're the last that I thought could do this\nIf you needed blood I would have slit my wrist\nNow you'd cut me open just for spite\nSo I won't be losing sleep tonight\n\nIt seems that I have been betrayed again\nBy enemies disguised as friends\nFeels like a gut shot that stripped away my breath\nAnd now there's nothing left\nAnd now there's nothing left\n\n", "album": {"title": "Survive_(2006)&&5210", "genre": "", "year": 2006}}, {"title": "New Years", "href": "New_Years&&8701", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "I tore down masterfully constructed walls again\nI've got some rebuilding to do\nBrick by brick I'll try to put them each back in their place\nAnd leave no window to see through\n\"It's 4:30 am on a Tuesday, it doesn't get much worse than this\"\nI tried to be the kind of friend I always thought you needed\nAnd this is the thanks I get?\nDo I care to take the time to hear an explanation\nOr an unbelieved apology?\nI told you from the start there's be no manipulation\nAnd no psychology\nDid you think that you could get away with using me\nAnd that things would turn out fine?\nWell I've got news for you, we all see through your little game\nAnd you've lost again this time\nAnd this time I won't cry 'cause you haven't earned it\nAnd all your chances have been blown\nAnd if you've treated everyone the way you treated me\nIt's no wonder you're perpetually alone\nI hope you learn your lesson now\nBut you can count me out\n\n", "album": {"title": "Quitters_Never_Win_(2003)&&2358", "genre": "Punk Rock", "year": 2003}}, {"title": "Liar", "href": "Liar&&6015", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "I have always been so proud of my honest heart\nSo naturally the truth flows from my mouth\nOf course I have lied my share of times in my life\nBut it's pulling the teeth they pass to even spit them out\nSo it's so hard to find that I've been lying to myself all this time\nI say I know you but it's time I realized\nThis life I lead is far from glorifying\nRedundancy is plaguing me, it happens all the time\nBecause I just keep trying\nAnd it's so dark in here And I need you near\nTo ease my growing fear\nSo now I know the truth that I've been missing all along\nOr maybe just didn't want to hear\nAnd I confess I'm a lifetime liar of the truest kind\nBut I'm no longer blind\n\n", "album": {"title": "Quitters_Never_Win_(2003)&&2358", "genre": "Punk Rock", "year": 2003}}, {"title": "Still Falling?", "href": "Still_Falling%3F&&8243", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "Thoughts get trapped inside my brain\nBreak my ribs so I can uncage\nAll these emotions that still dwell inside my heart\n26 hours, where you remain\nAnd I'm force fed all this pain\nIn heaping spoonfuls that are slowly killing me\nWait for me\nBut that's unfair to ever ask of anybody\nAre you still falling?\nI'm glad you found someone so now you can breathe\nBut not for me\nThe tickle of knives is better than this\nBut fresh cuts wouldn't help distract\nAn already bruised and broken soul\nSo this is my song to you\nTo tell you just how much I miss you\nAnd I think about you every day\n\n", "album": {"title": "Quitters_Never_Win_(2003)&&2358", "genre": "Punk Rock", "year": 2003}}, {"title": "Skeletons", "href": "Skeletons&&8220", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "Get on your knees, beg for forgiveness, you broke everything and you can't fix it\nBut you will not admit that you're no saint, a drunk, you steal, you lie\nAnd with a loss of grace you realize you're setting yourself up to take a fall\n\nLooking back on life, does your past still keep you up at night? Can't ever be that way again\nChoose to live it wise, make a change to have a better life and never be the same again\n\nNo one is an innocent and no one can be called perfect\nYou've got your skeletons and you're scared to the bone\nBut I know what's in your head and I understand the old you is dead\nYou just wonder when this misery will end\n\nSelf righteous and hiding who you really are, trying to cover your scars\nBut they're there, don't deny who you really are\nYou play the fool when you drown your sorrows at the bar, that life wont get you very far\nCan't stand to go on another day, can't stand to look at your own face\nJust know that with the actions that you take, you'll never be the same\n\n", "album": {"title": "Survive_(2006)&&5210", "genre": "", "year": 2006}}, {"title": "Father & Son", "href": "Father_%26_Son&&2343", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "Hello, it's me, your only son\nWriting to you now because I haven't seen you in so long\nEven though we live in the same home\nYou're the father that I've never known\nI get up each day, you're already gone\nDrive past your office late at night\nAnd see the light still on\nWhy do you care more about your job\nThan about the family falling apart?\n\nDon't even know you\nCan't understand you\nNever stopped to think of anyone else\n\nHello, my boy, your letter hurt me so\n18 years I've worked so hard, while I missed seeing you grow\nI was just trying to provide for you\nAll my efforts thrown back in my face\nEvery morning I'd say a prayer for you\nAs I lose another day making it the best for you\nSomeday you'll wake up and you'll realize\nAnd you'll thank me for how hard I tried\n\nDon't even know you\nCan't understand you\nNever stopped to think of anyone else\n\nIt's always been about you (about you)\nBut I'm a person too (I'm a person too)\nI feel like giving up\nI've had about enough\n\nDon't even know you\nCan't understand you\nNever stopped to think of anyone else\n\nI gave up more for you than you'll ever understand\nBut you were never there for me when life went bad\nSon, I always tried to give you all the things I never had\nBut all I ever wanted was a dad\n\n", "album": {"title": "Quitters_Never_Win_(2003)&&2358", "genre": "Punk Rock", "year": 2003}}, {"title": "Quitters Never Win", "href": "Quitters_Never_Win&&4902", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "I've waited long enough and I've been putting it all off\nIt's time I got myself going again\nI've made enough excuses to last 'til the end of time\nI've got to move forward with my plans\nI tell myself that I am not cut out for this\nI don't like anything that's happening now\nBut when I think of losing everything I've done so far\nI know I've got to make it work somehow\nWhat good is a friend if you can't look him in the eye?\nWhat good is honesty if it feels like a lie?\nWhat good is a dream if you never even try?\nI thought that I was free and that I left that guy behind\nI wanted to believe that someday I'd reach the sky\nAnd if I don't press on then I'll watch the new me die\nAnd the sadder self survive\nThis isn't as easy as they make it look on TV\nI'd never have guessed it was so hard\nAnd maybe you can hear it in the strain of my voice\nThe perils of it caught me off guard\nBut when you know that burning deep inside of you\nIs not something so easily ignored\nYou get back on that horse no matter how many times you fall\n'Cause it's better than everything you've done before\nMy life is chronicled in lapses of writer's block\nOpening a window to let my feelings be mocked\nYou ask me why I put myself through this, to you I say\nIf you've ever chased a dream you know I can have it no other way\nThis is me today\n\n", "album": {"title": "Quitters_Never_Win_(2003)&&2358", "genre": "Punk Rock", "year": 2003}}, {"title": "Conclusion", "href": "Conclusion&&2450", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "Now we'll move on with our lives and try to make this right\nTo learn from past mistakes we made before\nIf you want, I'll leave you be to figure out yourself\nBefore you figure out what's defeating me\nThere's no one left to turn to, another time we'll try to forget who tried\nAnd now we'll move on with our lives\nNot shedding tears, I'll get by\nYou're better off without it\nYou're better off without him\nYou're better off without it\nYou're better off with anything\nNow who came out the better person, the better human being?\nAnd I'd really like to thank you for getting that person out of me\nI'm wondering how you're doing and I'm wondering how you've been\nAnd I really hope you're happy that you're happier with him\nThat time we spent together, did it mean anything at all?\nAnd I'm not gonna sit here wondering why you didn't call\n\n", "album": {"title": "Quitters_Never_Win_(2003)&&2358", "genre": "Punk Rock", "year": 2003}}, {"title": "Hits Home", "href": "Hits_Home&&1579", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "\"She's just a friend,\" he said, \"and that's all she'll ever be\nBut I can't get these thoughts of her out of my head\nThe cliche story once again, not as dramatic as it could be\nBut I can't help the way my thoughts are being led\"\nCan't you see she loves you in a special way?\nMaybe more than you will ever really know\n'Cause your mind is focused on a fictional storyline\nYou'll miss the happiness reality could hold\n\"This all hits home,\" I said, \"and I can't believe it took so long\nFor me to finally see what's going on\nWith so many troubles in her life, romantic feelings wear her down\nAll she needs is someone that she can lean on\"\nI'll be your friend through thick and thin\nThe kind that you can always run to\nWhen you're hurting and you need a helping hand\nI'll be your friend when things are great\nAnd all you wanna do is share your smile\nAnd your cheerful happiness\nI'll be your friend through your mistakes\n'Cause we both know I've had my share\nAnd yet you never took the chance to run away\nI'll be your friend because you love me\nFor reasons I may never know\nAnd that means more than meager words could ever say\nYou mean more than any words could ever say\n\n", "album": {"title": "Quitters_Never_Win_(2003)&&2358", "genre": "Punk Rock", "year": 2003}}, {"title": "Take What's Yours", "href": "Take_What%27s_Yours&&1040", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "I've come to far to let you take this from me,\nAnd I know it's for the best, it wasn't meant to be\nYou can talk behind my back if that's what gets you by.\nIt's not hard to see the truth if you read between the lines.\n\nMy patience has been slipping as our friendship fades away\nAnd you will hear me say, \"Take what's yours, but keep it far from me\"\nI've learned from my mistakes\n\nWanted to see how far my dream would take me,\nWhile you manipulate your friends and think no one can see\nHeart will win over pride, how can you be so blind?\nIt's not hard to see the truth: it was such a waste of time\n\nMy patience has been slipping as our friendship fades away\nAnd you will hear me say, \"Take what's yours, but keep it far from me\"\nI've learned from my mistakes: People never change, people never change\n\nYou ran from all your problems, and you can't deny you've ruined everything with all your lies\nYou almost broke me down, but I'm smarter now than I ever was before\nYou can play your game, but you don't fool me anymore, you don't fool me anymore\n\n", "album": {"title": "Survive_(2006)&&5210", "genre": "", "year": 2006}}, {"title": "Stitches", "href": "Stitches&&6104", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "A violent scream is better than the whisper of sweet nothings.\nIt holds us together, and I'll never understand\nWhy we don't let the flame burn the fan\nNo I'll never understand, why we don't let the flames burn the fan\n\nKindness is where we fail\nDon't understand why we're happy to be (content to be!) in discontent\nThis life is not well spent\nIs it better to suffer than to be alone?\n\nSo hide your heart and close your mind\nAnd put the key in a dark place that I can't find and don't forget to lie\n'Cause we would rather leave the truth behind\nNo don't forget to lie\n'Cause we would rather leave the truth behind\n\nIf I treated you like dirt would you stick to me like mud?\nWhy is this your idea of love?\nAnd I can't be clean we're coming apart at the seams\nStitches can't fix everything\n\n", "album": {"title": "Survive_(2006)&&5210", "genre": "", "year": 2006}}, {"title": "Wish", "href": "Wish&&1719", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "Well you're in control and I know it 'cause I'm miserable again\nI don't understand how any of this makes me a better man\nYou know I always run to You for some help with my life\nYou know I always come to You for a little wise advice\nAnd all I get is pain\nOkay, so I'm exaggerating,\nI'm just saying that's how it seems to me\nIf all good things come to an end, then what about the bad?\nAm I cursed to never see the fruits of the life I wish I had?\nAnd can I try, one more time, to be pleasing to You?\nMy futile efforts never seem to make my wish come true\nWhat can I do?\nI'll follow through with all these claims I never cease to make\nA promise to myself is one I promise to break\nBut when I have You by my side then I can do what's right\nI'll become the co-pilot and You control this flight\nThen everything will be alright\nThis song's for me\nA reminder of how I intend my life to be\nEvery word I sing\nIs an anthem against my own hypocrisy\nLet me be free\n\n", "album": {"title": "Quitters_Never_Win_(2003)&&2358", "genre": "Punk Rock", "year": 2003}}, {"title": "What I Know", "href": "What_I_Know&&7219", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "You say you're not in love because you think it feels differently\nBut if you've never felt it how can you be sure?\nI don't claim to have the answers and our future's hard to see\nBut don't let those worries push you out the door\n\n'Cause I hate the thought of living life without you\nEven though I'm not afraid of being alone\nBut still every dream will be about you\nAnd that's one thing that I know\nI know\n\nAnxiety's our enemy, this fear might not be real\nHow can I move on if I never know?\nEven though it's pretty likely that it's really how you feel\nForgive me if I can't just let you go\n\n'Cause I hate the thought of living life without you\nEven though I could get by just fine alone\nBut I want all my new love songs to be about you\nAnd that's one thing that I know\nI know\n\nI know that the odds have been against me from the start\nBut meeting you awoke something in me\nI thought that all my bad decisions had somehow stopped my heart\nAnd you proved that's not the way it has to be, the way it has to be\n\nAnd I hate the thought of who I am without you\nAnd someday I'll learn to get by on my own\nI became a better man around you\nAnd that's one thing you should know\n'Cause I know\n\n", "album": {"title": "Survive_(2006)&&5210", "genre": "", "year": 2006}}, {"title": "Someday Not Soon", "href": "Someday_Not_Soon&&9710", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "What happens when it all comes to an end\nGone from the one\nYour closest friend\nThere is no doubt your love is something real\nGoodbyes are hard, the pain will heal\nI wish I had some scholarly advice\nSomething that could make it all go away\nBut I will always be there when you call\nAnd offer a shoulder when you need to cry\n'Cause I'm always here, I'll always care\nI'm praying for you I want you to be aware\nSomeday not soon the memories of pain will fade away\nBut a contented love will always remain\nI've been through this myself a couple times before\nI wish I could say it wouldn't be so bad\nSecond song to you is not more cheery than the last\nI wish it didn't have to be so sad\n\n", "album": {"title": "Quitters_Never_Win_(2003)&&2358", "genre": "Punk Rock", "year": 2003}}, {"title": "The Greatest Betrayal", "href": "The_Greatest_Betrayal&&7162", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "I've never been that strong\nNever been the one to charge head on\nI'm afraid to let this in\nI have to try before the light goes dim\n\nWe pledge ourselves to all of this\nA broken promise, just a lie, a target I can't hit\nAnd is being strong depending on our blind faith\nOr is being gullible making us weak?\n\nNow I'm scared, and I'm using you\nHoping you will somehow pull me through\nIt's only when all is lost \nI need your help and I'll pay any cost\n\nWill I take all this back?\nTake all this back\n\nWe pledge ourselves to all of this\nA broken promise, just a lie, a target I can't hit\nAnd is being strong depending on our blind faith\nOr is being gullible making us weak?\n\nDon't place on me this crown of thorns\nI'm happy now, no need to be reformed\nPlease don't trust a single word I say\nBecause you know I will surely betray\nYou know I will betray\n\nWe pledge ourselves to all of this\nA broken promise, just a lie, a target I can't hit\nAnd is being strong depending on our blind faith\nOr is being gullible making us weak?\n\n", "album": {"title": "Survive_(2006)&&5210", "genre": "", "year": 2006}}, {"title": "One of a Kind", "href": "One_Of_A_Kind&&5754", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "These last few weeks there's been lots of talk about the past\nAbout the true loves we've all lost and the ones we never had\nVicariously reliving the pain of saying goodbye to you\nHas left me wondering exactly what you've been up to\nI've long since gotten over the aftermath of my mistakes\nHad pointed out to me the error of my ways\nBut the little things keep showing up inside my mind\nAnd a better friend than you were I don't think that I can find\nBut now seeing you again\nReminds me thankfully of why the bar was raised so high\nI'm not writing you this song\nTo say I want you back it's simply that I hope I'll never lose you again\nI think about the days we spent together\nI come to realize it's all blurry and I can't remember\nAll that much except how happy we both were back then\nAnd how these days I'm not even sure if I can call you friend\n\n", "album": {"title": "Quitters_Never_Win_(2003)&&2358", "genre": "Punk Rock", "year": 2003}}, {"title": "For Those Left Behind", "href": "For_Those_Left_Behind&&8870", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "Is it so hard to understand?\nYou got left behind 'cause you wanted to do something with your life\nYou wanted something where mediocrity would not suffice\nAnd I know the scene is bleeding, but I can't shake this feeling that's inside\nI know this life's not for everyone but I'm still gonna try\n\nWe could give up now, let ourselves just drown tonight\nNever voice my point of view and no more songs to sing for you,\nBut this time, not out without a fight\n\nTime keeps running out. I wake up each day and my pen and stare though my hazy eyes\nAt the blank sheet that's in front of me, but no one wants to hear me sing about\nHow the scene is bleeding, but I can't take this feeling that's inside\nI know this life's not for everyone, but I'm still gonna try\n\nFor years it's been built up and I won't let them tear it down\nWe've bled for this scene and with our blood we'll wipe the stains clean\nFor all those that were left behind, don't think we'll ever say goodbye\nYou're always with us in our hearts and on our minds\nWe'll try to cure this disease that mocks everything\nThat you wanted it to be, it's everything to me\n\n", "album": {"title": "Survive_(2006)&&5210", "genre": "", "year": 2006}}, {"title": "Picking Up The Shattered Pieces", "href": "Picking_Up_The_Shattered_Pieces&&8881", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "The last few years I thought that things would never change\nAll in the same moment I know it cannot stay the same\nAs this chapter ends and a new one begins again,\nI hope you find your way\n\nThis is not where I wanted to go\nThought we'd see this together\nThough you'll travel a different road\nYou'll always be my friend\n\nWe lost our way but we'll find it again\nGood times may end,\nBut we'll have memories and I'll always keep them with me\n\nSo what can we do now? Will all our hard work end?\nI wouldn't want to do this with anyone who wasn't already my friend\nBut I'll press on. We've come to far\nWe have to make this work somehow\n\nTry to pick up the shattered pieces\nWish duct tape could fix all of your reasons\nAre you waking up to a better life? Will it be a lie?\n\n", "album": {"title": "Survive_(2006)&&5210", "genre": "", "year": 2006}}, {"title": "Living A Lie", "href": "Living_A_Lie&&3581", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "It's a shame that you think you have to live this way\nIt's a shame that you never have known\nYou'd travel so far and you'd have so much power\nIf only you would let the real you show\n\nIt's a shame you think you have to live a lie\nIt's a shame that you think you have to try\nTo please everyone else when you don't even please yourself\nNow isn't that the worst kind of life?\n\nWhen you look into the mirror, do you see someone you hate?\nWhy do you listen to what all those empty people say?\nYou don't need them around, they just wanna keep you down\nBut there's a better way\n\nIt's a shame you think this is how it has to be\nIt's a shame you make everything so hard\nI wish you could see that you're beautiful to me\nAnd I think you're perfect just the way you are\n\n", "album": {"title": "Survive_(2006)&&5210", "genre": "", "year": 2006}}, {"title": "Masquerade", "href": "Masquerade&&8437", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "Sitting here and reading your thoughts, my heart sinks once again\n'Cause I caught you in another lie, find no truth in what you said\nYou say that you'll hurt my feelings\nYou say I won't understand\nI say you're just a coward\nJust a counterfeit friend\n\nAnd all the times I've been there, they didn't mean a thing\nAt least not to you, but I know they meant something to me\nAnd I wish that I could give up, is that what you want from me?\nBecause I'm still your friend even if you don't want me to be\n\nMy promises are haunting me, not so easily shoved aside\nAnd yet I keep on trying to finally justify\nTaking every single word back, every pledge I ever made\nBecause the friend I swore them to was nothing but a masquerade\n\nAnd all the times I've been there, they didn't mean a thing\nAt least not to you, but I know they meant something to me\nAnd I wish that I could give up, is that what you want from me?\nBecause I'm still your friend even if you don't want me to be\n\nThen you ask if something's wrong\nIf only you could hear this song\nYou'd just make up some lame excuse\nSo it's no use (it's no use) listening to you\n\nAnd all the times I've been there, they didn't mean a thing\nAt least not to you, but I know they meant something to me\nAnd I wish that I could give up, is that what you want from me?\nBecause I'm still your friend even if you don't want me to be\n\nWhat do you do when you're not lying, do you have other words to say?\nWhy do I have to try so hard to keep from pushing you away?\nI wish that I could give up, is that what you want from me?\nBecause I'm still your friend even if you've never been one to me\n\n", "album": {"title": "Quitters_Never_Win_(2003)&&2358", "genre": "Punk Rock", "year": 2003}}, {"title": "Wrecking Ball", "href": "Wrecking_Ball&&4623", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "To be alone is all you've ever known; this emptiness neat doesn't affect you now\nOn those steps I saw you, your face pressed in your hands\nWere thinking this life would be different if you'd taken that one chance?\nSo many words to say but you just can't find the time\nOr the strength that you possess within yourself to finally draw that line\n\nI see your weakness and they overtake you, a wrecking ball that splits right through your mind\nYou've got to take control, reach within yourself, stop your world from dying on the inside\nYou've got so much potential in your, it's waiting for it's chance to shine\nThis is a fight against yourself and you've got to make it out alive\n\nI'm here for you and there's no excuse for you to lose this time\nSo rescure yourself from your flaws; a simple solution to aowrthy cause\nJust know that it's up to you!\n\nYou say you can't. that's why you won't; this is your life, it ain't no no joke\nDrop the excuses and start to take a stand\nYou fail with your self-fulfilling prophecy\nLook in your heart that is the key to see the potential that we all see\nWhy can't you see?\n\n", "album": {"title": "Survive_(2006)&&5210", "genre": "", "year": 2006}}, {"title": "Miss The Pain", "href": "Miss_The_Pain&&5415", "artist": {"unique_name": "Much_The_Same"}, "lyrics": "It's so easy to look outside myself and point out all the blame\nI'm saddened when I see a friend no longer acting the same\nI wonder how each one of them so easily falls away\nBut the answer is identical to how I got this way\nNo longer am I looking to you\nIn darkness I have remained\nThe struggling's a thing of the past\nAnd sometimes I miss the pain\nThat pain is the evidence I'm fighting for a cause\nEvery temptation a hurdle I know we can cross\nBut then I let my guard down and the battle is gone\nComplacency takes over so I know something's wrong\nHelp me, help me find my way\nI'm tired, I'm tired of living this way\nI need you to bring me back home\nBecause I, because I hate being alone, all alone\n\n", "album": {"title": "Quitters_Never_Win_(2003)&&2358", "genre": "Punk Rock", "year": 2003}}]