[{"title": "Theme song from Unstrung", "href": "Theme_Song_From_Unstrung&&2745", "artist": {"unique_name": "Myrrh_Larsen"}, "lyrics": "Flew down the west coast to South California,\nThen I got lost and came undone.\n\nWrote you a letter, drew you a postcard,\nBut I can't remember what I meant to say.\n\nWe'll blow down the powerlines tonight,\nStrip off all our clothes and try to make things right,\nWatch the noisy city blink out of the light.\n\nJust remember that I'm doing this for you.\nJust remember that I'm doing this\nFor you.\n\n", "album": {"title": "Unstrung_(2004)&&8908", "genre": "Alternative Rock", "year": 2004}}, {"title": "Lullaby with eyes closed", "href": "Lullaby_With_Eyes_Closed&&6808", "artist": {"unique_name": "Myrrh_Larsen"}, "lyrics": "The distraction of your eyes as I'm singing you to sleep,\nAnd the motion of the stars against the sky,\nAnd this moment, that won't ever keep.\n\nWhen it's dark and the dim light holds something of your reflection,\nWhen I'm cold and alone, and some distant recollection sings through me,\nSings through me.\n\nIn this moment of decay, so aware of our decline,\nAnd the darkness of the stars we'll never see,\nAnd this peace we'll never find.\n\nWhen it's dark and the dim light holds something of your reflection,\nWhen I'm cold and alone and some distant recollection sings through me,\nSings through me.\n\nThe distraction of your eyes as I'm singing you to sleep,\nAnd the motion of our hearts in harmony,\nAll alone, could never keep.\n\nWhen it's dark. Cold and alone. Sings through me. Sings through me.\n\n", "album": {"title": "Unstrung_(2004)&&8908", "genre": "Alternative Rock", "year": 2004}}, {"title": "Let me in", "href": "Let_Me_In&&1427", "artist": {"unique_name": "Myrrh_Larsen"}, "lyrics": "I forgot the words, forgot the pattern of this song.\nI forgot how hard it is to start, or carry on.\nI forgot the ocean, I forgot the salty breeze.\nI forgot how it feels to be down upon my knees.\n\nI forgot the sun, forgot the moonlight in your eyes.\nI forgot the way you'd turn to me in such surprise.\nI forgot the note upon the counter by the door.\nI forgot this feeling that there's always time for more.\n\nOh, let me in. Oh, let me in.\n\nI forgot the words, forgot the pattern of this song.\nI forgot how hard it is to start, or carry on.\nI forgot the melody, the passion in your eyes.\nI've forgotten everything that once kept me alive.\n\nOh, let me in. Oh, let me in.\n\nLet me in, let me in. Let me in, let me in.\nLet me in, let me in.\n\n", "album": {"title": "Unstrung_(2004)&&8908", "genre": "Alternative Rock", "year": 2004}}, {"title": "Here in my arms", "href": "Here_In_My_Arms&&3776", "artist": {"unique_name": "Myrrh_Larsen"}, "lyrics": "So much stronger than language, so much lost in the dark.\nI'll be down on the pavement, with you here in my heart.\nAnd this isn't the first time I've fallen for you,\nAnd it won't be the last.\n\nSo, now, what are you waiting for,\nWhat will it take till you stay, here in my arms?\n\nEvery desperate moment, every delicate scar.\nBy the time that you want me, will I see who you are?\nAnd I wish I had courage to tell you before,\nAnd I wish you'd believe.\n\nSo, now, what are you waiting for,\nWhat will it take till you stay, here in my arms?\n\nGo on, I dare you to go on and leave.\nGo on, there's nobody watching but me.\n\nTell me, what am you waiting for,\nWhat will it take till you stay, here in my arms?\nOh, what am I waiting for,\nWhat will it take till you stay, here in my arms?\n\n", "album": {"title": "Unstrung_(2004)&&8908", "genre": "Alternative Rock", "year": 2004}}, {"title": "January", "href": "January&&335", "artist": {"unique_name": "Myrrh_Larsen"}, "lyrics": "January's all I can see, in my fear there's nothing here I need.\nThe cold of winter's chill has long gone, the festive air is dry and stale and wrong.\n\nI never wanted love to bring me down.\nThere's always time enough for you to come around.\n\nPlayed my resignation by song: a list of mercies, verse by verse, by god.\nEvery whisper you seem to miss: my secret's out, it's all come down to this.\n\nI never wanted love to bring me down.\nThere's always time enough for you to come around.\nCome around.\n\nAnd the last thing I remember is what you forgot to say.\nI will bear this curse forever as I wish you away.\n\nWill you ever call me by name? From here on out, no words quite sound the same.\n\nI never wanted love to bring me down.\nThere's always time enough for you to come around.\nCome around, oh, love.\n\n", "album": {"title": "Unstrung_(2004)&&8908", "genre": "Alternative Rock", "year": 2004}}, {"title": "Running In Circles", "href": "Running_In_Circles&&9104", "artist": {"unique_name": "Myrrh_Larsen"}, "lyrics": "When I woke up I found you staring at the sun,\nIt had already come up while we lay dreaming.\nI'll make-believe that we'd be better off as friends,\nNo more casual regrets, no more deceiving.\n\nEverybody's got a place to run to, baby, you were mine.\nDon't leave me running in circles tonight.\n\nYou broke my heart and left me staring at the sun,\nEverything I've said and done twisted and broken.\nBack when I met you, I was fortunate and free,\nNow I'm shackled by the things we left unspoken.\n\nEverybody's got a place to run to, baby, you were mine.\nDon't leave me running in circles tonight.\n\nDon't leave me -- you've got me down on my knees,\nI fall for you every time.\nDon't make me beg you to see: I've done all I can,\nSo it's up to you this time.\n\nEverybody's got a place to run to, baby, you were mine.\nDon't leave me running in circles tonight.\nEverybody's got a place to run to, baby, you were mine.\nDon't leave me, don't leave me. don't leave me.\nDon't leave me running in circles tonight.\n\n", "album": {"title": "Running_In_Circles_(2005)&&7512", "genre": "", "year": 2005}}]