[{"title": "The Attack", "href": "The_Attack&&4439", "artist": {"unique_name": "New_Model_Army"}, "lyrics": "Now the talking's over, plans are laid and the hour is set\nGlances round the table, eyes all shining, dark and bright\nWe meet again at daybreak for the day that will be ours\nWe're tomorrow's history\nSo just check your weapons, say your prayers.\nNow the evening's over, voices muffled in the cold night mist\nWe leave the house together, home to rest up in the last few hours\nHeads against the pillows with eyes that will not close\nOf all the dreams that we've ever had\nThis is the one, this is the one\nNow the night is over - dawn cracks open like a breaking shell\nNow the waiting's over - as we walk in silence through the empty streets\nWe meet beneath the tower, greetings empty like the taste inside\nTurn towards the valley and the day that has waited for us all our lives\nEven in this age of concrete, even in this age of reason\nThere comes a time when you put your life\nInto the hands of the gods.\n\n", "album": {"title": "No_Rest_For_The_Wicked_(1985)&&4208", "genre": "Post-Punk", "year": 1985}}, {"title": "Grandmother's Footsteps", "href": "Grandmother%27s_Footsteps&&8098", "artist": {"unique_name": "New_Model_Army"}, "lyrics": "Come with me my little innocents, there's a game that we can play\nSee how much we can change your world while you look the other way\nTurn around as if to see if you can catch us cheat\nAnd all you'll find are shining presents laid down at your feet\nTake the bait, take the bait\nTelevision is flash and Coke is nice and you can have the rest\nDream those dreams you've always had of wealth and power and sex\nWe'll run your mines, your factories and we'll take our little toll\nAnd you can have these missiles too while we maintain control\n\nCreeping, creeping footsteps around the world\nWhile they promise us everything we've ever wanted\n\nHush now, don't you cry, don't you realise your crime?\nLike lambs go to the slaughterhouse, we know our rights from wrongs\nBut we go down to the shopping mall with 30 silver coins\nAnd somewhere out in South America, where the forests lie in ruin\nThey shout - we'd better get these natives some clothes\nBecause their videos are coming in soon\n\nCreeping, creeping footsteps around the world\nWhile they promise us everything we've ever wanted\n\n", "album": {"title": "No_Rest_For_The_Wicked_(1985)&&4208", "genre": "Post-Punk", "year": 1985}}, {"title": "Frightened", "href": "Frightened&&259", "artist": {"unique_name": "New_Model_Army"}, "lyrics": "It's all out on the streets today but you, you've found a place to hide\nToo busy with the ratrace, you pass by on the other side\nYours is the face of the brand new Britain with blinkers on your eyes\nFind yourself position and cling on for dear life\nYou're so frightened, everybody's so frightened\nThe papers tell of rape and murder, everything that you want to hear\nBad tidings on the radio - you find a way to name your fear\nSo you never pick up hitchhikers, never talk to strangers\nBelieve the world outside your bolted door is evil\nYou're so frightened, everybody's so frightened.\n\nYou are just a victim of your own bad dreams\nWhile people are the same as we've always been\nBut through the blindness in your eyes\nFor just one minute I see them shine\nLove me ... won't you love me? But they all turn away\n\nYou never fight for anything, you always turn your face away\nAnd you never get involved in trouble let all evil have it's way\nSo as the girl screams in the street below, you turn up the television\nPerhaps you'll see it on the news - well it's nothing to do with you\nYou're too frightened, everybody's so frightened\nWhy is everybody so frightened?\n\n", "album": {"title": "No_Rest_For_The_Wicked_(1985)&&4208", "genre": "Post-Punk", "year": 1985}}, {"title": "No Greater Love", "href": "No_Greater_Love&&7114", "artist": {"unique_name": "New_Model_Army"}, "lyrics": "There's storm clouds amassing over in the west up above the moor\nThe city shines in grey, mills closing down on the valley floor\nAll you can do here is survive, grit your teeth and just stay alive\nAnd never understand\nThe young ones they dance with fire in their hearts until the years go by\nAnd older, defeated they stare in their beer at closing time\nNo greater love could there ever be\nThan what I feel for you, what you gave to me\nYou saved my life from this\nWhile kings are in their counting houses, people just wait here in silent rows\nThey spat and they jeered in a last desperate fear as they watched us go\nRemember how we turned and ran\nHeads into the wind running hand in hand\nWe laughed until we cried\nSo many tears ...\n\n", "album": {"title": "No_Rest_For_The_Wicked_(1985)&&4208", "genre": "Post-Punk", "year": 1985}}, {"title": "My Country", "href": "My_Country&&7402", "artist": {"unique_name": "New_Model_Army"}, "lyrics": "Tell all the people who believe what they read in the press\nTell all the folk who stare from behind suburban walls\nThe enemy is not some nation far across the sea\nThe enemy is with us every single breathing day\n\nCh: So yes, I will fight for my country\nThe land that I love so well\nYes - for justice, a land fit for all our futures\nYes, I will fight for my country\nThe land that I love so well\nHear the voices of our history echo all around\n\nFight all the ones who divide us rich against poor\nFight all the ones who divide us white against black\nFight all the powers who want their missiles in our earth\nFight all the people who would lead us into war\n\nCh\n\nNo rights were ever given to us by the grace of God\nNo rights were ever given by some United Nations clause\nNo rights were ever given by some nice guy at the top\nOur rights they were bought by all the blood\nAnd all the tears of all our\nGrandmothers, grandfathers before\n\nFor all the folk who gave their lives for us\nFor all the folk who spit out - never say die\nFor all the fires burning on our highest hills\nFor all the people spinning tales tonight\nFight all the powers who would abuse our Common Laws\nFight all the powers who think they only owe themselves ...\n\nCh\n\n", "album": {"title": "No_Rest_For_The_Wicked_(1985)&&4208", "genre": "Post-Punk", "year": 1985}}, {"title": "Young, Gifted And Skint", "href": "Young,_Gifted_And_Skint&&2984", "artist": {"unique_name": "New_Model_Army"}, "lyrics": "Young, gifted and skint - that's where it in't\nLook how easily it happened, look how easily I fell\nNow I'm up to here in debt, there's a noose around my neck\nThere's a price upon my head\nMy past was all in borrowed time, stupid, stupid borrowed time\nNow that the deed is done I'm waiting for the axe to fall\nFantasies grow in my brain - run away and start again\nDisappear and change my name\nMoney makes the world go round, fear makes it turn much faster\nCan't pay the rent-man a single thing, don't let the man from the Gas Board in\nMaybe this is all a dream, maybe I'll wake up again\nMaybe this could all be clean again ...\n\n", "album": {"title": "No_Rest_For_The_Wicked_(1985)&&4208", "genre": "Post-Punk", "year": 1985}}, {"title": "Shot 18", "href": "Shot_18&&2536", "artist": {"unique_name": "New_Model_Army"}, "lyrics": "Thou shalt not kill - remember that?\nYou learnt it again and again when you were young\nThey said weapons have this safety catch\nYour moral conscience tells you kid what's right, what's wrong\nWell they make out like they're so surprised\nBut it's easy when you're civilised\nCount to ten, close your eyes\nThe way it's always been ...\nShot 18\nI think I was a bit surprised\nI never knew I was so anaesthetised\nAnd triggers pull so lightly and people die so easy\nI never realised\nWell I believe in common laws\nI believe in even scores\nI understand the rules of war\nThe way the slate is cleaned ...\nShot 18\nWho wants another Christian martyr?\nWho wants someone else's pain?\nWho wants the world on their shoulder?\nWho wants to have to cry in vain?\nWho wants to have an open sore\nEating away deep inside you?\nWho wants to torture themselves\nWhen there's plenty eager to do it for you?\nWell, years might heal all the scars\nBut I don't know if you feel like you have that time\nAnd if I was the man that killed your father\nAnd if I said I'm sorry, would that change your mind?\nWell no one should be so surprised\nThat words don't pay for victims' lives\nIt's teeth for teeth, eyes for eyes\nThe way it's always been ...\nShot 18\n\n", "album": {"title": "No_Rest_For_The_Wicked_(1985)&&4208", "genre": "Post-Punk", "year": 1985}}, {"title": "Drag It Down", "href": "Drag_It_Down&&2580", "artist": {"unique_name": "New_Model_Army"}, "lyrics": "They started work this morning down at city square\nThey're pulling down the statues of our great grandfather's hero\nThe new books said he wasn't such a great man after all\nAnd anyway remember that the times they are a-changing\n\nCh: Pull it down, drag it down\nTill there's nothing to look up to\nBut the brand names on the posters all around\n\nThey proved on television last night that God was just a lie\nHe never made the world at all\nIt was just some sweet old fashioned rite\nSo melt down all the ornaments, move out all the graves\nAnd let us build the disco that we need for our young braves\n\nCh: Pull it down, drag it down\nTill the hopes and dreams of all the ages\nPast are shattered on the ground\n\nWe think we are so clever killing heroes, killing magic,\nUntil everything that's sacred is brought down to our level\nFor Mammon is a jealous master, - leaves no room for any other\nAll the questions left unanswered, all the answers gone forever\nSo bow to the woman in the finest fur\nBow to the man with the ace street cool\nBow to the woman with all the power\nBow to the man with all the money\nIn whose sight are we equal now?\nNow that we've killed God\n\n", "album": {"title": "No_Rest_For_The_Wicked_(1985)&&4208", "genre": "Post-Punk", "year": 1985}}, {"title": "Ambition", "href": "Ambition&&2063", "artist": {"unique_name": "New_Model_Army"}, "lyrics": "Stepping out onto the stage the smalltown star tonight\nFlexes out for fame and fortune into the lights\nThe way she tears into the heart makes me realise\nThat I never understood hatred until I looked into those eyes\nShe cries, \"No one's going to talk down to me again\nNo one's ever going to patronise me again\nI'm going to get out of this town, steal myself a crown\nI'm going to get myself some power\nIf it's the last thing that I do\"\n\nHeading out of Bradford with a ticket on the train\nAnd a faith as hard as steel and as sharp as any pain\nGets pictures in the papers smiling oh so good\nWhile she lies in bed with racing dreams hot as blood\nBecause love will make you happy and love will keep you warm\nAnd love will build a cushion to keep you safe from harm\nBut hate will drive you onwards, hate will drive you upwards\nTill you can get back all the bastards\nWho ever tried to put you down\n\nAnd when she's gone forever, please don't lay her down to rest\nIn a quiet little churchyard along with all the rest\nThrow a great big party to remember that she lived\nGive her headlines on the TV to remember who she is\n'Cause no one's ever going to talk down to her again\nNo one's ever going to patronise her again\nShe's going to get out of this town, steal herself a crown\nShe's going to get herself some power\nIf it's the last thing that she does\nIf it's the one thing that she does\nIf it's the only thing that she ever does\n\n", "album": {"title": "No_Rest_For_The_Wicked_(1985)&&4208", "genre": "Post-Punk", "year": 1985}}, {"title": "No Rest", "href": "No_Rest&&1126", "artist": {"unique_name": "New_Model_Army"}, "lyrics": "Four o'clock in the morning and still we cannot sleep\nTurning over, turning 'round, twisting in our sweat\nThey say there is no rest for the wicked ones\nDear God, what have we done?\nThere is no rest for the wicked ones\nDear God, what is this evil that we've done?\n\nIs it that we wanted more than you gave?\nWhy did you put us then in this smalltown grave?\nHumility - is that what you want?\nWhy did you make us then the way you did?\nYes we have pride - is this our sin?\nIs it the times that we've been out fighting?\nWell I'll tell you all those times - we never really hurt anybody\nOr is it that we were eating\nWhile other people were starving?\nIs this our crime?\n\nFour o'clock in the morning and still we cannot sleep...\n\nIs it the times we laughed about it all\nThrough all those whisky nights so far away?\n\n", "album": {"title": "No_Rest_For_The_Wicked_(1985)&&4208", "genre": "Post-Punk", "year": 1985}}]