[{"title": "Cast Down The Heretic", "href": "Cast_Down_The_Heretic&&6656", "artist": {"unique_name": "Nile"}, "lyrics": "Blasphemer, heretic, defiler of the sacred ones\nThou art deprived of your limbs\nThy nose shall be split\nThou art cast down and overthrown\nRa-Harmakhis destroyeth thee\nHe damneth thee and driveth hooks into thy body\nIsis sayeth in mighty voice\n\"The number of they days are cut short\nThy bones are broken to splinters, thy vertebrae are severed.\"\nHorus hammereth thy head\nThe sons of Heru smash you with their blows\n\nThou art decimated by their violence\nThou fallest backwards as thou retreateth like unto Apep\nThe great company of gods gather in retribution\nThey hath passed judgment upon thee\nThey cast down your heresy\nThey spit up on thee and thy rebellion\nAnd turn their back upon thee\nHorus repulseth thy crocodile\nSut defileth thy tomb\nNephthys hacketh thee in pieces\nThe sons of Horus speareth thee\nThe gods repulse thee\nThe flame of their fire is against thee\nCursed art thou, impaled thou art, flayed art thou\nHeretic, thou art cast down\n\nBlows are rained upon thee\nDismemberment and slaughter are on thee\nThy crocodile is trampled underfoot\nThy soul is wrenched from its shade\nThy name is erased\nThy spells are impotent\nNevermore shalt thou emerge from thy den\nThy city Armana lays in ruin\nDamned art thy accursed soul and shadow\nDie O one, which art consumed\nThy name is buried in oblivion\nSilence covereth thee and thy false one\nDown upon thy belly\nBe drowned, be drowned, be vomited upon\n\nThe gods have pronounced thy doom\nThey scorn thee and thy false Aten\nThe ancient ones turn their backs upon thee\nThou art cast down, overthrown\nThy reign of heresy is ended\nThose thou hast driven out have risen against thee\n\nCast down the heretic\nCast down the heretic\nCast down the heretic\n\nKhnemu draggeth thy spawn to the block of slaughter\nSick shalt thou be at the mention of thine own name\nSekhmet teareth out thy bowels and casteth them into flames\nShe filleth thine orifices with fire\nUadjit shutteth thee in the pits of burning\nNevermore shall you breathe or procreate\nNeither thy house or tomb exist\nThou shalt drive thy teeth into thine own body\nHeretic, thou art cast down\nOverthrown, ended, hacked in pieces, slaughtered, butchered\nRa hath made Thoth to slay thee utterly\n\n", "album": {"title": "Annihilation_Of_The_Wicked_(2005)&&1996", "genre": "Technical Death Metal", "year": 2005}}, {"title": "The Burning Pits Of The Duat", "href": "The_Burning_Pits_Of_The_Duat&&2878", "artist": {"unique_name": "Nile"}, "lyrics": "I Hath Been Immersed Head Down.\nIn that, Which Floweth In Abundance from the Slaughtered Ones.\nI Hath Been Made to Eat Feces and Drink Urine.\nI Lay in Chains before the Undying Flames.\nI am Helpless in the Presence of He Who is Master of the Pits of Fire.\nI am Humbled and Broken in the Presence\nOf Those Who Shall Consume My Shade in the Pits of Burning.\n\n(Guitar solo)\n\nI Didst Bow in Homage to the Spawn of Set.\nI Hath Kneeled in Homage to the Servants of Shesses.\nIn Rebellion, I Did Recite the Formulae of Rites in Glorification of the Lords of Filth.\nI Hath Recited the Formulae of Rites in Glorification of the Lords of Wickedness.\nHe Who Hath Dominion of Khenti-Amenti Hath Uttered,\n\n\"Hack in Pieces and Cut Asunder the Bodies of Mine Enemies\nAnd the Members of the Dead Who Hath been Turned Upside Down.\nScatter in Pieces Their Shades.\nThey Shall be Cast Down Headlong into the Pits of Fire.\nThey Shall not Escape nor be able to Flee From the Flames Which Art in the Serpent Set-Heh.\"\nI burn.\n\n(Guitar solo)\n\nMy Heart Desires to Burn in the Pit of Fire.\nAllow My Ka to Blaze in Flames and be Utterly Consumed.\nI Stand in Submission Before the Living Uraei of Flame\nWho Hurls Forth Burning Heat Against The Tongues of Those Who Hath Spoken Evil.\nIncinerate Me in the Pits of Burning.\nSear Me in the Pits of the Damned.\nImmolate Me in the Pits of Torment.\nI Seek only the Charnel Bliss and the Blackened Caress of the Burning Pits of the Duat.\n\n(Guitar solo)\n\nI Burn.\nI Burn.\nI Burn.\nI Burn in this Tomb of Fire.\nI Burn in this Tomb of Fire.\nI Burn in this Tomb of Fire.\nI Burn in this Tomb of Fire.\n\n", "album": {"title": "Annihilation_Of_The_Wicked_(2005)&&1996", "genre": "Technical Death Metal", "year": 2005}}, {"title": "Chapter Of Obeisance Before Giving Breath To The Inert One In The Presence Of The Crescent Shaped Horns", "href": "Chapter_Of_Obeisance_Before_Giving_Breath_To_The_Inert_One_In_The_Presence_Of_The_Crescent_Shaped_Horns&&6163", "artist": {"unique_name": "Nile"}, "lyrics": "Khensu Neter Hetef.\nWho Possesseth Absolute Dominion over the Evil Spirits that Infest the Earth and Sky.\nHe of the Silence of the Moon.\nGiver of Oracles.\nHe that Must Forever Wax and Wane.\nThou Art in Union with Thoth.\nThe Excellent Tehuti of Truth and Time.\nKeeper of the Lunar Cycle.\nWhose Hands are Able.\nWhose Tongue is Mighty in Speech.\nAuthor of the Works of Knowledge.\nWriter of the Ancient Wisdom.\nMaster of the Words of Power.\n\nObeisance before giving breath to the Inert One\nIn the presence of the Crescent-Shaped Horns.\n\nLord of the Two Horns.\nGod of the Full Moon.\nAh Tehuti.\n\nAs it Was for Thoth So Shall it Be for Me.\nAs it Was for Thoth So Shall it Be for Me.\n\n(Guitar solo)\n\nAs it Was for Thoth So Shall it Be for Me.\nAs it Was for Thoth So Shall it Be for Me.\n\nI am He Who Sendeth Forth Terror into the Domain of Rain and Thunder.\nI have Made My Knife to Flourish along with the Knife Which is in the Hand of Thoth.\n\nLord of the Two Horns,\nGod of the Full Moon.\n\nI am He Who Calleth Down Curses and Commandeth the Elements unto Darkness.\nI Hath Uttered the Hidden Words.\nEven unto the Divine Words which Art Written in the Book of Thoth.\n\nWritten in the Book of Thoth.\n\n", "album": {"title": "Annihilation_Of_The_Wicked_(2005)&&1996", "genre": "Technical Death Metal", "year": 2005}}, {"title": "Sacrifice Unto Sebek", "href": "Sacrifice_Unto_Sebek&&2418", "artist": {"unique_name": "Nile"}, "lyrics": "Sebek, Sochet, Suchos\nDread lord of the marsh\n\nHe who crawleth amongst the sacred waters\nAnd devoureth the flesh\nOf that which is sacrificed\nUnto Him\n\nTua Ashemu. Tua Ashemu.\nRekhes Au Sebek. Rekhes Au Sebek.\nTua Ashemu. Tua Ashemu.\n\nSebek, Neter, Ashemu\n\nWhose teeth rendeth and teareth with terrible violence\nRestore the eyes of the dead\nCollect their skulls\nJoin their bones together again\n\nLord of the temple of the mount of sunrise\nOpen the way unto the underworld\nCause the dead to rise to new life\nBring the child Horus upon the throne\n\nOf Osiris\n\n", "album": {"title": "Annihilation_Of_The_Wicked_(2005)&&1996", "genre": "Technical Death Metal", "year": 2005}}, {"title": "User-Maat-Re", "href": "User-Maat-Re&&9638", "artist": {"unique_name": "Nile"}, "lyrics": "O Seti, Great One, My Father.\nI Hath Finished for Thee Thy Temple at Abydos.\nAnd Made Known the Lineage of the Blessed.\nThose Who Came Before.\nI Hath Exalted Mine Ancestors.\nI Hath Honoured with the Blood and Sweat of Many.\nThe Legacy of Thy Conquests.\n\nT Hath Glorified Thy Temple of Set in Avaris.\nIn Karnak, Hath I Raised the Great Hall.\nIn Thebes, Sublime Monuments, Grand Pylons, Obelisks\nAnd Colossal Statues Are Inscribed With My Name.\nBy Divine Right I Hath Usurped the Monuments of My Predecessors.\nI Hath Created Imposing Rock Hewn Temples.\nMonumental Colossi in Mine Own Image.\nLike as unto the Images of Amun, Re, Ptah.\nI Hath Caused to Rise a Formidable Legacy Carved in Stone.\nIn the Mountain of Meha.\nIntended to Endure a Million Years.\n\nIn the Violence of Sekhem.\nI am Become Montu,\nGod of War in the Two Lands.\nI Hath Suppressed the Rebellious.\nI Hath Driven Back Chaos and Disorder.\nThe Conquered Chiefs of All Foreign Lands are Beneath My Sandals.\nI Hath Emblazoned My Countless Victories in Immortality.\nCarved in Rocks as Living Images of the Ritual Massacre of Mine Enemies.\n\nI am User-Maat-Re Setepene-re,\nSovereign of Sovereigns,\nBeloved of Amun,\nChosen of Re,\nI Hath Made Manifest the Grandeur of My Empire.\nTo be Worthy of Thy Legacy.\nO Seti, Great One.\n\nUser-Maat-Re, Thou Hast Done Nothing.\nUser-Maat-Re, Thou Hast Done Nothing.\n\n(Guitar solo)\n\nUser-Maat-Re, Thou Hast Done Nothing.\nUser-Maat-Re, Thou Hast Done Nothing.\n\nNothing.\nNothing.\n\n", "album": {"title": "Annihilation_Of_The_Wicked_(2005)&&1996", "genre": "Technical Death Metal", "year": 2005}}, {"title": "Annihilation Of The Wicked", "href": "Annihilation_Of_The_Wicked&&2350", "artist": {"unique_name": "Nile"}, "lyrics": "The Dominion of Seker.\nBarren Desert of Eternal Night.\nShunned by Ra.\nBehind the Gate Aha-Neteru.\nThe Wastelands of Seker.\nEldest Lord of Impenetrable Blackness.\nDeath God of Memphis.\nHe of the Darkness and Decay of the Tomb.\nHe of Rosetau.\nThe Mouth of the Passage to the Underworld.\nClosely Guarded by Terrible Serpents.\nWho Careth Not for His Own Cult of Worshippers.\n\nSeker.\nAncient and Dead.\nPrimeval Master of the World Below.\nRemaineth Unwitnessed, Unseen, Hidden in His Secret Chamber.\nHis Primitive Graven Image like as a Hawk-headed Man.\nShrouded and Swathed in Tomb Wrappings.\nStanding Between a Pair of Wings which Issue Forth from the Back of a Monstrous Serpent.\nHaving Two Heads.\nHaving Two Necks and Whose Tail Terminates in a Human Skull.\n\nIn Thick Darkness.\nAmid Violent Tempests of Unendurable Cacophony.\nHis Serpents Make Offerings unto His Image and Live upon Their Own Fire.\nHis Servants.\nHideous Reptiles of Terrifying Aspect.\nWhose Work is Nothing Less than the Annihilation of the Wicked.\nConsume the Bodies of the Damned by Flames of Liquid Fire They Emit from Their Mouths.\nAnd the Goddess Quetet Tent which Liveth on the Blood of the Dead.\n\nOn Their Blocks.\nThey Cut into Pieces the Flesh of the Dead.\nSinging Hymns of Torture and Mutilation to Their Master.\nAccompanied by the Wailings and Anguish of the Damned.\nThey Wreak Destruction upon the Wicked.\nThose Who Hath Not Recited the Formulae.\nNor Made the Sacrifices or Who Know Not the Words of Power.\n\n(Guitar solo)\n\n", "album": {"title": "Annihilation_Of_The_Wicked_(2005)&&1996", "genre": "Technical Death Metal", "year": 2005}}, {"title": "Lashed To The Slave Stick", "href": "Lashed_To_The_Slave_Stick&&971", "artist": {"unique_name": "Nile"}, "lyrics": "Asfetiu\nAsfetiu\n\nFiends, criminals, slaves, blasphemers\nThe word of Ra is against ye\nYe are fettered and bound with leather straps\nHelpless, doomed, wailing in unendurable torment\nLashed to the forked slave stick by the neck\n\nLashed to the slave stick\nAbata ankh t khet\nNeba t steb tcha\nLashed to the slave stick\n\nRa pronounceth the formulae against thee\nThe Eye of Horus is prepared to attack thee\nSekhmet uttereth words of flame\nAgainst thee and pierceth thy breast\n\nYour evil deeds have turned against you\nYour plottings have come upon you\nFor your abominable acts\nYou shall be lashed to the slave stick\n\nAbui, the god who burns the dead\nShall leave you smoldering in exile from the Netherworld\nAbati, the gorer\nCauses you to howl like a jackal in anguish\n\nYour doom hath been decreed by Ra\nYour unjust and perverse judgments are upon yourselves\nThe wickedness of your words of cursing are upon you\nIt is you who hath committed the unutterable and wrought iniquity in the Great Hall\n\nYour corruptible bodies shall be cut to pieces\nYour souls shall have no existence\nYe shall never again see Ra as he journeyeth in the Hidden Land\nThe doom of Ra is upon you\n\nLashed to the slave stick\nAbata ankh t khet\nNeba t steb tcha\n\nLashed to the slave stick\nAbata ankh t khet\nNeba t steb tcha\nAsfetiu\n\n", "album": {"title": "Annihilation_Of_The_Wicked_(2005)&&1996", "genre": "Technical Death Metal", "year": 2005}}, {"title": "Von Unaussprechlichen Kulten", "href": "Von_Unaussprechlichen_Kulten&&8751", "artist": {"unique_name": "Nile"}, "lyrics": "I Hath Dreamed Black and Grim, Desolate Visions\nOf the Pre-Human Serpent Folk and Communed with Long-dead Reptiles.\nSilently Watching Through the Ages in Cold, Curious Apathy.\nThe Unending Sorrows and Suffering of an Abysmal Humankind.\n\nI Dare Not Again Surrender to the Deep Sleep Which Ever Beckons Me.\nLest I in Dread.\nShudder at the Nameless Things.\nThat May at this Very Moment.\nBe Crawling and Lurking.\nAt the Slimy Edges of My Conciousness.\nSlithering Forth from the Bowels of Their Infernal Pits.\nWorshipping Their Ancient Stone Idols and Carving Their Own Detestable\nLikenesses On Subterranean Obelisks of Blood-soaked Granite.\n\nI Await the Day When the Claws of Doom Shall Rise.\nTo Drag Down in Their Reeking Talons the Weary\nAnd Hopeless Remnants of a Jaded, Decayed, War-despairing Mankind.\nOf a Day When the Earth Shall Open Wide and the Black,\nBottomless, Yawning Abyss Engulfs the Arrogant Civilizations of Man.\nChthonic Retribution Shall Ascend.\nAmidst Universal Pandemonium and Those Who Slither\nAnd Crawl Shall Rise Again Once More to Inherit the Earth.\n\n", "album": {"title": "Annihilation_Of_The_Wicked_(2005)&&1996", "genre": "Technical Death Metal", "year": 2005}}]