[{"title": "JCB", "href": "JCB&&2378", "artist": {"unique_name": "Nizlopi"}, "lyrics": "Well, I'm rumbling in this JCB\nI'm 5 years old, and my dad's a giant sitting beside me\nAnd the engine rattles my bum like berserk\nWhile we're singing, 'Don't forget your shovel if you want to go to work!'\n\nMy dad's probably had a bloody hard day\nBut he's been good fun and bubbling and joking away\nAnd the procession of cars stuck behind\nAre getting all impatient and angry, but we don't mind\n\nWe're holding up the bypass, oh\nMe and my dad having a top laugh, oh whoa\n\nSitting on the toolbox, oh\nAnd I'm so glad I'm not in school, boss\nSo glad I'm not in school, oh no\n\nAnd we pull over to let cars pass\nAnd pull off again, speeding by the summer green grass\nAnd we're like giants up here in our big yellow digger\nLike zoids or transformers or maybe even bigger\n\nAnd I want to transform into a Tyrannosaurus Rex\nAnd eat up all the bullies and the teachers and their pets\nAnd I'll tell all my mates, my dad's B.A. Barachus\nOnly with a JCB and Bruce Lee's nunchuckas\n\nAnd we're holding up the bypass, oh\nMe and my dad having a top laugh, oh whoa\n\nSitting on the toolbox, oh\nAnd I'm so glad I'm not in school, boss\nSo glad I'm not in school\n\nAnd we're holding up the bypass, oh\nMe and my dad having a top laugh, oh whoa\nI'm sitting on the toolbox, oh\nAnd I'm so glad I'm not in school, boss\nSo glad I'm not in school\n\nSaid I'm Luke, I'm five, and my dad's Bruce Lee. Drives me around in his JCB\nI'm Luke, I'm five, and my dad's Bruce Lee. Drives me around in his JCB\nI'm Luke, I'm five, and my dad's Bruce Lee. Drives me around in his JCB\nI'm Luke, I'm five, and my dad's Bruce Lee. Drives me around...\n\nAnd we're holding up the bypass, whoa\nMe and my dad having a top laugh, oh whoa\nAnd I'm sitting on the toolbox, oh\n\nAnd I'm so glad I'm not in school, boss\nSo glad I'm not in school\n\nAw, said\nI'm Luke, I'm five, and my dad's Bruce Lee. Drives me around in his JCB\nI'm Luke, I'm five, and my dad's Bruce Lee. Drives me around in his...\nAw, I'm Luke, I'm five, and my dad's Bruce Lee. Drives me around in his JCB\nI'm Luke, I'm five, and my dad's Bruce Lee. Drives me around in his JCB\n\n", "album": {"title": "Half_These_Songs_Are_About_You_(2004)&&9631", "genre": "Hip Hop", "year": 2004}}]