[{"title": "Below One Hundred", "href": "Below_One_Hundred&&5049", "artist": {"unique_name": "On_The_Last_Day"}, "lyrics": "The dead will take you in \n\nLeave me alone, can't you see I'm dying here. I'll rip you, wide open. Just let me go, there's no more use for me. \nSo cold I'm shaking \n\nAre you all dead? Dead and walking, corpses talking. Is your blood red and beating? Still screaming \"don't let them take me\" \n\nI'm paralyzed, my arms rest at my side. Stop testing, I'm resting. Incessantly, you're making a mistake. It's just my time now. \n\nLeave me alone, can't you see I'm dying here. I'll rip you, wide open. Just let me go, there's no more use for me. So cold I'm \nShaking \n\nA pinprick glow, my heart rate is still falling let me go. \n\nI'm lost, this shaking won't stop, there's no hope. \n\nClose my eyes, take me before I \nRealize, that there's still a \nChance to change, to live, and never fade away. I wake... \nDon't wait. The dead will take you in. \nLike too much insulin\n\n", "album": {"title": "Meaning_In_The_Static_(2006)&&5607", "genre": "", "year": 2006}}, {"title": "The Journey And The Balance", "href": "The_Journey_And_The_Balance&&8626", "artist": {"unique_name": "On_The_Last_Day"}, "lyrics": "Step into frame. This is your scene. The end is the same. It can't be changed. \nYou can't escape. You can't erase this part of fate. We're all the same here at the end of the journey. \n\nJust one more day. Just one more chance to say the things that I meant to say. Wait... just one more day. Then you can burn my body, leave, and white out my name. \n\nStand behind me (Stay still) So safe (shielded) no pain (Slip frame by frame) Rewrite the end (Before) The last (No way) reel spins (It can't be changed) Now that I stand here at the end of all places; I understand that the meaning is the journey. \n\nJust one more day. Just one more chance to say the things that I meant to say. Wait... just one more day. Then you can burn my body, leave, and white out my name. \n\nFind the message in the static. Heed the warnings there. Search for meaning in the journey. Balance in between\n\n", "album": {"title": "Meaning_In_The_Static_(2006)&&5607", "genre": "", "year": 2006}}, {"title": "Initial Deployment", "href": "Initial_Deployment&&9807", "artist": {"unique_name": "On_The_Last_Day"}, "lyrics": "Wake up, the walls have softened up (My foxhole's filling up with mud) Please come save me. We dug this hole, we made it safe (Yet now, you're staring down at me) I'll keep reaching. I won't give up (Because to me it means that much) \n\n(Still fighting, these battles, in our words) (Still fighting, these battles, in our whispers) \n\nWe're fighting wars. in our words. In our whispers. So soft they can't be heard. This battle has been lost. This war cannot be won \n\nDiscard, every word I said (and I'll still love you just the same) Clear out my head. This world is breaking all around (still you refuse to make a sound) I'm not breathing. Please lift me now \n\n(Do something, call out \"man down!\") \n\nPay for your treason. your betrayal. Live in exile for fighting wars like whispers. \n\nNow how do you plead?\n\n", "album": {"title": "Meaning_In_The_Static_(2006)&&5607", "genre": "", "year": 2006}}, {"title": "Meaning In The Static", "href": "Meaning_In_The_Static&&3396", "artist": {"unique_name": "On_The_Last_Day"}, "lyrics": "Strings of numbers in the black. Solutions false to send me back. If only I could only do the math. (there is no escape) Tell me secrets with white noise. If I could single out a voice maybe the past would all make sense. (there is no meaning) A pattern there, a sequence here, there's something that I lack. The answer's there, but the end is near, and there's no turning back. \n\nThere's meaning in the static and I need to believe that if there's an end, I'm planning my escape. \n\nTurn the volume up to ten. The signal's there it's just hiding. Beware the monsters at the end. (there is no escape) I'll place this purpose in the void. Something to block out the white noise. Quick now, my time is running out. (There is no meaning) They've caught my scent, they're on my heels, this city's closing in. I'm leaving town, I'm reaching out, but all I grasp is air. \n\nI hear voices in the darkness. (I hear voices) Waiting, they're watching, and telling me lies. They don't answer now. \n\nI hear voices...\n\n", "album": {"title": "Meaning_In_The_Static_(2006)&&5607", "genre": "", "year": 2006}}, {"title": "The Rescue", "href": "The_Rescue&&8740", "artist": {"unique_name": "On_The_Last_Day"}, "lyrics": "Light your signal flare in the air. I need to find you. Hospital white glare. Are you there? This is the rescue. \n\nCollapsed out in the rain. Lost in the dark. Surrounded by the trees with no landmarks. So now you're out of sight. Blood draining till you die. You won't make it through the... \n\nLight your signal flare in the air. (in the air) I need to find you. \nHospital white glare. Are you there? (are you there) This is the rescue. \n\nLet us begin the surgery tearing you apart. We need to fix the valve on your failing heart. I hope I blocked the pain. I hope we're not too late. Don't you dare give up. \n\nWhite noise. In the air. Buried in the layers. Disarmed by the sound of the signal that I found. \n\nThis is the rescue \nThen the warnings and the flat line paint the picture of my mistake. \nWhite noise in the air buried in the layers. White noise. In the air. Buried in the layers. Disarmed by the sound of the signal that I found. This is the rescue. Then the warnings and the flat line paint the picture of my mistake\n\n", "album": {"title": "Meaning_In_The_Static_(2006)&&5607", "genre": "", "year": 2006}}, {"title": "So Here Is Us, On The Raggedy Edge", "href": "So_Here_Is_Us,_On_The_Raggedy_Edge&&9922", "artist": {"unique_name": "On_The_Last_Day"}, "lyrics": "Flood this room (completely sealed) with my regrets. (with water dark and cold) Cold they climb (it's rushing in) above my knees. (my heart begins to slow) Slow enough for me to sleep. (So sorry, I lost my way)\n\nNot worried or afraid. Just sorry I lost my way in these sleepless dreams.\n\nBrace the doors. (against my weight) Don't let me out (not even if I scream) scream for help (there's no one home) This water's cold. (my heart begin's to slow)\n\nSlow enough for me to sleep.\n(So sorry, I lost my way)\n\n(I'm just sorry I lost my way)\n\nNot worried or afraid. Just sorry I lost my way in these sleepless dreams.\n\nRespect my last request when you remember what it is.\n\nFlood this room (completely sealed) with my regrets. (my heart begins to slow) Slow enough for me to sleep.\n\nRespect my last request when you remember what it is. Respect my last request\n\n", "album": {"title": "Meaning_In_The_Static_(2006)&&5607", "genre": "", "year": 2006}}, {"title": "Leaving The Citadel", "href": "Leaving_The_Citadel&&6189", "artist": {"unique_name": "On_The_Last_Day"}, "lyrics": "You seemed so strong, stood your ground. Is this enough to make you proud?\n\nThe seasons barely change. They move too fast for me.Back home the autumn leaves are falling softly from the trees. Don't take this away, I'm close to sanity. I pushed against the grain and drove a thousand miles away.\n\nThere's nothing left (I've given all I have) Done what I can (I've leaned into the wind) It's all (it's all) For you (I've done all that I can) There's nothing left (I've given all I have)\n\nYou seemed so strong, stood your ground. Is this enough to make you proud? You seemed so strong, stood your ground. Are you proud?\n\nWinter turns to spring, but it still looks the same. The city is gray and there's still the constant rain. Now I understand the things you gave to me. Because I have the means to fight a faceless enemy.\n\nThere's nothing left (I've given all I have) Done what I can (I've leaned into the wind) It's all (it's all) For you (I've done all that I can) There's nothing left (I've given all I have)\n\nI'm sorry. I'm trying. Are you proud?\n\n", "album": {"title": "Meaning_In_The_Static_(2006)&&5607", "genre": "", "year": 2006}}, {"title": "At The Breaking Of The World", "href": "At_The_Breaking_Of_The_World&&7619", "artist": {"unique_name": "On_The_Last_Day"}, "lyrics": "Panic, the earth is heaving up beneath me\nI've got nothing to say to besides it's over\nFire breaks through the window pane, it's coming\nThe guilt weighs down on me, heavy\nThis is the last moment that I'll ever feel\nThen finally I find the thing that keeps me safe\nHere comes the rain\nTo douse the flame, to wash away all my mistakes\nRuins stand stark against the sky and smolder\nThe air is heavy and it smells of sulfur\nSirens warn of the coming fear, take cover\nHere comes the second wave for me\nTriggered, by my failures\nCarried, in the flames\nOur part, is ending, trust me, I'm not afraid\nBlack smoke, on the horizon, the sky is burning, but where are you, I won't die alone\nI won't die\nThen finally (Then finally) I find the thing (That keeps me safe) Here comes the rain (To douse the flame) To wash away (All my mistakes)\n\n", "album": {"title": "Meaning_In_The_Static_(2006)&&5607", "genre": "", "year": 2006}}]