[{"title": "No More Drama (Remix)", "href": "No_More_Drama_(Remix)&&4039", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(P. Diddy)\nHere we go again\nYeah, that's right\nHere we go again\nHa Ha, yeah\nThis is the remix\nBack together again\nLet's go Mary\n\n(Mary)\nAll the love we gave\nThe loving that we made\nThen you went away (that's right)\nSo I had to pray\nSee a brighter day\nCause silence let us pray\nNow I'm moving on to get away from all this pain\n\nI feel (I feel)\nBetter than I felt before (so much better)\nCause there's no more drama knocking at my door\nI feel\nBetter than I felt before\nCause there's no more drama in my life no more\nNo More\nNo More\nNo More\n\n(Diddy)\nThis is the remix\nI like this, come'on\n\n(Mary)\nIt's looking better now\nA brand new love I found\nI finially figured out\nWhat love is all about\nAnd now I'm on my way\nAnd all I have to say\nIs there'll be no crying and I truly believe that\n\nIt's time\nTo realize (people it's time)\nIt's up\nTo you and I\nLove is what you make it\nIf you don't give up the fight\nAll this really means\nAssuring me\nBelieve in all you dream\n\n(P. Diddy)\nEh yo Mary\nI don't think they ready for this one\n\nYo it's the D I D again, D to the weezy\nBeen in the game twelve years it ain't easy\nBeen in dem things got game that so breezy\nSpendin' them things with a chain that's so freezy\nPlease believe me, TV need me\nAs far as the CD, pump that on GP\nWhat's the 411 hun, it's PD\nMJB collabo with BB\nPeriod, no question no comma\nYour hearing is no vest and no armour\nBring it to cats like Bush to Osama\nSippin on vu, make moves and no scama\nWord to my mama\nCan't deal with the trama\nThat why a nigga stay in the Bahamas\nLaying in pajamas\nTwo sexy mamas\nBodyguards, topguns, two extra lamas\nI don't want no drama\n\nNo more, no more, no more\nNo more drama y'all\nIt's so hard\nBut I got to say\nNo more, I said no more, no more\nNo more, no more, no more\n\n(Diddy)\nThis is the remix\nMary J Blige\nNo more drama\nBadBoy bady\nDiddy, Yellowman, Hitmen\n\n", "album": {"title": "We_Invented_The_Remix_(2002)&&5420", "genre": "Hip Hop", "year": 2002}}, {"title": "Thank You", "href": "Thank_You&&869", "artist": {"unique_name": "P._Diddy"}, "lyrics": "You've always been right there to let me know everything's all right\nWhenever darkness came my way You were my light\nI wanna thank You for the difference in my life\nCan't even count the reasons why (oh I)\n\nI lift you up and praise Your name\nYou gave me strength to see another day\nWhen I was lost, You helped me find my way\nWhen it seems I can t face another day (That's when I call on...)\n\nYou-- In time trouble, faced with struggle I call no one but ...\nYou-- When I'm feelin' lonely, no one around me still I call on ...\nYou-- You always placed Your arms around me when I needed...\nYou-- That's why I sing this song to tell You\nLord I do love You\n\nYou are the only one who keeps on blessing me\nAt times, I thought that I was blind You helped me see\n(Oh ho) And I can never pay You back for all You've done\nThat's why I serve You faithfully and never give You up\n\nI lift you up and praise Your name\nYou gave me strength to see another day\nWhen I was lost you helped find my way\nWhen it seems I can't face another day\nThat's when I call on...\n\nKnock and He will answer\nThe lord will make a way\nHe's worthy of his praise\n\nI know life is worth living\nBecasue of you Jesus\nI always call on You\n\nDuring second time altos say (Lord I love you: love you)\n\n[Ending] - 4X\nBoys say: All I wanna do\nGirls echo: All I wanna do I\nBoys echo: is to keep lovin' you\nGirls echo: is to keep lovin' you\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "The Saga Continues", "href": "The_Saga_Continues&&50", "artist": {"unique_name": "P._Diddy"}, "lyrics": "{\"Sirius\" by Alan Parsons Project plays in the background...\nBetter known to some as \"Introducing your Chicago Bulls\" music}\n\n(P. Diddy)\nYeah can you hear me? Yeah\nThere's certain things in life that you can stop\nAnd there's certain things in life that can't be stopped\nLet's go...\n\n\"And now... for your... Bad Bad Boys...\nStarting at guard..\"\n\n(P. Diddy)\nY'all niggaz still talkin'?\nOh you got a little name little fame little fortune?\nWhat you have is a portion\n'Bout the size of the hats in the back of my Porsche and\nSo you better use caution, knowin' I'm the boss and\nI'm sittin' on pyramids, flossin\nI don't really gotta talk son\nI can get lost and sit back livin' off endorsements\nI'm a pro, kid\nWhy you actin' like you don't really know, kid?\nAny records I broke it\nThrough the fame and the stardom, makin' my mark on Harlem like Poe did\nI said, here's your eviction notice\nBut you probably already know this\nI don't mean to be greedy, but turn on your TV\nOr pick up your CD, P.D.\n\n(G. Dep)\nThis is gruesome\nNiggaz always grab that mic and salt like they really gon' do some'\nWhat's wrong with you son?\nOh you got a new gun, do you know how to use one?\nThen you livin' an illusion, livin' in a used one\nWhile I'm in the Limited, cruisin\nYou ain't really got a crew son\nYou givin' them amusement, fuck what your Comic Views meant\nYouse a smokehead\nI've been doin' this since this Pro-Ked\nBroke breads with the cokeheads\nBeen down, still I get around like a nigga with broke legs on a moped\nI said; I'm a \"Top Gun\" like Gossett\nRun and get your CD and cass-ette\nGossip, lotta niggaz got lip\nBut they ain't got hot yet till they got Dep\n\n(Loon)\nWhy niggaz lie like that? Know they ain't fly like that\nNiggaz get fried like that\nAnd you don't wanna die like that\nHave your momma cryin like that\nBesides all that, I'm in to get it fryin like that\nStill on the block and move pies like that\nNever my life dealt with guys that rap\nIn fact, I leave a nigga with his eyes all sad\nSwoll up, y'all niggaz better hold up\nAny nigga that roll up, could get fold up\nBody get ripped up, and then sewed up\nEvery nigga I fucked with, niggaz is growed up\nWe don't play games, get on the stand, and say names\nAll we do is cock back, and spray planes\nGive a fuck if nigga hustle or gangbang\nNigga try to use they muscle and fang fang\n\n(Black Rob)\nKeep frontin, I'ma put a crease in your jaw\nMight catch me squeezin the four\nMy nigga I go to war\nAnd if a nigga want the raw you still gotta come in the store\nY'all never had a run-in before, with the likes of an outlaw\nPredicate assassin, smashin\nOpen shit, rig scope, focus it\nGive niggaz what they 'posed to get (shit)\nOppose the clique, I send five close to six\nHoodfellaz, that'll come close your shit\nNiggaz stay with the frozen wrists\nNow the smoke colored big Benz with the top broke off\nFix your face, we back on the paper chase\nNever left, so I ain't gotta take your place\nFuck the fake bogus niggaz that ain't notice\nThe breadwinner, three-six-five I stay focused nigga\n\n(P. Diddy)\nWe'll never stop...\nWe'll never stop...\nOne of the greatest teams that ever lived...\nIt's like in our blood...\nWe gotta be born this way...\nBad Boy baby\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "Back For Good Now", "href": "Back_For_Good_Now&&1075", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(P. Diddy)\nUh, yeah, you know what it is\n\n(Black Rob)\nAiyyo, back on the scene\nAin't nothin' changed\nStill doin' wild things\nWhippin' something mean\nThe whole shorts in the Rolls Royce is off\nFor sure, bouncin' the bar on my next world tour\nWhen we hit the sick, I'm the cure\nWe 'bout to pop it off so wild, hit the floor\nAin't nobody botherin' you\nAll I'm thinkin' 'bout is clobberin' you\nImmigration always sayin' I'm harboring a few\nIllegal aliens\nFemales, mostly Latins and Israeli-ans\nThe top story, evening news\nI'm the shit, they been deceiving you\nDrop the roof on the Coupe D'Ville\nShoot to kill\nAsk niggas, Duke is real\nStay lookin' for the loot to steal\nHe determined\nDon't try to touch Bad Boy, 'cause we burnin'\nI want my glory\nDuke is not a joke, and I ain't got?\nEverytime I grab the mic it's with the sole intent\nTo rip shots and give you 2OO percent\nMan, I'm tired of doin' dirt\nTired of being on the the run from Wyatt Earp\nRather be somewhere in a quiet church, sayin' prayers\nNot only sayin' mine, but sayin' theirs\nThat's cause my dawgs ain't there\n\nThe more hits we make, more money to burn\nThe more fame we get, niggas get concerned\nIt don't matter who's hot, who's out\nBad Boy is Back For Good Now\n\n(Loon)\nAiyyo, I'm fresh off the plane\nTryin' to get a little bit of stress off my brain\nM-I-A\nDom P., palm trees, 9O degrees\nArm freeze, mom please, ain't nothin' but cheese\nCaribbean Sea, Malibu breeze\nWatchin' DVDs on 5O inch screens\nSo cut it out, you ain't now Don Juan, please\nI stay spillin' Dom on my Sean John jeans\nI hit the bar, yo, it's all on me\nPop bottles, models, be all on me\nYou all gon' see how it's all gon' be\nFront on me and see where you all gon' be\nSix feet deep\nWhen the heat seek, niggas be misty\nFrom 155th to 11Oth Street\nHarlem bound, Bad Boy, who the fuck want a problem now?\n\n(P. Diddy)\nSee this is the part I like right here\nI like when I see everybody on the dance floor\nYeah, I see y'all, just shakin' your asses\nC'mon, hold on, I need to break it down\nYeah\nOne time like this\n\nNow would you clap your hands\nYour hands you clap\nIf your girl's outta place then your girl get tapped\nNiggas keep thinkin' Diddy ain't on it like that\nBut you never see me standing on the corner like that\nCause, I'm talented, yes I'm gifted\nNever boosted, never shoplifted\nForget get the cash, the money ain't nothin'\nCause everything I talk about, you know I ain't frontin'\nI rock Sean John everyday\nBoutiques from France to the USA\nAnd I make all the chips off the hits I invent\nSo it really doesn't matter how much I spent\nCause, I'm droppin' hits\nDaily\nYou burn me?\nReally?\nThink Bad Boy been played a million times\nAnd I don't care if niggas write a billion rhymes\nDamn, we still paid!\n\nWe still paid!\nYeah, we got it made!\n\n(Loon)\nAiyyo, this game ain't stoppin'\nWe champagne poppin'\nGirl, I got shit that your man ain't coppin'\nYou could hop in when your man ain't watchin'\nGive you one option, temperature's droppin'\nGettin' cold, control your soul when I'm locked in\nYou the type of chick that fold when you boxed in\nSignals my watch and givin' you more reasons to hop in\nThis is a Bentley, not a Datsun\nDon't confuse me with dude, I'm not him\nYour man got a lot to learn\nBut you could leave with the cat if you that concerned\nOne day you gon' actually learn\nBut not now cause, girl, I got tracks to burn\nI stay on my J-O-B\nNigga, me, P. Diddy, B. R-O-B\n\n(P. Diddy)\nThe fam baby, Bad Boy\n\n(P. Diddy)\nYeah, I want to dedicate this to everybody that been down with us\nFrom day one\nShakin' them asses on the dance floor\nThat's all we're tryin' to do\nMo' money, no mo' problems\n2OO1, Bad Boy forever\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "So Complete", "href": "So_Complete&&9973", "artist": {"unique_name": "P._Diddy"}, "lyrics": "I remember what you said to me, when you said it to me last night\nWe was talkin', and you reassured me everythings fine\nWhen I woke up this morning to get some loving from you\nI turned to one side, to my surprise, I wasn't layin' next to you (mmmm)\nWhy don't you get closed to me, I thought it was supposed to be\nMe and you, you and me, so complete (so complete)\nWhile you handlin' me this way, what was it?\nYou was talkin' yesterday, yesterday, I could say,\nI seemed to be so complete, so complete\n\nWent away, you said nothing\nYou didn't, no kiss, no lovin'\nYou didn't, it's a shame,\nBut it brings about the weak in me,\nBrings about the weak in me\nYou didn't, spend a lifetime with me\nYou didn't, share things I wan'na see\nYou didn't, when ever your around me it's so complete\n\nSo I waited, and I wanted, 'cause I knew you would come\nHours 1, hour 2, hour, 3 hours, not at all\nIf I'm dreaming, wake me up\n'Cause I just about had enough, I had enough\nI can not see, how would you ever let this happen to me\nI still believe, that it was supposed to be\nMe and you, you and me, so complete\nSo complete, so complete\nIf you saying that you need to leave, then be a man about it\nAnd step to me, step to me, tell me please\nAnd without me it's so complete, so complete\n\nWon't you tell me right now what you want from me (what you want from me)\n'Cause it's been too long that you've held it in baby (held it in, oh)\nThought you where the one but, you just played me (you know you played me)\nNow I feel that I'm so incomplete, yeah\n\nRepeat Chorus (with different variations)\n\nPlease, give me the respone I need\nI want you to complete me, oh baby\nPlease, give me all the lovin' I need\nPromise you will complete me, oh baby\nBaby, what more can I say\n'Cause I want you to tell me\nWhat it is you wanna do\n'Cause I want'a be with you\n(Be with you...)\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "Let's Get It", "href": "Let%27s_Get_It&&3469", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(Black Rob - almost mumbling)\nThey said that I'm a Rottweiler\nAnd I'm from the Rottweiler house, the Rottweiler New York\n\n(G-Dep)\nReally, get smacked silly, you get smacked silly\nFucking with these niggas from the, what you gonna do\nWhen you ready, shit I was born ready\nAnd I was all ready on fish and spaghetti\nCreep with the culture, rap I can coach ya\nAttack like a vulture, see what I told ya\nSaid I'd get cha, wear it if it fit ya\nY'all thirteen inches, I see the big picture\nIf it's to get richer, I'd probably get wit ya\nIf not burn it, get hot like a furnace\nShoot the video, motherfuck city permits\nWe own the city, on the phone with Diddy (*phone sounds*)\nRed bone pretty, when she get aroused like to suck her own titty\nPut it in the video\nYa wanna holla got to follow nigga here we go\nGet you ticket, the train, don't miss it\nWon't reach out, and ya bet I won't visit\nTill my whole wardrobe is-it, now listen\n\n(G-Dep and Black Rob (Puffy))\nMake this money\nTake this money (Let's get it)\nAin't no way you can take this from me (Let's get it)\nAin't shit funny (uh)\nShake it honey (Let's get it)\nTake it money\nNow let's get it (Let's get it)\n\n(G-Dep)\nCreep with your people\nThough my shit is Sweet and Low it's no Equal, front but you lookin'\nOnce I throw the hook you proceed to get cookin\nWith the game when the soldiers shit\nYou came, thought that I owed you one\nWide big Lincoln, why's this guy on the side for the stinking?\nWatch task force dash forward lookin' marveled\nIt's a big chance, big pants, might guard him\nWith my man's type cargo\nBetter learn quick, cause my clique don't argue\nYou ain't my crew, who are you? Beat it\n'Fore we take off make sure you all seated\nBillboard read it believe it\n\n(G-Dep)\nSoul Controller, rap Ayatollah\nKids hate me when they older I put cracks by the stroller\nI'm registered voter, motherfuck a quota\nGive some bakin soda and a quarter\nBet I flow straight up out the water\nI'ma wreck the game till it say out of order\nPut the high score up, then tear the floor up\nOn the world tour with your whore out in Europe, head on the tour bus\nDo what them niggaz in the drop thinks cooler\nAll the five quarters, headline supporters\nHitting wives and daughters\nBrought a neck spray from Estee Lauders\nCall Puffy to order\n\n(P-Diddy)\nAiyyo, call me Diddy, I run this city\nSend the cops, the D. A. and feds to come get me\nCats wanna leave me for dead you comin' with me\nGettin' head in the Bentley red at one fifty\nStraight lose it, love two things my money my music\nMight co-write and produce it\nDrop mine, hot 9 exclusive\nGot y'all Hulkin like Bruce did\n'Cause I can, break backs and stacks it's no problem\nMake raps and tracks and go Harlem\nI get worldwide coverage\nI got so many spots I don't even buy luggage, ya love it\nMake moves major, hide out in Asia\nIf your girl keep coming around them I'm a blaze her\nI'm the Bad Boy flavor, light blue gators\nNOT GUILTY, plus I'm filthy, c'mon\n\n(Black Rob (Puffy))\nI be the east side Soprano, Rob Marciano\nFlow in each channel with the Iverson handle\nForty-five sparks turn your day gray flannel\nSnatch the yay of the mantle, then proceed to dismantle\nCan't slay Rob\nHow many niggas done tried to play mob, quit they day job\nTired of putting broke niggas under the wing\nIf I go to jail again I'm going under the bing\nAct like you gonna pull that thing thing\nYou the only one that always get stuck for bling bling\nI represent \"A\" block in Sing Sing\nAlmost caught a buck fifty for fuckin' a Latin King's queen\nMoves for paper, booze no chaser\nBullets out the blazer four-fifths with laser\nCome and get your shit splitted, newspapers say I did it\n(He ain't do it) Now let's get it (Let's get it)\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "Can't Believe", "href": "Can%27t_Believe&&7886", "artist": {"unique_name": "P._Diddy"}, "lyrics": "[Carl Thomas] (Faith Evans)\nUh, oh, oh yeah\nOh, oh, oh, oh, oh yeah\n(Emotional)\n\nI always dreamed that everything would be okay\nWith me and you, but I was wrong\nWhen I looked into your eyes\nI didn't see all the things I used to see\nWhat's going on?\n\n1 - [Faith Evans]\nYou gave me reason to believe that\nWe were always meant to be\nBut now I see, you were wrong\nYou can't keep running back to me\nWith all those \"Baby, baby please\"-s\nNo more, no more\n\n2 - [Faith and Carl]\nNever imagined\nYou would be a painted picture\nI'm emotional\nYou saw me leaving\nNo deceiving, it's official\nI'm emotional\n\n(Faith)\nI can't forget that night I saw you in the corner\nWrapped up tight, you were wrong ooh\nSlow dancing on the floor\nWhile I was watching from the door\nSo hurt, there you were\n\nRepeat 1\n\nRepeat 2\n\nYou had your chance\nBut you through it all away\nThought you had my love always\nOh baby, I don't understand\nWhy you think that we could in total unhappiness\n\nRepeat 2 till end\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "Blast Off", "href": "Blast_Off&&638", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(G. Dep)\nYeah...\nYeah, me and my man's and them\nWe gon' blast off\nBad Boy nigga, and we don't stop\nCome on to the top, blast off\nYeah, yo\n\nAiyyo, I take it up top for my peeps\nCracks in they Jeeps, don't sleep till they 6 feet deep\nNo 'lax' in my tracks they potent\nFuck homicide, I'ma ride, keep smokin'\nI keep smokin' till the bullshit filter\nLike cigarettes, Dep came through, killed ya\nWhen I swerve hit nerves\nNumber 1 contenders, I put 'em on injured reserve\nAnd everybody know what's golden, matter of fact platinum,\n?Mores trap to mold in?\nOnce I explode and I, burn up the road and\nCruise around the globe, the cops thinkin' it's stolen\nUnderstand, the world's in my hand\nG. Dep in this scam, no stunt\nBitch play the front\nAnd I'ma show you how to lay back do a buck while you puff on a sac\nCause yo, I'm about to blast off -\n\nStraight to the chase, cause everybody know what's the case\nAiyyo, I'ma about to blast off\nStraight to the point, aiyyo, yo, light another joint\nNigga, I'ma blast off\nRight to the top, aiyyo, no, I ain't gon stop yo\nNigga, I'ma blast off\nStraight to the dome, you entered in the Bad Boy zone\n\n(Mark Curry)\nYo, yo, uh\nWho's a nigga harder than me?\nOn the boats, make it known how the slaughterin' be\nDamn, Curry ain't the shit? Put the name in your mouth\nGot it different? You ain't on what you talkin' about\nBustin' off in her mouth, catch me\nI'm feelin' for whoever test me, pity for whoever second guess me\nKnow how to ?manhand'? it's real as it get\nFeelin' my shit, straight through the cealin' with this\nBet your block love it, find me only with the grimy\nGutters of the street where my mind be\nPlay the game, get you a 'zil'\nForever, put you until, it fit me to kill\nHeat, got it with me still\nFlip the game over, see me, we be, untouched\nOut like your motherfuckin' guns bust, BLAOW\nSure shot, hit again, spit it grim, anytime, anyplace\nBitch, I'm about to-\n\n(G. Dep)\nBlast off, yo I get it poppin'\nWhen I rock, yo it's non-stoppin'\nYo, I'm about to blast off\nSee me at the show, when I rock everybody know\nAiyyo, I'm about to blast off\nBottles gon' pop, 'cause when I rock, everybody rock\nAiyyo, I'm about to blast off\nStraight to the top, cause everybody know this is hot\n\n(Loon)\nAiyyo son, I'm about to blast off, like an astronaut\nNiggas don't wanna see a nigga blast the glock\nNiggas don't wanna see a nigga flash the rocks\nAnd pop up in the flashy drop - motherfuckers\nNiggas know me, Loon's a gunslinger\nFuck fightin' a nigga, I'm usin' one finger\nCatch one of you rap cats in the 'Humdinger'\nSome niggas get shot, live and become singers\nExpect to die, I'd rather sit in a chair, electrified\nThan to stand here and testify\nBut, other than that though, we never get caught\nWe George Jefferson walk out of federal court\nWe gettin' bread in New York, ain't better the sport\nSo whatever you thought, you can use whatever support\nBut, I think it's best you go 'head and just walk\nOr have the cops find traces of lead in your corpse\nYo, I'm about to-\n\n(G. Dep)\nBlast off-\nStraight to the chase, cause everybody know what's the case\nAiyyo, I'ma about to blast off\nStraight to the point, aiyyo, yo, light another joint\nNigga, I'ma blast off\nRight to the top, aiyyo, no, I ain't gon stop yo\nNigga, I'ma blast off\nStraight to the dome, you entered in the Bad Boy zone\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "If You Want This Money", "href": "If_You_Want_This_Money&&1951", "artist": {"unique_name": "P._Diddy"}, "lyrics": "You are now entering a Bad Boy zone (3x)\nYeah!\n\n(Morock)\nThis is for the niggas who ain't got shit to love\nI cripple thugs, just because\nYou not Jada but you could, kiss the slugs\nUntil your place hit up\nRap niggas in the studio, wasting bucks\nYou're better off making sure papi know your name well\nGuess who ghostwrite for me, my brain sails/sells\nNow believe it, better place checks\nBad Boy, big things nigga, HF\n\n(Classy Freddie Blassy)\nI put it down for mine, my crew live a life of crime\nConstantly non-stop, when they on the climb\nAnd BK, no such thing, it's dark\nThe sun go down, the tool start to spark\nOutline in chalk, moms lift the part\nCases handle in the street, motherfuck the court\nShouldn't talk the talk, you can't walk the walk\nIt's The Hoodfellaz, what the fuck y'all thought?\n\n(G. Dep - Chorus)\nNow if you want this money baby\nThen I guess you in the right place\nAnd if your mind ain't right sugar\nThen you need to get up outta my face\nSo what's the deal?\nCan't ya see how a nigga feel?\nAnd let me know if you gon' ride tonight\nCause this paper we makin' is real, all day\n\nIt's like that y'all (that y'all)\nDon't get it twisted with the rap y'all (rap y'all)\nStill walk around with the gat y'all (gat y'all)\nDon't make me have to point it at y'all (at y'all)\nAnd clap y'all (clap y'all)\nThat's how I see things goin'\nChains showin', rings glowin', Range Rovin'\nAnd my nigga push ki's like Beethoven\nIt's gonna stay like that till the pearly gates open\n\n(P. Diddy)\nAnd here we go {overlaps Verse's last line}\nAiyyo, let's get it where it needs to be\nTuned in to the, P-the-D, please believe\nI told y'all it's on for life\nThe only bars I ever be behind is the one's I co-write\nHold it down, hold the crown\nWhat I gotta brag for? Y'all should know by now\nCats talk this and that, so we rip the track\nThis a fact, it's a wrap, uh!\n\n(G. Dep)\nYo, yo\nNiggas mad at the fact we bad\nMan I won't stop like a New York taxicab\nIf your shit wack, we burn\nIf you got beef, we come back like a tax return\nWe get money, hold money, no quotas\nWe gon' fuck around and do this murder, no motive\nAiyyo, I burn more\nWait till I drop it, then you can learn more (Why?)\nCause you a turn-off\n\n(Poppa Sims)\nNumb in my veins\nAnd bought enough to numbin' the brain\nLovin' the brain, let a slob till it's come and arrange\nStrollin' the block, honey holdin' the glock\n1-9, come on baby, it's crunch time\nIn a truck blue, yellin' my fuck you's\nDoin' a buck-2, circle hoods like Doug Ghouls\nHuggin' the piece, ha ha, Sim is the word on the street\nCome on, I can make dessert outta beef\n\n(Chorus - till fade)\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "So Complete (Remix)", "href": "So_Complete_(Remix)&&8527", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(Feat. Cheri Dennis)\n\n(P. Diddy)\nUh\nYeah\nDiddy\nCheri Dennis\nBad Boy\nLa Familia\nThe saga baby\n\nBefore I met you couldn't take stress\n'Cause after BIG died my nigga Mase less\nAnd that's when I started havin' faithless\n'Cause Black Rob he on trial and I escaped death\nStill in your tape (yeah) still gettin' hate threats\nStill gotta take that\nStill gettin' sued for money I ain't even make yet\nWithout you girl I'm incomplete\nI can't lie ma I'm in too deep\nAnd yo I know we don't get to spend time together\nJust you and me nevermind the cheddar\nAnd though we barely speak on the phone\nCould tell by your tone, you hate bein home all alone\nAnd I wish I could sleep witcha\nRoll around in the SHEETS witcha\nNo fans hold hands on the beach witcha\nGirl I'd do anything just to be witcha\nOn the real 'cause I feel so complete witcha\nYeah, talk to me girl\n\n(Cheri Dennis)\nI remember what you said\nWhen you said it to me last night\nWe was talkin' and you reassured me everything's fine\nWhen I woke up this morning to get some lovin' from you\nI turned to one side\nTo my surprise, I wasn't layin next to you m'mm\n\nWhy did you get close to me\nThought it was supposed to be\nMe you you me so complete\nWhy you handelin me this way\nWhat was it you was talkin' yesterday\nYesterday, I could say, I seemed to be\nSo complete so complete\n\nWent away you said nothing\nYou didn't no kiss no lovin'\nYou didn't it's a shame\nBut it brings about the weak in me\nYou didn't spend a lot of time with me\nYou didn't share things I wanna see\nYou didn't when ever you're around me it's so complete\n\n(Cheri Dennis)\nSo I waited and I waited\n'Cause I knew that you would call\nHours 1 hours 2 hours 3 hours not at all\nIf I'm dreamin' wake me up\n'Cause I just about had enough, I had enough\nI cannot see how you would ever let this happen to me\nOowoowoo\n\nI still believe that it was supposed to be\nMe you you me so complete\nIf you're sayin' that you need to leave\nThen be a man about it step to me\nStep to me, tell me please\nThat without me it's so complete, so complete\n\n(Cheri Dennis)\nWon't you tell me right now what you want from me\nWhat you want from me\n'Cause it's been too long that you've held it in baby\nHeld it in\nThought you were the one but you just played me\nYou know you played me\nNow I feel that I'm so incomplete\nYeah hoo hoo yeah yeah\n\n(Cheri Dennis)\nPlease, give me the response I need\nI want you to complete me, oh baby\nPleas, give me all the lovin' I need\nPromise you'll never leave me whoa baby\n\nBaby what more can I say\n'Cause I want you to tell me\nWhat it is you wanna do\n'Cause I wanna be with you\n\n", "album": {"title": "We_Invented_The_Remix_(2002)&&5420", "genre": "Hip Hop", "year": 2002}}, {"title": "Child of the Ghetto", "href": "Child_Of_The_Ghetto&&9835", "artist": {"unique_name": "P._Diddy"}, "lyrics": "Yo, yeah, yo\nUh, uh, yeah, yo\nUh, uh, yeah, yo\nUh, uh, G. Dep!\n\n(G. Dep)\nA child of the ghetto, nobody explain it to me\nLivin' the scripture the picture they painted for me\nRippin it runnin' and gunnin and aimin for me\nYo... (yeah, uh, yeah)\n\nI guess you niggaz told me right and exact\nShak, shak, right in his back\nI might just crack while I'm writin this rap\nFrom even, a tire that snap, I'm light in the sack\nI tell you how I feel and that's part of the deal\nI'm like, Seagal with the steel but \"Harder to Kill\"\nIt's real, big Beans up for lettin me know\nFifteen bet and you blow, better get dough\nWon't be a second we won't; they lettin me go\nSince pays wisen your ways, allow me to grow\nAiyyo (yo) swing yeah back to the scene\nSeven-four-eight-oh, can't recall in between\nWhole state pulsate, we can wrinkle the town\nPark jams dark shams niggaz breakin it down\nNiggaz rock the heaters, my clique rocked Adidas\nDidn't know the blocks were where the spots would lead us\nBut hey...\n\nA child of the ghetto, nobody explain it to me\nLivin' the scripture the picture they painted for me\nKnew what it wasn't, it wasn't the game or the greed\nRippin it runnin' and gunnin and aimin for me\nA child of the ghetto, nobody explain it to me\nLivin' the scripture the picture they painted for me\nNiggaz is gamin they ain't who they claimin to be\nNiggaz that know me they told me the game it could be - CRAZY\n\n(G. Dep)\nI take you back to the scene of the stunt\nScene of that rhyme and you can think what you want\nAnd if you... and if you tell me you can get it from here\nGot boom got boom, put shit in the air (yeah yeah yeah)\nGet us some gear to get us in here\nWaited years to get a premier and did it from here\nHarlem - citizen where the kid is in gear, guard him\nNiggaz in here, who get it in here, we are them\nTake you back to the 80's around\nPolo Grounds, Uptown, eight-eighty a pound\nNiggaz hit the rooftop, y'all was roofin the rocks\nOther niggaz shoe tops, only youth on the block\nYou dig me - movin in tops and movin these rocks\nYou get it - we movin them blocks to move in them drops\nSkiddin - I guess the niggaz told me right and exact\nWhen they said stop fightin and stack it - get the money nigga\n\n(G. Dep)\nEighty-one I had fun, eight-two I was new\nEight-three I did me, eight-four I had grew\nEighty-five it got live, eight-six in the mix\nEighty-seven in the kicks, eighty-eight in the whips\nEighty-nine I had the grind, now I know it was flow\nNinety-one we got guns, ninety-two it was dough\nNine-three was the key, nine-four was sure\nNine-five took a dive, nine-six I was poor\nNine-seven did eleven now I'm made out the gate\nNine-nine spit rhymes two-thousand and straight...\nShit, I thought I'd give housing a break\nSit back, countin' the cake, and lounge in estates, but yo\n\n[Chorus] - 2X {*to fade*}\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "Bad Boy For Life", "href": "Bad_Boy_For_Life&&2882", "artist": {"unique_name": "P._Diddy"}, "lyrics": "<b>P. Diddy:</b>\nAiyyo, you ready?\nLet's do it\nMmm, yeah...\nYeah... c'mon\n\nI'm the definition of half man, half drugs\nAsk the clubs - Bad Boy, that's whassup\nAfter bucks, crush crews after us\nNo games, we ain't laughin' much\nNothin' but big thangs, check the hitlist\nHow we twist shit, what changed but the name?\nWe still here, you rockin' wit the best\nDon't worry if I write rhymes - I write checks (hah!)\nWho's the boss? Dudes is lost\nDon't think 'cause I'm iced out, I'ma cool off\nWho else but me? (who else?) And if you don't feel me\nThat mean you can't touch me, it's ugly, trust me\nGet it right dawg, we ain't ever left\nWe just, moved in silence and repped to the death (yeah)\nIt's official, I survived what I been through\nY'all got drama, \"The Saga Continues...\"\n\nWe ain't, go-in\nNowhere, we ain't\nGoin' nowhere, we can't be\nStopped now, cause this Bad Boy for Life\n\nWe ain't, go-in\nNowhere, we ain't\nGoin' nowhere, we can't be\nStopped now, cause this Bad Boy for Life\n\n<b>Black Rob:</b>\nHey yo straight from the Harlem streets\nI don't play, I push it down with the Harlem Heat (uh-huh)\nAll a sudden niggaz got a problem wit me (Black, what happened?)\nThey run around actin' like the Black-o can't eat\nAnd you know what? (what?) For some strange reason (uh)\nI'm off of this medication, feelin' deranged needin\nFor y'all to put the word out (c'mon, c'mon) we ain't leavin'\nWe tryin' to be rich before we all stop breathin\nTherefore (what?) we kinda hustle lames\nStay layin down our muscle games (c'mon)\nStill turn niggaz dreams to flames (yeah) you got the wire\nIf not I ain't sayin' no names, you'll soon expire (heh)\nNo pain (nothin') I feel remorse\nYes of course it's me and Diddy up first racin Porsches\nWit the big twin valve exhaust-es {*screeching*} (yeah)\nOn the cover of ya Vibe's, XXL's and Source's bitch (c'mon, let's go)\n\nWe ain't, go-in\nNowhere, we ain't\nGoin' nowhere, we can't be\nStopped now, cause this Bad Boy for Life\n\nWe ain't, go-in\nNowhere, we ain't\nGoin' nowhere, we can't be\nStopped now, cause this Bad Boy for Life\n\n<b>Mark Curry:</b>\nYeah, yeah, yo, yeah\nIt ain't shit changed, since the Notorious (We miss you B.I.G.)\nSee everything still glorious (yeah)\nWe still got Warriors, still be the Victorious (that's right)\nSee it's a lot of them, but it's more of us\nStill got cash to blow, raps to flow\nStill them cats that know, pack ya flow, that's fo' sho',\nBottles that pop, joints that rock\nPlayed the background, hand on my jock, holdin' my glock (hahaha)\nMoney to get (yeah), cars to flip (uh)\nBars to sit at and sip Cognac wit jewels that drip (c'mon)\nHoes to see (uh), make sure they knowin' it's me (they know it's you)\nDrop that beat, can't believe that I MC (haha)\nBad Boy till the casket drop (Bad Boy) gotta love it\nPlace nuttin above it (nuttin) it's on like that (c'mon)\nDon't believe, we ain't goin' like that we're always gonna be here (yeah)\nWe there (uh) every motherfuckin year!\n\nWe ain't, go-in\nNowhere, we ain't\nGoin' nowhere, we can't be\nStopped now, cause this Bad Boy for Life\n\nWe ain't, go-in\nNowhere, we ain't\nGoin' nowhere, we can't be\nStopped now, cause this Bad Boy for Life\n\nWe ain't, go-in\nNowhere, we ain't\nGoin' nowhere, we can't be\nStopped now, cause this Bad Boy for Life\n\nWe ain't, go-in\nNowhere, we ain't\nGoin' nowhere, we can't be\nStopped now, cause this Bad Boy for Life\n\n(Bad Boy... we ain't goin' nowhere\nUh-huh... uh-huh... what?\nWe ain't goin' nowhere... we gon' stay right here\nFor ever, and ever, and ever, and ever... c'mon\nWe ain't goin' nowhere... we gon' stay right here\nWe ain't goin' nowhere... we gon' stay right here\nYeah, uh-huh... uh-huh, uh-huh)\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "Lonely", "href": "Lonely&&3664", "artist": {"unique_name": "P._Diddy"}, "lyrics": "{*Kokane begins stutter-singing the word lonely*}\n\n(P. Diddy)\nThis goes out to my nigga B.I.G.\nListen to me playboy, check dis out\nI go, on and on and on and\nWon't take her to the crib unless she's bonin'\nPD call her on the phone and\nPromise I'll leave her moanin'\nNow she zonin'\nTellin' me she's all alone and\nLove the dark chocolate tone and\nAhead of my time, I live what's said in my rhymes\nThe cars and the chedda is mine\nWe ain't, the type to sit back and lose focus\nSpit that mack-a-docious\nMost ferocious\nCash all in my holsters\nBurn more bread than toasters\nYou must know this, the cats I'm with is the coldest\nHip-hop quota but quote this\nBack on the track again, that's what's happenin'\nPlease believe it, we on top and won't leave it\n\n(Chorus: Kokane)\nSometimes I feel like I'm lonely\nAnd sometimes I feel like I'm lonely\n\n(Kain)\nUh, uh, yeah\nEy yo C-I-O-F-F-I-E\nQ-U-double E-N-Z\nCome on ma your riding with me\nLeave the lame respect the game\nWhen you hanging on my arm you expect the same\nAnd, extasy when you sex the Kain\nI, only link with the wealthiest\nAnd only cop jewels if it drop celcius\nNow, you can run but you can never hide\nBut, where you go when the temperature rise\nIt's Bad Boy see death in ya eyes\nKain Cioffe the next on the rise\nDamagin' shit hot stamina split\nYou got screwball raps we the hammerin' clique\nLimo, the club, and the cameras'll flip\nMoney, music women son we standin' in it HA!\n\n(Mark Curry)\nYo, yo, yo, yo\nDon't panic, don't take this for granted\nI did then still do and always ran it\nA lot to gain when I say I'm off the chain\nThe shit I spit... burn flames\nWho's controllin' this\nI can make the bitches grin\n'Cause I get money and run with the richest men\nKnockin' at ya door it's Curry again\nBeen down since the jump off begin\nYou know who I am\nDon't get it all twisted up\nGet the cash to my hands be all blistered up\nWe can pick it up, we can drop it low\nRecognize what it is when I come through the door\nNot partyin' and pimpin', I walk wit a limp\nOnce I took it to the top I ain't fell off since\nStay high stay fly stay cool in the fan\nAin't none of y'all seein' ya man\nGet a grip niggas\n\n(Kokane)\n(On guard, defend yo' self) It's lonely at the top hey hey (repeated twice)\n\n{*Kokane fades out stutter-singing the word lonely*}\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "Special Delivery (Remix)", "href": "Special_Delivery_(Remix)&&79", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(Intro: Ghostface Killah)\nFuck the whole industry!\nYou tried to get rid of me! Y'all must be kiddin me!\nY'all must be kiddin me! Aiyyo fuck the whole industry!\nCome on! Staten Island! Come on! Hold me down!\n\n(Verse 1: Ghostface Killah)\nMonster cut truck balley shit\nChampagne spillin while we hittin every bump that my Denali hit\nOutfit is four thousand and better\nThe rhinestones in my flintstones look crazy in my sweater\nPah, it's not a big fairy tale that's my M.O.\nFuck bitches on the reg' with no problemo\nIceberg, rabbits, and the fox and more\nWhere I coped two more, brought four for RZA\nBad Boy thank you for this special delivery\nCatch me by the pool in my Tony Starks slippers\nWonder Woman armed, Ghost is intelligent\nMade 30 offa Def Jam I was killin' 'em\nDid cash on One-Sixteen I was feelin' 'em\nThem days kept a crisp cold dollar bill on 'em\nI lived it out -- special delivery\nI spit it out -- special delivery\nI sniffed it out -- special delivery\n\n(Chorus: P. Diddy)\n(I want that) Special delivery!\n(I need that) This is the remix, special delivery!\n(Can I have that?) Come on, special delivery!\n(Well give it to me) Bad Boy baby!, special delivery!\n(I want that) We won't stop!, special delivery!\n(I need that) Yeah! G. Dep! Child of the Ghetto!\n(Can I have that?) As we proceed! Ah!\n(Well give it to me)\n\n(Verse 2: G. Dep)\nAiyyo! Aiyyo!\nSigned, sealed, delivered in just the nick of time\nRare, I'm a give it to 'em my design is rhyme in the ghettoist form\nShow power the child of the ghetto is born\nUh, feet first, preach give a speech I kick ya each verse\nGroove let the shit just spit now it's dirt\nDeath pressin ya and ya like a hustler on the first ya need work\nStand by the grand high exhaulted\nAt your door with a portrait of the raw shit\nPicture that while I spit anthrax\nOn your CD, tape, and wax so stand back\nYou don't really wanna jump the gun\nIn the airless flow with punctured lungs\nGo 'head and stand there and bump ya gums\nIf ya wan't the problem we can hurry up and come bury ya\nI'ma play the courier\n\n(Chorus: P. Diddy)\nSpecial delivery!\n(I want that) Yeah come on, special delivery!\n(I need that) This is the remix, special delivery!\n(Can I have that?) Ha-ha ha-ha, special delivery!\n(Well give it to me) Come on come on! Special delivery!\n(I want that) Yeah yeah! Special delivery!\n(I need that) What what! Special delivery!\n(Can I have that?) Ladies and gentlemen, Keith Murray, ah!\n(Well give it to me)\n\n(Verse 3: Keith Murray)\nYo! This for my niggaz dem special delivery\nBang ya head off to this, fuckin' up your memory\nI'll shake your cradle and rock your boat\nBuck 50 your face and then butter your throat\nIt don't matter where you been or where you at\nI'm here now and I'm bangin', kid you softer than the Queen of England\nPhraseologist natural philosopher wordsmith\nAuthentical metaphorical lyricist\nSharp descriptive writer, kill a biter\nPanty raider, party exciter\nYo Murray what the deal - how ya feel?\nYeah I'm gutter what I utter got you timid hesitatin like a stutter\nOxymoron, don't be dumb\nI school niggaz like the United Negro College Fund\nI see you plottin schemin tryin' to snake\nAnd when you do I'm a give it to you special delivery\n\n(Chorus: P. Diddy)\n(I want that) Special delivery!\n(I need that) This is the remix! Special delivery!\n(Can I have that?) Get wit me now come on special delivery!\n(Well give it to me) Bad Boy baby! Special delivery!\n\nAy yo hold up a second... this is the remix\nSo let's bring back my man, Craig Mack\n\n(Verse 4: Craig Mack)\nAiyyo you must wanna be in the Guinness Book of World Records\nAs the dumbest motherfucker alive\nFigure you gon' survive\nYou couldn't move through my terrain, even in 4-wheel drive\nAnd I'm your highness, finest\nYou hungry? Try this, buy this, livest\nUh huh, I take my rap style real serious\nWhat you think it ain't... that serious?\nI bang clubs and streets it's gettin' hot\nSee Mack won't stop until Mack's on top\nYoung black America my CD drop\nIn two thousand and two, to change hip-hop\nMost folks shake ya bones\nI'm talkin' cyclones and \"Terrordomes\" like Mel Gib-son's\nMy heat will cook you bwoy, whooped you bwoy!\nMack came an shook you bwoy, somma'bitches\n\n(P. Diddy)\nSomma'bitches!\n\n(Chorus and Outro: P. Diddy)\n(I want that) Take that! Come on! Special delivery!\n(I need that) Special delivery!\n(Can I have that?) This is the remix! Special delivery!\n(Well give it to me) G. Dep! Special delivery!\n(I want that) Come on now! Special delivery!\n(I need that) Child of the ghetto! Special delivery!\n(Can I have that?) 1-1-5, Harlem's Finest! Special delivery!\n(Well give it to me) Yeah, special delivery!\n(I want that) Alumni baby! Special delivery!\n(I need that) B-R, special delivery!\n(Can I have that?) Ghostface, special delivery, Keith Murray!\n(Well give it to me) Craig Mack, special delivery!\n(I want that) I'm that boy they call Diddy, Bad Boy baby\n(I need that) Yeah! Special delivery!\n(Can I have that?) Special delivery\n(Well give it to me) Special delivery...\n\n", "album": {"title": "We_Invented_The_Remix_(2002)&&5420", "genre": "Hip Hop", "year": 2002}}, {"title": "Bad Boy for Life (Remix)", "href": "Bad_Boy_For_Life_(Remix)&&5141", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(Feat. Busta Rhymes &amp; M.O.P.)\n\n(Intro: P. Diddy (Busta Rhymes))\nStick 'em up!\nAs we proceed\nStick 'em up motherfuckers!\nTo give you what you need\nPut your hands in the air\nIt's star time (Bring the fire along, c'mon)\nWe still here (Bring the fire along, c'mon)\nIt's star time (Bad Boy, M.O.P., Busta Rhymes)\nMotherfuckers\nYeah, c'mon\n\n(P. Diddy)\nI'm the definition of - fuck it y'all already know\nI stack heavy doe, sell out every show\nIt'll never die, we live\nAnd we gon stay big time till it's time to see Big (B.I.G. forever!)\nGet a grip, Bad Boy never slip\nWe, runnin' strips while y'all runnin' lips\nHaters wanna stop my lute\nThey don't want me wearing Sean John, they want me wearing lawn suits\nP.D. increase the heat in ya streets\nKeep ya tapes on rewind, CD's on repeat\nMy mental, more older, jewellery, more colder\nGot a lot like its '97 all over\nYou know what I came to do; change the rules\nEven when I stand still I'm makin' moves\nI, paid my dues as soon as I stepped in\nP. Diddy a.k.a. News at Eleven\n\nThrow your hands up in the air now\nWe're gonna hit you with the heat\nFor the streets\nThrow your hands up in the air now\nWe won't stop\nIt's Bad Boy For Life\n\n(Lil' Fame (Billy Danze))\nM.O.P.!\nCatch me walking on the wildness side of your block\nYo, I bang mine, niggas showing me hood love throwing up gang signs\n(Yo, is that who I think it is?)\nYou see it, Brooklyn Military remains in blazin'\nRespect our hood because the clove is a ghetto\nBut niggas start switchin like hoes in stilettos\n(It's Lil' Fame and them!)\nRemember them niggas from the hill up in Brownsville\nWe still bangin' 'em!\nAh!\n\n(Billy Danze (Lil' Fame))\nSound the alarm\nIt's the First Family and we're back to drop bombs, boom! (Napalm)\nNuke those justice, it's the worlds, famous, fast Caress' street\nVow, to keep the homies proud in the street\nTo make our music loud and stomp over beats\nLike (ba ba bom bom ba bom bom!) There you go!\nYeah, we ain't goin' nowhere\n\n(Busta Rhymes)\nNiggas put a hundred grand up\nStand up, before I stick your bitch-ass you better put your hands up\nHate if you want and front like you ain't wit it, nigga\nI bust your motherfucking head with a skillet, nigga\nMore rugged nigga, heat for the track\nI'm like a Pick-up Truck with broken concrete in the back\nNow let me add a couple G's to the stack\nI know we got you dumb and how we put this together\nAnd run when you didn't even see it coming\nBack the fire armor and pop your car\nNigga watch me shatter your windshield with a rock guitar\nWe be them zero tolerance niggas\nI'll turn on your ass, bitch\nAnd melt you niggas like a fire, burnin yo' ass bitch\nRelax bitch, the fact is we trifil with heat\nWith cycles with lyrics right from the street\nI'm sayin' \"AS WE COME THROUGH, PUT THE SHIT DOWN\"\nSoldiers get up, faggot niggas need to sit down, what?\n\n", "album": {"title": "We_Invented_The_Remix_(2002)&&5420", "genre": "Hip Hop", "year": 2002}}, {"title": "Unfoolish", "href": "Unfoolish&&8542", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(Chorus: Ashanti and (Notorious B.I.G.))\nSee, my days are cold without you (Here's another one)\nBut I'm hurtin' while I'm with you (And another one)\nAnd though my heart can't take no more\nI can't keep runnin' back to you\n\nSee, my days are cold without you (Here's another one)\nBut I'm hurtin' while I'm with you (And another one)\nAnd though my heart can't take no more (Uh)\nI can't keep runnin' back to you (Uh, uh, uh)\n(Here's another one, what)\n\n(Ashanti)\nI think about my strength to finally get up and leave\nNo more broken heart for me\nNo more tellin' your lies to me (And another one)\nI'm lookin' like I got my head on right, so now I see\nNo more givin' you everything\nThere's no more takin' my love from me\n\n(Ashanti)\nI'm glad to wake up every day without you on my brain (Uh)\nNo more where you're laid up at night\nNo more havin' to fuss and fight\nI'm proud to say (And another one)\nThat I will never make (And another one) the same mistake\nNo more thinkin' bout what you do\nThere's no more me runnin' back to you\n\n(Notorious B.I.G.)\nSome say the X, make the sex\nSpec-tacular, make me lick you from ya neck\nTo yo back, then ya, shiverin', tongue deliverin'\nChills up that spine, that ass is mine\nSkip the wine and the candlelight, no Cristal tonight\nIf it's all right with you, we fuckin' (That's cool)\nDeja vu, the blunts sparked, finger fuckin' in the park\nPissy off Bacardi Dark\nRemember when I used to play between yo legs\nYou begged for me to stop because you know where it would head\nStraight to yo mother's bed\nAt the Mariott, we be lucky if we find a spot\nNext to yo sister, damn I really missed the\nWay she used to rub my back, when I hit that\nWay she used to giggle when yo ass would wiggle\nNow I know you used to suites at the Parker Meridian\nTrips to the Caribbean, but tonight, no ends\n\n(Ashanti)\nYou must be used to me cryin', cryin'\nWhile you're out bumpin' and grindin' (And another one)\nBut I'm leavin' you tonight\n\nSee, my days are cold without you\nBut I'm hurtin' while I'm with you\nAnd though my heart can't take no more\nI can't keep running back to you\n\nYou must be used to me cryin', cryin' (Uh, and another one)\nWhile you're out bumpin' and grindin'\nBut I'm leavin' you tonight (Uh, and another one)\n\n", "album": {"title": "We_Invented_The_Remix_(2002)&&5420", "genre": "Hip Hop", "year": 2002}}, {"title": "That's Crazy", "href": "That%27s_Crazy&&3957", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(Black Rob (P. Diddy))\nY'all ain't ready (The saga continues)\nTootsie rolls (We still here)\nYo, PD, Bad Boy, Alumni, BR\n\nI had this bad bitch uptown, she was Whoa (that's crazy)\nAlmost had me pushing up daisies (that's crazy)\nAsk a made nigga the keys to the crip (that's crazy)\nJust came home from doing a bid (Oh that's crazy)\nNow how you ain't gon' change the locks? (Oh that's crazy)\nDidn't sit there and call the cops (Oh that's crazy)\nGot in 'bout the back door LIKE Whoa (Oh that's crazy)\nHop in an Excursion with sixteen wheels (Oh that's crazy)\nYeah you love it how we huggin' the curb (Oh that's crazy)\nPlus it's jumpin' off up in the spot (Oh that's crazy)\nBoobie cat, lapdance for kid (Oh that's crazy)\nPlus the spinal chick put in the bid (Oh that's crazy)\nNow the driver smoking chron' (Oh that's crazy)\nIf he crash, then we all gone (Oh that's crazy)\nFuck it, pump the sound to ten (Oh that's crazy)\nCatch BR on the cover of Spin (Oh that's crazy)\n\nMan, it's all right, on tight\nWatch out, pushing on tonight, it's crazy\nDon't hold back, I'ma put it where it's suppose to be at\nAnd that's non-stop, party-hoppin', it's on\n\n(P. Diddy)\nYou had the nerve to say I had a gun (Oh that's crazy)\nMan for twelve years I had to run (Oh that's crazy)\nAnd ain't a threat on my family, dogg (that's crazy)\nCourthouse got my name in the log (Oh that's crazy)\nAnd ain't my name Sean John? (Oh that's crazy)\nOr about the movie star chick on my arm (Oh that's crazy)\nEven had foul shit to say to my moms (Oh that's crazy)\nThey even called the office to say it's a bomb (Oh that's crazy)\nBut yet, I'm supposed to be so calm? (Oh that's crazy)\nTavis Smiley, I killed him with the charm (Oh that's crazy)\nYeah, looked like there wasn't nuttin' wrong (Oh that's crazy)\nThat's how it is when you in the game so long (Oh that's crazy)\nMan, we been had the keys to the six (Oh that's crazy)\nFrom now on, it's no Puff, just Diddy (Oh that's crazy)\nMan, New York never looked so pretty (Oh that's crazy)\nCan't picture NY without no Diddy (Oh that's crazy), oh no\n\n(G. Dep)\nYo, how Dep ain't on, that's crazy (Oh that's crazy)\nMan, I wouldn't miss this if they paid me (Oh that's crazy)\nCome through, man, parkin' lot (Oh that's crazy)\nFuck cops, we watch the block (Oh that's crazy)\nYo, we hustle when them cameras is hittin' (Oh that's crazy)\nI did a bitch, still puttin' my bidness (Oh that's crazy)\nShit, it's hard to get one red cent (Oh that's crazy)\nAnd they charging us high ass rent (Oh that's crazy)\nAnd now my back pocket starting to leak (Oh that's crazy)\nSomebody get this nigga something to eat (Oh that's crazy)\nI got a meal when I signed my deal (Oh that's crazy)\nBunch of dreams, planes, and automobiles (Oh that's crazy)\nNow the bank don' sketched on my crib (Oh that's crazy)\nNow the boobies got a G-Dep fetish (Oh that's crazy)\nThousand dollar honies givin' me leather (Oh that's crazy)\nOver-respect due to \"Let's Get It\" (Oh that's crazy)\n\n(Black Rob)\nNow the moral of the story is what? (that's crazy)\nException, CO, doing the streets (that's crazy)\nSome chicken won't even give me the digits (that's crazy)\nSure paper, slide off with them midgets (that's crazy)\nTalk about the feds made you snitch (Oh that's crazy)\nHow you gon' hate what made you rich? (Oh that's crazy)\nLife Stories, shit, it ain't goin' gold (Oh that's crazy)\nMan, we scanned two million of those (Oh that's crazy)\nNow you don't got Permanant Scars (Oh that's crazy)\nYou know, bank or papi R (Oh that's crazy)\nLights, camera, action, I'm a star (Oh that's crazy)\nLike yesterday, I broke a nigga's car (Oh that's crazy)\nNow sittin', endless cash (Oh that's crazy)\nBad Boy, got the game in a smash (Oh that's crazy)\nFuck around and put a foot in your ass (Oh that's crazy)\nSee, I'm thirsty, still lookin' for cash (Oh that's crazy)\n\n(Chorus to end)\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "You Gets No Love (Remix)", "href": "You_Gets_No_Love_(Remix)&&2177", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(Intro: Faith Evans (P. Diddy))\nUh, uh-uh, (There's another one)\nWhat-what (And another one)\nThis is the remix (There's another one) Ha ha\nI know it's not too ghetto (And another one, Bad Boy)\nI know it's not too ghetto\nPedigree (Pedigree baby) I said I know it's not to ghetto\nDonaway (Faith, Faithfully, the remix)\nYou better, check yourself respect yourself\nYou better go for self because I flow for self\n\n(Verse 1: Faith Evans)\nI'll tell you why there's no love, simply you're not cool enough\nFor what we had between us, don't you know you lost my trust\nPeople ask me where you've been (Where you've been)\nAnd I tell them were just friends (Tell them we're just friends)\n'Cause it's so obvious that it's never gonna work for us\nNo no oh no (No)\n\nPlayed with my emotions (Played)\nYou gets no devotion (And you gets no love, gets no love)\nYou can't get no love from me\nYou can't even be my friend (Be my friend)\nAnd you gets no love again\nWhatever you do it will come back to you bitch\n(You gets no love from me)\n\n(Verse 2: Faith Evans)\nTell you why we can't hook up (You gets no love)\n'Cause I had about enough (You gets no love)\nHearin all the lies you tell (You gets no love)\nBoy I thought I knew you well\nPeople think that you're my man (People think that you're my man)\nThey don't even understand (They don't even understand)\nJust because I let you get some that don't make you the one\nWe ain't even in love (You know you played with my...)\n\n(Chorus: Faith Evans)\nPlayed with my emotions You gets no devotion\nYou gets no love, you can get no love from me\nYou can't even be my friend (Can't be my friend)\nAnd you gets no love again\nWhatever you do it will come back to you bitch\n\n(Bridge: Faith Evans (P. Diddy))\n([P.Diddy:] Yo! Faith let 'em know!)\nYou better, rock my shit don't knock my shit\nBecause I got the shit that make you cop my shit\nI know y'all sick of this Bad Boy diva\nThat blows and plus got flows ridiculous\nYou better, rock my shit don't knock my shit\nBecause I got the shit that make you cop my shit\nIt's the chick from the bricks that got the hot shit\nLeft you sick from the single now check the remix\nBoy you had a clue, thought we had a cool relationship\nBut you couldn't handle it (You couldn't handle it)\n\n(Verse 3: G. Dep (P.Diddy))\nYo! At the end of the day what a playa 'gon do? (Badboy)\nYou got love for me, It's how supposed to be\nSame love I'm a land on you (Come on)\nRight back at you it's only natural\nSo what I'm gon' do? Me\nEverything love ain't always lovely\nLeave it all up to me, I'll be livin' in luxury, sucker free\nWithout no lies without no ties to those that patronize\nThat's why I don't socialize\nI eat, shit, even sleep with open eyes\nJust, give me that gasoline\nI'll move in the jag few bags of green\nCouple ads in the magazine\nAll freezy and I'm easy G Deezy one\n\nPlayed with my emotions, you gets no devotion\nWhatever you do it will come back to you bitch\nYou can't even be my friend, cause you gets no love again\nCan't even be my friend, and you gets no love again\n\nYou played with my emotions and you gets no devotion\nCan't even be my friend, and you gets no love again\nYou played with my emotions and you gets no devotion\nCan't even be my friend, and you gets no love again\n\n(Chorus: Faith Evans)\nPlayed with my emotions You gets no devotion\nYou gets no love, you can get no love from me\nYou can't even be my friend (Can't be my friend)\nAnd you gets no love again\nWhatever you do it will come back to you bitch\n\n", "album": {"title": "We_Invented_The_Remix_(2002)&&5420", "genre": "Hip Hop", "year": 2002}}, {"title": "The Last Song", "href": "The_Last_Song&&4845", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(P. Diddy)\n1, 2, 1, 2\nYeah y'all can hear me\nMake the drumming sound yeah\nLets ride yeah yeah\nBe clear we here lights out\nEat here sleep here my house\nRhyme wasting time wasting\nFeds want me caged in\nHope they got patience\nMore you win they want you to lose\nI don't floss no more I drop jewels\nHope we might chill the heights real\nStill we got fire that will melt your ice grill\nKnow the deal once we hit record\nHit the floor\nNew era this is war\nLord I'm the answer without a question\nNo evidence no possession\nStop stressing\nShit I got moves to make\nStreets is dark but still I illuminate nigga\nI could see the way\nTill I see the end to me and BIG meet again yeah\n\n(Mark Curry)\nCurry going hit again\nDreams your living in\nThis what you coulda been\nEvery city foot scene gets scrilla with em\nKid shortchange the dealer\nThe game be gorilla\nAin't nothing illa\nAka 800 toll free aside\nI rose to be a Bad Boy till I die\nThe official bonafide (fide)\nTested and tried (tried)\nGet in like Canson\nWork from the inside\nWhen I ride eyes are wide\nAin't that I lick when I walk\nMy some pimping to my stride\nSome wit a emphis on my side\n'Cause I understand niggas out to get I\nLiving the life\nIs no lie\nBeen a great thing to do\nNuttin I could think change the view\nAlthought it might seem strange to you\nIts plain to me\nI'm here with you\nLets give them what they came to see\n\n(Big Azz Ko)\nYow yow aiiyo\nWe exceptional\nCongressional\nIts best that you bester crew\nWit your flesh going bruise\nBlood goin' ooze and\nHowever you choose your ass goin' lose\nThis ain't the blues\nDon't things that cruise\nGo bring the news\nWit flows meaning cruel\nFrom few options\nTo cruise hopping\nNow fools plotting 'cause I chart topping\nFrom bounce checks to being in effect (fect)\nAnd it don't stop till they reinterbect\nRhyme calisthetics\nBad Boy anesthetics\nWill twist me like crippie\nAmanda Chevitts\nBack flips tactics\nBe on measure\nHat tricks wit only dimes and better\nNigga just for that cheddar\nO please I switch cheese to leather\n\n(Loon)\nUh yeah uh yeah uh\nCheck it out yo\nY'all niggas say what y'all wanna say\nFeel how y'all wanna feel\nWho give a fuck dog kill who you wanna kill\nJust keep it real when it come to me\n'Cause all my niggas in the slums kinda hungary\nOn my right where my gun going be\nBitches ain't getting a crumb from me\nMember when niggas used to run from me\nAll of a sudden niggas names is buzzing\nNigga in the game got a little chain becuz\nHeard the nigga signed a major budget\nBut I'm the nigga made you love\nNow you wanna change the subject\nI ain't sweating that animosity\nI'm deading that\nInstead of rap imma smack you dead in your trap\nI don't give a fuck what I said on a track\nNiggas know me better than that\nNiggas I could neva be wack\nMy money way to ahead of you cats\nI'm going strait to the top where the cheddar be at\nWassup wit that\nYeah bad boy nigga\nFuck y'all wanna do\n\n(P. Diddy)\nAs y'all can see when have come to the end of our program\nVery important that I let y'all know\nThat I truly appreciate and I'm thankful\nFor all your support\nFor everybody that's been down from day one\nI love you\nWe love you\nP. Diddy and the Bad Boy Family\nWe out\nAiiyo BIG we miss you\nOne\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "Woke Up in the Morning (Remix)", "href": "Woke_Up_In_The_Morning_(Remix)&&369", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(Chorus: Carl Thomas)\nWoke up in the morning, you were not there\nAll I seen was an imprint of your head\nIn my pillow, weeping willow\nWhy'd I treat you so bad\nI should of known one day that you'd be gone\nYou should of known one day that I'd be gone\nYou should of known one day that we'd be\n(Verse One by Carl Thomas)\nWhy did you have to be this way\nBaby all you had to say\nIs that you were sick and tired of the man I began to be\nBut you planned a great escape\nBright and early before I wake\nWe both knew we had to break\nYou could of chose a better way\n\n(Chorus: Carl Thomas)\nWoke up in the morning, you were not there\nAll I seen was an imprint of your head\nIn my pillow, weeping willow\nWhy'd I treat you so bad\nI should of known one day that you'd be gone\nYou should of known one day that I'd be gone\nYou should of known one day that we'd be\n\n(Verse Two: Carl Thomas)\nIt was cold the way you left\nStill the pain is in my chest\nBecause in my heart I felt you should of came and talked to me\nIf you put away your pride\nAnd look deep into my eyes\nIt would have been to your surprise\nThat I got up to apologize\nBut you were gone\n\n(Chorus: Carl Thomas 2x)\nWoke up in the morning, you were not there\nAll I seen was an imprint of your head\nIn my pillow, weeping willow\nWhy'd I treat you so bad\nI should of known one day that you'd be gone\nYou should of known one day that I'd be gone\nYou should of known one day that we'd be\n\n(Break: Carl Thomas)\nOh I thought we had forever, now it's gone\nIt's time to carry on\nI thought that you made me happy\nBut it's this thing that's come between us girl\nAt one time you were my world\nNow it seems it's gone away, gone away\n\n(The Notorious B.I.G. - Rap Verse)\n(Uh) I dreams filthy\nMy moms and pops mixed in with Jamaican Rum and Whiskey\nHuh, what a set up\nShoulda pushed 'em dead off, wipe the sweat off\nUh, cause in this world I'm dead off, squeeze lead off\nBenz sped off, ain't no shook hands in Brook-land\nArmy fatigue break up teams, the enemies\nLook man, you wanna see me locked up, shot up\nMoms crotched up over the casket, screamin \"Bastard!\"\nCryin, know my friends is lying\nY'all know who killed em' filled em' with the lugars from they Rugers\nOr they Desert, dyin' ain't the shit but it's pleasant\nKinda quiet, watch my niggaz bring the riot\nGiving cats the opposite of diets\nYou gain thirty pounds when you die no lie, lazy eye\nI was high when they hit me, took a few cats with me\nShit, I need the company (uh-huh)\nApologies in order, to T'Yanna my daughter\nIf it was up to me you would be with me, sorta like\nDaddy Dearest, my vision be the clearest\nSilencers so you can't hear it\nCompetition still fear it, shit, don't ask me\nI went from ashy to nasty to classy, and still\n\n(Chorus By Carl Thomas 4x... music fades out)\nWoke up in the morning, you were not there\nAll I seen was an imprint of your head\nIn my pillow, weeping willow\nWhy'd I treat you so bad\nI should of known one day that you'd be gone\nYou should of known one day that I'd be gone\nYou should of known one day that we'd be\n\n", "album": {"title": "We_Invented_The_Remix_(2002)&&5420", "genre": "Hip Hop", "year": 2002}}, {"title": "Where's Sean?", "href": "Where%27s_Sean%3F&&4654", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(P. Diddy)\nEh yo what's up playboy\nYeah, now I'm out here in Milan\nI need you to come get wit' me aight?\nYeah, I got something I need you to do\nCall up the rest of the crew\nI'll see you there\n\n(Big Azz Ko)\nYo, I got the call from Sean he out in Milan\nWent to get the package, got there it was gone\nHold on say word you got to be joking\nDon't worry about it dun I'm on the next thing smoking\nHit Bristal up on the speed dial\nYo these funny talking cats tryin' to do a nigga foul\nIt's goin' down nigga round up the team\nI'm'll head over here just to map out the scene\nShip them things in route to climb walls\nInfrared vision ear plugs and all\nDigital surveillance linked with laptops\nExpress mail it to me can't ???\n\n(Bristal)\nI'm splurtin' for certain Bris-pro working\nSearchin' dippin' curvin' breakin' clean outta virgin\nFrom servin' here Rob certain I'm burnin'\nOn my way from Mt. Vernon\nSwervin' a stretch bourbon\nIdentity of this man I look persian\nHey yo we gotta get him\nI wanna know where they came from\nOr who sent them\nFirst nigga to find them better bend'em\n'Cause I just spoke to Polly Fontaine\nShit ain't a game, and Sean feel the same\nSo y'all niggas betta get on point\n\n(P. Diddy)\nWell it seems like our bad boys have theirselves in a bit of a jam\nSeems like Bristal got his back up against the wall\nWell let's see how Rob B-O handles this one\nBad boys watch ya backs\nWatch ya backs bad boys\n\n(Black Rob)\nYo, who the fuck is this pagin' me at eight forty six\nI'm hoppin' outta shorty whip\nI'm by the tel, across exxon by the shell\nSense of urgency on the cell\nWe gon' pick you up, when ya flight land\nWe in a tight jam\nMe and Diddy fam sorta like his right hand\nI touch down like two-thirty\nIf I was on you, your hoe's and them cowards I'm'll do dirty\nStill a commssion and we all equal\nAll lethal\nCaught'em doin' dirt to the wrong people\nIt's the family affair, I'm here\nWith all of me I'm'll deal with this one accordingly\nGot the locations sittin' in the console pacin'\nGet bagged murder be the case and\nAnd I'm tired in jail\nEven though through the riots I prevailed\nEnjoyin' my freedom, got two kids as long as I feed'em\nI'm here for the fam that's there when I need'em\n\n(Mark Curry)\nYo, uh uh uh, hello\nIt gotta be the same cats\nI can tell by they strange acts\nWhen they mumble to each other\nLike Milan they run for cover\nNew 'cause this bitch that I fucked with\nOne thought I loved her\nSeas debate the storm pull him the the surface\nThat's a purpose\nOne of these faces, make'em nervous\nCatch'em when they out for hamburgers\nTurn they whole lunch into a murder\nIn a way all the rounds gon' be heard of\nThis shits big, the first thing to catch to where PD is\nI'm on it, act like they want it\nI'm'll bring the heat\nJust let me know the place we plan to meet\nAnd I'm in it sure as your heart beat\n\n(Loon)\nYo I ain't really tryin' to duck no strays\nSo watch what the fuck you say\nIt's ya mouth that started the shit\nNow you actin' all retarted and shit\nDog I came to play my part and that's it\nWe had a fullproof plan, all we need was the fam\nAmmunition, a van, two chicks and one extra man\nTwo lincoln LS Sedans\nFifteen hundred yards of saran\nAnd after the scam, we be out in Amsterdam\nYo, call Sean in Milan\nCall Sean tell Sean we gone\nWe'll meet him in Hong Kong\nWith two chicks both they thongs on\nMabe Ling and Kim Long\nBoth of them dead wrong\nTwo rich bitches the feds on\n\n(P. Diddy)\nYeah, well it seems like brother Loon is out in Hong Kong\nHe's found his self in a sticky icky icky situation\nBut you know somethin' I have faith in the bad boys\nBad boys bring it on home, bring it on home bad boys\n\n(Kain)\nHeh, I'm bout to do Santa Dimengo\nOn a horse named Bingo\nA fugitive lookin' for Puff switchin' my lingo\nStayin' at a hotel called the pink flamingo\nCallin' up MC from a cuatro cinco\nThe set up, tryin' on my way to uniform\nRoom service bumpin' Kain on the newest song\nHoldin' gats knowin' everything I do is wrong\nTill I hi-jack the sky flyin' on a unicorn\nDownstairs with a bag of money and two clips\nTalkin' to Loons chicks wit' sombreros and toothpicks\nSayin' they commit homicides for two bits\nAnd fuck for dough like I give two shits\nWildfire call from Hong Kong\nHello (Loon: Yo Kain I just spotted Sean Jean)\nHold up, some information was missing\nI just got the same page from Bris\nHe told me he saw Sean and two chicks followed by four whips\nSomewhere in the Florida sticks\nIt's a set up\nTell the crew to keep their heads high\nI'm gonna flip if any one of my mens die\nWe've been fucked somebody told us a bent-lie/Bentley (what?)\nLet's get back to the spot in NY\nSeven glocks P-S-P-O pops\nHit both the hot locks\nLet'em read it that Diddy is on them hot blocks\nSo we sent two teams to rush both spots\nHa yeah!\nSuited up ready to dumbs out\nThumbs out watch the motherfuckin' door with our guns out\n\n(P. Diddy)\nHey yo yo hold up stop the music man heh heh\nY'all niggas is crazy I was only joking man\nI just wanted to see if my family was on point\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "Diddy", "href": "Diddy&&8606", "artist": {"unique_name": "P._Diddy"}, "lyrics": "Yeah... it's Bad Boy baby\n(Yeah, c'mon) Neptunes (mm, mm, mm, mm, c'mon)\nAnd we won't stop (I like this right here)\n'Cause we can't stop (yeah)\nYeah, let me tell you somethin'\nYeah, check this out\n\n(Verse One)\nSometimes I rhyme slow, sometimes I rhyme quick\nI was on 1-2-5 and Saint Nick\nChillin' with this chick named Tondalea\nWas a hot girl and everybody wanted to slay her\nBut she wasn't fond of players, only wanted ballers to spoil her\nWith six figures and camcorders\nSo what you tryin' to tell me dear?\nI got Bently, Benson and Mr. Belverdere\nAnd I just want to blow your mind\nI'm talkin' literally blow your mind\nMy repetoire is menage-a-trois and exotic cars\nChillin' with the hottest stars\nAnd it ain't no stoppin' this\nI can't help it I'm a optomist\nAnd I'ma make ya head bop to this\nAnd at the end you gon' rock to this\nNow say my name, c'mon\n\n(Chorus: Neptunes)\nD the I the D the D the Y, the D the I the D\nIt's Diddy (Hold up!) It's Diddy (That shit's crazy!)\nThe D the I the D the D the Y, the D the I the D\nIt's Diddy (Hold up!) It's Diddy (Say whaaat?!)\n\n(Verse Two)\nAiyyo, I came in the door, I said it before\nI never the ladies hypnotize me no more\nBut... but back to the manuscript\n'Cause I don't think you can handle this\nFrom New York to Los Angeles\nI think the whole world scandalous\nI'm just tryin' to keep the candles lit\nLet the party people dance to this\nGet out your seats and clap your hands to this\nBecause I came too far for me to be bourgeoise\nIt's a Bentley to you, to me it's a blue car\nSo Branson pass me a jar\nCause these cats done went too far\nYeah one phone call send two cars\nAnd I still get searched by security guards (that's right)\nI guess that's what I have to do\nTake the game international, now what you call me?\n\n(La La La La La La La La La La La La)\nC'mon work it out girl\nI'm tryin' to see you work it out girl\n(La La La La La La La La La La La La)\nC'mon work it out girl\nI wanna see you work it out girl\n\n(Verse Three)\nNow hold up, stop (stop) now wait a minute\nWe don't stop we rock cause ain't a limit\nMy aim is winnin', got Asian women that'll change my linen\nAfter I done blazed and hit 'em, but\nI just wanna rock wit you (that's right)\nAnd take it straight to the top with you\nAnd do what I gots to do, if it's possible\n'Cause I ain't trying to stop you boo\nI, got an agenda, got on a Ninja\nOne wheelin and killin' it not to offend ya\nThat's when I met this chick named Brenda\nTender, her whole body bend like fender\nSo let me see you shake it girl (c'mon)\nI just wanna see you shake it girl (c'mon)\nFor the return of the Don, the world in my palm\nMy moms calls me Sean but y'all call me\n\n(La La La La La La La La La La La)\nC'mon work it out girl\nI'm tryin' to see you work it out girl\n(La La La La La La La La La La La)\nC'mon work it out girl\nI wanna see you work it out girl\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "Notorious B.I.G. (Remix)", "href": "Notorious_B.I.G._(Remix)&&7951", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(Notorious B.I.G.)\nYo, check it\nCall Lil' Cease\nTell that muh'fucker to bring me some muh'fuckin' weed for this hospital\nMan fuck that\nTell that reporter to go pick up ten thousand from Dez\nAnd go take about like twenty G's from Gino\nTell that muh'fucker get this nigga next door up out of here\nNigga be snorin all night I can't sleep (hehe)\nCall that big butt nurse with the long hair to come suck my dick\n(Bad Boy Big, c'mon)\n\nThe doctor said I need about three weeks of recovery\nBut the nurses is lovin' me\nSayin' the best part of the day is my half\nFeedin me breakfast, and givin' me a sponge bath\nNiggaz say I died dead in the streets\nNigga I'm gettin' high, gettin' head on the beach\nChillin', sittin' on about half a million\nWith all my niggaz, all my guns, all my women\nNext two years, I should see about a billion\nAll for the love of drug dealin'\nGot no love for the other side, fuck them tricks (fuck them)\nAny repercussion, Junior M.A.F.I.A. spit clips (that's right)\nAll the time, Big Poppa kick the war rhymes\nRaw flows, and that's how it goes\n\n(Puff Daddy)\nNotorious!\nC'mon... we are, we are\nNo, no, no, notorious!\nHe is... he is...\nNo, no, no, notorious!\n\nThis for my niggaz slingin thangs, had my ring encaged\nTruck, necklace, igloo ring and things\nFor the bitches, who see them rims spin and grin\nThat shit with the V-trim that win\nAnd the enormous fields disperse of rap\nOn the road to the riches more furs to drag\nMore niggaz to kill, than birds to bag\nHit the jeweler and splurge the tab, uh\nHops, out the truck like, \"Trick, what up?\"\nCall me Sean if you suck, call me gone when I nut\nThat's the end of us, get your friend to fuck\nUntwist and bend her up, you know the deal\nNiggaz talkin' real greasy on some ballin shit (that's right)\nFunny how quick these pricks forget\nActin' like I ain't the reason they traded they shit\nSwitched that 5, copped that 6 (that's right)\nIt's all good, you know who the clone is\nFuck the Joneses, niggaz tryin' to keep up with the Combses\n\n(Puff Daddy)\nC'mon y'all...\nNotorious!\nWe are, we are ... (what's his name)\nNo, no, no, notorious!\nHe is, he is... (c'mon, what's his name?)\nNo, no, no, notorious!\n\n(Lil' Kim)\nWho that queen bitch, keep her glass filled to the rim?\nThe Notorious K-I to the M\nThat's me, on MTV, no doubt\nTitty out like what - I don't give a fuck!\nY'all know my attitude, can't stand my cologne\nThen stay your ass home, you and your chaperone\nThings done changed, but we continue to reign\nAs the King and the Queen of hip-hop, me and B.I.\nFrank White still listen to all the (a)'ttention\nI'm by his side, with the chrome fifth, playin' my position\nSexy, young thing, from the ghetto\nThat bitch rockin' mics in high heel stilletos\nWe takin' over like Francis\nSwitchin our styles like the hottest new dancers\nSee, I let y'all live to stack a LITTLE paper\nBe glad I pushed my album back, I did y'all hoes a favor!\n\n(Puff Daddy)\nShe did you a favor, c'mon now, yeah\nNotorious!\nNo, no, no, notorious!\nHe is, he is... (c'mon, what's his name?)\nBad Boy baby, D.R. c'mon\nNo, no, no, notorious!\nWe are, we are ...\nQueen Bee baby, we are, c'mon\nNo, no, no, notorious!\nHe is, he is... (B.I.G. baby, he is c'mon)\nNo, no, no, notorious!\nWe are, we are ...\nBad Boy 2000\nNo, no, no, notorious!\nB.I.G. Born Again (he is... he is..)\nAnd he won't stop\nNo, no, no, notorious!\n'Cause he can't stop, yeah, uh-huh\nWe are, we are... (Brooklyn baby)\nNo, no, no, notorious!\nHe is, he is...\n\n", "album": {"title": "We_Invented_The_Remix_(2002)&&5420", "genre": "Hip Hop", "year": 2002}}, {"title": "Roll With Me", "href": "Roll_With_Me&&8665", "artist": {"unique_name": "P._Diddy"}, "lyrics": "(P. Diddy)\nYeah... uh-huh, uh-huh-huh...\nYeah\n\n(8Ball)\nYeah, yeah\nThis big 'Ball mayn, P. Diddy and MJG\nWe raw mayn (we raw) if pimp was a drug we'd O.D. (c'mon)\nGot game for days - betta keep yo' broad away from a nigga like me\nI likes to play (I likes to play)\nDrop the top and feel the summer breeze (let's go)\nI know you can get with that, flippin through the city\nBright lights and all my G's is out here rollin' wit me (c'mon)\nBig trucks, or fo'-deep in a old school\nLookin' for the hoes, at a club - full of drunk fools\n(WHAT WHAT WHAT?) Who wanna get it krunk non-stop\n(WHO YOU WIT? WHO YOU WIT?) Yo chill fo' dem guns pop\nOfficial player anthem, say what you drankin shorty?\nPop that Henn roll somethin' let's get this party started\nI roll with Bad Boys (Bad Boy) we like them bad girls (bad girls)\nThem fast girls, them love to shake that ass girls (shake that ass)\nGet with me, let's get a suite, order somethin' to eat\nTell me things about you (c'mon) and I'll tell you things about me\n(Let's go)\n\n(Chorus: Faith Evans)\nSho' nuff ridin', won'tcha come roll with me\nCome on, roll with me\nWe can put the top down on the highway and feel the breeze\nWe can feel the breeze\nBaby we can kiss the sky, don't matter if we never come down\nWe ain't never comin' down\nFrom the N-Y-C and Memphis Tennessee is how it goes down...\n\n(P. Diddy)\n(Uh-huh, yeah yeah)\nYeah, uh\nLet's blow the roof off (roof off) let's ride out (ride out)\nLet's try to put these city lights out (lights out)\nJust flow with me (flow with me)\nIt's Diddy with some niggaz that y'all know with me\n(Who?) 8Ball and MJG (that's right)\nWe got it man (c'mon) from Harlem to Tennessee\nLet's roll through 'em, how I call it is how I see it (that's right)\nLet yourself go (self go) the way I keep it real\nWith a smile that reminds you of my Bentley front grill (ehehe)\nYes it's on again (c'mon) to a place near you\nI'm lookin' out my rearview, fresh gear too (yeah)\nHolla at your man (holla at him) I'm clean and I'm tight (c'mon)\nThat's all day and night, these shoes fit me right\nJust bendin corners - know just where you can find\nMe picture this (picture this) you only have to use yo' mind\nWhat you know good (you know good)\nIt's your world and I'm just in it (what?)\nIt's just the way that God must have meant it\nSpeak of the man\n\n(MJG)\nPimp tyte! M-J-G\nFin' to get up on the mic with a passion\nGet up on some pads Gwen, my chick get her ass in\nFor the track, make my money\nBring it on back to the middle of the flo'\nI want the whole stack\nPlus I, need a little more, I gotta eat a little mo'\nMy seed gotta grow\nI got a reason to flow, a reason to show\nWhat I mean is I go\nOff like a champ, when I cling to the flo'\nMy twinkies shine when I hit the strip, 'llac dippin\nStrictly pimpin', as long as tricks invest in women\nFrom the Memphis Tenn., to the N-Y-C I'm representin\nI put mo' spice into yo' life than yo' entire kitchen\nBig dickin, chokin hoes with anaconda\nIf my pimpin' was a drink it'd be a can of Thunder\nI slang lumber, a spell I keep my women under\nThrough all seasons, they fall winter spring and summer\nI hit the highway smoked out pistol grippin\nBut I ain't trippin' though I'm high as hell, spaceship'n\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}, {"title": "On Top", "href": "On_Top&&5339", "artist": {"unique_name": "P._Diddy"}, "lyrics": "Yeah [3x]\n\n(Loon)\nYo I'm a gangsta, outlaw; indoor, outdoor\nNigga tell me, right, Loon goin' south paw (that's right)\nIt's Bad Boy we don't give a fuck about y'all (that's right)\nStep in the room see the bitch come up out y'all (that's right)\nI fuck with niggas but it's something about y'all (uh huh)\nActin' like Loon can't do shit without y'all (c'mon)\nI caught my menses in Benzes that out y'alls (yeah)\nSee how it feel when your friends be without y'all (that's right)\nI been doin' it, coke I been movin it\nBefore you niggas thought of the block I been through with it\nKeep confusin this music shit, die for some foolishness\nFrontin like you a hardware usin' bitch\nYou hit the block, prolly lose your whip\nNiggas (yeah) snatch your watch and the rocks out your crucifix\nWatch (yeah) how we do this shit, (c'mon) Bad Boy 2Kin it (uh huh)\nSo playboy, what type of paper is you playin' wit\n\n(Chorus Marsha 2x)\nSee that Bad Boy on the countdown (on the countdown)\nToo slow can't keep up, no, better run (better run)\nDon't stop, what we gone too far (yeah)\nDon't flop, what we just too large (oh)\n\n(P. Diddy)\nLet's get, one thing clear (that's right)\nStill the same cat who put the flavor in ya ear (c'mon)\nStill the same cat who let the BIG rock with Tony (yeah)\nMost wanted successful rap mogul (uh)\nStill got niggas wilin out on the floor (let's go)\nStill got the sky-blue drop-toppers on (yeah)\nStill eat at Justin's in Sean John velour (that's right)\nStill humble (c'mon) and still want more (uh)\nStill hate war, still want peace\nAnd I still can't stand to see blacks beefin\nY'all still sleepin' and we still eatin\nStill bring that heat, wilin out on the weekends\nStill happy in black and don't need a reason (that's right)\nStill platinum back in London and Sweden (c'mon)\nStill pack the garden like Adam did Eve 'n (yeah)\nI still got rhymes to (yeah) leave your girlfriend freakin\nHaha Haha Haha Ha (I like that)\n(C'mon)\n(Let's go)\n\n(Loon)\nAiyo, besides all the money and riches\nVideos and pictures, slippin, these silly hos will get ya (c'mon)\nBut not me, I'm too cocky\nI love when the women scream \"Hey Papi\" (that's right)\nI love when a chick leave my crib knock-kneed (c'mon)\nAnd I love when a playa-hata try to knock me (yeah)\nOr cock-block me (yeah) but you can't stop me\nYou come for all you want (yeah) but you (yeah) can't top me\n\n(P. Diddy)\nYeah I'm just a B-A-D (c'mon) B-O-Y (that's right)\nSon we multiply, nigga we don't die\nNiggas frontin like we ain't fly (say what)\nBut nigga can't name nothing that we ain't buy (c'mon)\nOr we ain't try, (that's right) or we ain't drive (yeah)\nThe judge said \"not guilty\" and he ain't lie (he ain't lie)\nNiggas need a hit it's to me they cry (c'mon)\nSo why front like nigga (yeah) P-D ain't live (yeah)\n\nC'mon, man (let's go)\n\n(Marsha)\nWe got some, real niggas, real blingas, real money makers\nNo- (Bad Boy baby) Bad Boys on top (we ain't goin', we ain't goin')\nThey won't stop (we ain't gonna stop)\nNo, we got some, real niggas, real blingas, real money makers\nNo play, Bad Boys on top\nThey won't stop\n\n", "album": {"title": "The_Saga_Continues_(2001)&&5529", "genre": "Hip Hop", "year": 2001}}]