[{"title": "What Comes Around Goes Around", "href": "What_Comes_Around_Goes_Around&&5275", "artist": {"unique_name": "Pacewon"}, "lyrics": "(Pacewon - imitating famous rap samples)\n\"Batman is just robbin\"\n\"With the pistol in my small pocket, I start robbin\"\n\"Yeah, I used to be a stick up kid\nSo now I think of all the devious things I did\nI used to roll up\" \"Me and you fool, let's make some cash\nRobbin old folks and makin' the dash\"\n\"Cause now we stickin you and takin' all of your money\"\n\"Stick up kid that's out to tax\"\n\n(Pacewon)\nAs a kid me and two friends was walkin' down the block\nOne of 'em was a fancy kid, down to the socks\nAnd the other was a kid that kept his money in his shoes\nWe knew the neighborhood already grungy in the tooth\nAnd me, the lil' pup, not holdin' no long paper\nJust enough for comic books and jawbreakers\nBuggin out like it's nothin' to fear\nThen I got distracted by somethin' I hear\nI heard, tires screech, a car pull up\nTwo jump out and hit fancy kid in the mouth\nLike - run your lil' Dodgers shirts, break off the jewels\nEmpty out your pockets nigga, take off your shoes\nThen his partner hollered at him like - dem just kids\nBut he said - in the hood, that's how stuff is nigga\nHit the car and sped off with our stuff\nFancy kid barefooted, please call McGruff, somebody\n\n(Chorus - repeat 2X)\nLucky you, monkey see, monkey do\nHear it, see it, be a monkey too\nWhat go around come around come around over round\nSee a pound hold a pound hold a pound hold it down\n\n(Pacewon)\nOkay in March of '93 I just got out of high school\nMy IQ was flyer like the beats that I rhyme to\nBut no, '95 then I stopped sellin crack\nStarted rollin' with the robbers, tecs, macs, revolvers\nNo more gettin' stuck with ten-packs and problems\nNow I'm on the hunt for checks bags and Converse\nTickets and trinkets, drugs and cash\nThugs and gats, take your lil' Lugz and hat\nFrames and rope, spend your lil' change in bars\nChasin broads, deadly like agent orange\nStealin cars, rockin' up on 19th Ave.\nFeelin' large, {?} with the fly green mask\nEvery, Friday was mine every corner was hit\nWe would, warm up the shit, be gone wit'cha kicks\nFrom a young unsuspectin to a fella that'll set it now\nIn my life what came around went around\n\n(Pacewon)\nAs I remember it was Friday like a quarter to one\nI was chillin' with the fellas, ridin' 'round havin' fun\nAnd we was sober as a soldier and we wanted to drink\nWe wanted to smoke, it's time for a steam, let's go\nDown the hill adrenaline made me think real fast\nSeen this joker hidin steppin out on Springfield Ave\nMy boy pulled to the curb, let me and my dude out\nWe stepped to him strongarm, no pullin tools now\nLike cool down fella then I grabbed his t-shirt\nHe tried to pull away we started givin' him B work\nWe got his goods then we split it up, nigga what\nHit him up, now we said, let's start gettin' drunk\nWithout a shotgun, switch or a four\nWe would, hit your jaw, then the liquor store\nI thought nobody could hassle us but\nThen one-time gaffled us up\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}, {"title": "Rocking with the Best", "href": "Rocking_With_The_Best&&5991", "artist": {"unique_name": "Pacewon"}, "lyrics": "(Samples from KRS-One)\nYes... say yeah!\nYes... yeah!\n{\"You now rockin' with the best\"} say yeah! {\"So why try and test\"}\n{\"You now rockin' with the best\"}\nHerrrre we go\n\n(Pacewon)\nThe rabbit kicks the bucket I could give a fuck about it\nYo I'm still the same nigga that a motherfucker doubted\nBut succeeded you can't beat it guess you niggaz need to join it\nI'm responsible as shit, never leave you dissapointed\nI'm the underground legend, the lord of the realm\nWhere you battle for your name then record it on film\nThen you send it to the internet, flexin your intellect\nBitches goin' crazy, little kids start spinnin it\nReply that quick, reporters askin for details\nMy fuckin' inbox jampacked with e-mails\nI'm fuckin' blown up, I never knew I'd be well known\nGettin' caught creepin' bitches checkin' my cell phone\nBut, other teenyboppers hang with a rhyme clique\nBe hawkin me to smoke and always want me to sign shit\nSo I tag 'em up, smoke they weed then step\nWhat can I say? I'm they dog like DMX, the one!\n\n{\"You now rockin' with the best\"} yeah! {\"So why try and test\"}\n{\"You now rockin' with the best\"} yeah! - PACEWON!\n{\"You now rockin' with the best\"} yeah! {\"So why try and test\"}\n{\"You now rockin' with the best\"} yeah! {\"So why try and test... the best\"}\n\n(Pacewon)\nNine said to be the best you gotta challenge the best\nSo to some I pay homage and embarrass the rest\nGet a talented test, keep a balance in this\nLike the bond between parents and kids you see\nIt's a whole lot of MC's crowdin the throne\nSo I stepped up and pulled the sword out of the stone\nLike, gimme mines, speed across city lines\nCock the semi-9, could flip at any time\nAnd uh, I know that you know that, you know that I know that\nYour lil' freestyle raps ain't where my flow at\nMy flow is well thought out, plotted and planned\nHotter than that white boy is, hotter than Cam\nMore hotter than Loon and that's just to start with\nI piss on your wall, shit on your carpet\nTake your homey to trial like Ken Starr did\nSee 'em drivin' and scream \"Get out the car kid!\"\n\n[Chorus] w/ variations\n\n(Pacewon)\nAll I do is write raps, smoke weed and guzzle Henny\nCame and broke down the door when you niggaz wasn't ready\nNow you hatin' on a brother cause you hungry cause you envy\nWant my Beamer, want my Benji's, bitch nigga come and get me\nYou can find me in New Jerz, in the Bricks, on the same corner\nWaitin with a 9M slug with your name on her\nCatch your lil' punk crew in the streets\nKnock off the top dog, give him 2 in the knees\nSnatch lil' man, smack dude in the teeth\nI do it with ease, it's like shootin the breeze\nI'm the reason and the rhyme, the style you don't lose\nYou niggaz all talk, no soul/sole like old shoes\nYou nice? The king of the mic? Show proof\nGo platinum, 1 point 5, go 2\nGo anything you can, go gold, go copper\nGo triple diamond, I'ma still flow hotter\n\n(Ad lib scratches to the end)\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}, {"title": "Don't Trip", "href": "Don%27t_Trip&&5131", "artist": {"unique_name": "Pacewon"}, "lyrics": "(Pacewon)\nRight about now, you are rocking with the best\nYes, the East coast's finest, {?} greatest\nSo here we have, the, the all raw material\nThe man from the sand, the brotherman from the motherland\nThat was another clan, make you stutter like the Dutta man\nNext, ladies and gentlemen, we have, Pacewon\n\nYeah yeah, this is hardcore gangsta rap\nYou see your pockets deflate and he don't answer back\nYou see if I diss a player then he had to be dissed\nScratch his name off your faculty list, 'cause if you don't\nI'ma flip, say word, he suck and it's through\nFuck with him, I ain't fuckin' wit'chu\nAnd then, if I ever see you on the street without a M-16\nI'ma act like Mike Tyson when he seen Mitch Greene\nYeah I'ma act like Al Capone, pull a Louisville Slugger out\nAnd beat a brother till his body look like rubber now\nPlasma leakin, lookin' like Sustecal\nDon't even come around, I'm the #1 underground\nArtist in the world by far\nAnd I wonder who's the next MC I might scar\nIs it you, you, you or maybe him\nFor I am like a ton and I roll with crazy men nigga\n\nTake it easy homey don't trip\nOr he'll empty out the whole clip\nHold your breath and leave a ransom\nStart to throw a fuckin' tantrum\nHe don't ever call for five-oh (woop woop woop woop)\nPop the trunk and grab the rifle (ch-ch, ch-ch)\nPlayers better run and hide quick\n'Cause he'll bust you and your sidekick\n\n(Pacewon)\nYeah! Son of an immigrant, passionate, intimate\nI was so infatuated with rap and gettin' into it\nFor me it was imminent, felt so fuckin' genuine\nI would rap for anyone worth a new millennium\nThen I told my dad my plan, back then\nHe was rockin' to \"Roxanne, Roxanne\"\nNow I'm all grown up educated and my plan is succeedin\nAnd I'm eatin like a deacon in the Garden of Eden\nAnd the, sooner I blow, the sooner we bust\nBreathin life into those parties that would usually suck\nBreathin life into those records that would usually flop\nWith rhymin, timin shinin like a jewelry shop with Titan\nGiant fightin off two or three cops writin\nInvitin kids to watch you and me box brother\nThe older I get, the harder I spit\nI'll beat that ass like your father and shit, oh no chico!\n\n(Pacewon)\nTake it to the bridge now\n{?} Hair pull, pass me a scalpel\nPourin till bass flow, all in your asshole\nDirties rascal, start a fiasco\nWay out in Glasgow, don't make me snap yo\nBringin' it back bro, never get tackled\nNever a flag thrown, I'm in a bad zone\nYeah I'm on your one yard line, ready to rush in\nI can feel my heart beatin', I'm bustin', it's percussion\nLike Nick Cannon played it in \"Drumline\"\nAnd I can freestyle while I'm bustin' at one-time\nAnd I can freestyle at the table at lunchtime\nThat's why everybody with a radio bump mine\nThat's why everybody with a radio like this\nNot just for backpackers or the crazier white kids\nNot just the hoochies or the niggaz that clock\nThe killers too they wanna see the nigga Won really rock\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}, {"title": "MC's", "href": "MC%27s&&4457", "artist": {"unique_name": "Pacewon"}, "lyrics": "Emceeee's\nMaster of Ceremonie [yeah!]\nEmceeeeeeeeeeeeeeeeeee\nEmceee's\nMaster of Ceremonie, cause to me Emcee means Move the Crowd\n\n(Verse one)\nYeah\nA supreme MC has lots of girls\nLets his nine go bang while he rocks the world\nYo, a cool MC stolls through the bitches\nMight be on the run down \"THE ROAD TO THE RICHES\"\nA wise MC blazes through\nAnd he ain't NO JOKE 'cause he's \"PAID IN FULL\"\nYo, a raw MC loves to blast weapons\nYou know the nigga motto, \"AIN'T NO HALF STEPPIN'\"\nA slick MC is wet off props\nHe'll tell the CHILDREN a STORY while he let off shots\nAh... a critical MC takes a stand\nIf you fear a BLACK PLANET planet c'mon raise your hands\nPeople... a hard MC got to sell\nHis MOTHER said KNOCK YOU OUT while he ROCKS THE BELLS\nBrotha... a real MC talks so brave\nAnd they also taught me how to \"WALK THIS WAY\"\nWhat!\n\n(Verse two)\nYeah\nA natural MC never kicks a bad rhyme\nThe WORLD IS HIS, he be chillin' at \"HALFTIME\"\nA rugged MC comes with a better plan\nAlways ready like yeah \"WHATEVA MAN\"\nMethodical MC's get the check\nAnd they got hot nickels so \"PROTECT YA NECK\"\nUh... a consistent MC will use a BLUEPRINT\nTo BIG PIMP while he schools his students\nA B.I.G. MC rolls with a M.A.F.I.A\nVersace shades, watchin' ya, like \"WHO SHOT AT YA?\"\nAn entertainin' MC is nice to me\nSo put your fuckin' hands WHERE MY EYES CAN SEE\nThanks... a thug MC is just like a viking\nMake a song about you and you'll still like him\nDeep MC's is total OFF THE BOOK niggaz\nMURDA MUSIK, they scare all the SHOOK niggaz\n\n(Verse three)\nA SHADY MC pulls up in a mp\nWhips out a gat but the mothafuckah empty\nA crazy MC, he always wanna SHYNE\nTill he locked up in a cell doin' nine, nigga why?\nA loose MC, he always wanna shoot\nHe ain't gotta do much, that's THE REASON he \"THE TRUTH\"\nA southern MC will capture you\nScreamin' out \"MOVE BITCH\" as he \"ACT A FOOL\"\nA creative MC is always official\nEven have his own language \"FA SHIZZLE MY NIZZLE\"\nHey, a clever MC locks the stress out\nHe don't give a fuck like \"KNOCK YASELF OUT\"\nA strong MC is crafty y'all\nHe will catch himself \"SLIPPIN'\" like \"GET AT ME DOG\"\nArgh!...true MC's paint our hood\nWith SOUL even if it ain't \"ALL GOOD\"\nYo!\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}, {"title": "Won, Part 2", "href": "Won,_Part_2&&9789", "artist": {"unique_name": "Pacewon"}, "lyrics": "(Pacewon)\nThis is a story, of a man\nUnlike any other man, for this man is the... WON!\n\n(Break: repeat 4X)\nYo, yo, yo, yo, yo\nYo, yo, yo, yo, yo (WON!) (Pacewon..)\n\n(Pacewon)\nAll across the world from the UK to Canada\nNever have you seen a rapper of this calibre\nRock the microphone with energy and stamina\nBrother so nice you could spell it out in algebra\nP-Won MC = 10 of y'all squared\nA hundred rappers scared I'll put dent in y'all beard\nGrab you by the neck, stick a pen in y'all hear\nThat's what your label get for sendin y'all here\nWhy fight when you know you can't win?\nYou climbin up the ladder but I'm the champion\nAnd these some awfully big shoes for dudes to stand in\nDespite who you know or where you campin\nYou see, what y'all flip and make on the first\nI trick off on broads, take home ya Earth\nFuck with a creole girl, take home the curse\nLeave out the hospital, take home the nurse\n\n(Chorus: Pacewon)\nAll these lil' jokers wanna play my game\nBut I'm boss here, say my name (PACEWON)\nSee I'm comin' with the rhyme, my crew mad deep\nI declare war, who that be? (PACEWON)\nAll these thick-ass pretty women checkin' me out\n\"Say My Name\" like Destiny's Child (PACEWON)\nJust speakers in the car baby no backseat\nHear the bass kick, yo that's me (PACEWON) c'mon\n\n(Pacewon)\nI'm way out of this world, superspectacular\nI'm the O.G. that bit Dracula\nMake a slick kid mackadocious\nStay away from young girls, I crack a ol' bitch\nWifebeater, like Ike Turner\nCarry five heaters and like 9 burners\nYour homegirl like it, 14 guns\nThe more heat I bring, the more she cums\nDebonaire, never fear\nMad tipsy off Grand mixed with Everclear\nI got a, QB of 'dro and like 60 bucks\nParked my whip, a limo driver picked me up and\nI jump in and smokin' Hawaiian\nWatchin \"Late Night with Conan O'Brien\"\nHit the studio your homegirl meet me\nDeeply entranced by my CD, easy\n\n(Pacewon)\nYou can see it my aura\nI'm happy as a lil' kid playin' Pop Warner\nAnd it's all thanks to my pops and {Ipora?}\nI'm a performer not standin on the corner\nMade my house warmer than a sauna or jacuzzi\nFlew me to Italy\nP.E. #1, I'm the epitome\nI, dribble a riddle, hit a kid with a fiddle and\nWiggle a lil' with my dick in the middle\nJust pull up in the alley with 10's on the chariot\nGot a 9-M-M and I do carry it\nRock hell's bells, smoke weed, sell shells\nCool as LL, well well\nSee me like 6 tours later, superfresh nigga\nBest lookin' girl in the club, I left with her\nShocked the fuck out, yeah we all are\nWe ain't wannabe b-ball stars this is rap music\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}, {"title": "Love Me Baby", "href": "Love_Me_Baby&&5166", "artist": {"unique_name": "Pacewon"}, "lyrics": "(Pacewon)\nYeah, yo...\nYeah, yo...\n\nI don't talk about killin', jewelry or linen\nI talk about women - what I do with 'em\nDroppin' 'em home to find a new victim\nActin' \"La Schmoove\" like the Fu-Schnickens\nMeetin 'em, bendin 'em up\nHit the butt without spendin a buck\nEither crush on the hood or put a dent in the truck\nShe don't care if it's rented or what\nAnd sometimes they trick on me\nLike Playboy that drink on me\nGangsta chicks always stay with the steel\nDip out without payin' the bill\nIt seems like the wilder they get, the better they are\nEven let her push the getaway car\nI'm shotgun buggin, roll a cigar\nBaby stop, let's go to the bar\n\n(Chorus - female singer)\nLove me babe, love me babe {*8X*}\n\n(Pacewon)\nYo, blast that ass yo, that's your last warnin\nSplash that ass more fast than Flash Gordon\nWhen I say blast I don't mean with a pump\nI wanna fuck till my dick get numb\nI'm like Christopher Walken with a spliff and a tall can\nTeenage girls gotta sleep with a floor pan\nWe 'bout the scrilla, need another winner\nTreat her out to dinner, leave the rubber in her\nIn the jaw like Ambesol\nYou can even bring a friend, I can handle y'all\nWhattup in the truck, in the Cadillac\nAt your boyfriend house with the hammers backs, yo\nIt ain't nuttin that she won't tell me\nTake you out of town to a hotel suite\nLock the door, we can fuck right now\nLet me turn that pretty ass upside down\n\n(Pacewon)\nYo, y'all do y'all while I do me\nWith a chick, that look like the girl from the Hughleys\nSittin' in the parkin lot, chillin' at the movies\nPumpin the song that I did with the Fugees\nUncomitted, never marry chicks\nI just take flicks like Larry Flynt\nHoldin' a beauty contest, who'll be my next centerfold\nTo crack legs let me eat it like a dinner roll\nTake her out for a night on the town\nBlazin' up while we ridin' around (word)\nA meal and the weed on me\nStop at the track, drop 3 on 3\nChain around her ankle, fold in the Kangol\nCan't go wrong with a face like a angel\nLet me smack that\nI'll make sure I tap back\n\n(Female ad libs over beat to fade)\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}, {"title": "Okay, Alright", "href": "Okay,_Alright&&1992", "artist": {"unique_name": "Pacewon"}, "lyrics": "{*Phone rings*}\nHello is Pacewon home?\nNo he's not in right now\nCheck it out now y'all\n\nOkay! all right!\nOkay! all right!\n... Green, green, green!\nAll we need is - GREEN, GREEN, GREEN!\nAll we want is - GREEN, GREEN, GREEN!\nAll we see is - GREEN, GREEN, GREEN!\n\n(Pacewon)\nGrimy chicks buy me kicks\nI came in the door in ninety-six\nThere was a lot of good MC's, but where they at now?\nDid they travel overseas and die from Mad Cow?\nOr was it lyrics, chumps couldn't deliver it\nInstead of actin' they age, they actin' ignorant\nSo insignificant rhymes I don't consider it\nYou're illiterate, loud and belligerent\nI'm the king of bustin' off in ya\nCould tell ya how I feel with just one finger\nDrop it on wax, without bein vulgar\nSend a message out to the culture\nLet 'em all know I'm a pro but I do carry arms\nHit your vest hard as Barry Bonds\nHandle my gat like a lady, slugs is bisexual\nYou'll catch one and your girl die next to you\n\n(Pacewon)\nI'm out to make a profit I got dough in the pocket\nI toss it up like it's really no object\nI get pussy when I want like Big, name spreadin like gossip\nOne rhyme could get you higher than chronic\nI got friends that's Islamic like Chi Smoke and DJ Muhammad\nThey religious but they shifty as Onyx\nAnd we speak in ebonics, roll dice and we drink till we vomit\nThrow a rocket in the Eagle and cock it\nWatch it break down the sonic barrier more quick than a comet\nFemales gettin' hit in the bonnet\nLed laced dark eyes pale face like them bitches is Gaelic\nThe grim reaper done made a deposit, if you want it you got it\nHere it is, plug me into your socket\nLike a slug go into a glock clip, I rock shit\nStraight for the burbs just as well as the projects\nNot just for the economics bitch, we keep it...\n\n{*Sample scratched - \"Get on down!\" while female talks*}\n\n(Pacewon)\nI decorate my house and car with kitty litter\nPretty nigga, city slicker\nRoll up in a GS3, ESP\nI could read your mind, don't BS me pa\nYou think you thinkin' what I'm thinkin' but I'm thinkin'\nBeat you in the motherfuckin head until my rhyme sink in\nDo the damn thing baby, let it rip\nThis is all etiquette, and I'm gettin' better kid\nCause now I separate the subject from the predicate\nThe words is all edited, the verbal brawl never quits\nYou cocksuckin son of a nice woman\nBring your lil' rhymes and I eat 'em like rice pudding\nMy rhymes, I throw 'em like Dwight Gooden\nYou driveby pullin, you just might couldn't\nI play your tape, but it sounds the same\nSo I threw it in the sink and rinsed it down the drain\nLittle trick\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}, {"title": "Wake the Town", "href": "Wake_The_Town&&7601", "artist": {"unique_name": "Pacewon"}, "lyrics": "(40 second instrumental to open)\n\n(Pacewon)\nYo, until Miss Cleo predicts who pull the most chicks\nLet me tell you in advance that's me\nSippin on Henny, never have to spend a pretty penny\n20/20 vision can't see\nYo, I keep game tight go out and mack hard\nI'm just another pimp slash rapper at large\nWhippin through them uptown streets like Black Rob\nPuffin on wet mixed in with backyard\nI got it locked no doubt, I thank God\nKeep a jimmy hat right by my bank card\nI'm the P-A-C-E-O-N-E\nWanna be a deceased geek, no friends speak?\nWanna be a police chief? Go get heat\nSee if they got a badge that they'll thrown in free\nNow you can fight crime in the alleys of the badland\nWear a cape, be a hero like Batman\n\n(Chorus: Jamaican patois sample 4X)\n\"Wake the town of jazzy people\" - best guess\n\n(Pacewon)\nRaw to the core, seen y'all dime a dozen act on tour\nI didn't applaud\nYou rap like a broad bein fucked in the back of a Ford\nMaybe you should unfasten your bra\nYou gotta have breath control, and be flexible\nIf you wanna be the next to blow\nYou gotta spit flame, shit game, steal cars and flip 'caine\nMake haste, stay safe until you hit fame\nMake noise, break boys, then buy a big chain\nTo cover up the fact them rhymes you kick lame\nDumb in the flesh and, uninterestin\nI'm Tonto, holdin' up a gun in a Western\n\"We the sound of jazzy people\" - like the silver bullet\nYou can't get a deal cause you might deliver bullshit\nMight make a tape that's dull with no glamour\nBesides these labels would rather sign Hammer\n\n(Pacewon)\nYo, until Miss Cleo predicts who pull the most chicks\nLet me tell you in advance that's me\nSippin on Henny, never have to spend a pretty penny\n20/20 vision can't see\nYo, come in with a clique, go out in a bang\nFed up with a chick, get down with a gang\nSick of talkin' proper, bite my slang\nSuck my left nut while my right ball hang\nDon't like cars? Cop you a van\nDon't like jobs? Start up a scam\nDon't like bein by yourself? Roll with a clan\nBe a soldier, fuck your mother holdin' your hand\nYo, you want lettuce, got a fetish, go and get it\nInstead of spendin money blowin' credit\nFor all our sakes, get a 9 to 5 and stop rappin'\nSomethin', fuck it, make your kids start actin'\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}, {"title": "Get it, Get It", "href": "Get_It,_Get_It&&1616", "artist": {"unique_name": "Pacewon"}, "lyrics": "(Opening skit for 12 seconds)\n\n(Pacewon)\nAiyyo 56 Ruckers, we bust kids, fuck it\nShow 'em what's up with a slug on the thug tip\nRugged lil' culprit, hit you upside your\nNugget for the ducats, blood come in buckets\nMight stain your Chuckers, reverse up a 1-way\nDumpin from a Cutlass, whattup bitch? Fuck this\nWear that well, I hope the slug hit your mug\nTill the pulp is leakin out your skull, I'm occultist\nPump this in your whip, niggaz love this\nJustice for all my black men that was this\nOr still is this, they my cousins, buggin\nSeperatin women from they husbands\nI govern the block while I'm bubblin\nHustlin hard on the job like I'm muggin\nBut I'm rappin', I'm like a oven\nTurned up to broil kid, don't get shoved in\n\n(Chorus 2X: Pacewon)\nYou could get it get it, if you want it want it\nYou could get it get it, if you want it want it\nIf you 'bout it 'bout it, there's no doubt about it\nYou're the one they doubted, now you're the one that's whylin\n\n(Pacewon)\nAiyyo 9-M stay on the waist, son\n(Like y'all can't fuck with Pace-Won)\nBe careful, brothers don't step because most be scared to\nCause the next thing they see me\nIn all three rearview mirrors straight comin' at 'em\nI'm a quarterback, watch me run a pattern\nL swing strike 45 one\nThat means I bring like 45 guns\n45 pumps, Gordy like what\nBefore we light up, shorty might run\nCause Pace make you short out 83 circuits\nI'm Michael Myers, she Jamie Lee Curtis\nHit 'em with a whip, then I blast through shades\nLike \"Indiana Jones and the Last Crusade\"\nBut this ain't the \"Lost Ark,\" I ain't Harrison Ford\nI'm the rude MC that be embarassin broads, like\n\n(Pacewon)\nI'm a product of hip-hop! And stereo stealers\nMy area's ill as serial killers\nLike Sam Berkowitz and old Charles Manson\nMickey move bars with broke broads dancin\nTippin that tight light-skinned sexy mama\nIn a past life she was Jeffrey Dahmer\nHangin' with pimps and relentless suckers\nDown for life like the Menendez brothers\nRugged lil' princess a thug might find\nBuck up in the club like Shyne\nThat's what she does, I'm out her holdin' down ya speakers\nEvery whip need us, so throw your dick beaters and\nSing along with the king of the Bricks\nThat don't care like sit on my dick!\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}, {"title": "Take Me With You", "href": "Take_Me_With_You&&2431", "artist": {"unique_name": "Pacewon"}, "lyrics": "(Intro - female singer)\nEvery morning, every evening\nOh I love love love love loving you\n\n(Pacewon)\nMy girl love me, no question I guess\nNot to mention the attention I get\nBut sometimes I get mad though, like what're you, cattle?\nMary's little lamb, what are you my shadow?\nAnd when I don't run to you, you be off\nWith some ugly motherfucker, chillin' in his Porsche\nGettin' so fucked up that you start seein double\nAnd he see that you seein double, so it's trouble\nAnd here I am, just playin' myself\nStayin to delf, walls, tucked away on the shelf\nWatchin every little step I take like B. Brown\nBet my conscience fuck with me now\n'Cause I'm not the one to throw a heart in the air\nAnd to tell the absolute, I'm startin to care\nBut if she playin' with my head, I'd rather be dead\nWhen I asked her, this is what she said\n\n(Chorus - female singer)\nTake me with you, take me with you\nIt would break my heart and soul if you left me behind\nTake me with you, take me with you\nI don't wanna stay around when you're gone\n\n(Female singer)\nI can hear you, when you're callin\nAlways always always, always there\n\n(Pacewon)\nTake her with me? Maybe I should\nOr maybe I shouldn't, like baby I'm good\nQ&amp;A, what to do and say\nGot me takin' Valium, at least 2 a day (gulp)\nGot me on the bottle, drinkin' my joint back\nMade me a misfit, don't know where my boys at\nWhat's the deal? What's today's mathematics?\nGot me in a daze like crack addicts\nGot me in a +Bond+ like +James+, I wanna respond and take aim\nBut these females play games\nSo I, keep it movin, play it like a b-boy\nNo feelings, cold as Leonard Nimoy\nHands crossed, one eyebrow up\nNot speakin', like I'm bugged, but no\nI guess it's just a couple things in the mind\nGoin' on about you that made me think of a rhyme\n\n(Female singer)\nTo be with you is, all I wanted\nYes so c'mon, c'mon, c'mon, c'mon, take me with you\n\n(Pacewon)\nI would if I could but I can't so I won't\nBut it's good in the hood, I'll be back with a coat\nAnd a full length fox, if it's hot then it's rocks\nTo cool off the attitude you got\nEverytime I reach for my belt and my keys you don't breathe\nAnd you start turnin' blue when I say I'm 'bout to leave\nI'm head over heels cause of you, what to do\nCan't handcuff her, can't cut her loose\nCan't pack her up, and sneak her on the plane\nSo you get mad and you creep to Lover's Lane\nI come home early, you know I don't play\nCatch you just like OJ\nThen I just kick you in the belly, do the man you with awful\nPunch him in the jaw, dismantle his torso\nThen I go to jail, I'm not on the road\nAnd all you ever send me is a carton of stogs?\n\n(Female ad libs to fade)\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}, {"title": "You Ain't Really Down", "href": "You_Ain%27t_Really_Down&&4764", "artist": {"unique_name": "Pacewon"}, "lyrics": "(Pacewon)\nHuh, huh, huh, huh\nYeah, yeah, yeah, yo\nHuh, huh, huh, huh\n\nYo, I walk on the block right by these thugs\nLike LL, \"I Need Love\"\nSo fresh so clean keep my hygiene up\nFly clean cut, no Visine, what?\nRed-ass eyes, veg' past five\nCatch niggaz like hot webs catch flies\nI got a plan for, cops who see me\nTry to lock me, I'm Houdini\nGot the weed spot, locked completely\nKeep the gravy, nice and creamy\nRiunite and a little bit of Henny\nDo my friends dirty just to get a penny\nDo your men dirty just to get your hens\nDo my girl dirty just to get her friend\nI did the scam with my fam my man I got rich\nLike John Gotti, boy got pinched\nDue to that we fuck like Wilt Chamberlain\nDon't blame me, blame the game we in\n\n(Chorus - sung)\nYou ain't really down, playin' the game you do\nI said, you ain't really down, your love was never true\n\n(Pacewon)\nYo, sucker MC's perpetratin a fraud\nFront like they down but be hatin' the cause\nWanna be me, wanna play in my drawers\nRead my black book, start datin my broads\nWaitin to floss, you gotta stay goofy\nGucci, make coochie\nKeep up the front while I make your girl wiggle it\nTill she pull a ligament, I'm ignorant as hell\nUptight, way out of my mind and self-centered\nBeef? You'll need a forklift to help him up\nAll the king's horses and all the king's men\nLike me, they know the time like Big Ben\nKingpin at it again with a pad and a pen\nGet your gat and your vest and let's roll\nGet your hat and your coat and let's go\nLike Eddie Murphy, I run the \"Metro\"\n\n(Pacewon)\nYo, shots on target, open up the market\nBomb your apartment, walk it like I bark it\nTake you in the crib with some sharp shit\nIf you drivin' a car, you better park it\nI'm a star kid, women stalkin\nShe ain't fuckin'? Then I'm walkin'\nGot a boyfriend? Shoulda called him\nI'm on that tape you got playin' in your Walkman\nRhymin, dinin, I shine on interviews\nI'm more fine and I rhyme more syllables\nIller with the rhyme and my time's more critical\nJust in my prime now I'm more physical\nKeep this hip-hop real like a cult\nMake this paper turn green like The Hulk\nThirsty niggaz don't sip, we like to gulp\nAnd there's a couple of chicks out here I'd like to UHH\n\n(Ad libs of Chorus to end)\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}, {"title": "Locked, Part 2", "href": "Locked,_Part_2&&3849", "artist": {"unique_name": "Pacewon"}, "lyrics": "(Pacewon)\nUh-huh, rock on\nCheeba cheeba y'all, cheeba cheeba y'all\nCheeba cheeba y'all, rock on\n\nIf you broker than a joker, pockets on E\nOr just got stuck after clockin all week\nThe gat 12.50 and the rocket's on me\nNow you can roll through your hardest projects on feet\nNow you can send 'em upstream like bass they dead fish\nSpend your money with me, watch how fast you get rich\nSee I take it by force while they come with a soft sound\nLike they with they girl, carriage and horse style\nI'm a drunk, see I can't put the sauce down\nGirls that I fucked in the past turn me off now\nCrooked, I done snatched a hundred chains\nVersace shades since Big, nuttin changed\nSensors go off when the pussy come in range\nDown with the Wons we the most wanted gang\nRaise hell, skip bail, inhale, weed smoke\n+Poppa Large+ big shot from the East coast\nBring your two teeth I'm lost like +Kool Keith+\nIn a tinted up Sedan, plushed out with blue seats\nThe rims on the whip cost about two each\nBetter stop and pay attention every time my crew speak\nSmart like Bill Gates, check me out in Newsweek\nShowin off like I'm sunbathin on a nude beach\nThe moral of the story is niggaz gotta rock\nYou can't move nothin' right here - we got it locked!\n\nAnd these Jakes 'noyd at me 'cause they make toy money\nThey upset 'cause they see me with a Playboy bunny\nAnd I just shove my head in the hole, get up and go\nUp late every night like David Letterman yo\nSingin' \"We Want the Funk\" off three blunts of skunk\nGot a G and a bitch that I see once a month\nA girl across the border, or the one your daughter\nI'm not normal don't get caught up, my style is too water\nLike, H2O and I race through hoes\nI take 'em tall and light-skinned but I ain't racial though\nI get, busy with mine, I take Dominican dimes\nLittle chicks comin' up with the city in mind\nWest Indian eyes with some serious thighs\nSo pretty and fine hope she give me the time of day...\n... And make me feel this need\nTo have to give her that ring like my man Willis Reed\nSnatch up the dice and roll five by six\nHeadcrack you bitches while you ride my dick\nThen, giggle a little cause your pockets is brittle\nAnd your game is kinda slow, nigga pass me a pillow\nI'm the one on the streets, I'm the Don on the block\nLocked!\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}, {"title": "It Gets Hot", "href": "It_Gets_Hot&&800", "artist": {"unique_name": "Pacewon"}, "lyrics": "\"Oh my gosh... the music just turns me on!\"\n\n(Pacewon)\nYo... uh, uh\nGive it to me now, give it to me now\n\n(Chorus: singer)\nIt gets hot - when I see you\nWhen you see me and the vibe is true\nC'mon shorty let me ride with you\nIt gets hot - when the love is real\nWhen my car's all shiny and the club is filled\nWalkin' in the door like what's the deal?\nIt gets hot\n\n(Pacewon over Chorus)\nAiyyo... ha ha\n...\nWhat the deal huh, huh?\n\n(Pacewon)\nAiyyo I'm sexable from head to toe\nMad hot like Mexico\n'Cause I +Rap+ like +Kool G.+, every year, new me\nToo deep, mixin that umm with that ooh-wee\nA few peeps up in my loft, havin' lunch with the boss\nSex might jump off (who knows)\nIt all depends on her clothes, if she's dressed provocative\nThe compliments I can give her, that's positive\nAnd she'll swallow it, gobble it up\nJust because I'm a prominent, dominant thug\nThat be rhymin in tongues, mi amor {j'tem?}\nA flirtatious man who loves to make friends\nPull you in bathroom, grope you, harass you\nDazzle every woman in town, when I pass through\nWith my \"Mad Crew\" like BDP\nShowin my colors like BET, what's the deal now?\n\n(Pacewon)\nWhat's the deal, yo, yo\nYour wife like me like flicks from Spike Lee\n\"She's Gotta Have It,\" my jeans and white tee\nMy arms around her waist, she breathin in my face\nLike \"Pace when I'm with you, I feel so safe\nAnd hey I'm all yours, the ring means nada\nIt only costed two-thousand sixteen dollars\nAnd your verbal illustrations get me hotter\nSexy dada, let me holla\" - and I'm like\nCome right along, I'm a roller coaster ride\nGet on, we can crush to the song\nI chat with your motherfuckin cat like Dr. Doolittle\nShow your dog how to hit it from the back and chew nipples\nCause friction like when you rub two nickels\nInvent new shit to do wit'chu\nKnock the boots down to the ground with energy and stamina\nMy boy locked up, won'tcha pose for the camera\n\n(Pacewon)\nWhat's the deal yo, yo yo yo\nI make women hallucinate and see things\nPut my finger in the G-string\nMake her smile like Christmas Day when she was 4 years old\nGrab the back of her neck, kiss her earlobe\nMake her sweat like she just ran a mile\nTurnin' green like she was Bruce Banner now\nBetter yet the She-Hulk, break buildings down\nWhen we fuck, break the oochie down and leave her\nBack to the block, rollin' trips and fever\nBrand new chicks for my chips to freeze up\nChicks like Britney, chicks like Shakira\nI take the purest of 'em just like mirror mirror\nAnd I'm, Prince Charming, the best they mobbin\nGet my boys together, do some big robbin\nAnd we ain't robbin ya goods, nigga stealin your world\nAll because I was feelin' ya girl\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}, {"title": "Rap Music", "href": "Rap_Music&&1711", "artist": {"unique_name": "Pacewon"}, "lyrics": "New Jersey stand up!\n\n(DJ scratching Eminem sample)\n\"Pacewon\" Yo!\n\"Pacewon\" Yo!\n\"Pacewon\"\n\"Pacewon\"\n\n(This is how the East Coast rocks)\n(This is how the East Coast rocks)\n(This is how the East Coast rocks)\n(This is how the East Coast rocks)\n\n(Pacewon)\nYo! This is every man for himself and things not sweet\nI knew this song by that crew Mobb Deep\nSo I used it, my brother produced it, new shit\nSet me up so I could flow like a cruise ship\nAnd tell this story 'bout these men that's foul\nAnd how this little nerdy kid stole our style\nAnd ran wit' it, even bit our wit' and our charm\nAnd did a half a dozen songs dissin' his mom\nHe went so far 'cross the grain, I should put the choke down\nHe turned our inner expression to a joke style\nDoin' that pop B.S, doin' coke now\nAnother manic depressive, gettin' doped out\nI read a book about he a crook and no good\nThat's why he hidin' from Suge\nWhy he had to pack his bags and move his things from the hood\nSo scared he wouldn't move back if he could\n\nSee this is rap music, this is culture\nThis is organised, it has structure\nIt has insight, this is rap music\nNot to be mixed or deluded\n\n(Pacewon)\nYo, is it your heart, or is it the lies\nYou lack courage like the lion in the Wizard Of Oz\nYou went from brunette to blond just to better your cause\nBut your hypeman album sound better than yours\nBunny rabbit got a funny habit, we say\nHe let a homey and a honey have it, 'cause he gay\nWell I'm hard to the core like Brun in Krush Groove\nYou a little prick that ate too many mushrooms\nGot your voice on the track of your choice\nYou made noise, but then turned your back on your boys\nEven did it to Royce, where's Head? Where's Fuzz?\nI'm sick of your songs, I need lead ear plugs\nThe same thing you tried to do with the Outz\nIs the very same reason that they booin' you now\nLike the D.A. in court I pull two of your files\nBetter save that last dance for Julia Stiles\n\nSee this is rap music, this is culture\nThis is organised, it has structure\nIt has insight, this is rap music\nNot to be mixed or deluded\n\n(DJ scratching Eminem samples)\n\"Fuck\" \"Slim Shady\"\n\"Fuck\" \"Slim Shady\"\n\"Fuck\" \"Slim Shady\"\n\n(Pacewon)\nYeah, back to gettin' +Raw+ like Kane and Mister Cee\nMe and Slim Shady had a past history\nI'ma paint a picture now, you can set it up\nLet's start with this time that he was gettin' jumped\nI jumped in, knocked a couple kids down\nMade niggas bidounce, helped him off the gridound\nMe and Big Nasty started raisin' hell\nAlways wondered why your other boys ain't help\nSee this is real dirt that I'm kickin' on y'all\nWon't you battle me? Stop pickin' on Ja\nScary little bitch, you a soldier? Not true\nThe truth just is you wanna be Pac too\nStop biting, invest in speech\nAnd let my fallen brothers just rest in peace\nYou never met 'em, they probably wouldn't feel ya\n'Cause your little rap songs need to get realer\nSee you just got a charge 'cause you shook with a gun\nGot yourself in trouble now, look what you done\nLow down and shifty, only on camera\nShit, compared to him I'm Tony Montana\nI beat his ass, smack him up and play wit' em\nTake that little ass allowance Dr. Dre give 'em\nHow many styles can I flaunt in your face\nAsk Em, he don't want it with Pace, no\n\nSee this is rap music, this is culture\nThis is organised, it has structure\nIt has insight, this is rap music\nNot to be mixed or deluded\n\n(DJ scratching Eminem sample)\n\"Pacewon\"\n\"Pacewon\"\n\"Pacewon\"\n\"Pacewon\"\n\n(This is how the East Coast rocks)\n(This is how the East Coast rocks)\n(This is how the East Coast rocks)\n(This is how the East Coast rocks)\n\n", "album": {"title": "Telepathy_(2004)&&5920", "genre": "", "year": 2004}}]