[{"title": "Is Anybody There?", "href": "Is_Anybody_There%3F&&5369", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "Is anybody there?\nIs anybody listenin?\nDoes anybody care?\nCan you actually say\nThat you don't give a shit about your future\nAnd I am scared to think\nThat the world\nHas been populated\nWith dumb fucks and assholes\nThat don't give a fuck\nAfraid to stand up and fight back!\n\nWhoa oh oh\nDon't turn your back\nYou're a victim of consequence\nWhoa oh oh\nFight back\nStart a revolution\nWhoa oh oh\nJust close your eyes\nAnd think of no one but yourself\nConsider someone else\n\nYou've got it lodged inside your mind\nThat everything is happy\nAnd no one has to die\nYou've got it lodged inside your mind\nWhen everything is fucked up\nNow everythings not fine\n\nIs anybody there\nIs anybody listenin\nDoes anybody care\nCan you actually say\nThat you don't give a shit about your future\nAnd I can't understand\nHow the fuck you see so blindly\nHow can you justify this fucking lack of humanity\nThose who care just spit out rhetoric\n\nWhoa oh oh\nDon't turn your back\nYou're a victim of consequence\nWhoa oh oh\nFight back\nStart a revolution\nWhoa oh oh\nJust close your eyes\nAnd think of no one but yourself\nConsider someone else\n\nWho do you think you are?\nWho do you think you are?!\n\nYou've got it lodged inside your mind\nThat everything is happy\nAnd no one has to die\nYou've got it lodged inside your mind\nWhen everything is fucked up\nNow everything's not fine\n\nYou'd got it lodged...\nLodged inside your mind\n\nWhoa oh oh!\n\n", "album": {"title": "Search_For_The_Truth_(2005)&&7248", "genre": "Progressive Metal", "year": 2005}}, {"title": "No Stars Over Bethlehem", "href": "No_Stars_Over_Bethlehem&&7287", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "This should never be...\n\nI'll burn all the lives of this angel illuminati\nWhen St. Michael sized means find an end to justify\nA belief to fortify this stained glass disgrace\nToo beautiful to change or perhaps too scared\nThe truth behind our lives will be erased\n\nA crusader begging for a crusade in which to die\nWhere lead locusts pierce the heart of men\nAnd tie the tongues of those who lie\nCut the sinner, bleed redemption through the city streets\nThat resonate in prayers of \"This never should be\"\n\nSomeone plunged a dagger deep into God's chest and\nWhen He groaned it laid our entire civilization to rest\nWhen he pulled out the dagger and marveled at the pain he could create\nWe stuck another in His back to seal creation's fate\nNow we turn from wealth in the height of all our poverty\nA call that renders me ageless\nTurning the pages of a belief that's greater than us all\n\nAmen to the fools and the cossacks and the pulpits\nAmen to the people who think there's still a way to help us\n\n", "album": {"title": "Kezia_(2005)&&1905", "genre": "Progressive Metal", "year": 2005}}, {"title": "Blindfolds Aside", "href": "Blindfolds_Aside&&1143", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "We woke up as men but tonight we'll sleep as killers,\nAs we break the cryptic morning with a bullet and a prayer.\nThe steel never seemed more cold and agile than now,\nAnd life never seems less vital and fragile.\n\nWith a heart that's beating louder than my own,\nI watch a girl they call Kezia.\nI watch a woman that I know.\nMy hopes and my own future, blindfolded.\nTo atone for a sin I didn't care for, but a sin that paid my debts.\nA sin that fed my children, and burned my smiles and cigarettes.\n\nAnd no one ever said that hope would be so beautiful.\nAnd no one ever said I'd have to pull the trigger on her.\nI can't even still her trembling hands that were locked up by the dutiful and the obligated.\n\nFive soldiers, forever sedated with the \"no one's responsible\" psychological drama\nOf our social justice dribble, dribble, dribble.\n\nHer tiny steps tell lies about the choice I have to make.\n(Resurrect a static lifetime, starve to death my own mistakes)\n\nSo pull the screaming trigger, and watch your carcass bleed me dry,\nOr drop the gun, and try to shake away the blindfold from your eyes?\nDrop the gun (pull) drop the gun (the) drop the gun (trigger)\n\n", "album": {"title": "Kezia_(2005)&&1905", "genre": "Progressive Metal", "year": 2005}}, {"title": "Silent Genocide", "href": "Silent_Genocide&&5039", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "Lives will be lost, and children will die.\nBut in response our nation does nothing but lie.\nA silent genocide with a country at stake,\nHow many more innocent lives will we take.\nUntil we realize who exactly is to blame,\nShould we bomb ourselves for the economic sanctions that we've made?\nStripping them of essentials and their primary basic needs,\nJust to get to one man and we wonder who's destroying the peace.\n\nAnd this counties indigence, is no fault but our own\nAnd the people are dying, to see one man overthrown\n\nIt wasn't how many bombs we dropped it was the places we targeted\nTheir healthcare, their water, their power their food,...\nTheir livelihood.\nStripping them of essentials and their primary basic needs,\nJust to get to one man and we wonder who's destroying the peace.\n\nAnd this countries indigence, is no fault but our own\nAnd the people are dying, to see one man overthrown\nAnd the media spins us, a tangled web of lies\nWhile we search for the truth\nAnother child dies.\n\nAnother child dies, adds to your death toll,\nHow many more, children must die\nAnother child dies adds to your death toll,\nHow many more, bodies will lie\nAnother child dies adds to your death toll,\nHow many more, children must die\nAnother child dies adds to your death toll,\nHow long until...\nWe take away they're lives\n\n", "album": {"title": "Search_For_The_Truth_(2005)&&7248", "genre": "Progressive Metal", "year": 2005}}, {"title": "Bury the Hatchet", "href": "Bury_The_Hatchet&&8334", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "Place your justice in my palm and then I'll make fist\nPunch your grimaced face until every knuckle breaks\nAnd bleeds in resistance to my sidewalk painting\nA mangled body twitching and regaining consciousness and closure\nAttempting composure before a bullet in the mouth answers the questions of exposure\nAnd God of Sunday School fa&#231;ades and paycheques to validate the time I served abroad\nIt all means nothing if I forget why I'm here\nTo serve and protect my fist over fist mind under matter career\n\nThat's why a man sounds kind of funny when he falls to his knees\nWith his hand on his throat while he begs you to please spare his life\nWhile I explain the hardest of bodies dulls the softest of knives\n\nThen I hold up his head and carve X's in his eyes\n\nI swear I have compassion I've just been trained to disregard the prisoner's life\nBecause I am the prison guard\n\n", "album": {"title": "Kezia_(2005)&&1905", "genre": "Progressive Metal", "year": 2005}}, {"title": "A Plateful Of Our Dead", "href": "A_Plateful_Of_Our_Dead&&1003", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "Don't ever ask us to define our morals\nSometimes when fundamentals meet teenage heartbreak\nSome of us are all of us; half-selves that love whole hopes\nAnd hara-kiri heartbreak\n\nThere's almost nothing worse than never being real\nStrained voices crying wolf when nobody can hear\nIf I had a gun I'd pump your ethics full of lead\nIf I believed in meat I'd eat a plateful of our dead\n\nThere's merit in construction when it's done with your own hands\nThere's beauty in destruction, resurrection, another chance\nThere's a you and I in union but just an I in my beliefs\nThere's a crashing plane with a banner that reads everyone's na&#239;ve\n\nThe only proof that I have that we shot and killed this horse \nIs the sounds of whips on flesh and a bleeding heart remorse\nWhen I'm In this state of reflection and you hand me whips\nAnd two by fours I could never bring them down and beat the same horse as before\n\nI'd rather kill a stupid flower and spread its seeds around\nUntil a garden with our bullet-laden morals will be found\n\n", "album": {"title": "Kezia_(2005)&&1905", "genre": "Progressive Metal", "year": 2005}}, {"title": "Red Stars Over the Battle of The Cowshed", "href": "Red_Stars_Over_The_Battle_Of_The_Cowshed&&4920", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "I declare a war\nA fight for freedom against any system that's built\nTo consume our power and maintained to divide our energy.\nA system where an honest person can sweat for hours\nAnd then play slave to the man in the television tower.\nA syetem where private ownership erases public healthcare\nBecause dollars are worth more than people; dollars are worth more than sense.\nIt's a one-way street through a faceless crowd;\nBarcodes and backlit billboards show us, guide us,\nTeach us how to earn our rank, divide the rich and poor,\nPit us against ourselves, compiling and burning corpes of class war.\nYes, I want to topple this system held in place by financial greed\nWhere wealth is made through ownership and social hierarchy.\nDollars are worth more than a worker in need,\nMore than John and Jane Doe with a family to feed.\nWe are the workers, the majority, and this system fears solidarity.\nSo I declare a war on everything they're for\nIt's a one-way street through a faceless crowd;\nBarcodes and backlit billboards show us, guide us,\nTeach us how to earn our rank, divide the rich and poor,\nPit us against ourselves, compiling and burning corpes of class war.\nJust someone to topple the system.\nI want to topple the system\nJust someone to topple the system.\n\n", "album": {"title": "A_Calculated_Use_Of_Sound_(2003)&&5875", "genre": "Progressive Metal", "year": 2003}}, {"title": "Fear and Loathing In Laramie", "href": "Fear_And_Loathing_In_Laramie&&8725", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "Compassion is shit\nSoft-spoken words and a look of concern\nThe fire is lit\nEmotion will never extinguish these flames that inaction has built\nWhat makes it burn? A nation so straight that deviation's a crime\nWhen will we learn that sexuality is not a punishable offense? On a cold October night, a gentle soul was crucified and what remains of his blood still stains our idle hands that soft-spoken words won't justify\nCulprits are we\nLet's talk about rights\nLet's talk about sexual orientation\nLet's talk about you and an entire homophobic nation\nWill you follow me down? Can we not separate ourselves from such hate? Let's sever the head of the beast with the crown, let's no longer participate\nWill you follow me down? Why won't anyone stand up?\n\n", "album": {"title": "A_Calculated_Use_Of_Sound_(2003)&&5875", "genre": "Progressive Metal", "year": 2003}}, {"title": "Led Astray", "href": "Led_Astray&&8557", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "So much time slipped away\nAs if it meant nothing at all \n(I remember that night)\nWe didn't know it\nIt would be our last\n\n(But now as I look back) \nAn awkward tension (hung in the air)\n\nNow everything is different\nI don't know you anymore\nAnd as we pass in the hall\nI feel myself weeping inside\n\nKnowing that the friendship that there once was \nHas withered to a glowing ember\nOf a fire that burned so brightly\n\nAnd I swear to you (the times are changing and I swear that you are too)\nI swear to you (that I'm no different) this I swear to you. \n(I think you're well aware) that this path we've taken is all but fair\nWith everyday (we're led astray) and slowly it just slipped away\nAway from me\n\nI am now accompanied by\nHollowed memories\nAll of them faded to black and grey\n\nAnd I swear to you (the times are changing and I swear that you are too)\nI swear to you (that I'm no different) this I swear to you. \n(I think you're well aware) that this path we've taken is all but fair\nWith everyday (we're led astray) and slowly it just slipped away\n\nThese thoughts they tear me up inside, devour me, consume my mind\nI scream at night, rip out my hair\nHow much more can I forbear?\n\nI swear, this I swear to you\nFrom birth I think we knew\nNothing is truly alive unless it dies \n\n(And you I think you're well aware) \nThis path we've taken is all but fair\nWith everyday (we're led astray) \nAnd slowly it just slipped away\nAway from me\n\n", "album": {"title": "A_Calculated_Use_Of_Sound_(2003)&&5875", "genre": "Progressive Metal", "year": 2003}}, {"title": "Nautical", "href": "Nautical&&8314", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "The day that civil glory dismembered my civility\nI could have parted ribs and flesh like a different kind of Red Sea,\nDrowned the ancient east in western progress,\nCustom and the least of all our pride and sentiments.\n\nWhich turned out to be the closest thing to a fashion trend\nThat's ever been put on trial.\nWhich turned out to be the closest thing to a fashion trend\nThat's ever been put on trial.\n\nThe rest was cast off as denial of statehood and mastery;\nThe ultimate form of treason is the treacherous use of reason,\nThe treacherous use.\n\nEmployed by the bastard sons of American fore-fathers who keep this fire burning\nWith the flesh of their would-be American daughters, daughters, daughters, daughters!\n\nWhat will happen to our children when the least of us pass on?\nUs who fought the monsters of our country's crowded closet,\nUs who dropped the bombs on goodness when we saw it wasn't flawless.\nUs whose youthful life was hostage to what harm did,\nUs who fought the hardest to be swept under the carpet.\n\nAnd I'm still a cigarette softly smoking on the edge of a metal ashtray.\nI begged this place to let me burn, and it whispered, \"burn away\".\n\n", "album": {"title": "Kezia_(2005)&&1905", "genre": "Progressive Metal", "year": 2005}}, {"title": "I Am Dmitri Karamazov And The World Is My Father", "href": "I_Am_Dmitri_Karamazov_And_The_World_Is_My_Father&&9252", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "And so it starts from one impurity\nHeld in place by loveless security\nAlways thrown around\nAnd beaten by squinted eyes\nThat soon bear turned back\nAbstract views through\nBroken bottles of brandy\n\nI'm questioned all my life\nWhy I kept on saying\nThat I (didn't even ask to be here)\nYou made that choice for me\nEnrolled me in your schools and church\nAnd in your god-forsaken military\n\nWhat cost do I pay for being born of you? \nMy life, enslaved by passions and held away from me\n\nWho is my mother? Where is her grace?\nWhere is that subtle joy I crave? \n\nIt's gone\nOr should I say never existed anyway\n\nThrough blurry winter clouds and snow melted by anger\nMy subscription, my addiction\n\nIf I had one love in this world\n\nA pound of nuts is simply not enough to keep my rage at bay!\nAnd though I didn't kill you \nLike you tried to do to me\nI'm just as guilty \nBecause I would have wanted to be free\n\n", "album": {"title": "A_Calculated_Use_Of_Sound_(2003)&&5875", "genre": "Progressive Metal", "year": 2003}}, {"title": "An Apathetic New World", "href": "An_Apathetic_New_World&&4013", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "Tonight I sat alone on the steps and stared into the blank sky; stars cloaked by smog, the poison of our own. And as the bitter air bit down I held my breath and thought of all the others on their backs. How do you organize resistance against something that's not even there (but still killing you)? Dirt covered fists screaming indignantly, midigate to out turned palms pleading admittedly. Raping people of their hope and the sky of all its stars. They're dying at your feet but 'who cares who they are.' (right?) There's no place like home. \"It's like filling an empty glass from an empty bottle.\" and it's stricken by rigor mortis with your hand on the throttle. Grasping at a chance through a wall of austerity and a fence of police enforced by democratic vulgarity. Two percent controlling the power; controlling yo, controlling me, controlling the borders of democracy. So it's you, and it's me and we're up against a fence, control or be controlled by only two percent. So it's you, and it's me and we're up against a fence, control or be controlled, because only we can set us free.\n\n", "album": {"title": "A_Calculated_Use_Of_Sound_(2003)&&5875", "genre": "Progressive Metal", "year": 2003}}, {"title": "The Divine Suicide Of K.", "href": "The_Divine_Suicide_Of_K.&&1530", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "I better think of my answers now, because I know questions will be asked,\nLike if I brought the joy I found in the confessions of a mask.\nThe tip of my tongue's already touching the top of my mouth,\nIts meaning manifest in mercy burning down, burning down,\nBurning down the house.\n\nIt's true that tactless teem totem-poles turn tolerance to tired taboos.\nIt's true that a bullet never knocks on the door, it's about to come crashing through.\n\nI'm walking one last mile in big steps as your altar wine.\nI'm doing it in tattered shoes that aren't even mine\nBecause my own are in a box locked up with possessions I can't have.\nThe gunman with his future, and the prison priest's golden calf.\n\nWalking one last mile...\n\nBlindfolds aside, I'd probably still close my eyes, and try to feel a trembling fetal life inside.\nWith a shotgun barrel that's about to make me bleed, like an ulcer in the stomach of the beast,\nLike a little girl in a bed that was years ago deceased, resurrected last night with a letter she can't trace.\n\nResurrected to be killed, then maybe born again.\nI'll always be Kezia so long as any hope remains.\n\n", "album": {"title": "Kezia_(2005)&&1905", "genre": "Progressive Metal", "year": 2005}}, {"title": "She Who Mars the Skin of Gods", "href": "She_Who_Mars_The_Skin_Of_Gods&&5101", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "\"Kezia, my darling, please never forget this world's got the substance of a frozen summer silhouette,\"\nSaid my mother through lips that were cracked with love and toil\nBefore she added, \"the warmest of blankets is six feet of soil.\"\n\nShe had a perfume called Pride that smelled a lot more like Shame,\nWhen she walked into the room I was sleeping, heard her curse my father's name.\nIt was our situation, our position, our gender to blame.\n\nIt was the lonely grey of my father's eyes staring back in the mirror's frame.\nIt was the lonely grey of my father's eyes staring back in the mirror's frame.\n\n\"Mother, I'm shaking while I write, tonight I'll stay awake and try to breathe away my fright.\"\n\n\"There's a letter waiting for me that I have yet to read 'cause I know it's not from you\nAnd you're the only one I need, I'm tired and I'm cold and I want to go to bed\nBut there's no one here to tuck me in, so the shotgun will instead.\"\n\n", "album": {"title": "Kezia_(2005)&&1905", "genre": "Progressive Metal", "year": 2005}}, {"title": "Turn Soonest To The Sea", "href": "Turn_Soonest_To_The_Sea&&7172", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "Do you remember how it was when you bled?\nWhen you loved and burned in those flames that you've kept,\nBecause Vesta's long been sleeping.\nNow you've come to accept that\nYour anatomy defines more than a few of the gaping holes in our social fabric,\nAnd it defines more than a few one night stands,\nMore than a few prison bars melted,\nMelted in, melted in, melted into wedding bands.\n\nWe've made you all the peasants and we've made ourselves the kings,\nOur queens are still subordinate as an angel without wings.\nBut we make it easy to be hung which means it's easy to be wrong,\n\"Put some plastic in your tits, and you'd look better as a blonde.\"\n\nI remember when you were hopeful,\nAnd you never thought your life would be lived inside a coffin\nWith a moral sacrifice and a million social obligations, labels and expectations,\nWhen you were young and modern seventeen,\nIn vogue and vague pursuit of the cosmopolitan dream.\n\nSo when you bled on the bed as you fed those expectations\nAs a whore and not a human you embraced with hesitation\nThe very parameters of all you can be:\nNot a mother, not an aunt, not a sister who's not subdued,\nBecause dignity is not physical and your flesh means more than you.\n\nYour flesh means more than you.\nYour flesh means more than you.\nYour flesh means more than you.\n\n\nI know we'll wake up one day with a gun to the back of our brains.\nYou'll be asking for your rib and I'll smile and call you brave.\n\nMaybe someday when,\nWhen this bloody skull has dried\nI'll know our city is in ruins\nWhen our greatest source of pride\nIs a monument of dicks and ribs\nAnd the gender crowns we wore\nWhere underneath, a plaque will read,\nA plaque will read...\n\"No woman is a whore.\"\n\nMaybe someday when,\nWhen this bloody skull has dried\nI'll know our city is in ruins\nWhen our greatest source of pride\nIs a monument of dicks and ribs\nAnd the gender crowns we wore\nWhere underneath, a plaque will read,\nA plaque will read...\n\nMaybe someday when,\nWhen this bloody skull has dried\nI'll know our city is in ruins\nWhen our greatest source of pride\nIs a monument of dicks and ribs\nAnd the gender crowns we wore\nWhere underneath, a plaque will read,\nA plaque will read...\n\nMaybe someday when,\nWhen this bloody skull has dried\nI'll know our city is in ruins\nWhen our greatest source of pride\nIs a monument of dicks and ribs\nAnd the gender crowns we wore\nWhere underneath, a plaque will read,\nA plaque will read...\n\n", "album": {"title": "Kezia_(2005)&&1905", "genre": "Progressive Metal", "year": 2005}}, {"title": "Divinity Within", "href": "Divinity_Within&&6889", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "This morning there are no rods or staffs\nTo comfort you dressed as a target\nAs you amble in your chains and stumble through\nThe corridors that lead to our makeshift valley of death\n\nIn the prison's backyard\nWhere you'll give us your final breath\nLast night I saw you dine with lovers and human tears\nBut glanced at me in ways\nThat brought to life my sleeping fears\nThat today you'll bite my neck\n\nPeel away the aging skin\nExpose this lifeless body in a boy\nDivinity within (I watch my temple fall to pieces)\nDivinity within (I watch my temple fall to pieces)\n\nSo tell me why\nWhen I've read you your rights,\nWhen the guns are in their place\nWhen your crime no longer seems absurd...\n\nWhen your crime's no longer absurd,\nWhat will you say when we ask you,\nWhat are your final words?\n\nWhen your crime's no longer absurd,\nWhat will you, what will you say, Kezia, when we ask:\nWhat are your final words?\n\n", "album": {"title": "Kezia_(2005)&&1905", "genre": "Progressive Metal", "year": 2005}}, {"title": "Heretics & Killers", "href": "Heretics_%26_Killers&&8903", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "They called me the man with the blood of Christ honesty,\nBut tonight I drink with heathens and (our,) our finest blasphemies.\n\nIn wine there's truth but in silence there's surrender,\nA screaming for the silence in stunned suspicious terror.\nBuilt a temple in my life and used God to seal the pillars,\nAfter twenty years of fighting young heretics and killers.\n\nI watch my temple fall to pieces at the first signs of oncoming weather.\nFell to my knees like Jesus in the cave, knew I would die.\nBut my lips could only say \"I'm not your son, so why have you forsaken me?\"\n\nThere's a hole in my heart but it just makes me unholy.\nCrucified that night and I walked away with alter-egos,\n(Like the) prison priest who preached his dead and buried gospel.\n\nWith my faith in ruins my duty still breathes strong,\nI'm a parrot in a cage now singing prayers to belong...\nTo a textbook of my crying, lying, dying history.\nA textbook of my crying, lying, dying history.\nA textbook of my crying...\nA textbook of my lying...\nA textbook of my dying...\nA textbook of my history.\n\n", "album": {"title": "Kezia_(2005)&&1905", "genre": "Progressive Metal", "year": 2005}}, {"title": "These Colours Don't Run", "href": "These_Colours_Don%27t_Run&&8901", "artist": {"unique_name": "Protest_The_Hero"}, "lyrics": "(They do however slaughter innocent millions world wide every year)\n\nIt's so egregious so conspicuously wrong\nTens of thousands of people vilified and killed by the means of western hypocrisy.\nThe double standard of the ways of Mao Ze Dong,\n(Killing for crimes against country).\n\n1998 the Clinton administration,\nBombing the plant of Al - Shifa was merely \"retaliation.\"\nThis move would prove detrimental to so many lives, and day by day the death toll is forced to rise.\n\nBombings won't justify bombings, death will not justify death.\nDeath its self justifies nothing, Nothing will come of it.\n\nTerrorism as defined by official U.S. documents is \"the calculated use of violence or threat of violence,\nTo attain goals that are political, religious, or ideological instate.\"\n\nA labeled rouge state, Look at your self.\n\nThe Rockets red glare (Red like the blood you have spilled),\nThe bombs bursting in air,\n(Anonymous graves you have filled,)\nIn the name of humanitarian intervention will not cease all though by definition, they're a terrorist act.\n\nBombings won't justify bombings, death will not justify death.\nDeath its self justifies nothing, Nothing will come of it.\n\nNothing will come of it.\n\nBombings won't justify bombings, death will not justify death.\nDeath its self justifies nothing, Nothing will come of it.\n\nBombings\nBombings won't justify bombings, death will not justify death.\nDeath its self justifies nothing, nothing will come of it.\n\n", "album": {"title": "A_Calculated_Use_Of_Sound_(2003)&&5875", "genre": "Progressive Metal", "year": 2003}}]