[{"title": "Get Your Groove On", "href": "Get_Your_Groove_On&&6183", "artist": {"unique_name": "Skillz"}, "lyrics": "Yo it's the weekend, time for freakin, no doubt\nHit the mall, get a hookup, night falls and I'm out\nPick up my man (Whattup Hobbes?) from around my block\nGet nice, pump the sounds, now it's time to hit the spot\nCrews downtown freestylin off beats\nIf heads start whylin I got the glock in the seat\nHectic out front, some chillin' some wild\nTonight I'm takin' a niggaz girl like Ill and Al\nI freak raps so black they let me through the back\nThe DJ was on point, the joint was packed\nFemales were all of that, I'm seein nothin' but dimes\nMoet on ice, yeah it's time to go for mine\nDancefloor got packed when they played All Night Long\nBrothers that front with blunts passin round the?\nCrew mode in effect, party can't go wrong\nThis is strictly for my peeps that's gettin' they groove on\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "The Jam", "href": "The_Jam&&3186", "artist": {"unique_name": "Skillz"}, "lyrics": "(Mad Skillz)\nNow who done passed you a diaper and got you thinkin' you the shit?\nThe styles I be inkin get you hyper when I get and attack tracks\nBruise and snooze on the wack\nMy crew's in the back, gettin' blitzed like a slow quarterback\nNo introduc's needed, this be the jam\nWhich occurs every time that the mic hits my hand\nNow understand, me not makin' MC's sweat\nIs like seein a brother sellin the Final Call chillin' in the short set\nCheck the drill when you see me write your will\nMakin' cheese like grill, here to test a nigga's mic skills\nWhen I rhyme REAL heads get the shivers\nHere comes that nigga name Shakwan, signed sealed and delivered\nTo your tape deck, CD's and crossfaders\nBeats be hard like blowin' bubbles with Now or Laters\nDon't front, like you don't know who I am\nFully equipped to mic rip, brother here comes the jam\n\nWhen the mic hits my hand, you know I'm gonna slam\nMoney you'll be like, oh shit! That's the jam\nWhen the mic hits my hand, you know I'm gonna slam\nKid you'll be like, oh shit! That's the jam\nWhen the mic hits my hand, you know I'm gonna slam\nYo you'll be like, oh shit! That's the jam\nWhen the mic hits my hand, you know I'm gonna slam\nAnd you'll be like, oh shit! That's the jam\n\n(Mad Skillz)\nNow if you wanna play around don't play with me\nYou can play with AIDS, I'm puttin' H's in your IV's\nBum raps over drum taps; rappers jumpin' up in my face\nLike the ground was covered with thumbtacks\nI'm in your face like mace, take a taste\nMake a crowd vibrate, like a device on my waist\nSkillz Mad, will he be bad? Ask your dad\nDon't front, he know about the skills that I had\nOr should I say got cause my mic still hot\nBack up it's Shakwan I'm lettin off verb shots\nI take MC's, wake 'em up out they sleep\nPour ammonia in they face, slap 'em with some microphone techniques\nAfter that, niggaz retire, 'cause I'm iller\nAnd my lyrics are thicker than Richard Pryor\nOne time for my crew, two times for the fam\nGivin' crews sun tans, make way for the jam\n\nWhen the mic hits my hand, you know I'm gonna slam\nYo you'll be like, oh shit! That's the jam\nWhen the mic hits my hand, you know I'm gonna slam\nMoney you'll be like, oh shit! That's the jam\nWhen the mic hits my hand, you know I'm gonna slam\nYou'll be like, oh shit! That's the jam\nWhen the mic hits my hand, you know I'm gonna slam\nYeah you'll be like, oh shit! That's the jam\n\n(Mad Skillz)\nYeah, the jam has arrived so all that garbage can walk\nBefore I personally interact with that ass like Box Talk\nSo pass the steel when I flex on the reels\nYou know the deal that nigga Skillz be up in dips like Massengil\nDouche, ass toosh, who get loose\nFunk money times five gettin' live call a truce\nFrom Compton to Maine I tear, niggaz out the frame\nI don't battle I show niggaz how to play the cryin game\nLike last November, when your man got dismembered\nIt was me I ate his meat, and it lasted through the winter\nSo enter, cause yo I been, bombin since\nNinety-one when I started destroyin MC's confidence\nSo peace, to the real MC's\nKalonji the Mindbenda and my man Lonnie B\nJavon, Little Rock, Big Street my man\nFuckin' 'round with Skillz you get caught up in the jam\n\nWhen the mic hits my hand, you know I'm gonna slam\nYou'll be like, oh shit! That's the jam\nWhen the mic hits my hand, you know I'm gonna slam\nYo you'll be like, oh shit! That's the jam\nWhen the mic hits my hand, you know I'm gonna slam\nYou'll be like, oh shit! That's the jam\nWhen the mic hits my hand, you know I'm gonna slam\nYou'll be like, oh shit! That's the jam\nWhen the mic hits my hand, you know I'm gonna slam\nYou'll be like, oh shit! That's the jam\nWhen the mic hits my hand, you know I'm gonna slam\nYeah you'll be like, oh shit! That's the jam\nWhen the mic hits my hand, you know I'm gonna slam\nAnd you'll be like, oh shit! That's the jam\nWhen the mic hits my hand, you know I'm gonna slam\nYou'll be like, oh shit! That's the jam\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "Tongues Of The Next Shit", "href": "Tongues_Of_The_Next_Shit&&9544", "artist": {"unique_name": "Skillz"}, "lyrics": "<span style=\"padding:1em\"><a href=\"/wiki/Category:Instrumental\" class=\"image image-thumbnail link-internal\" title=\"Instrumental\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D\" alt=\"TrebleClef\" class=\"lzy lzyPlcHld \" data-image-key=\"TrebleClef.png\" data-image-name=\"TrebleClef.png\" data-src=\"https://vignette.wikia.nocookie.net/lyricwiki/images/1/1e/TrebleClef.png/revision/latest/scale-to-width-down/30?cb=20090423154754\" width=\"30\" height=\"68\" onload=\"if(typeof ImgLzy==='object'){ImgLzy.load(this)}\"><noscript><img src=\"https://vignette.wikia.nocookie.net/lyricwiki/images/1/1e/TrebleClef.png/revision/latest/scale-to-width-down/30?cb=20090423154754\" alt=\"TrebleClef\" class=\"\" data-image-key=\"TrebleClef.png\" data-image-name=\"TrebleClef.png\" width=\"30\" height=\"68\"></noscript></a></span> <b>Instrumental</b>\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "From Where??? (Intro)", "href": "From_Where%3F%3F%3F_(Intro)&&1645", "artist": {"unique_name": "Skillz"}, "lyrics": "...It's not about the salary\nI do this so MC's think twice before they battle me\nCause Lonnie B can really flow shit (say what!)\nThis ain't no wo, thuggish ruggish, bow wow, yippie yo shit\nI through yo rappers like a bad poker hand\n(Now tell me, Biggedy B, the man, yeah!)\n\n(Lonnie B)\nYeah, my rhymes style's scandalous leavin' MC's in bandages\nSo many niggaz on my dick now I feed them semen fuckin' sandwiches\nHardcore when I throw rappers to the flow\nBattlein me is like giving birth to a fuckin' dinosaur\nFuck wack niggaz it's my turn\nSo how you gon' rap the microphone\nAnd come weak in a motherfucking rock sperm\nMad Skillz got this fucking mig on\nI suck ya blood out motherfuckers\nLike Tom Cruise with the wig on\nYeah about to make the loop\n'Cause I can keep motherfucking rap until Biz Markie gets cute\nAAAAAiiigghhttt!\n\nWhere you from, you gotta be from Brooklyn man, you gotta be!\nNa nah kid!\nYeah, na, ya that nigga from Queens?\nNa B nah, I ain't from Queens\nOh! I've got it, that nigga from Uptown, he gotta be!\nNa, na, na kid!\nNo I ain't from Uptown kid\nWhere ya from God?\nVirginia\nFrom where???\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "VA. In the House", "href": "VA._In_The_House&&2921", "artist": {"unique_name": "Skillz"}, "lyrics": "Verse one: Mad Skillz\n\nIt's time to bring it down, don't front on the sound\nCheck your thunderpound, it be Skillz blowing up from the underground\nNow, don't waste your time and try to taste mine\nI'm killing MC's and going low-key like baselines\nBe hesitant, VA residents ain't friendly\nDiss and I'll walk on your back like Mr. Benny\nWhen my shit drop, all this wack shit'll stop\nTill Janet stops, rockin' Planet Rock\nKeepin' it real hot\nI specialize in microphone satisfaction\nHackin' MC's who think Skillz be relaxin'\nStraight from punchline ave, metaphor metropolis\nI'm shockin' MC's like seeing their grandmothers topless\nWatch this, check for my sequal\nI make raps and niggas vanish like the Village People\nHey, you checkin' for me check &#24966;ound my way\nThey say Skillz don't play when he's representin' VA\n\nChorus 4x: [Mad Skillz]\nVirginia's in the house [I said it]\nV-A [so what you gotta say?]\n\nVerse two: Mad Skillz\n\nYo, niggas get pissed, MC's cease to exist\nAs I persist, to drill mics and fill glock clips\nDon't sleep, like Mobb Deep, I'm leaving brothers shook\nWhile you debatin' I'm urinatin' on your rap book\nI be Skillz see, the ill East Coast MC\nAll my peeps down in VA, this one's for you B\nSo don't give me nothin' I'm takin' my props\nAnd I ain't stoppin' till my face is on the side of a lunchbox\nThe wack fold, &#24950;ause they been told\nTheir rhymes used to be worth something like Mr. T's gold\nNow I'm in, so watch me Kline like Calvin\nI'm the Dread Man, you fucked up by lettin' me make an album (huh)\nThe outcome is ill, when I grip the steel\nDon't be mad at me (why?), if you ain't got no skill\nNo questions, no second guessin' without a doubt\nNiggas know my name and they know who's in the house\n\nVerse three: Mad Skillz\n\nIs VA up in here? (HELL Yeah!)\nThen here's a jam for you to spread across the state like welfare\nI'm a special dread, that still be tactics\nDoing MC's anytime, anyplace like Janet Jackson\nIt ain't about dirt roads and corn bread\nNiggas be MC'ing, G'ing, war deeds and dread\nAfter this pack it up, I'll tell you my plan\nI'm on a VA tour with Kalonji my man\nCheck it, hittin' city to city like a horny trucker\nThis year, it's East Coast like a motherfucker\nMisconceptions are coming back like reflections\nNiggas who dissed, are now checkin' for my section\nThey wanna be down, they makes me laugh\nThat's like Brandy gettin' dropped and then you askin' for her autograph\nYou know the steelo and Skillz be in ya\nIt's just like that, nigga Virginia\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "Extra Abstract Skillz", "href": "Extra_Abstract_Skillz&&5394", "artist": {"unique_name": "Skillz"}, "lyrics": "(Extra P)\nWe bout to bring 'em out\nWe bout to bring 'em out\nA lot of niggaz in this rap world, come out, and dumb out\nMe, I bring the bassline and drum out\nPlus write scriptures, that bust bright pictures\nWhen Mad Skillz, ?Cool Reef Daddy? plus Tip\nJust stepped inside the lab, to keep the Extra Skillz Ab\nYou either true fat or cut the flab\nOn the microphone hot it's Skillz before heat\nA wack nigga rhymin, kills a raw beat\nAnd I got both, bout to cook up a loaf of bread\nOn your motherfuckin head!\n\n(Mad Skillz)\nYeah, here comes that kid Mad Skillz rippin styles with perfections\nMakin' rappers uncomfortable like they had yeast infections\nI'm prone to rip microphones, keep rap sewn\nStep on niggaz domes, leavin' crews with Down's Syndrome\nI'm Skillz, ending out the Extra Abstract\nGrinding on nouns, hittin verbs from the back\nIt's like that, that's the only way it'll be\nSo if it gets said nigga, it got to be by me\nI represent V-A well, peace to the Cella Dwell\nWashing-tons of rappers up, like my first name was Denzel\nWho wanna come test and attempt to come near\nI shaked your puny record sales and end your career\nLookie here, no need to get fly and shit\nIn ninety-five, I'm on sucka MC wanna die shit\nTo your chest and watch the mic get ripped\nMad Skillz, Extra P, and my brother Q-Tip\n\n(The Abstract)\nHuhuhuhuhuhuh *shuddering sound* like the Doc Bruce Banner\nHit you with a ray which is similar to Gamma\nDo you believe in miracles, ?\nLike I believe in myself, but I don't believe in you\nWhat you need to do is get faith\nTake your spiritual, out your body, put it in a higher place\n'Cause I'ma bring out, the Holy Ghost in niggaz\nIn my lyrical church, and I be hostin niggaz, uh\nSubmergin bodies in water, you know you oughta\nLose all the glitter and flash, and get raw ass\nI've been ordained by the feeling, to keep the hip-hop\nRaw hoppin and the wack rappers reeling\n\nChorus: Mad Skillz\n\nWho got the shit that make your wigs go back?\nYeah, WE GOT THE SKILLZ that be Extra Abstract\nWho's packin shit to make your wigs go back?\nYeah, WE GOT THE SKILLZ that be Extra Abstract\nWhose got the shit that make your wig go back?\nYeah, WE GOT THE SKILLZ that be Extra Abstract\nWho got the shit that make your wig go back?\nYeah, WE GOT THE SKILLZ...\n\n(Mad Skillz)\nYo, check the status, I write madness like Sutter Kane\nBody-snatchin MC's and pullin souls out the frame\nYou know my name, V-A's invincible Mad Skillz\nIntoxicatin rappers like eight million Advils\nYou comin' black, bring your lyrics, fuck a gat\nDon't play, every real nigga in V-A got my back\nI come strapped with lyrics and hooks intact\nYou ain't gettin' shit, Virginia'll send your demo tape back\nDon't waste your time tryin' to sound like me\nNigga treat me like a sleeping lifeguard and just drown for me\nI take you back like the Ebony Island\nIn the three twenty-five, with your fuckin' wife freestylin\n\nUh, like that\nMad Skillz, Extra Abstract\nKeepin' it real on the set\nYeah, catchin wreck\nYeah yeah we bout to blast off\nMad Skillz bout to blast off\nTribe Called Quest bout to blast off\nLarge Professor bout to blast off\nAll around just blastin off\nEast coast, we bout to blast it off\nDown South gotta blast it off\nUptown you gotta blast it off uh\nV-A you gotta blast it off\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "Move Ya Body", "href": "Move_Ya_Body&&7535", "artist": {"unique_name": "Skillz"}, "lyrics": "On the real, I freak techniques and beats in my sleep\nThe mack back in action show skills when I speak\nWatch my - leak when I bring it to your face\nI still corner dimes, but in the nine I'm on a paper chase\nGlass rocks, mega tops, Tims on your block\nHolding heat like crock pots and keeping g's in my socks\n(So, what's up, hopps?)\nI got to keep it tight like seams\n'Cause ain't no fiends\nComing in between me and my dreams\nSee what I mean, black?\nI keep it real like that\nF a \"word is bond\"\nI need stocks and bonds from these ill raps\nRappers won't see me with contacts, friend\nSo, please act you've got a Siamese twin and think again\n'Cause in the end I start off with flavor\nNext to bless your chest with freestyle fantasia\nSmooth behavior\nSeeing rappers as illusions\nMeaning they disappear but I'm hear to keep you moving\n\nEverybody, move ya body!\nEverybody, move ya body!\nEverybody, move ya body!\nI don't think twice, kid\nYou know I bring it to ya live\n(Repeat)\n\nSee, I don't get writer's block\nYo, I block other writers\nAnd there's been nights I had to wear sniper attire for biters\nDon't make that same mistake and get scarred, retard\nI see that tape you listening to got you thinking that you hard\nBut dig this...\nCut your hair and get your name on your stomach\nI still find ways to make your whole rap career plummet\nMaintain\nI steal mics out of the frame\nBut now people think they know me 'cause they know my real name\nWhile I stay same\nDoing shows and tours\nSomewhere in a phat crib (?) playing Sega in the dashboard\nStyles of sword (?) and flowing steadily\nTrapping MCs in mazes forever like Frankie Beverly\nYou know the steeze\nI'm bringing beats to they knees\nHolacausting MCs and sees some g's before I breath\nThat's how it be\nIt's no doubt that I\nGot to bring it to your chest as I bring it to ya live\n\nSo, from this point on until the day that they bury me\nI'll still be on a hunt trying to snatch this currency\nPutting my peeps on while friends turn fake\nThey get pissed thinking I be in Switzerland checking some real estate\nDropping LPs every year\nSomewhere in a mansion with a butler named Vincent Jeffrey Belvadere\nI'm rare\nBut, rappers ain't trying to hear\nThe reason why their girl freestyled her number in my ear\nIt's my year, son, and I ain't trying to slip\nI'm trying to collect props and get not (?) to stretch money clips\nHoney-dips\nI keep 'em on like low end\nSo, f five-o\nIllegal, so we don't got to go there\nIt's so unfair\nHow I do wack crews shady\nThey want to be next up\nTheir style sucks like a new baby\nThey can't faze me\nMics and man fusion\nBeats I keep bruising\nDo your thing and keep moving\n\n(Repeat twice)\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "Tip Of The Tongue", "href": "Tip_Of_The_Tongue&&4310", "artist": {"unique_name": "Skillz"}, "lyrics": "(Mad Skillz)\nUh... nine-five shizzot, in the hizzouse\nUh what nigga? Tch, uh, uh, uh...\n\nWatch my style rise like ? on your eyes\nAnd battlin is hard, like retards becomin Jedi's\nWatch the dread fry, submerge it from tripes\nBorn from a virgin, with a eye in her back\nSo where you at -- when I choose to chew through rhythms\nMakin' bitches WOOF, like they had seven niggaz with em\nMC's is sleazy, plus they styles is easy\nFool take that shit to help son and give it to fuckin' Wheezy\nOr Helen, I'm crackin' open MC's melons\nTonight aight yo, I'ma leave some microphones swellin\n(Man I be flowin) Whatcha flow got to do with me?\nYo I'm wiser so be Pryor and act like you can't see\nI'm the abyss so wack niggaz take a dive\nI'm over killer beats the average kids won't survive\nYou wanna battle? Come on and bring it on son\nI got your whole family tree on the tip of my tongue\n\nChorus: Mad Skillz (repeat 4X)\n\nFloatin lyrics, from the tip of my tongue\nI swing (swing) I sway (sway) I swung (swung)\n\n(Mad Skillz)\nCheck it\nI flow with tight raps, niggaz get a tight face\nAttitude's, like I parked in they handicapped space\nBut I wets it, wrecks it when I mic checks it\nGivin' girls my number backwards, tellin' 'em I'm dyslexic\nDon't front -- you know what type of shit I'm on\nRippin mics of all types, Verbal Master Sha-Kwan\nYou were warned about the Northside click\nBitch, flex, and get your neck stretched like Dionne Warwick\nLet me lick a shot for all my niggaz in the streets\nGettin' ill keepin' it real doin' what they gotta do to eat\nCompete and get hit with dizzy techniques\nThe only crossin over I'm doin' is a motherfuckin street\nSo listen, I get in where I fit in and word to God\nI like beats hard like holdin' your shit in, sit in\nOn the session watch your body get numb\nA real MC keeps his skills on the tip of his tongue, what?\n\n(Mad Skillz)\nVerse, tre, who's tryin' to leave in a hearse today?\nSee Skillz has skills since your great grandma'a first birthday\nIn the worst way, my styles be diesel\nMy crew ain't goin' no-fuckin-where nigga we the Forever People\nGettin' rid of, bullshit, when I bang ya\nSo MC's don't talk to me, just consider me a stranger\nTake a toke I hope you don't choke\n'Cause if you ever see my shit it'll be through a kaleidoscope\nLeavin' marks to embark then gettin' beat sparked\nFloatin lyrics from the tip like an ark\nI got rhymes to stand the test of time\nI'm bound to climb, when I go one time for your mind\nI'm fulfillin my purpose in life, pah (what is it?)\nSee I was put here so wack niggaz, would know how wack they are\nYou know who you are your shit's saggin, word is bond\nMy shit's tighter than five virgins in a Volkswagen\n\nDo you have any idea how tight, that, five virgins, well, fuck it...\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "Inherit The World", "href": "Inherit_The_World&&5072", "artist": {"unique_name": "Skillz"}, "lyrics": "(Mad Skillz)\nRappers came with their styles and I left with their heads\nTheir crews became victim of the body-snatchin dread\nThe world is now mine, the world belongs to me\nI carefully planned the extinction of all wack MC's\nNow innocents must prepare for my slaughter\nMy style will inherit the world, just like water\nCover it like sauce, think about who lost\nNiggaz minds was the reason for the MC holocaust\nI'll be the first to admit, I'm on some next shit\nTwo rappers stepped up and left bullemic, and anorexic\nI told humans I'd conquer and bomb shit\nNow I stand alone and take care of my continents\nA&amp;R's used to ignore me (yep) realized I was nice\nNow it's no one left here to write my life story\nNinety-five rappers shelled like pearls\nHit by genocide, I inherited the world\n\nChorus: repeat 4X\n\nHumanity gets crushed, with a style that's hard\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "Doin' Time In the Cypha", "href": "Doin%27_Time_In_The_Cypha&&3637", "artist": {"unique_name": "Skillz"}, "lyrics": "*Bunch of emcees talkin' about a cypha*\n\nI put roots on emcees who try to fade these, lyrics\nKid please, I got the microphone disease\nAnd I don't joke when it's time to go to work\nWhack emcees play like Pee-wee Herman and get jerked\nIn the cypher mad skillz gets hyper\nMore heads show up, and now the shits gettin' tighter\nHuh, I find it hard to breathe, bass line strummin\nMoney is gettin' hot but the lyrics keep, comin'\nFeel like I'm trapped inside my mother's womb\nAdrenaline's flowin, it's bound to be a battle soon\nPeep it, this is our secret garden\nNiggas'll represent and end up heads-a-noddin\nOn the corners, whithout the mics\nInside the clubs, whithout the spotlights\nPacked and tight like we were all doin' the bid\nFuck were ya from it's time to shoot ya lyrics kid\nYo flip the script, if you'll act time'll tell\nAww shit my man lit up the L\nSo you go for your's, I'ma go for mine\nRapper after rapper, rhyme after rhyme\nHardcore punchlines and then comes the riddles\nIt's like gettin' high when I'm standin in the middle\nSo freestyle fanatics and ya badass writers?\nYa shit ain't real unless it's real in the cypher, uh\n\nOn the corners, brothas bobbin' heads\nFrom them all doin' time in the cypha\n\nThe cypha keeps it real! bring nothin' but ya flowin'\nMinus the static and some batteries for your radio, 'cause yo\nSkills are vital if ya enter\nI've seen niggas lose titles just for standin in the, center\nCan ya feel it? can ya feel the vibe?\nIt looks like we beefin' to the people walkin' by\nThe feeling's real and ain't nobody fake\nSo go acapella while my man flips the tape\nI close my eyes and think for a while\nMoney changed the beat, different heads, different styles, yeah\nWho's next to flex? yeah you know the deal\nChillin' in the cypha where the shit is maaaaad real\n\nRepresentation, minus comfrontation\nKeeps shit funky with the funky sensation\nSo step up kid, come on kid step up front\nAnd peep out my man while he's rhymin with the blunt\nSome kids bring the funk, some kids bring the dissin\nSome kids are just whack, but everybody's listenin'\nYeah ya gotta give respect, ? when respect is due\nFuck the bullshit, and the cypha shit is true\nThe rhymes get spit and the 40's get tapped\nSome niggas don't have jack, some niggas got contracts\nRepresentation keep the brothas tighta\nPeace to emcees who did time in the cypha\n\nYeah, keepin' it live for '95, no doubt... it's cypha time, only emcees know\nWhat I'm talkin' about... yeah...\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "It's Goin' Down", "href": "It%27s_Goin%27_Down&&1282", "artist": {"unique_name": "Skillz"}, "lyrics": "It's goin' down baby, It's goin' down baby, It's goin' down baby,\nIt's goin' down,\nIt's goin' down baby, It's goin' down baby, It's goin' down baby,\nIt's goin' down\n\nI be that nigga bringing fat funk freestyle perspectives\nRappers couldn't see me, they hide it fucking detectives\nCheck this when I flex this, put it on point\nThat nigga Skillz droping foucers in your local due joint\nI'm still paying deuce and saying cruise\nStill geting up at niggaz asses\nLike that little brothers Underudce\nShoes haotatin' in ya air, it ain't news I stay on bitches\nLike Dano Kariges\nAt partys I retaits and make niggaz wanna fight\nSo when they play some reggae keep happerseein' to the right\nRight outta my life you and ya hoddie bitch\nSeein' thous of body, whitin no infron of me\nV.A running shit, you best be believe it\nIf I'm up and commin, all ya niggaz is down and leavin'\nHit me with a tound when I come to ya town\nWhen you see my face, you know it's about to go down\n\nIt's goin' down baby, It's goin' down baby, It's goin' down baby,\nIt's goin' down,\nIt's goin' down baby, It's goin' down baby, It's goin' down baby,\nIt's goin' down\n\nNow if I told one time. I told you before child\nYou can't toutch one kid, who got two billons styles\nMean wild, when it comes to mics I be cheeting\nI'm destend to find new ways so ill MC's\nAnd I'm real with this, I come of like a scat\nIt's the dread heads checking for repesenting north add\nKids pack tacs, I pack technics\nLyricol contact, now I'm strapped on the streetz\nFreezby aient, niggaz be trying\nBut standing next to me kin but so in lyricele dyin'\nI wrote the rhyme 'n' wrote the next rappers back\nSo before you run up in my face, foe, remember that\nAnd dance in the art 'n' main tain\nA rapper speaking for real like ban-jis when it's swinging\nNot yo bond MC's, don't aim to ever round\nAnd bust off like four pound\nNow bust how they go down\n\nIt's goin' down baby, It's goin' down baby, It's goin' down baby,\nIt's goin' down,\nIt's goin' down baby, It's goin' down baby, It's goin' down baby,\nIt's goin' down,\nIt's goin' down baby, It's goin' down baby, It's goin' down baby,\nIt's goin' down,\nIt's goin' down baby, It's goin' down baby, It's goin' down baby,\nIt's goin' down\n\nYo, my sex and be mic checking and MC decking\nYou can buck me I ain't contry\nI never said I wreck it (true)\nSo wack MC's chill with defesistnts\nCause the minist that I freestyle\nCan probably shoop 'n' your entistnts\nI make beats to stort\nRappers be getting court\nI swear all MC's be sampling my fucking thoughts\nIt's on when I hit the metchinon, beat acsin' at your show\nNa, nigga I boo be check your microphone\nDroping rappers and black hole, hell and head n',\nPull 'n' girls of smore\nLike Pam Grier, seveny seven\nYou can't work a verse, pass it\nWhen I come in niggaz start wrecking win like Din Jackins\nThinking they asking, lyricle breaking backs\nMy shit is hot, my reggae come,\nShouldn't be fucking prengsing wacks\n(You don't repesent nigga)\nNigga hide that sound\nCheck your battle stats, 'cause it's about to go down\n\nIt's goin' down baby, It's goin' down baby, It's goin' down baby,\nIt's goin' down,\nIt's goin' down baby, It's goin' down baby, It's goin' down baby,\nIt's goin' down,\nIt's goin' down baby, It's goin' down baby, It's goin' down baby,\nIt's goin' down,\nIt's goin' down baby, It's goin' down baby, It's goin' down baby,\nIt's goin' down\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "Street Rules", "href": "Street_Rules&&3108", "artist": {"unique_name": "Skillz"}, "lyrics": "(Mad Skillz)\nYeah\nYo this go out to everybody, just doin' what they gotta do\nKnowhatI'msayin? To get that cream, knahmean?\n\n(Chorus: repeat 2X)\nThe streets don't care who you are\nAnd those who fake jacks son they never get far\n\n(Mad Skillz)\nYo, where I reside fake niggaz run and hide (what?)\nThe streets be wicked, keep that biscuit by yo' side\nWhat the fuck? Who the next crew to get run amuck?\nIt's all real over here, on the streets you get stuck\nFor fakin jacks don't max cause the block stay hot\nWatch your back for the jeal' niggaz tryin' to get what you got (true)\nCount your dough slow, never flash your ends\nAlways keep a stash spot and never make new friends\nCommit your sins (right) confess on your own time kid\nNever think that you too nice to do a fuckin' bid\nDon't nobody but you wanna see, you gettin' bigger (uh-huh)\nSo for every loyal nigga (what?) it's two spoiled niggaz (true)\nMidnight to six cliques pullin sweet vicks (uh)\nFulfullin cream dreams, takin' niggaz out the mix\nNine-pound locked down by you and yo' crew\nBut watch yo' back nigga (why?) because the streets don't have to\n\n(Mad Skillz)\nYo, fuck gettin' high, I need high dough\nAnd when you high all you seein is yo' money movin slow\nSo scratch the itch, don't slip and don't snitch\nLeavin'? C'mon, this ain't \"Superfly\" bitch\nAsk black, the kid with the wide-body Ac'\nPut a freeze on your cheese and you're workin till he stack\nNuff bills to chill, sniff lines and shit\nTill some niggaz hit crib on some tec-9 shit\nI numb gums like coke when you take a taste\nYou in the wrong motherfuckin place tryin' to be Scarface\nNiggaz be schemin and slippin on Henny demon\nTryin' to outlast the next ass, cash got him fiendin\nTo rock on the wrong blocks and don't know the tactics\nIn God we trust, mad deep like Sounds of Blackness\nLocked in the rule of no sharin, it might seem\nI'm selfish but I'm for delf I can't spend whipped cream\n\n(Mad Skillz)\nBreak it down\nThe man is so hot niggaz is catchin suntans\nMakin' plans to jam after they bag up this next gram\nBrothers gettin' laced, I caught a new case\nBut if they want me, they got to kill me twice like Screwface\nExcess players I got no time for rest man\nKeep that dough flowin, motherFUCK owin the next man\nNeighborhood villain, hoodie glock no smile\nWhen I see you it's gon' be, executioner style\nWhat nigga? Check the stee', yeah you know how it get\nOut here some ol' (?) Columbian blindfold shit (true)\nDou-ble go to club chill drink holder (uh)\nDiscrete down to low cabbage gettin' street soldiers (hah)\nDuckin guys till heads recognize the real\nLettin lead fly, but instead I maintain and chill (uh-huh)\nYou know the deal, kids get ill don't sleep\nYou get your card pulled quick fuckin' around in these streets\n\nYeah, you know how we do\nBig shout to everybody\nI ain't mad at ya, do your thing, y'knahmean?\nNorthside, Southside, Eastern, Western\nNiggaz gotta win\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "Unseen World", "href": "Unseen_World&&8933", "artist": {"unique_name": "Skillz"}, "lyrics": "(Mad Skillz)\nYeah what?\nTime for lyrical shanks to your gut\nDeath to wack MC's\nFirst up is my nigga Lonnie B\n\n(Lonnie B)\nFirst up to make it liver, I catch wreck like drunk drivers\nBeen through many battles but I left no survivors\nSo WHASSUP? Those that want a beef nigga bring it on\n'Cause when I'm done, it'll be my dick that you're swingin' on\nFrom the way I say my rap clear\nI make people more excited than a faggot that got a pap smear\nThe crooked truth rap sensation, I ain't to be fucked with\nYou better off practicin masturbation\nLine after line I bring excitement like a hooker\nSo put rubbers on your ears, then diaphragms on your woofer\nAs the rhyme buster, mic clutcher, from Richmond\nShow the real definition of the word represent\n(SOUTHSIDE!) The place where I dwell so\nRecog-NAS NAS NAS, that It Ain't Hard to Tell\nWho's the best, blessed with lyrical, context that kick\nJust like that little girl that got shot in +Fresh+\nWord to momma, I'm hotter than that nigga with the bomber\nLeather pants on, in hell holdin' hands with Jeffrey Dahmer\nYo, let me make this clear - I ain't the baddest rapper out there\nBut I'ma take his place until he get here\n\n(Kalonji)\nThe sun shitter, hoarse all-star spitter\nMore ? and asteroid transfixer\nUpchucks the medicine, chest of anguish\nIn a fantasy, holy sign language\nI hit worlds, and my strange sperm gives birth\nTo septuplet lady plants\nCheck my tympanic titanic time pulse\nBy the grace of the Immortal One\nI am the poisonous priest of fifty until the ?m'salaam?\nSo every naked ape on Earth bow down in silence\nTo the slumlord, of all universe reality\nIronic supalism sodomizes your mentality\nScience super-mystics and futuristics join in wedlock\nSo my freon cyrogenics make your head rot pop then bust\nFrom galactic cryathallic mechany mal ??\n\n(Mindbenda)\nPreposterous, ice in my drop, yeah that's niggaz\nWhen I bend prisms and ride soundwaves in your eutrichula\nMalopropism is none, when I cerebrum wash in your brain pan\nMixin ooze, your state of bein and attitude\nPetuitary shrinks, accepts it when\nI bite then flatten your head\nRichencypholic surgeon of my cosmorama, astrophysical\nInvades one, individual stands\nAnd uses cosmic radiation as a cosmetic\nTo beautify inner fantastic, gory flow\nSo, writing weak rhymes to your boomin system is no mo'\nWhen I induce arthritic rheumatism\nIn dosages in sterile toxosins, ex-osmosis\nInfect the schlerois, of your trickanumerolagia\nUnderstand, who are you, to defend against, Mindbenda\n\n(Mad Skillz)\nYeah the Northside click, rocks the spot\nThe Forever People, rocks the spot\nDJ Street, rocks the spot\nTo the Roc comin' next, time to get your props\n\n(Lil' Roc)\nYo, umm, befo' I knock out yo' lies\nThere is something you need to know\nBreakin mo' grounds than aftershocks from the earthquakes in San Fran'\nMore determination than a bull, seein Redman\nImagine, Technic glare +From Where???+\nCompetition say I gotta be display 'em in a photo album\nDisorganized has the other file\nBein flamboyant like ? herbal user, slash, barracuda\nWith key maneuvers like silent troopers of styles\n?? To split your wig and nip your eyebrows\nGo to space and greet the stars, huh\nStarted chewin on the Milky Way, thought it was the candy bar\nYou get the gong 'cause we niggaz do wrong\nAnd if you're young, and in love, do the moves of Michael Evens\nSingin' songs, big up to my peoples Northside\nShow the brotherhood, how I recognize\n\n(J'Von)\nI've been, detonatin equivalyrical exposives\nRambo soldiers deep like the black trials of Moses\nMadness and wisdom accelerates my pendulum\nNo attackin my forces of life, 'cause I got ten of em\nDangerous, disciple killin' images\nMy warfare dreads be just like Nemesis\nInfiltrates, holy massacres like ?tnakarid?\nMy religion break down prisons for missionaries\nIn it to survive, so enlist, in strategies\nMy non-exist thinkin' only lead, to casualties\nI'm battlin, invadin, interceptin\nMakin' sure don't nuttin move in your section\nDon't misinterpret my threats as just talk\nAnd the raise of a hand can make, worlds start haltin\nThe almighty, leavin' Gods and nations lost\n'Cause when my shit hits I leave holes like sawed-offs\n\n(Mad Skillz)\nYo, it's the Mad child layin verses like tile\nNiggaz go impotent, when I kick these potent ass freestyles\nWack MC's get mad and look at me hard\n'Cause they used to be the shit, like McDonald's on Broad\nIt's odd, how niggaz try to bomb\nThen I be fadin more motherfuckers than AIDS story harvest\nThrowin' niggaz away like apple cores - I don't wanna see shit\nBut some hits and Ed McMahon at my front door\nI'm rippin tapes, niggaz still makin' SHIT cakes\nSlippin down to fall off dudes tryin' to get they shit straight\nI'm tryin' to get paid troop -- I want more G's\nThan a girl named GiGi gaggin on some gin and garlic glue\nNiggaz think they hype, but they ain't touchin these\nTheir styles plaid out like stripe cuffed Lee's\nPlease! In ninety-five, I'ma be straight\nStealin MC's like DJ's be stealin milk crates\nAsk Dre, can't nobody hack it, they ill Dre?\nYou get beheaded with a motherfuckin hatchet\nHaste makes waste and taste the bass\nWhen you see me - you don't see me get the FUCK out my face\n\nTo that nigga Speedis Toine, rock the house\nTo them heads Raw Deal, rock the spot\nTo Mike the Merciless, rock the spot\nTo my brother Danja Mowf, rock the spot...\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "The Nod Factor", "href": "The_Nod_Factor&&1811", "artist": {"unique_name": "Skillz"}, "lyrics": "I know your tired of bouncin' so check this here\nWe got tha back breakin club shakin beat for this year\nYeah... so peep the steelo and the flow\nI gotcha head noddin 'cause your neck already knows\nSo pass the mic and watch Skillz rip fast\nAnd have niggas up in parties catchin whiplash\nSlash the wack... who tryin' to bite my style\nTake yo ass to da old school\nAnd part your fuckin' eyebrows\nI comin' through to\nAbout to get set\nSo act like WU... Protect that Neck\nI still calm... I'm still tendin to the song\nI be blowin' up spots like I was sendin out mailbombs\nStya calm and be noddin see\nI'm like a black president (why)\n'Cause niggas ain't seein me\nHas beens they both like bad skinz so face it\nAfter this joint yo we passin out some neck braces\n\nI gotcha head noddin 'cause your neck knows it phat\nCheck it out like this and then like that\n(Repeat *4)\n\nMy track packs enery like nuclear reactors\nI be Mad Skillz and this be the Nod Factor\nAfter MC's smoke me take a toke\nI'll fuck your career like the cast on Diffrent Strokes\nNo joke... I see airlines and start aimin rhymes\nMy shit will have hard niggas in soul train lines\nBumpin wit this big black broad named Belinda\nOh you rap don't say jack\nAnd walk quiet like a ninja\nI injure... beats so you can expect to go to Cairo\nSo I can practice checkin' that neck and got set\n'Cause guess what I'm the one to set it\nYou regret it\n'Cause my beats employin paramedics\nI wet it\nYeah and it will stay that way\nI know you'll be back\nYou probably got some rhymes on lay away\nBut I be here freakin fat funk to make you sweat\nDo me a favor\nAnd tell your neck that I ain't finished yet\n\nChorus (Repeat *4)\n\n\nI perfect raps stick in under your skin\nEither your noddin by now\nOr your dead or a mannequin\nMy friend resistin ain't good for ya health\nPut your tool on the shelf\nAnd just go for self\nGet help... get da drink and get the hidin\nGet your groove on\nBefore he get gis glock and gat up the party like Gotti\nI'm runnin' thangs from the inside\nRap better wait because your style done died\nAnd let you corny-spiderman MC's sayin' nothin'\nPut your clothes on backwards if you feel like frontin\nI'm huntin for beats/on point like cleets\nWit da brand new sound\nYou can pump in ya jeeps... It be the Nod Factor\nRollin' hard like tecs\nI'm Skillz for real\nBringin' it to you somethin' stank\nThis track will be in ya ear\nLike new wax/now max\nAnd tell your neck veins to relax...\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}, {"title": "All In It", "href": "All_In_It&&193", "artist": {"unique_name": "Skillz"}, "lyrics": "(Mad Skillz)\nNo doubt\nMad Skillz for the nine-five shot son\nYeah... forever people wreckin shit, uh-huh\n\nGet closer to your speaker, it's Mad Skillz the mic freaker\nThe cordless technician ill breakbeat seeker\nYou're feelin' weaker, when I begin to come in\nWack MC's are like abortions, 'cause I ain't havin' none of them\nSo break it down for me I can't understand\nNowadays you got more rappers than you got fuckin' fans\nAnd man listen that's a pity\nThat shit wouldn't come off the shelves if a earthquake hit the city\nIf they ain't pullin blunts, they pullin triggers\nI'm gettin' tired of DJ Nobody and MC New Nigga\nHuh, I start cyphers for self in dark alleys\nI wreck shows lovely 'cause I got nine personalities\nI kick the real on ear-woundin tracks\nYour first mistake was, \"Man niggaz from Virginia can't rap\"\nYeah whatever - where I'm from, mics be gettin' dented\nGive me a fly beat, and I'm all in it, yeah\n\nStraight up skills, no time for gimmicks\n\"Gimme a fly beat, and I'm all in it\" -&gt; Guru\nBreakin down tracks the beats get diminished\n\"Gimme a fly beat, and I'm all in it\" -&gt; Guru\nRhymes designed to be in the book of Guinness\n\"Gimme a fly beat, and I'm all in it\" -&gt; Guru\nYo son where I'm from yo mics be gettin' dented\n{*Scratched: \"I'm all in it\"*}\n\n(Mad Skillz)\nNever fakin jacks, just makin' tracks when I set it\nUh - battle odds are betted, don't sweat it, MC's leave beheaded\nWhat? I'm on some sit back, relax shit\nSome never leave my house without a (?) max and count green stacks shit\nIt's ninety-five, you know what I mean yo\n\"Yo Skillz what you doin'?\" Son I'm tryin' to get dough\nThe paper raper, yeah flatline massager\nDon't worry cause MC's see me blurry like Roger Thomas\nWithout his glasses - momma, I can't breathe\nI'm fat and black, I squeeze the life outta MC's\nSo please, keep your style in your grab bag\nRappers step up and get sent back like a shag\nWhat? I chills on the real side\nChickenheads crossin the street tryin' to hit the Mad Skillz side\nLight and G's get cut off when I'm finished\nGive me some fly beats and I'm all in it, yeah\n\n(Mad Skillz)\nAdmit it, I'm all in it, quotes are all in\nWhen it comes to beats yo I'm swim through 'em like frogmen\nI take basslines in my veins, so refrain\nFrom poppin' anythang that make me wanna tear you out your frame\nYeah, things have changed but it's all real over here\nWhat? Eargasmic styles havin' sex with your ears\nYeah, I leave crews in debt\nCause ain't nothin' like a fat loop that a brother ain't use yet\nWhose set to rock raps raunchy and raw - yeah\nI like my beats pretty like Chante Moore, now check it\nConstructin raps like erector sets\nArtifacts flexed the tech', now I'm next to wreck\nBitch-ass niggaz should know that they done messed up - why?\nI'm pullin skirts bras and girdles and motherfuckin dresses up\nBeat (?) society, oh I dogs 'em, I'm a menace\nThis track was fly, I was fly, you was all in it, yeah\n\nStraight up skills, no time for gimmicks, yeah, yeah\n\"Gimme a fly beat, and I'm all in it\" -&gt; Guru\nYeah breakin down beats the tracks get diminished\n\"Gimme a fly beat, and I'm all in it\" -&gt; Guru\nUh-huh, rhymes designed to be in the book of Guinness\n\"Gimme a fly beat, and I'm all in it\" -&gt; Guru\nI'm from V.A., nigga what? Mics get dented\n{*Scratched: \"I'm all in it\"*}\n\n(Mad Skillz)\nYeah\nLike that, like that y'all\nLike that y'all, like that y'all\nUh, uh, like that y'all\nDJ Riz y'knahmsayin?\n\n", "album": {"title": "From_Where%3F%3F%3F_(1995)&&2179", "genre": "Hip Hop", "year": 1995}}]