[{"title": "Sincerely Yours", "href": "Sincerely_Yours&&6443", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "Where's your brother? Where's your sister? Do you remember when they used to let me in? I just wanted to see you again\nWhat happened when the door closed? We're led to believe that it would never lock\nI never set my feet again against our wall and now I'm sick\nI'm sick of hurting you\nI'm ten feet tall, then to nothing\nMy hands still bleed from the fall\nThere I stand again at your door\nCan I just sleep on the floor? We can just talk through this long night\nI never set my feet again against our wall and now I'm sick\nI'm sick of hurting you\nHere I stand again knocking at your door while you check your hands\nWe may be right\nHere I stand again waiting by your door\nLet me take your hands\nI'll make you right\n\n", "album": {"title": "The_River_Bed_(2003)&&561", "genre": "", "year": 2003}}, {"title": "This Ship Will Burn", "href": "This_Ship_Will_Burn&&1710", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "(Listen) to me, my best friend\nPermission granted friend, but stay close to my heart and we'll get through this sad part\n(Wander) with me, my lost friend and find something that makes sense\nWe catch drift far from home\nReturn to things we don't know\n(This ship will burn) Breaking waves and bitter lives\n(Full steam ahead) Turning tides and hanging minds\n(Stop shoveling coal) Churn our sea, unpredictably\n(The boiler room is full) (Recover) with me, my hurt friend\nThe wounds you wear aren't forever\nThe air will cool where you bleed\nYour tears bear salt from our sea\n(This ship will not overturn\nThese waves will not cool this burn\nThis sea will not swallow me\nThis past will not defeat me.) This distance is so absurding\nDropped anchor just to keep on moving\nFound times bound ground in course from dead reckoning\nThe true course at what speed? Past times find ways to drown\nDeciding distance for the present roaming\nOff course source bound for worse in dead reckoning\nWe'll find true speed in traveling on\n(Assumed command\nComplied and warned those who don't know what it might have done.) (Hold on) to me, my last friend\nMy sails are free from all wind\nStep down from my seat\nMy drowning mind sinks slowly\n\n", "album": {"title": "Dead_Reckoning_(2001)&&4911", "genre": "", "year": 2001}}, {"title": "Tragically Ending", "href": "Tragically_Ending&&1240", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "So you laugh and try to change your way.\nI hope that you don't have to lie again.\nIf I walk out right now, will it make you see the things that you can't stop?\nHead feels heavy. \nMind can't find it. \nI try to leave all. \nFeet aren't moving. \nEyes keep blinking.\nI'll be the one to laugh it off.\nIt kills, but you know you have to say it.\nYou leave this going for so long, unchanged.\nIf I walk out right now, will it make you see the things that you can't stop?\n\n", "album": {"title": "The_River_Bed_(2003)&&561", "genre": "", "year": 2003}}, {"title": "Now and Never", "href": "Now_And_Never&&6730", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "You've given up on me? I gave up on you about a year ago\nI find it hard to see that you've been trying now and I still don't know\nI don't know\nI've had this rage for you since I left your house on that one sunny Sunday\nI the right the thing to do, but it won't turn on that way\nSay something\nDo something\nLet's go somewhere\nLet's stay right here\n\n", "album": {"title": "Our_Own_Wars_(1999)&&1688", "genre": "", "year": 1999}}, {"title": "My Own Disaster", "href": "My_Own_Disaster&&8760", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "I was lost in these last few years\nDrag these bones to our graves\nI was lost in the future we had\nA cease-fire agreement for now\nClocks and calendars scream at me, mocking time\nMe and everyone spend our days, walking lines\nThings get different each day\nCreeping back through the latest escape\nDo you remember it's me? Can you forget the grief? Let's remove the tanks\nLet's call back the troops\nComfort and control\nIt's unwinding me\nI can't change any faster\nI can't stop my own disaster\n\n", "album": {"title": "Dead_Reckoning_(2001)&&4911", "genre": "", "year": 2001}}, {"title": "Sleeping Weather", "href": "Sleeping_Weather&&3272", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "I fall asleep to the breeze from your open window\nAnd your computer screen lit the room just right\nThe last thing from your mouth sheds light\n(Goodnight) You are the one who calls my arms\nWave from home and sound alarms\nThe want is angled from afar\nAnd I don't want to leave, especially with this breeze\n(But my ambition teases me) This truth be known\nI shout it in this song\nMy song to say forget where I've gone wrong\nTimes changed\nI've changed\nNow I feel like my life has changed\nI lie awake to this long night\nTo separate me from my mind until the morning light just shines\nYour words sound right\nCast these images to find\n(I can't sleep another night)\n\n", "album": {"title": "Dead_Reckoning_(2001)&&4911", "genre": "", "year": 2001}}, {"title": "Zerosum", "href": "Zerosum&&6959", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "Up and down just to see you smile with a cup of tea. I've seen better days. today I thought about giving up, given up on me, but the comfort still remains. a walk in the rain passing by your window, I asked myself, \"is she dead?\" holding you in my arms crying in the rain, I said nothing. I woke up by a phone call from my mom, I tried not to cry. say to me it's okay, she said it's okay then I remembered that I saw your eyes and not the rain. your family cried, your friends all cried, I finally cried when I realized what love is. sitting on the bathroom floor asking \"why?\" I think your stronger for wanting to stay alive. all of the sudden I thought you were leaving, didn't you know you gave me something to believe in? you kept me breathing when my times were down. the last time I saw you I took a good look at the sky. and you told me something. I should have said something, then I remembered that I saw your eyes and not the rain.\n\n", "album": {"title": "Our_Own_Wars_(1999)&&1688", "genre": "", "year": 1999}}, {"title": "Running Swimming and Sinking", "href": "Running_Swimming_And_Sinking&&2733", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "Doesn't it kill you too? sometimes when you realize that you've spoken too soon or fallen so quickly. you're getting ahead of me, I'm losing will and trying to paint a masterpiece. you said that it seemed to be right, I think that I was trying to impress you, nothing ever works and I'm glad. today we all run for the ocean floors, we all swim through the seas. we all capture our torture whole and fall to our knees. holding my breath, dodging the time, I'd rather drown by myself. I can only remember enough to keep myself in line, I can only forget so much at one time. you said it seemed to be right, I think that I was trying to impress you, nothing ever works and I'm glad. walk to the ocean with me, let's do this right, let's take our time, with longer to breath. float through the ocean once more, we'll laugh and just smile and sink to the floor.\n\n", "album": {"title": "Our_Own_Wars_(1999)&&1688", "genre": "", "year": 1999}}, {"title": "In Tune", "href": "In_Tune&&44", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "I'm picking and tuning, but I can't get in tune with myself\nEverything I do I end up thinking about you\nI'm scraping and crawling, I chose that road myself\nI slammed the door in my face, I want to fix it\nI don't know anything today make me numb my friend\nTwisting and tying knots makes it hard for me to breath\nI want to know something, untie the knots that bind\nI want to be strong my friend, I want to breath\nTell me I'm wrong and I'm far from it, I can't loosen the grip\nTake your hands off my throat everything I do I end up thinking about you\nGive me broken glass instead of all the answers\nSincerity runs strong through me, I'll hold onto it\nWon't you tell me and hold me, won't you tell me everything from the radio tonight\nI slept on the floor, just waiting screaming at myself, \"do you love her tonight?\"\n\n", "album": {"title": "Our_Own_Wars_(1999)&&1688", "genre": "", "year": 1999}}, {"title": "Expression Eraser", "href": "Expression_Eraser&&7379", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "Broken glass moves through me, calloused skin falls off of me, I crash to my knees\nInteriorly I bleed and I cry blood under the sheets\nI'm breaking down, I'm broken down, I break my thumb, don't mind me\nYou erase how I feel, erase every chance I get\nI'll take every expression and make it something\nI wish for an even number of stars, I breathe simple\nI give you real and ask for nothing, rain on me now\nThere's nothing like a cold in June to wake you up\nI'm choking on my lung and drowning in tears, I won't and can't be hurt I am the expression eraser\n\n", "album": {"title": "Our_Own_Wars_(1999)&&1688", "genre": "", "year": 1999}}, {"title": "The Cannons and Tanks", "href": "The_Cannons_And_Tanks&&9008", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "I know that this might sound strange, but I can't think of a better way to say that if I could find the words I'd tear them out of my throat and crush them into your eyes. so I wrote myself a list of things that I've been meaning to say. I forced them out of my head, but I can't find your eyes. I try to call it a truce, approach you crush them out of my life, convince you. a walk is all that I need; this ambiguity feels like a knife in me. sixteen blocks without any thanks, I feel that I think the cannons and tanks. all of these wars that I try to explain get defused so many times so I play with my shoes, I've learned to untie them with my eyes. I try to call it a truce, approach you crush them out of my life, convince you. call it a truce, crush them out of my life. The Cold\nI've been outside for too long now, I've seen the seasons come and go. could be today may be the day, tomorrow comes and I'll stay the same. don't know my place, never thought it'd be this way. can't change my face, never thought I'd see this change. too many times I've passed these doors, I've seen them open just to close. now I'm searching for some new key. locked up, locked out it comes down on me. don't know my place, never thought it'd be this way. can't change my face, never thought I'd see this change. I've come to see this change, I've come to stay the same I'll stay until I'm old, unwind, release, unfold. I've come to stay the same, I'll stay until I'm old I don't want to be cold.\n\n", "album": {"title": "Our_Own_Wars_(1999)&&1688", "genre": "", "year": 1999}}, {"title": "Curiosity Killed the Cat and Im the Killed", "href": "Curiosity_Killed_The_Cat_And_I%27m_The_Killed&&761", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "How hard will I fall down? will everything fall in line for me? there's only so much I can take until I fall down. the numbness wears on me and when you think for a second things are going well, you start to feel the scratch, the burn, and the cold. push your feelings aside and walk the back road home. can I play with the second string dumbie? here are the scissors to cut the strings. I thought that's what went wrong, thanks for knocking me out of the tree. it's not my fault that this isn't home, too many people involved. thought thatwhat I felt was right, I guess I learned my lesson that night. involved then dissolved, wash and rinse away I was wrong for playing pretend. I was killed, I'll show them, if your curious, it won't happen again.\n\n", "album": {"title": "Our_Own_Wars_(1999)&&1688", "genre": "", "year": 1999}}, {"title": "Unsung Zero", "href": "Unsung_Zero&&2002", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "Everything was so dead still\nThe air just froze and broke\nThose few words that you said to you\nThey had no place to go, but to our minds, to our hearts and the torture wasn't marked\nNow I've found that you hated our lives\nI just think it through sometimes and get nowhere, but lost\nI can't help but miss those things that we found through our talks\nNow we don't laugh and we don't sing and I can't understand a thing\nAnd the thirds and the fifths are all gone\n(And it's so hard to see you now) Don't be my unsung zero\n(And it's so wrong to hate you now) Don't be my unsung zero\n(I can only scream half as loud) Don't be my unsung zero\nI don't want to chase the past\nIt feels like finding ghosts\nYou seem to have your mind set up\nIt's creeping from our home\nWe don't talk and we don't call in this manufactured war where I can't even aim with my eyes\nNow that we've closed that door\nHugged and stepped away\nThank you from my heart\nWith one last thing to say\nI miss our life\n\n", "album": {"title": "Dead_Reckoning_(2001)&&4911", "genre": "", "year": 2001}}, {"title": "Kingfisher", "href": "Kingfisher&&2927", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "Do you remember the day you saw me? Credit card life cared enough for groceries\nI can't explain just what this song will never say\nI hope to be just what you've been to me someday\n(River is our veins) Rushing to our hearts\n(Cast the line to me) To catch, to teach and then to release\nI bleed your blood\nI share your skin\nI play your part\nTake me apart\nBack to that place again\nYou can see it in his eyes\nNo one could convince a man whose pride ignores their prize\nSpoken so softly with gentle hands that show with care\nTo a child unknowingly learning the traits and manners that they share\n\n", "album": {"title": "Dead_Reckoning_(2001)&&4911", "genre": "", "year": 2001}}, {"title": "Atlanta", "href": "Atlanta&&2510", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "Walking, where I have yet to go I'll pay big for this one\nFacing these things I've yet to see, my eyes won't be the same\nFor now, there's no way\nFor now, I'll just stay\nRunning from things that have no force, my naive self comes up for air\nKnowing that all of this time I'm wrong and I admit my guilt I know that we can't stay forever\n\n", "album": {"title": "Our_Own_Wars_(1999)&&1688", "genre": "", "year": 1999}}, {"title": "The Cold", "href": "The_Cold&&260", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "I've been outside for too long now, I've seen the seasons come and go.could be today may be the day, tomorrow comes and I'll stay the same.don't know my place, never thought it'd be this way.can't change my face, never thought I'd see this change.too many times I've passed these doors,\nI've seen them open just to close.now I'm searching for some new key.locked up, locked out it comes down on me.\nDon't know my place, never thought it'd be this way.can't change my face, never thought I'd see this change.I've come to see this change, I've come to stay the same I'll stay until I'm old, unwind, release, unfold.I've come to stay the same, I'll stay until I'm old I don't want to be cold.\n\n", "album": {"title": "Our_Own_Wars_(1999)&&1688", "genre": "", "year": 1999}}, {"title": "The Vacuum", "href": "The_Vacuum&&9894", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "Our signal is breaking up. \nI'd like to focus my attention on something bigger than my thoughts.\nWatch where you point those words.\nSame saga.\nOur hero never wins.\n(Hardly a hero at all)\nMy eyes won't focus.\nI'm standing crooked at the wrong place and wrong time.\nAir sweeps through my ears like a vacuum.\nPulling life from view.\nDraining me from you.\nWelcome to our vacuum.\n\n", "album": {"title": "Dead_Reckoning_(2001)&&4911", "genre": "", "year": 2001}}, {"title": "Hideaway", "href": "Hideaway&&9474", "artist": {"unique_name": "Small_Brown_Bike"}, "lyrics": "Cabin in the woods\nWhere I feel isolation\nWhere I feel separation from everything\nBut my mind travels distances that my body can't make\nI find it hard to sleep with this oncoming dream, I recite, \"I see you.\" This room sinks below\nUnderground tonight\nIs your room sinking too? I lie in the hide away bed\nAn attempt for the best to awake my sleeping life\nDeath is contagious\nDeath is courageous\nThe phone was crying tonight, but I can't answer its call\n(Wake up, wake up) With a purpose to react to this loss of response\n\"I'll find you.\"\n\n", "album": {"title": "Dead_Reckoning_(2001)&&4911", "genre": "", "year": 2001}}]