[{"title": "Royale Fuck Deluxe", "href": "Royale_Fuck_Deluxe&&2856", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "As I look at the moon, my eyes are closed\nYou have gone so soon, like the moon\nYou know what I miss? The old you\nYou're a cold hearted-fool\nYou swore to me that things were still cool. How untrue\nThe cards have been dealt and my hand doesn't exactly rule\nAs I looked at the sky, I was glad I didn't cry\nLove-- thrown away\nI'm happy that you are undauntedly mistreating me\nLook at my life you can't honestly say that I could\nAnd it would be better for us both\nSo what now I feel sick?\nI was right, did I have to be so cruel, like the moon\nHiding away as the sun shows the pain in the world\nNow my heart has been broke and you're the one crying\nIs this some sick joke?\nMaybe next time someone dicks in your crotch you'll pray that he chokes\nMonths-- thrown away\nYou pissed on my trust and that's always the way that I'll see you and me\nAnd as it stands now that's the way that it always will be\nSo we're done and in the end it wasn't all real fun\nYou're the one who ended up not being the one\nAnd as time passes by, its stands ever still and I just can't figure out why\nHeartsick disease\nYou hand-cooked me royally fucked with tomato and cheese\nI'm at ease, 'cause I don't care now\nHave fun the choice isn't me\nGood-bye again\nAs I tell myself over and over that's we'll still be friends, but I know\nIt won't be the same in the end\nHave fun in your life without me\nI know that I don't care about you\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "... And the Flame Dies Out Again", "href": "..._And_The_Flame_Dies_Out_Again&&9941", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "Potpourri of uselessness.\nSit with much dismay, I watch a summer go by\nWith the boredom of watching paint dry.\n\nWhy this time? Gone away. Nothing good can ever stay.\nBasic freedom, cigarettes and free pornography.\n\nIt always takes so much longer to find out what you want, and not to get it.\nOf course I don't know the latter or how to do the first.\nOnce I analyze myself I'll end the hurt.\n\nAnd the flame dies out again.\nGotta answer to someone else.\nNow emotions rear their blistered calloused heads.\n\nI worked myself too hard by not working at all.\nDear God, I'll get back at me once the summer leaves unfall.\n\nI always have a chance but blow it just like I can spare it.\nIt can't pass me by anymore. Why am I sad?\nOut with the bogus, in with the rad.\n\nI'm gonna change my world, I'm gonna have a blast.\nI'm gonna rock and roll, I'm gonna play it fast, and\nI'm gonna change my world, I'm gonna have a blast.\nI'm gonna rock and roll\n\nSo controlled by education.\nTaught myself to think too much.\nLook back realized I'm not so...\n\nFucked up, ditched out, failed, won, who cares?\nAte, drank, puked, shat, brushed, washed,\nDressed, worked, played, so what?\nI've got the rest of my life to do what they want me to do.\nNow I'll only have one set rule.\nDon't let another summer pass me by.\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "American Penis", "href": "American_Penis&&7171", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "I don't wanna go to the show tonight\nBecause its probably filled with punks and skins\nWho hate my band but still decided to go.\n\nI don't wanna go to the show tonight\nBecause my girl is gonna be upset that I can't spend any time with her alone.\n\nBut will things change if we sign our lives away?\nI'll never have to work a day in your GAP society\n\nWhat will we be if this gets bigger than iced coffee\nWill we ignore the kids we meet?\nFor starters ask the question what we planned to seek\nWhen we practiced on Pine Street Nobody knows.\n\nI don't wanna go to the show tonight\nBecause my voice is gone I can't hit a note we played for an hour yesterday.\nI don't wanna go to the show tonight\nBecause my parents will say \"You got home too late, did you get paid?\"\n'Cause they don't understand me or the reason I play.\n\nBut will we change if we sign our lives away?\nI'll never have to work a day in your GAP society\n\nWhat will we be if this gets bigger than iced coffee\nAnd you don't wanna know me mediocre\nUs getting played on your MTV\nHow come we practiced on Pine St. Nobody knows\n\nI don't wanna go to the dance today.\nThe rectum of society.\nGonna fuck the fucking world away tonight!\nDon't like me 'cause my hair is green.\nWhy should I talk to you anyway?\nYou talk more shit what can I say?\nI'll tear your fucking world down tonight! tonight!\n\nI don't wanna go to the dance today.\nThe rectum of society.\nGonna fuck the fucking world away tonight!\nDon't like me 'cause my hair is green.\nWhy should I talk to you anyway?\nYou talk more shit what can I say?\nI'll tear your fucking world down tonight! 234\n\nI don't wanna be your friend, oh no.\n'Cause you go around just spewing shit about everyone else,\nAnd you and your whole kind can go to hell.\n\nI don't wanna be your friend, oh no.\n'Cause you're just a stupid bitch who no one likes.\nNot even worth me making this whole verse rhyme\n\nWhat can I say?\nFUCK IT! Sign my soul away!\nI'll never have to work a day\nIn your pretentious and sickening society\n\nI'm a fake, not what you made me out to be.\nSo go home with a disappointed look on your face\nAnd just go stomp with your feet\nJohn lives on Pine St. Now you all know\nNo no no no no no\nYes\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "Fuck You", "href": "Fuck_You&&5608", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "I remember the days I used to laugh and play.\nMy friends were mostly girls and I got good grades.\nThat was a time I could look back on proudly and say \"Hey, that's me\"\nBut now the future pummels me with uncertainty.\nSuccess I'll never grasp\nA love I'll never find or notice\nMaybe this is just a test\nSuccess I'll never grasp, won't obey the status quo\nAm I cynical, political or mental? I don't know.\nIn my head I've got all the explanations that I need\nThat not a motherfucker in the world would believe.\nAnd I fail. Remarks misheard callously.\nThe notes we passed in class never had an effect on me.\nYou win. You've beat me at my own game.\nBut you're not gonna be there when I've won.\nI'm sure I'm not as bad as I think, but I feel like I've done nothing\nAnd now I'm at the brink of zero\nAnd I ain't got no souvenirs\nFrom the last few years that could fucking show.\nThat I've attained some form of success\nA love I'll never find or notice\nHow much of this makes any sense\nSellout now or I'm never gonna win\nWho needs to give a motherfucking shit about my fucking friends?\nThe hand on the clock reaches my end\nBop Bada Bop\nIt's not me.\nI know that I made you see the directionless slacker I made myself out to be\nWell you, win. It doesn't matter\nI'm not gonna be there when you're gone\nI don't need your advice and I don't need your help.\nWhy am I so lonely if I still have myself?\nWhy should I care if I don't have a chick\nTo take all of my ca$h and hurt me till I'm sick?\nIt all makes such sense, it's all loud and clear\nI may have had a bad week, a bad month, a bad year but the future's there\nAnd all I've got to do is concentrate on what I want.\nAnd if you oppose me, fuck you.\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "This Song Has No Effect On You", "href": "This_Song_Has_No_Effect_On_You&&8381", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "I wanna take our minds and meld them into one.\nI wanna play your games but you're not any fun.\nI wanna find your soul so I can figure out\nWhat you and me ever were (talking) about.\nI wanna meet some girl who doesn't speak in dialects\nThat everybody but me understands.\nBut my anti-flamboyancy makes my buoyancy decrease\nSo I am gonna drown before I hit the land. (whoa yeah)\nIt used to be like we could talk all night and day.\nBut now you have strayed far away from me.\nWe could talk together **** and yell in peace.\nBut I didn't buy you out, you were just a lease.\nI've had you on my mind all night.\nYou mean so much to me.\nWell I guess that once I let go giving up will come more easily.\nRefill on my coffee, another sleepless night.\nNot knowing who is wrong, but I know I'm not right.\nMade some bad decisions, I had good intentions to keep.\nBut if I keep on crying, maybe I'll cry myself to sleep.\nI've heard a lot of condescending understatements from your gender\nLong before you were around.\nOf course you're not the one for me right now 'cause you're not here for me\nBut I call anyway to hear your voice sound (whoa yeah)\nI gotta give up find myself.\nI gotta give up by myself.\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "Everything but the Pizza", "href": "Everything_But_The_Pizza&&3054", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "What would you say if I threw this whole damn life away?\nWhat would you do? You'd get pissed like I owe something to you.\nI just want to get in my car\nAnd drive away to somewhere very far\nWhere a beautiful world's not blocked out by billboards.\n'Cause everyday it looks the same\nIt ticks the piss right out of me\nIt seems that everyday you're walking away, nothing to say.\nIt's like every time I stub my toe before the starting line.\nWhat does this mean? Fuck this world, let's forget everything!\nI walked for half a mile in the cold\nJust to find some place to be alone\nAnd what do I get? A bunch of pollution\nAnd everyday it's all the same\nIt ticks the piss right out of me\nIt seems that everyday you're walking away with a smile on your face.\nSo I'll take the problems on my head.\nI'll take the blame and save your ass.\nKick me when I make mistakes\nBecause you really are the best.\nSo you can use me if you care, that funny kid with funny hair.\nAnd show me off to all your friends any time and anywhere.\nI'll still be left with empty feelings 'cause they never go away.\nAnd I fuck up everyday.\nI try.\nI'm just wrong?\nYou're the one that's wrong.\n'Cause everybody makes mistakes\nDon't take your problems out on me\nI can't apologize, I'm walking away, nothing to say.\nAnd everyday it's all the same\nIt ticks the piss right out of me\nIt seems that everyday you're walking away, calling me gay.\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "Have Fun Rotting By Yourself", "href": "Have_Fun_Rotting_By_Yourself&&4566", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "I'm taking the last train home tonight\nI'm drinking but I can't get drunker than this\nI'm going home alone again with a checklist of my ex-best friends\nAnd a headache the size of your little white lies\nBlood dripping from my head into sore black eyes\nPlace my head between my hood and the vent\nWalk home from the station\nNo friends\n\nKilling time by killing myself slowly\nDrugs and booze and tobacco companies own me\nYou said you never meant any harm\nBut you meant what you did\nNow I'm hurt and you're alarmed\nI'm a replaceable fixture in your house\nI'm a dispensable character from your past\nAnd I'm not feeling safe, come on pick up the fucking phone\nI can't accept when this night ends I'm going home alone\n\nI'm running far away from my problems (it's me vs. them)\nI'm not waiting for you to decide what to pack (it's me vs. them)\nI'm not talking California\nThere's never been a better time to get out of America (it's me vs. them, it's me vs. them)\n\nI'm running far away from my problems (I will give my last so long suckers, as you write down good byes)\nI'm not waiting for you to decide what to pack (on the back of old post-its as I exit and die)\nI'm not talking California (accept the fact that you will not be seeing me again)\nThere's never been a better time to get out of America (no more white flags I swear this time we're never gonna talk again)\n\nI'm running far away from my problems\nI'm not waiting for you to decide what to pack (it's me vs. them, it's me vs. them)\nI'm not talking California\nThere's never been a better time to get out of America (it's me vs. them, it's me vs. them)\n\nI'm running far away from my problems\nI'm not waiting for you to decide what to pack (it's me vs. them, it's me vs. them)\nI'm not talking California\nThere's never been a better time to get out of America (it's me vs. them, it's me vs. them)\n\nBecause it's me vs. them\n\n", "album": {"title": "Three_Cheers_For_Disappointment_(2006)&&1001", "genre": "Ska", "year": 2006}}, {"title": "Rocket Rocket Rocketship", "href": "Rocket_Rocket_Rocketship&&8639", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "Exhausted all the things I love\nI torture myself, can I just be happy\nWhen everybody jumps on everything I said\nAnd everybody's telling that me we're best friends\nI'd rather be dead or dying\n\nSo someone cut me a check (let me out now)\nCashed for all that I'm worth (let me out now)\nDivide by what I spent\nAnd calculate my net worth\nI never got nothing for anything\nI feel I've done everything for nothing\n\nAnd maybe we can fly away from here\nSurf on the debris of our broken scene\nSub suburban wasteland\nPack up everything and get out of here\nEverything I fight for is dead to me\nSome suburban wasteland\n\nYou were wrong\nI'll buy the farm tonight\nI'd like to spend time where no one can see me\nAnd I'm pissing down the cracks your broken dreams\nUnited we can change our whole destiny\nCome on, nobody's with me\n\nJust send me off with a check (let me out now)\nCashed for all that I'm worth (let me out now)\nAnd I'd say I feel better\nBut I really feel worth worse\nI never feel like feeling anything\nI only feel anything for nothing\n\nAnd maybe we can fly away from here\nSurf on the debris of a broken scene\nSub suburban waste\nPack up everything and get out of here\nEverything I fight for is dead to me\nSome suburban wasteland\n\nGo, go\n\nAnd maybe we can fly away from here\nSurf on the debris of a broken scene\nPack up everything and get out of here\nEverything I fight for is dead to me\nSome suburban wasteland\n\nAnd maybe we can fly away from here\nSurf on the debris of a broken scene\nSome suburban waste\nPack up everything and get out of here\nEverything I fight for is dead to me\nSome suburban wasteland\n\nWe're breaking down while breaking in (repeat)\n\n", "album": {"title": "Three_Cheers_For_Disappointment_(2006)&&1001", "genre": "Ska", "year": 2006}}, {"title": "November Rain", "href": "November_Rain&&8573", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "It seems we've made no progress within the last 12 years\nBecause deadlines and tests and fucked up kids\nHave transformed high school into a house of fears.\nAnd if the budget keeps blocking sunlight we can't help these growing trees.\nAnd I doubt that the integral of blah blah blah is what I fucking need.\nSo I'll take my pencil, break it on my head.\nThere's no use in knowing how long Calvin Coolidge's been dead\nIf you're not getting real education go complain\nBecause we deserve all that we want.\nTerm papers declare them useless, I'll get them off the net.\nI don't remember a single thing my 8th grade teachers said\nExcept the propagandist dittos they told me to read.\nSuch a paucity of free thought. I must believe what they believe.\nSo I'll take those dittos and burn them till they're dead.\nHooray for Operation Desert Storm is what they said.\nOn my Brit Lit quizzes I just guessed. I'll believe everything I want.\nIn school they constantly reminded me\nThat I wasn't smart enough and that I wasn't cool.\nIn school they rarely tell you there's more to life than school.\nWell I learned how to add and anti-differentiate.\nWell I learned the formula for Sodium Benzoate.\nWell I learned the 1 chord to the 5 is a half cadence.\nI learned how to ask how to piss in English and Spanish.\nWe have to take some time to just forget about our classes.\nSeize the day it doesn't matter if we fall on our asses.\n'Cause you'll learn that g=9.8 and w=mg\nBut I rarely get a thing from class that helps me become me.\nSo raise your hand high, say what you wanna say.\nAnd if they condemn and fail you you will still be ok.\nJust be yourself and succeed anyway.\nI'm afraid of not doing what I want.\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "Last On My List", "href": "Last_On_My_List&&6767", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "I wish I could be mad and break something\nI wish they took me instead, you were nothing\nShort of all the things I'll never be\nYou would never be bitter like me\n\nYou solved my problems like it was your job\nI never thought that one day you'd be gone\nOr I'd tell you how much late night talks\nReally did mean everything to me\n\nBad times for everyone today\n\nI only wish this could be your hand across the page\nAnd I only wish this could be a song for you sing\nAnd I only wish that it was me in the car that day\nAnd I only wish that I said goodbye before you went away\n\nThen you could tell me how to get through these days\n\nMiniature golf cannot be played\nOnce the seasons change and end this summer holiday\nI knew the sun would shine again\nI didn't know that this one was your last\n\nThe summer started off me pacing in a room\nFeeling comfort only seconds long\nHoping passersby were you\nNot-so-distant memories\nI cried that night 'cause they took you too soon\n\nHard times for everyone today\n\nI only wish this could be your hand across the page\nAnd I only wish this could be a song for you sing\nAnd I only wish that it was me in the car that day\nAnd I only wish that I said goodbye before you went away\n\nLike everybody else\nI have my own shit list, and\nI want to you to know that\nYou were at the bottom of it\n\nLittle technicalities and\nIndescribabilities and\nI can put my finger on it\nNow I'm in this fucking van\n5000 things I won't forget\n\nYour face\nMove on\nAgain\nGoodbye\n\nHow I long to share eternal life with you, and (repeated)\n\nI only wish this could be your hand across the page\nAnd I only wish this could be a song for you sing\nAnd I only wish that it was me in the car that day\nAnd I only wish that I said goodbye before you went away\n\nThen you could tell me how ...\nTo get through these days\n\nIf we had just another day\nWe'd have a ball instead of pissing it all away\nThree cheers for all those summer days\nHey hey yeah\n\n", "album": {"title": "Three_Cheers_For_Disappointment_(2006)&&1001", "genre": "Ska", "year": 2006}}, {"title": "Melon Country", "href": "Melon_Country&&4171", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "Well its OK to want, but its less OK to need\n'Cause I started to get greedy,\nThat's the last thing I would need (great rhyme)\nGetting comfortable with all my friends, finding no need to explore\nAnd now I wanna get away from life ('cause I'm so fucking bored)\nDid you ever get the feeling your trying put out the sun\nWith nothing but a pink and plastic broken water gun\nYeah, trying to extinguish all the angst that I don't need inside\nI wanna get away from life and do something before I die.\nIt's so monotonous.\nThe daily grind:\nI get up, go to school or work instead,\nMaybe hang out with my friends, then bed.\nTime I spend has become frivolous\nWriting songs that no one understands\nBut plenty will feel obliged to berate.\nSo one day I went nuts.\nI don't remember exactly how it happened but now my mind doesn't like me\nSeeking therapy never was the way for me\nI've gotten dumped and bounced right back,\nThe music was supposed to be a haven.\nYeah, but now I wonder was it just a waste of time.\nI could institute my whole mind with vim and vigor seeking a future.\nWhen I figure it I'll create a flux capacitator and travel back in time.\nI wanna say goodbye,\nBut my empty closet bookshelf mind finds it so hard to leave behind\n--What I think I wanna do.\n--A guitar.\n--A case of rancid flu.\n--A burnt up photograph of you. (soon I will be leaving too)\nIt never made much sense to me to celebrate the rain\nThe odds are stacked against us.\nIt may help but there's still pain.\nSo as I sit in the cold and wet writing waiting for a sign\nMy eyes light up with a ray of hope\nShe'll never again get to be mine.\nI died inside when you did this to me.\nI died and I thought that you would help me.\nThere's a fire inside when I say this to you.\nYou're not mine anymore.\n(Well it's funny how it all works out this time, isn't it you heartless bitch?\nAnd don't think I really care if you give me a phone call anymore or even talk to me\n'Cause if you give me some meaningless obligatory pity based friendship\nThat doesn't really mean anything just like your life and mine\nYou're the only one who's gunna have ??? regrets tomorrow fucking morning ???)\nYou lost your chance with selfishness\nAnd it all comes back to the same problem.\nI am lonely, but don't want you.\nSomeday you'll feel this too.\nYour problems I can't solve them.\nI'll be gone with a damp piece of paper reading your address.\nMaybe I'll write you someday.\nI thought I'd call but the mechanisms won't let me submit.\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "Pete Is Murder", "href": "Pete_Is_Murder&&4602", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "Eh... no thanks\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "15 Stitches and a Headache", "href": "15_Stitches_And_A_Headache&&2165", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "I remember a math teacher I had in 7th grade,\nHe talked down to me about every single day.\nAnd to make the matters worse, the bastard failed me too\nSo for the first time in my life I raised my fist and said \"Fuck you\".\nThat was the me that I thought that I was going to become.\nI made no mistakes and I made sure everything got done\nBy me and no one else but now I just let others decide.\nI've become so indolent should I just go run and hide.\nHow come every song I write has some ska breakdown.\nAnd why do I care if my styles change?\nHow come it feels like everybody is talking about me behind my back again like my old friends?\nAnd when is this gonna transcend?\nComfortable mediocrity-- look at our mediocre scene.\nWho cares? I've got no confidence of self esteem.\nIs this what we want it to be? A mediocre scene\nWhere you're skapunkemohardcore or you're not cool enough? Suck me.\nI used to say \"Hey, you can't talk to me like that\"\nAnd I used to be short and I used to be fat.\nI remember when the skater kids used to pick on me,\nBut I don't care now 'cause I have your money.\nBut I remember saying that I'd show them who's the man.\nThey'd try to get on my good side so I could book their band.\nAnd I'd say \"no\" but now I just don't care cause grudges hurt the scene.\nWhat's the difference between keeping your spine and just being mean?\nI feel like it was not my fault to have this label.\nBut we knew where we were heading from the start.\nI can still voice my beliefs so listen hard damn well to me.\nMusic segregation's shit. Tear borded lines apart.\nLet's focus on what I call we. \"We're so ruling the scene.\nI played with Edna's and Dan Deacon's friends with me.\"\nI'm not saying its trendy, but where's the variety.\n\"You're skapunkemohardcore or you're not cool enough for me.\"\nIf you see Adam Geller never ever shake his hand,\nJust kick him in the ass. He isn't in the band.\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "Kill Your Cats", "href": "Kill_Your_Cats&&6367", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "I'm not your \"friend\".\nI'm not your \"pal\".\nI don't care very well for your misconception of what friendship should be.\nSo when I see you in the mall\nDon't talk to me at all.\nCause this is all that you deserve from me.\nA 30-Second song where I almost didn't say fuck.\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "The Last Bell I Will Ever Hear", "href": "The_Last_Bell_I_Will_Ever_Hear&&3223", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "Well I lied\nI lied to you again\nI said I wanted to be friends\nI said that it would never end\nBut I was out before it began\nI bit my nails and rode away\nI have been waiting for the day\nThat it was the end\n\nThe clouds\nGrey covering the sky\nBarely let the sun slip by\nAt about 2:05\nEveryone was starting to cry\nThere's nothing that needs more explaining\nYou can't run my fucking life anymore\n\nI'm going home tonight\nTo tear your pictures off the wall\nAnd I won't spend another night\nWaiting for your precious telephone call\nI won't be sorry\nFor anything I do\nBecause I live this life for me not you\nDon't think that I'm gonna call you tomorrow\nTo remember the days gone past\n5 4 3 2 1 it's over\nAnd you can kiss my ass\nAnd if I never see you again that'll be too soon\n\n", "album": {"title": "Three_Cheers_For_Disappointment_(2006)&&1001", "genre": "Ska", "year": 2006}}, {"title": "Piss Off", "href": "Piss_Off&&8150", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "P-i-s-s-o-f-f hey\n\nI remember way back when, when I wanted you to be mine\nAnd now that I kinda had you I wonder was it all a waste of time and did it\nMake sense jumping into something knowing that I'd get hurt\nI don't know but my boss thinks not it makes me less productive at work\n\nAnd all my friends told me look out, cause you were treating me like (shit)\nI swallowed my pride, and bit my tongue and tried to just deal with it\nI blame the whatevership's termination on why things are never fine\nI dreaded this moment from the day that we met, we have to say goodbye\n\nNow all I do is drink and smoke with all my friends\nI regret not moving on even though I said I did, yeah blah blah\nHow many times do I have to call you just because you called me first, you see\nWe're nothing together but a bunch of obligations, that just make me feel worse\n\nAnd why was I the last to know you were riding some other guy\nAnd why should I have even cared that night you said you cried\nWell my stomach threw up my daily nutrition and your anti morals robbed me blind\nI loved you and you blew it and you broke your own heart\nSo eat this last goodbye\n\nAnd all that money we blew on each other\nDid it mean so little that you could just find another\nTo replace me, whatever I mean, piss off, go to hell\nWhen can I get over this, stop hating myself\n\nAnd as the days go on I'll find someone better\nI'll go it alone and brave the cold weather\nThrough the blizzard like conditions screaming if I'm still alive\nPiss off, this is the last goodbye\n\nThis is the last goodbye (repeat)\n\n", "album": {"title": "Three_Cheers_For_Disappointment_(2006)&&1001", "genre": "Ska", "year": 2006}}, {"title": "I Just Wanna Have Sex With You", "href": "I_Just_Wanna_Have_Sex_With_You&&2646", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "I don't like the way you cook\nI just like the way you look\nAll you do is bother me\nBut I really want your body\nI don't know what I wanna do\nI just wanna have sex with you! Whoa-oh-oh-oh-oh!\n\nI don't like the way you cook\nI just like the way you look\nYour beliefs really hurt my head\nBut all I think about is getting you in bed.\nI don't know what I wanna do\nI just wanna have sex with you! Whoa-oh-oh-oh-oh!\nWhoa-oh-oh-oh-oh!\nHey hey hey\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "Yeah, I Don't Know What It's Like To Be Around A Bunch Of Hipsters", "href": "Yeah,_I_Don%27t_Know_What_It%27s_Like_To_Be_Around_A_Bunch_Of_Hipsters&&7697", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "Hey again\nI hope you know you ruined my life\nThe bitterest words are never quite sincere\nBut I gotta tell you one thing\nIt's all the same to me\nIts in my blood\nAnd you don't feel the flow\n\nI sat there\nAbsorbing the ever present real world\nWondering why people have to change all the time\nAnd about those who shift with the trends\n\nWell we both know I know better than to point the blame at somebody else\nBut myself\nSo I'll put these words on the shelf\nWith pictures of old friends\n\nI can sit and ask myself what I'm doing wrong\nBut I'm right this time\nThese are my convictions, you're tearing down\nI won't give up even though it's all anyone in this world thinks we're good for now\nHe's not with us anymore\n\nI sat there feeling frustrated\nThe autumn sky was rapidly turning to dusk\nAnd I'm feeling so fucking alone in this world\n\nYou won't believe me when I tell you\nBut everything that I respect is absent in you\nSo go shut me out and shut up\nAs this scene rages on\n\nI can't decide what to do with people like you\nI can't take it on the chin\nCause these are my convictions that you're tearing down\nI won't give up even though it's all anyone in this world thinks we're good for now\nHe's not with us anymore\nI'm not changing for the world\n\nThere's a time to let it go\nWhen it comes I'll let you know, yeah\n\nI'll take this mental anguish fist thrown at my head\nBecause I'm right this time, yeah (this time)\nYeah I'm right this time, oh yeah (this time)\nI'm so right this time\nThese are my convictions that you're tearing down\nI won't give up even though it's all anyone in this world thinks we're good for now\nShe's not with us anymore\nI'm not changing for the world\n\nI'm not changing for your world\nOh yeah, as we go (go, go, go, go)\nFists first into the world\nYour concrete morals mold life's prison cells\nAnd with fashion as warden\nYou are prisoners in hell in your world\nRot in hell in your world\nI'm not changing for the world\n\n", "album": {"title": "Three_Cheers_For_Disappointment_(2006)&&1001", "genre": "Ska", "year": 2006}}, {"title": "Disappointment At The Taco Bell", "href": "Disappointment_At_The_Taco_Bell&&6135", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "The clock is ticking and my shelf life is up\nThe clock is ticking and my shelf life is up\nThe clock is ticking and my shelf life is up\n\nWrong side of the tracks, wrong side of the fence\nWrong thing that I lack, I lack the common sense\nMy life\nAnd this is all I know\nAnd I've got no time\nI've got no mind\nI've got nowhere to go\n\nCan't live in your world of the 9, 9 to 5\nYou'll get your 15 minutes and I've got my whole life\nMy life\nAnd this is all I know\nAnd I've got no time\nI've got no mind\nI've got nowhere to go\n\nCareer tests all came back inconclusive\nAll that I can give is a half assed attempt\nAt being like you, I'm not normal like you\nNothing I can say, I haven't said 5,000 times\n'Cause you've got your way to live and I've got mine\nThere's nothing to say, I've said it 15,000 times\nKiss it goodnight, kiss me goodbye\n\nYou think it never hurt, all the con, confusion\nAll the itches in my nerves, all the hate in my blood\nMy blood\nThis isn't what I need\nOccupational conformity won't put my mind at ease, so\n\nThe clock is ticking and my shelf life is up\nAnd all bets have been placed for when the wheel's gonna stop\nSo stop\nCause this what I need\nThis is life\nAnd this is love\nAnd this is my release (yeah)\n\nPains my soul to separate like this\nI guess that's how it is, I'll leave myself to mine\nOur paths can't cross now, I wish I had one more chance now\n\nNothing I can say that I haven't said 5,000 times\nYou've got your way to live and I've got mine\nThere's nothing to say, I've said it 15,000 times\nKiss it goodnight, kiss me goodbye\n\nIt's been a year or two since we've communicated\nSo don't tell me you're one for me to trust or believe in\nI believe nothing, I will not trust anyone again\nAnyone again\n\nI've said it 15,000 times\n\nMy brain keeps spinning and I still can't give up\nI've run far off the course, I guess I'm never gonna stop\nThis clock's keeps ticking, sorry I got no more shelf life for ya baby\nTime bomb's ticking, I'll commence blowing up\nI'll construe your rejection as a lack of trust\n\nYou won't love me\nOnce I'm washed up\nI'm all washed up, yeah\nAnd I can't trust no one\n\nThere's nothing I can say, I haven't said 5,000 times\nYou've got your way to live and I've got mine (yeah, yeah, I've got mine, yeah)\nThere's nothing to say, I've said it 15,000 times\nKiss it goodnight, kiss me goodbye\nKiss it goodnight, kiss me goodbye\nI've said it 15,000 times\n\n", "album": {"title": "Three_Cheers_For_Disappointment_(2006)&&1001", "genre": "Ska", "year": 2006}}, {"title": "Better Off Dead", "href": "Better_Off_Dead&&8214", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "Get up.\nGet dressed.\nGo to school.\nGo home.\nJerk off.\nGo to sleep.\nDo it all again.\nGet up.\nGo to work.\nSmoke a butt.\nGo home.\nJerk off.\nGo to sleep.\nThat's my fucking routine.\nGo out to the pawn shop.\nSell your soul, buy a gun.\nTake it home, say goodbye.\nPoint it at your head.\nWhoever said life wasn't easy was right\nFuck living, you might as well be dead.\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "So Let's Go Nowhere", "href": "So_Let%27s_Go_Nowhere&&3939", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "Heh, heh, heh, heh, heh, heh, ha ha ha ha\nHeh, heh, heh, heh, heh, heh, ha ha ha ha\n\nThe autumn came in like concrete at my face\nLocation hasn't changed but I'm not living in the\nSame place\n\nIt's useless to respond respond to\nAnything I've said I've said\nI hate to quote this song all wrong but\nWhy can't we still be friends\n\nAiming to upset me but you're baffling me with your actions\nI am wrong, you are wrong, we subdivide into two fractions\nIt's made me retarded, I wish I didn't let it\nEverything is upside down\nI want those times I can't forget\n\nEverything is always falling apart\nEverything is always falling apart\nYou know I'd amputate my flaws if it meant that I could be with you\n\nHeh, heh, heh, heh, heh, heh, ha ha ha ha\nHeh, heh, heh, heh, heh, heh, ha ha ha ha\n\nHow can I be so self important in the world today\nMy disease of choice will be arriving soon anyway\nWe justify our selfishness in every fucking fight\nAnd I hate to quote this song all wrong but it doesn't make it right\n\nFuck the world\nEverything is breaking and changing and\nEverything inside of me is breaking and changing\nWhy can't I ever let it go\nI concentrate real hard I\nMight not ever even know that\n\nEverything is always falling apart\nEverything is always falling apart\nI'd ignore my dreams in exchange for you being true\n\nIt's going to rain tonight\nSo everything is miserable\nSmoke some more and then I'll go back in and hate\n\nIt's going to rain tonight but it's got to stop eventually\nLet's anticipate the sun and warmth and raise our fists and say\n\nEverything is always falling apart, but I can't\nEverything is always falling apart, but I can't\nEverything is always falling apart (repeat)\n\nFell fast\nAsleep\nWoke up\nSo easily\nLet's make\nOur dreams\nTranscend\nReality\nLet's not\nJust seethe\nGive up\nAnd go back to sleep\nWake up\nDon't fall apart\n\n", "album": {"title": "Three_Cheers_For_Disappointment_(2006)&&1001", "genre": "Ska", "year": 2006}}, {"title": "Pornocracy", "href": "Pornocracy&&1337", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "Pornocracy, government run by whores\nWe never ask what the fuck we do this for.\nWe only have one party, democracy is just a front\nThey say they care about our country. All they care about is cunt.\nA 6th of my paycheck it belongs to me,\nThe rest is what's given to my greedy landlord and government.\nAnd all of that money goes to hurtful programs\nLike social security and nuclear weapons. Justify my right to die.\nWe turn our heads try to scream try to shout,\nGive the lower class power make the middle class count,\n'Cause they're not not not gonna take that away from me.\nNot not not gonna take that away\nThey say they care about our country,\nAll they care about is cunt.\nWe've all done little of any worth\nMake our oceans cleaner maybe save the earth.\nCreate a less harmful fuel available to all nations.\nKill our race or the local gas station.\nDistribution education budget based on who needs the most help,\nDon't cripple minorities by basing it on wealth.\nWhen you're young dumb and poor, you have no voice.\n\" Would you like fries?\" is your freedom of choice.\nAmerica's burning, we're just burning, watch us burn and watch us fall.\nNuclear war. Holding back more. What's it all for? What's it all for?\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "Got Filk?", "href": "Got_Filk%3F&&7598", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "A love story's what you're about to hear\nIt's about a girl who wasn't sincere yeah\nI asked her out and she didn't refuse but everyday it was a new excuse\nI was confused didn't know what to do\nEverywhere I looked no one to turn to lies mistrust and all that shit\nShe left me vulnerable and in pain\nI know it's sad but my life's a shame\nSimple and complex\nIt always stays the same.\nSex no love and no passion just pleasure won't make me deal\nAlways playing with my head to think I thought you were really disturbed\nThat late at night my friend Dave needs help from you\nSeven simple numbers 8 6 7 4 6 8 2\nI wish I could fucking learn to fucking walk\nOr fucking run or fucking drive a car\nOr fucking play guitar or fucking sing\nAnd fucking dance and be a fucking star\nMaybe then you'd see that I don't need you on my knob\nBack off step off die\nI try and tell me you've hurt me for the last time you little whore\nAnd a half only thinking about yourself\nBut now that I'm fading out isn't it funny how there's no one else\nThanks for telling me you cared\nAll my common sense was gone\nIf you make me so damn mad why can't I keep my pants on\nMaybe this is just a trick\nWait that's you yeah I forgot\nGo to hell and suck my dick\nScratch that last part better not.\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "Meatheads Attack Spencer At 9", "href": "Meatheads_Attack_Spencer_At_9&&5259", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "Seems that every time I wanna have a good time\nYou and your wife beater wanna ruin it for me.\nWhether I'm at the diner, at the beach, or at a party,\nBowling, playing pool, or rockin' out to Silent Majority.\nYou're tough, superb, can you take me or can you not?\nYou probably could so call off your crew and handle it for yourself.\nBut you won't, 'cause you're a bitch. Another 5-on-1 pin.\nNike wearing lowlife, selling out to the hardguy trends.\nAnd what are you when you become another symbol of what seems to\nBe an authority over the kids\nYou do the things that you hate when its done by the \"pigs\"\nOne day your system will collapse\nAnd we will laugh when a geek puts you in a body cast.\nAnd I'm afraid to use proper nouns in this song\nBecause I'm sure that you and your crew will come and beat me up at once.\nI swear I'll do what I want and don't you disrespect\nOr call me faggot, queer or queen or else I'll write another song.\nAren't Saturday nights meant for you drinking in some alley\nNot getting shitfaced at some party ruining all of my friends fun?\nJust another bitch who next millennium will cry\nWhen he opens up his eyes and is being beaten by a prison guard.\nAnd what are you when you become another symbol of what seems to\nBe an authority over the kids\nYou do the things that you hate when its done by the \"pigs\"\nOne day your system will collapse\nAnd we will laugh when a fag knocks you on your fucking ass.\nThrow the first punch, throw the last\nThrow an empty bottle at the past\nWhatever happened to unity?\n(Its absent in reality) Drunken-- a stagger in the dark.\nThe night was so much fun.\nWhen a cellmate rapes your ass\nWe'll see who's having fun\nDrunken--another night alone.\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}, {"title": "People Pops & Fudgesicles For The Shit Factory", "href": "People_Pops_%26_Fudgesicles_For_The_Shit_Factory&&67", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "I'm sorry that you've all gone soft\nAdvance apologies required now for pissing you off\nI'll deny all of this to your face\n\nQuit claiming to be indie rock\nBecause you aren't independent\nAnd your rock and rolls fucked\nI'll get the coffin\nYou supply your own hammer\n\nAnd we'll put a nail in it\nI hope the scene can fit\nAnd we'll throw it in the pit\nAs a sacrifice for middle-aged men\nAnd screaming girls\n\nYour scene is full of shit\nSo start killing it\nDon't be the hypocrite\nThe last teary eyed thrift store mope star in the world\n\nA victim of the latest hoax\nThe iconoclasts have lied and you're not in on the joke\nProve they're not what they claim to be\nYour money they're gonna get your money\n\nCriticize all that I've said\n'Cause if I wasn't so pretentious I'd cash in on the trend\nDo lines, double fist pills and o.d.\n\nStop singing it\nStop singing it\nYou're too serious\nHow can you crack a smile if you can't laugh at yourself\n\nYou think you're legit\nBut you're just the idiot\nHere's how to deal with it\nBring the asshole and the douche bag level down\n\nAnd I'm not a part of your scene\nWhere fashion meets choreography\nYour haircut is stupid\nYour pants are uncomfortable\nYou systematically plan every awkward forced guitar spin\nYour emotion is a joke\nYour emotion is a joke\nYour emotion is b-u-l-l fucking shit\n\nAll ... your ... favorite ... bands ... do ... coke ... sorry\n\nStop singing it\nStop singing it\nYou're too serious\nHow can you crack a smile if you can't laugh at yourself\n\nYou think you're legit\nBut you're just the idiot\nHere's how to deal with it\nBring the asshole and the douche bag level down\n\nStop singing that shit\nWe're tired of it\nStart killing it\nStart killing and kick the baggage and ego to the ground\n\nStop singing that shit\nWe're tired of it\nStart killing it so\nStart killing so I can kick the rotting carcass of your sound\n\n", "album": {"title": "Three_Cheers_For_Disappointment_(2006)&&1001", "genre": "Ska", "year": 2006}}, {"title": "Go Ska!", "href": "Go_Ska!&&4034", "artist": {"unique_name": "The_Arrogant_Sons_Of_Bitches"}, "lyrics": "Pick it up, pick it up\nPick it up, pick it up, pick it up, pick it up and give me a pizza\nGive me a, give me a steak\nYeah, that's what I meant to say, that must be it\n\nI heard a rumor and it's hard to ignore\nEverybody is saying punk's not cool anymore\nSo I called all my friends just to make sure\nThen I went down to the record store\nTook all my CDs of Rancid and traded them in for Inspecter 7\nShaved off my Mohawk, I got a bald head\nGot a tattoo that says \"I'm gonna skank till I'm dead\".\n\nNobody likes the punks these days\nLet's go ska we can start today!\nI wanna be cook in a Rastafarian way\nLet's go ska, man we can start today!\n\nYeah\n\nHey what's the matter little bugger?\nI wanna learn how to skank!\nYou wanna learn how to skank?\nYeah\nGo ahead, try, pick it up\nOk ... Ow ... God damn it!\nOk, now you gotta get some checkerboard sneakers and suspenders\nPick it up, Pick it up, Pick it up\nThere ya go ... now you're ska-ing like a pro, Pick it up!\n\nPolitics Schmolitics, we can get some food\nAnd we can write songs about being rude\nI got a mohawk, a bad attitude, a checkerboard tie and a three-piece suit\nI'm glad that I found this sound\nAnd I hope there's cheap tattoo removal when this trend dies down\nI wanna be cool the Rastafarian way\nLet's go ska! hep hep hep hey!\n\n", "album": {"title": "Pornocracy_(2000)&&582", "genre": "Ska", "year": 2000}}]