[{"title": "Longfall", "href": "Longfall&&9145", "artist": {"unique_name": "The_Lost_Trailers"}, "lyrics": "The waves are settling down, and the sun has sunk into the sand\nAnd the only calm this city gives is living in these ocean sounds\nWell, it's not as bad as it could be, it's just not as good as I thought it would be\nYou'll find out what you miss most when you're out alone on the West Coast\nIn a longfall, yes, it's gonna be a longfall\n\nI'm not sure why I'm still here, when I left my life seemed so clear\nNow my dreams are heavy things that are muddied by reality\n'Cause I can't find good pay, and there's no game days on Saturdays\nYes, the only tailgates I see down are loading smack and crack cocaine\nFor a long haul, up the West Coast in this longfall\n\nMy girl loved the price of fame, I lost her when she changed her name\nHer face used to feel so soft, till her agent's doctor pulled it off\nShe got a new nose and cheekbones, and a bit part on a TV show\nBut a home can turn to a frozen place, when the one you love's got a stranger's face\nIt's a longfall, out in LA, It's a longfall. Still no rain, and I don't feel the same\n\nJust when I thought I'd head on back, I saw a black haired girl on the concrete path\nShe flung her hair back with her hands, between the setting sun and a coffee stand\nAnd in the fading light I could barely see, when she fired up a Winston and gave it to me\nShe said, \"You look like someone I know\";\nI said, \"I do, well, thanks for the care, cause it shows.\"\n\nIn this longfall, there's fine folks out on the West Coast\nIt's just a longfall, where there's no cold, and no one gets old\nIn this longfall, there's no rain, but I know Jane will change\nIn this longfall, yes, I know things have got to change\n\n", "album": {"title": "Welcome_To_The_Woods_(2004)&&5202", "genre": "Country", "year": 2004}}, {"title": "The Battery", "href": "The_Battery&&4970", "artist": {"unique_name": "The_Lost_Trailers"}, "lyrics": "I woke up on The Battery on a Charleston Friday night\nWith my dirt-stained Corduroys and Balances crumpled up by my side\nI said goodbye to my company, then I shook it on down the line\nSometimes I get a little lonely, and wish I hadn't left her behind\n\n'Cause every highway bears a bright sign, posted on the side of a roaring world\nAnd every passerby rolls back again, and in the end, you get what you're looking for\nSo just give me my good friends, And a good hearted woman\nJust give me some high times to fall back on\nSometimes I might need a cool drink and the good Lord to save me\nThen I will be found, then I will be found\n\nRan out of gas on the freeway, 'bout a quarter mile from Abilene\nThat Texas sun just-a hung in the sky, smiling on me\nA stranger stopped named Casey, said he's a friend of a friend of mine\nHe said, \"It shore is a small world.\" I said, \"It suits me just fine.\"\n\nWell they put me in a jail cell before a race in Bristol, Tennessee\nDon't you go to Sully County if you want to be free\nBut there are two ways you can take things, you can make them right or keep them wrong\nSo I kept my mouth closed and played Dominoes till the judge sent me home\n\nSo just give me my good friends\nAnd a good hearted woman\nJust give me some high times to fall back on\nSometimes I might need a strong drink\nAnd the good Lord to save me\nThen I will be found, I will be found\n\n", "album": {"title": "Welcome_To_The_Woods_(2004)&&5202", "genre": "Country", "year": 2004}}, {"title": "Fire On The Pontchartrain", "href": "Fire_On_The_Pontchartrain&&6786", "artist": {"unique_name": "The_Lost_Trailers"}, "lyrics": "The cocaine bag, and your lovers numbers\nFound in the bottom of our baby's crib\nI've never asked for what you have given\nAnd I can't take it for another day\nAnd if you say I've become a stranger\nIn this house that I built for you\nThen I would ask you to reconsider\nYour rendezvous out on Lake Pontchartrain\n\n\nI have been wronged and I have been mad\nI have planned violence in the face of love\nI tore the wires, and left them tattered\nI swear the both of you won't make it back, Hey, Hey\n\n\nI never knew why men would turn to violence\nThen I met you and it came all too clear\nThe whiskey, whining, and constant lying\nAnd the cheating in our very own bed\n\nSo cheating men and cheating women\nDon't deserve half of what they tore away\nJust a brief float in my old johnboat\nAnd blow them up upon the Pontchartrain\n\n\nFire on the Pontchartrain (Fire on the Pontchartrain\nI'll watch the rising flame, and make a toast\nThen I'll buy myself a brand new boat\nFire on the Pontchartrain (Fire on the Pontchartrain)\nFire on the Pontchartrain (Fire on the Pontchartrain)\nFire on the Pontchartrain (Fire on the Pontchartrain)\nFire on the Pontchartrain\n\n\nSuch a beautiful light, such a beautiful light\nSuch a beautiful life, such a beautiful life\nSuch a beautiful life\n\nThat night on the Pontchartrain\nI saw you leaving in the pouring rain\nTurned my head and I count to ten\nNow I want you back again, Such a beautiful life\n\n\nThat night on the Pontchartrain\nI saw you leaving in the pouring rain\nI turned my head and I count to ten\nBut I want you back again\nIt's a beautiful light... for such a beautiful lie\nIt was a beautiful light, such a beautiful lie\nSuch a beautiful life\n\n", "album": {"title": "Welcome_To_The_Woods_(2004)&&5202", "genre": "Country", "year": 2004}}, {"title": "Walking Blind", "href": "Walking_Blind&&3093", "artist": {"unique_name": "The_Lost_Trailers"}, "lyrics": "Tide keeps creeping, squeezing me to row.\nSad surrender of the summertime of my soul.\nWater will you wash me down and away.\nCarry me home, to the place where I need to lay.\nCarry you there and halfway here again.\nTrying to freeze-frame, when the second hand seems to spin.\nI wonder can you tell me how to keep on flowing to then from now.\n\nThere's a quiet and a rest,\nIt ain't that bad, but far from the best,\nAnd my dream keeps getting pulled away from me.\nAnd the time I wait will be my time to tell\nIf I'm walking blind or if I'm running well,\nAnd my dream keeps getting pulled away from me.\n\nRain crash harder, leave a ripple on my front page.\nFlood rise higher to drown out my age.\nWave break down over me; send me walking to where I need to be.\n\nThere's a quiet and a rest,\nIt ain't that bad, but far from the best,\nAnd my dream keeps getting pulled away from me.\nAnd the time I waste will be my time to tell\nIf I'm walking blind or if I'm running well,\nAnd my dream keeps getting pulled away from me.\n\n", "album": {"title": "Welcome_To_The_Woods_(2004)&&5202", "genre": "Country", "year": 2004}}, {"title": "I'm A Country Man", "href": "I%27m_A_Country_Man&&4262", "artist": {"unique_name": "The_Lost_Trailers"}, "lyrics": "I'm Country,\nYou can tell how I speak, I've lived by the creek.\nCotton fields and pickin' tress are my earliest memories.\nI'm Country,\nAin't scared to fight if one comes my way,\nBut I'm tryin' to see if I can be the man momma hoped to raise.\nEven Momma understands, I'm a country man.\n\nBorn to be, kickin it from Texas to Tennessee.\nGot the same truck since I was eighteen,\nGonna drive it till the wheels fall off.\nI'm country that's what I said,\nEarly to rise and late to bed.\nWhen I come home, I ain't alone.\nI rock it till the rooster crows.\nBaby you ought to know, I'm a country man.\n\nI'm reckless,\nI like shrimp and grits, and crazy chicks.\nI can't help but lick my lips,\nWhen she makes each grit with the flip of the wrist.\nI'm hungry,\nWhat I deserve is coming my way.\nI ain't to proud to work all day,\nCome home late for a roll in the hay.\nI'm holding the world in my hands.\n\nI'm a country man,\nBorn to be, kickin it from Texas to Tennessee.\nGot the same truck since I was eighteen,\nGonna drive it till the wheels fall off.\nI'm country that's what I said,\nEarly to rise and late to bed.\nWhen I come home, I ain't alone.\nI rock it till the rooster crows.\nBaby you ought to know, I'm a country man.\n\nI'm country that's what I said,\nEarly to rise and late to bed.\nWhen I come home, I ain't alone.\nI rock it till the rooster crows.\nBaby you ought to know, I'm a country man.\n\n", "album": {"title": "The_Lost_Trailers_(2006)&&7023", "genre": "Country", "year": 2006}}, {"title": "Why Me", "href": "Why_Me&&5311", "artist": {"unique_name": "The_Lost_Trailers"}, "lyrics": "Sometimes I go walking through the long tall grass\nWonder how long hard times will last\nFor this backward soul on a road that god knows where\nAs hard as I try ain't left no track\nIt's not enough to find my way back\nI hit the ground like broken glass and just lay there\n\nSinging why me, oh why me\nAnd I throw another empty bottle up against the wall\nAnd I say why me, oh why me\nBut pitty never ever did me any kinda good at all\nSo I walk on\n\nAnd I wound up on the capital steps\nWatching the lobbyists smoking cigarettes\nAnd bury their shoes in the country club blues\nAnd who got who by the short hairs\n\nStanding there in their high dollar suits\nLooking down at my tattered old jeans and boots\nAnd this weathered guitar that seems to follow me everywhere\nGod it follows me everywhere\n\nPlaying why me, oh why me\nAll I got's another song about how money makes and breaks the law\nAnd I sing why me, oh why me\nI'm just a broke troubadore with a bark for the underdog\nSo I walk on\n\nNow I ain't Jesus, but I can relate\nTo a man looking death square in the face\nEven he hit his knees with a plea in the garden of gethsemane\nTo his holy father he raised his eyes\nIn his darkest hours he cried\nPlease would you take this cup from me\n\nPraying why me, oh why me\nKnowing all the while he had to carry that cross and hang there\nWhen I say why me, oh me\nI know that somewhere up in heaven there's a big old book with my name there\nSo I walk on, I rock on\nEven when I'm singing, why me, I rock on\nEven when I'm singing, why me, I rock on\nEven when I'm singing, why me\n\n", "album": {"title": "The_Lost_Trailers_(2006)&&7023", "genre": "Country", "year": 2006}}, {"title": "Sitting On Top of The World", "href": "Sitting_On_Top_Of_The_World&&6318", "artist": {"unique_name": "The_Lost_Trailers"}, "lyrics": "Looking out on these back streets that you brought me,\nAll I see has been bought, kept for safety,\nTrade the rift of the change for the landing,\nSave the light for the few that's left standing.\n\n\nYou tried to tell me\nThese are the good times,\nGuess we'll find out\nDown the line, down the line\n\nWalking out used to be so easy\nClose the door while the light was still fading\nBut those times seem to fade into memories\nAnd bring us here while those streets are left sleeping\n\nIt's what we left behind.\nIt's what we found inside\nSo what is on your mind\nNow that we're wasted, and sitting on top of the world\nSitting on top of the world\nSitting on top of the world\nSitting on top of the world\nSitting on top of the world\n\n", "album": {"title": "Welcome_To_The_Woods_(2004)&&5202", "genre": "Country", "year": 2004}}, {"title": "Yellow Rose", "href": "Yellow_Rose&&9443", "artist": {"unique_name": "The_Lost_Trailers"}, "lyrics": "There's an old man standing by a pond\nSmiling like the world could do no wrong\nCool water runs against his toes\nAs he holds the petals of a yellow rose\n\nYears ago in Central Park\nHe and his woman disappeared in the dark\nAnd underneath the city's glow\nThey left the petals of a yellow rose\n\n\nSo would you be my, my yellow rose\nWould you stand beside me when the wild wind blows\nI'm only asking 'cause I, I'd like to know\nOh, would you be my Yellow Rose\n\n\nThey came in on a Jersey train\nHe took her hand and said, \"I love you Jane.\"\nShe saw the passing of a garden's row\nAnd said, \"I'd be yours if I had one of those.\"\n\nSo would you be my Yellow Rose\nWould you wake beside me in the morning glow\nI'm only asking 'cause I'd like to know\nWould you be my Yellow Rose\n\nThe water is still, and the woman is gone\nBut the old man ain't moving on\nCause there are moments when all you need\nIs a cool pond and a memory\n\n", "album": {"title": "Welcome_To_The_Woods_(2004)&&5202", "genre": "Country", "year": 2004}}, {"title": "Call Me Crazy", "href": "Call_Me_Crazy&&7289", "artist": {"unique_name": "The_Lost_Trailers"}, "lyrics": "All the lights are goin' down on Main Street. \nParkin' lots are fillin' up, \nWith teenage dreams an' pick-up trucks. \nThere's gonna be a race tonight: \nThat's where I'm gonna catch your eye. \nRight across that finish line is where I'll make you mine. \n\nAn' if it's crazy to think, maybe, \nAll you need is a love that's true, \nWell then, baby, you can call me crazy, \n'Cause I do. \n\nThis ol' GTO can't go no faster, \nThere's only two ways out tonight: \nWinnin' or disaster. \nAin't nothin' but dust in my rear view. \nOh, everybody's cheerin', baby, \nBut all I want is you. \n\nAnd if it's crazy to think, maybe, \nAll you need is a love that's true, \nWell then, baby, you can call me crazy, \n'Cause I do. \n\nAn' after the smoke has settled on this town, \nYou're gonna know why true love won't back down. \n'Cause when wild hairs have turned to grey, \nI still will feel this way. \n\nAnd if it's crazy to think, maybe, \nAll you need is a love that's true, \nThen call me crazy, \n'Cause I do. \n\nYou can call me crazy. \nAh, you can call me crazy. \nYou can call me crazy.\n\n", "album": {"title": "The_Lost_Trailers_(2006)&&7023", "genre": "Country", "year": 2006}}, {"title": "Overcrowded Town", "href": "Overcrowded_Town&&2927", "artist": {"unique_name": "The_Lost_Trailers"}, "lyrics": "I watch the sunset falling down\nI hear the voices coming through this overcrowded town\nAnd yes, I know that time it flies by so fast\nYou better find yourself something that lasts\n\nThere is just not enough time to hold onto the past\nIt either makes you bitter or keeps you looking back\nBut if you need someone to help you in moving on\nI have a will to make right what has been goin' wrong\nWhat you need it will be coming around\nYes, I will bring it back somehow\n\nIf this web could be broken, don't you think I would\nBut I am just a fly caught in this neighborhood\nThese streets are cracked and scattered and baked beyond belief\nOne day I'll shake myself free and step out from the heat\nWhat you need it will be coming around\nYes, I will bring it out somehow\n\n", "album": {"title": "Welcome_To_The_Woods_(2004)&&5202", "genre": "Country", "year": 2004}}]