[{"title": "Time to Kill", "href": "Time_To_Kill&&6418", "artist": {"unique_name": "The_Band"}, "lyrics": "The many roads I've covered\nThe many trails I've burned\nBut when our paths did cross, love, ooh\nMy whole world made a turn\n\nAnd we've got time to kill\nWhat a thrill\nJune and July\n\nWe've got all our love\nBuckets of\nThe tears that we cried\n\nNow we don't cry no more\nGonna bolt the door\nDon't know what we've got but it feels like a lot\nWe don't need no more\n\nWhen my day's work is done\nWe can take in a jamboree\nBut I just wanna sit down by the fire\nWith my love right here beside me\n\nWe've got time to kill\nCatskill\nSweet by and by\n\nWe've got all our love\nThe sky above\nThe twinkle in your eye\n\nNow where the wheel might roll\nIs where my love and I shall go\nWe're gonna plant the seed, there ain't nothing we need\nWe found our own rainbow\n\nMy love wants to have her fortune read\nAnd I know that she's in a hurry\nIf we go along the straight and narrow\nYou don't even have to worry\n\nWe've got time to kill\nStandin' still\nGo on, give it a try\n\nWe've got all our love\nMountains of\nThe trees are so high\n\nWe don't need no big car\nDon't eat no caviar\nWhen we come to rest we take to the nest\nYou know where we are\n\n", "album": {"title": "Stage_Fright_(1970)&&5579", "genre": "Rock", "year": 1970}}, {"title": "Strawberry Wine", "href": "Strawberry_Wine&&8752", "artist": {"unique_name": "The_Band"}, "lyrics": "I would try my finger and I would try my hand\nAt any fool game in this man's land\nBut don't you talk about this-a friend of mine,\nI ain't never been let down and you'd be wastin' time.\n\nI would scratch and steal, I would maim a man,\nI would even run the bounty across the other country,\nSo don't you talk about this here friend of mine,\nI gave it all of my money, but it makes me feel fine.\n\nYeah, I know you won't give me no peace of mind,\nTry to understand I just wanna feel good all the time.\nDon't you talk about a dear old friend of mine,\nWell, I know that you are sweet and more than double fine.\nEverybody said you oughta marry that rich man down the line,\nBut if I had to make a choice I wouldn't change my mind.\nHoney, you just ain't as sweet as my strawberry wine.\n\nYeah, You caught me when I's down a-sleepin' in the park,\nClimbin' up the walls and laughin' in the dark.\nBut I heard you been talkin' about a dear old friend of mine,\nNever tasted anything as sweet as my strawberry wine.\n\n", "album": {"title": "Stage_Fright_(1970)&&5579", "genre": "Rock", "year": 1970}}, {"title": "Sleeping", "href": "Sleeping&&626", "artist": {"unique_name": "The_Band"}, "lyrics": "For the life we chose in the evening we rose,\nJust long enough to be lovers again.\nAnd for nothing more, the world was too sore to live in.\n\nSad old ships, a morning eclipse,\nI spent my whole life guessing,\nThen I turned from the sun, and saw everyone searching.\n\nThe hoot owl and his song, will bring you along\nWhere else on earth would you wanna go?\nWe can leave all this hate, before it's too late\nWhy would we wanna come back at all?\n\nCobwebs on my pillow, I'm found in the willow,\nI'd spend my whole life sleeping.\nTo be called by noon is to be called too soon today. \n\nThe storm is passed, there is peace at last,\nI'll spend my whole life sleeping.\nNow there's not a sound, no one to be found anywhere. \n\nThe shepherd and his sheep, will wind you to sleep,\nWhere else on earth would you wanna go?\nTo a land of wonder, when you go under,\nWhy would we want to come back at all?\n\n", "album": {"title": "Stage_Fright_(1970)&&5579", "genre": "Rock", "year": 1970}}]