[{"title": "It May Concern", "href": "It_May_Concern&&399", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "We have a connection sorta like the correlation\nIn between new mustangs and premature balding\nWhen we're together I swear could skip\nA stone in the sky and watch it bounce from cloud\nTo cloud to cloudtime can only tell such an awkward tale\nCan't spam the guestbook I can't sign\nI'm just a resentful kid I guess and God knows why\nTo whom it may concern to whom it may\n(Awkward tale never fails never fails to concern) ditching is expected and maybe it's just sad\nThat I'm the very best fairy tale ending you never had\nShould I put these things behind me\nAlways willing to forgive I guess I have better things in store\nI guess I have better things in store...\n\n", "album": {"title": "Covington_(2004)&&4813", "genre": "", "year": 2004}}, {"title": "Blue Sunday", "href": "Blue_Sunday&&1459", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "Jaded eyes and stained glass windows. martyred beliefs and empty lies.\nMonotony leaves only apathy. fake emotions are as good as lies. the feelings that I get when I walk through the door are the kind that I abhor. the feelings that I show are the feelings that you give. a facade - the life you live. It's a blue Sunday, a blue Sunday, this is what have to say. we sit in the same place and we do the same things. back Sunday when I talked to my best friend thought those days would never end now time cannot amend. you haven't been since you were a kid because everything has changed and it's a blue Sunday empty feelings and ritual hearts broken smiles and dreary souls. left in a wake of weary songs deadened men leave only deadened lives. it's all repetition, repressive repetition now\n\n", "album": {"title": "Covington_(2004)&&4813", "genre": "", "year": 2004}}, {"title": "This Hurts Me More Than It Hurts You", "href": "This_Hurts_Me_More_Than_It_Hurts_You&&3758", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "Breaking hearts and trite manipulations, I cut you out of mine. we all know it's only life to breathe is to compromise. we all know we'll forgive this anyway there's more to life yet closer to our demise.\nIf I fall down I will stay sound because you taught me all.\nChanged like the seasons without reasons still you chase on after grandfathers ends in front of my friends\n\n", "album": {"title": "To_Breathe_Is_To_Compromise_(2005)&&8811", "genre": "", "year": 2005}}, {"title": "Little Cloud Dog", "href": "Little_Cloud_Dog&&5855", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "Life didn't turn out the way I thought it would\nNot in denial, lost the lamplight that will take me there\nSoon I'll be accused of trying something new\nAnd when I'm on trial, I know these charges won't sticklook, I've lost my way\nAnd ninety-nine didn't stray\nWill you come for me,\nWill you beat the wolves to me again\nSo close, so close,\nPlease don't let it go let it go\nWishes soon forgotten,\nNever have I seen with such claritytear down all your preconceptions of me\nAs I shed these tears of joy for this misery\n\n", "album": {"title": "Covington_(2004)&&4813", "genre": "", "year": 2004}}, {"title": "Return To Sender", "href": "Return_To_Sender&&9517", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "These times I remember are the ones where I laughed I gave I became I postmarks from different eras lives I can barely remember stories that retell (rewrite) themselves with different endings (bitter endings)\nIt's intangible looking better off pretending nothing ever happened\nThere is no one here to write home about there is no one here in this town\nI traveled the world\nWelcomes overstayed and passports overstamped\nAll I got was a t-shirt\nI sent you a package of irony\nLooking back in irony better off pretending Did you receive her?\n\n", "album": {"title": "To_Breathe_Is_To_Compromise_(2005)&&8811", "genre": "", "year": 2005}}, {"title": "Nostalgia In The Key Of \"a\"", "href": "Nostalgia_In_The_Key_Of_%22a%22&&5283", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "How far we've come from being bits.\nHow far we've come from grieving spirits.\nHow far... how far... pause, drift a nudge.\nHesitate the moment.\nStall reflecting crushed envy and love.\nChrist, forgive mehow far we've come from being unlist.\nHow far we've come from dragon's kiss.\nHow far... How far... (now safety) how high have we gone?\nHow high will we go on?\n\n", "album": {"title": "Covington_(2004)&&4813", "genre": "", "year": 2004}}, {"title": "Drama For Dummies", "href": "Drama_For_Dummies&&8936", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "Unbroken promises are clich&#233;,\nI'm sure clich&#233;'s will be clich&#233; one day.\nSo can you see why I spaz?\nGiven my history\nIf something's wrong it's wrong with me.\nBesides I know you're perfect.now you're gone. I can't blame you. (I can't go alone)\nIf you were me it wouldn't have taken so long.\nStarting to think now that you're gone.\nIf you were me it wouldn't have taken so long. I'm the star of this tragedy.\nI love the stage time, and I can't get past the irony.\nWhen the curtains draw I'll fear sarcastic applause,\nBut no one is there to see that this party's over. I'm confused, and I'm taking it out on you. you're gone... you're gone, so far away, you're gone\nAnd I can't reach you ... can barely reach you... barely reach you\n\n", "album": {"title": "Covington_(2004)&&4813", "genre": "", "year": 2004}}, {"title": "Hearts And Sleeves", "href": "Hearts_And_Sleeves&&5794", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "Home is where your heart is but your home is dead&#8232;\nWith an ego to match your narcissism\n&#8232;The sleeve is where your heart should be\n&#8232;But you swell it all inside your head instead&#8232;\nYou swell it inside\n\n&#8232;&#8232;Excuses, commitments\n&#8232;And in the end, is it really worth it all?&#8232;\nExcuses, commitments\n&#8232;And in the end, is it really worth it all?\n(Excuses, commitments)\n\n&#8232;&#8232;If it's really all about you, just move along\n&#8232;Leave me in the dust but leave me alone\n&#8232;I thought I knew who you really were\n&#8232;I guess I was never really sure\n\nExcuses, commitments\n&#8232;And in the end, is it really worth it all?\n&#8232;Excuses, commitments\n&#8232;And in the end, is it really worth it all?\nExcuses, commitments&#8232;\nAnd in the end, is it really worth it all?\nExcuses, commitments\n&#8232;And in the end, is it really worth it all?\n\n&#8232;&#8232;So why, so why?\nSo why, so why?\n&#8232;So why, so why are you here?\nSo why, so why pretend you're there?\n\nExcuses, commitments\nAnd in the end, is it really worth it all?\n(So why, so why are you here?\nSo why, so why pretend you're there?)\nExcuses, commitments\nAnd in the end, is it really worth it all?\n(So why, so why are you here?\nSo why, so why pretend you're there?)\nExcuses, commitments\nAnd in the end, is it really worth it all?\nExcuses, commitments\nAnd in the end, is it really worth it all?\n\n", "album": {"title": "Covington_(2004)&&4813", "genre": "", "year": 2004}}, {"title": "Stargazer Vs. Shoegazer", "href": "Stargazer_Vs._Shoegazer&&8340", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "We can live like spies in a small town\nUncover secrets about the lives we've always known\nDiscover meanings and reasons for being\nAnd then pretend that we still can't see still can't seesit down, take off your mask and stay a while\n(We'll make our rounds with old hands who count us among the trite few\nWho live their lives like an unopened bottle of champagne)\nI wanna be stargazer I wanna be stargazer\nGo to bed, get up again, day out, day in and I can barely breathe\n\n", "album": {"title": "Covington_(2004)&&4813", "genre": "", "year": 2004}}, {"title": "Wake Up, Wonder Twins", "href": "Wake_Up,_Wonder_Twins&&437", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "Here I stand on the threshold of mediocrity poised at the brink of something truly ordinary.\nDelusions of grandeur string me along the way I'll inspire a generation with uninspiration\nWake up, wonder twins. I'm so yesterday hanging over juries I'm the run of the mill my molehill.\nWhy am I so average? How do I find Courage to fly above water? Bleak and honest, meek and modest.\nWith friends like you who needs vulnerabilities it's sad but true you think we're wannabes yeah yeah we want to be unique. It's so tragic, so magically poetic, play it subtle, or boldly dramatic.\n\n", "album": {"title": "To_Breathe_Is_To_Compromise_(2005)&&8811", "genre": "", "year": 2005}}, {"title": "Calendar Day Cliché", "href": "Calendar_Day_Clich%C3%A9&&418", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "Books and covers and pigeon holes...\nWalk in the door ears burning already in a box - wheels turning\nPre-conceived notions and quiet whispersjudge me on what I say\nJudge me on my everyday\nJudge me on yesterday\nCalendar day clich&#233; mohawks and dyes - nothing but lies\nI don't wear dickies nor have any piercings\nAnd I even forgot what emo meant\nWhat it was and what it is\nAnd how it defines the giver and the gifti'll never be your ...\nI even forgot what emo meant what it was and what it is\nAnd how it defines the giver and the gift\nAfter all, music's emotion\n\n", "album": {"title": "Covington_(2004)&&4813", "genre": "", "year": 2004}}, {"title": "Modern Day Temple", "href": "Modern_Day_Temple&&5707", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "The Word (s) mean nothing to us now - means to an end\nSubstitutes for byproducts and carbon copies of cheapend lore. - sell more, sell more.so are we selling out or buying in? are we giving up or giving in? where did we draw the line, and when did we cross it? well, I'm not selling out, and I'm not buying in... modern day moneychangers of the Christian scene\nWith your greed and ambition... as you listen...\nCarbon copies of cheapend lore. - sell more, sell more\n\n", "album": {"title": "Covington_(2004)&&4813", "genre": "", "year": 2004}}, {"title": "I Swear On Clarity", "href": "I_Swear_On_Clarity&&6243", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "Must have been a jigsaw single thoughts of loneliness curse my ride to golden eternity would prevail if we try\nI feel dizzy like something grabbed hold and went all sadistic\nI'm not sure if you're listening I'm not sure if you care\nBlue skies go by everybody rides don't live it in your head get it all before you're dead\nYesterday is a habit that won't ever break\nSay word goes cricket chirp chirp you're convicted but you won't break\nJust stay focused wait no ignore it\nWho are you passing? Prove that you're grateful\nTruth isn't just for you\n\n", "album": {"title": "To_Breathe_Is_To_Compromise_(2005)&&8811", "genre": "", "year": 2005}}, {"title": "The Story Arc", "href": "The_Story_Arc&&3545", "artist": {"unique_name": "The_Awkward_Romance"}, "lyrics": "I wanna write a new song, but you never listen ...\nShow you the world, but you lost your visionand on the screen they antagonize\nThe arch rivals collide\nThe ever-crowded stage\nPseudo-heroes crowd the stage\nAnd on the screen they antagonize\nThe arch rivals collide\nThe ever-crowded stage\nEveryone's caught up in the latest rage\n\n", "album": {"title": "Covington_(2004)&&4813", "genre": "", "year": 2004}}]