[{"title": "Are You Ready?", "href": "Are_You_Ready%3F&&7931", "artist": {"unique_name": "The_Majestic_Twelve"}, "lyrics": "Let's say theoretically that you're a patriot who wakes up\nOne morning and realizes his government has been overtaken\nBy liars, incompetents and thieves - are you gonna stand up like\nPatrick Henry, or just get baked watching Patrick The Starfish?\nAre you ready? When things are falling apart\nYou gotta keep your body moving if the news is getting dark\n'Cause no solution can come from moping around\nKeep your head above the water and your heart on holy ground\nMy constitution is forged from Carnegie Steel\nEllis Island, Rosa Parks, America for real\nSo are you ready to pull your boots on and ride?\nSuck it up and slug it out, don't sit and let it slide\nDon't let nobody tell you you can't wave your flag and cheer\nSay what you think today, don't wait until next year\nAre you ready? United people have clout\nMy fingers push this pencil, but our fist can take 'em out\nOur solution depends on how much you care\nAre you really gonna fight, or just pretend that you were there?\nOur constitution is more than paper and ink\nBe there to defend it when it's had too much to drink\nSo are you ready to stand and sober it up?\nThe winds of change are flammable and ready to erupt\nDon't let nobody tell you you can't fix the stuff that stings\nThe Liberty Bell may be cracked, but it's loud and it still rings\nAre you ready to stop just running your yap?\nStand up like you mean it, put your body in the gap\n'Cause no solution can come from being afraid\nOf all the filthy maggots getting fat and getting paid\nOur constitution is worth my life to defend\nAny traitor in the driver's seat must suffer for his sin\nSo are you ready to fix our government's past?\nDon't be your daddy's Democrat, YOU KICK 'EM IN THE ASS!\nYeah, are you ready?\n\n", "album": {"title": "Schizophrenology_(2006)&&7181", "genre": "Experimental Rock", "year": 2006}}, {"title": "Whispering", "href": "Whispering&&1035", "artist": {"unique_name": "The_Majestic_Twelve"}, "lyrics": "Sometimes you can hear it like a rhythm through the crickets \nAnd the hum of the cars as they motor towards the beach \nHovering on the water like a ripple of the moon \nOn an eight foot tide, and the lights of the Lumina \nShine from the screen that they stuck up in the water \nChildren stare at movie stars who float above the sea \nTobacco barn smoke and a scary walk home \nSpanish moss blowing like bodies in the trees \nAll the folks who loved this dirt still stay \nIn the breeze and in the shadows, they live here \nThey never go away \nAnd my Grandma's dad is out there \nWhere the road turns into drawbridge \nSwinging his old lantern every time that there's a storm \nAnd that woman that he widowed \nThat's my Mamaw all around us \nMaking sure her babies are all proud, and strong, and warm \nAnd their pictures, they're not faded \nThey're hung up and they're framed \nStaring down at children who are proud to wear their names \nAnd one day I will stand beside them whispering \nWhispering, whispering to you my love \nI grew up with the stories of the storms \nRain in the house and an angry sea \nBut they were country proud, country tough \nAnd Hazel only made it halfway up the bluff \nWhen the Depression hit they held on and fought \nThey worked when they could and ate what they caught \nSo this little piece of rundown land \nIs where I sleep, and pray, and stand \nAll the ghosts, the marsh, the storms, and me \nWe sleep in the azaleas \nWe rise above and breathe \nAnd my Grandma's dad is out there \nWhere the road turns into drawbridge \nSwinging his old lantern every time that there's a storm \nAnd that woman that he widowed \nThat's my Mamaw all around us \nMaking sure her babies are all proud, and strong, and warm \nAnd their pictures, they're not faded \nThey're hung up and they're framed \nStaring down at children who are proud to wear their names \nAnd one day I will stand beside them whispering \nWhispering, whispering to you my love \nOne day I will stand beside them whispering \nWhispering, whispering to you my love \nMy family's whispering \nRichard and Jack, Austin and Joyce \nSnookie, Doris Ellen, all in one voice \nMama and Dad, Jolyon and Bud \nSinging all night beside the Summer Rest mud \nColin and Rachael, Amanda and Jay \nFirework nights and hide and seek days \nMamac and Mamaw cooking in the kitchen \nAll of us cousins crabbing and fishing\n\n", "album": {"title": "Schizophrenology_(2006)&&7181", "genre": "Experimental Rock", "year": 2006}}, {"title": "Grandfather (Sweet Baby Jesus)", "href": "Grandfather_(Sweet_Baby_Jesus)&&3792", "artist": {"unique_name": "The_Majestic_Twelve"}, "lyrics": "For Coley Bernard Sullivan\nSweet baby Jesus, come talk to me\nI need to see you smile\nThe cows in the meadow refuse to come home\nMy children all grown and with child\nThe fires don't burn like they did before\nThey shuffle and spark in the loam\nI can no longer build, so if it's all right with you\nCan I please come home\nSweet baby Jesus, come sit with me\nBut watch that third step by the door\nI've been meaning to fix it, but my shakes are real bad\nMy hands aren't my hands anymore\nDo you remember I sang to you\nAs I planted this house's first stone\nAnd I can no longer build, so if it's all right with you\nCan I please come home\nTura liy, tura liy, tura liy\n\n", "album": {"title": "Schizophrenology_(2006)&&7181", "genre": "Experimental Rock", "year": 2006}}, {"title": "Break It And Breathe", "href": "Break_It_And_Breathe&&6738", "artist": {"unique_name": "The_Majestic_Twelve"}, "lyrics": "If you feel all alone, flesh in a world of clones \nHave faith and listen to your deep internal microphone \nI grew up weird and lean, the world was truly mean \nAnd just as arrogant as Christmas in July \nDegraded every day, I swore they all would pay \nYeah, I would rise above and dominate the world one day \nOne of my closest friends, he didn't have it in him \nCountdown, baby, now... 3, 2, 1 \nThe air explodes and one more soldier \nScreams into the sky \nHey, my apologies, I wasn't listening. \nMy wife is whispering, my boy is playing in the yard \nSweet honey in the rock, we rock our local bar \nWe're far from famous man, \nBut everyone knows who we are \nI think of Philip now, about what might have been \nIf his short story was a novel with a happy end \nIf he were here today we'd hit the road and drive \nEvery single day I wish he was alive \nRight now our heat is slowly rising up into the air \nTo feed the ghosts that breathe around us \nThey are everywhere \nBreathe... baby, you can break it and breathe \nYou can rise above it all \nBaby, you can break it, we can break it, \nYou can break it and breathe\n\n", "album": {"title": "Schizophrenology_(2006)&&7181", "genre": "Experimental Rock", "year": 2006}}, {"title": "Trapped Underwater", "href": "Trapped_Underwater&&2687", "artist": {"unique_name": "The_Majestic_Twelve"}, "lyrics": "Your fingertips are shaking\nThere's rhythm in your hips\nYour fears are overtaking\nYour perfect painted lips\nI could be there, I could be real\nUnderstand everything you feel\nBleeding it out, suffering in doubt\nYou're trapped underwater\nGive me a sign, kill the alarms\nLet me be cradled in your arms\nYou're not alone, let me come home\nYou're trapped underwater\nYou know I see right through you\n(From the center of your ocean)\nYour fears are pumping through me\n(I need to be awake)\nI feel you\n(He feels me)\nI need you\n(He needs me)\nI could be there, I could be real\nUnderstand everything you feel\nBleeding it out, suffering in doubt\nYou're trapped underwater\nGive me a sign, kill the alarms\nLet me be cradled in your arms\nI could be there, let me come home\nYou're trapped underwater\nBlood in the water and it smells like sex\nYour personal effects in a plastic bag\nThe anesthesiologist doesn't make a sound\nAs the lights go down\nHey hey hey...\nI could be there, I could be real\nUnderstand everything you feel\nBleeding it out, suffering in doubt\nYou're trapped underwater\nGive me a sign, kill the alarms\nLet me be cradled in your arms\nYou're not alone, let me come home\nTrapped underwater\n\n", "album": {"title": "Schizophrenology_(2006)&&7181", "genre": "Experimental Rock", "year": 2006}}, {"title": "Condoleezza, Check My Posse", "href": "Condoleezza,_Check_My_Posse&&1083", "artist": {"unique_name": "The_Majestic_Twelve"}, "lyrics": "I think I'll buy myself a home in San Diego \nI'll buy some Mexicans to clean it every day! \nI'd buy Canadians, but they're all friggin' lazy \nThat's where the hippies went when Dubya won the day \nOh oh oh oh, I will rule the world forever \nI'm straight and white and male, American and free \nOh oh oh oh, Condoleezza check my posse \nClarence Thomas, Halliburton, mass destruction, me! \nI'm sure that Europe is a lovely place to visit \nMy wife would love to go there every single year (sing!) \nBut they're just puppies (yap yap yap yap yap yap yap yap yap) \nThey need to shut their yaps, the big dog's over here \nOh oh oh oh, I will rule the world forever \nI'm straight and white and male, American and free \nOh oh oh oh, Condoleezza check my posse \nBill O'Reilly, Diebold Systems, mass destruction, me! \nHere we go! \nI can't believe I bought that land in California, \nMy stupid summer home just slid into the sea! \nAt least old Uncle Sam is going to rebuild it \nMy country loves to lend a hand to folks like me \n\nOh oh oh oh, I will rule the world forever \nI'm straight and white and male, American and free \nOh oh oh oh, Condoleezza check my posse \nJerry Falwell, Coors Foundation, mass destruction, me! \nAnn Coulter, Ann Coulter, Ann Coulter, Ann Coulter \nRush Limbaugh, Rush Limbaugh, Rush Limbaugh, Rush Limbaugh \nSean Hannity, Sean Hannity \nTucker Carlson, Tucker Carlson \nPaul Wolfowitz, Paul Wolfowitz \nOh oh oh oh, I will rule the world forever \nI'm straight and white and male, American and free \nOh oh oh oh, Condoleezza check my posse \nMe, me, me, me, me, me, me, me, me, me, me, me, me!\n\n", "album": {"title": "Schizophrenology_(2006)&&7181", "genre": "Experimental Rock", "year": 2006}}, {"title": "Thank God Everything On TV Is a Lie", "href": "Thank_God_Everything_On_TV_Is_A_Lie&&1782", "artist": {"unique_name": "The_Majestic_Twelve"}, "lyrics": "We've got to win the war on drugs for the sake of our society \nOur future as a global force depends on our sobriety \nPornography corrupts us, it makes us less than pure \nAnd if everyone found Jesus, all those fags would have a cure \nIf you don't support our president you don't support our nation \nIntelligent Design is not just bullshit for creation \nWe don't assume you're guilty just because you're poor and black \nAnd we're winning hearts and minds with every bullet in Iraq \nThank God everything on T.V. is a lie \nThere's no justice in America, Democracy's a fraud \nAnd you really must be stupid if you think that there's a God \nIf you're straight and white and male you are the lord of the dominion \nYou were born as an opressor with no right to an opinion \nIf you build it we will burn it, eating meat is murder \nAgree with everything we think or be branded a deserter \nWe own the moral highground, we are freedom when it rings \nA fetus and a baby are completely different things \nThank God everything on T.V. is a lie \nI'm inquisitive and questioning \nI'm thinking and I'm free \nI'm not one of you, or one of them, I'm one of me \nI'm not in either party \nBoth sides are illegit \nI've figured out that all of you are completely full of \nSha-la-la-la-la-la-la\n\n", "album": {"title": "Schizophrenology_(2006)&&7181", "genre": "Experimental Rock", "year": 2006}}, {"title": "Cry", "href": "Cry&&3191", "artist": {"unique_name": "The_Majestic_Twelve"}, "lyrics": "Everything she wants \nEverything she thinks she wants just died tonight \nDriving in her car \nReliving all the ugly things they said tonight \nShe was pissed so she pushed all the buttons she'd saved \nFor the wave when she knew that she really could hurt him \nThe smell on her collar, the lights and the noise, \nStupid trucks full of boys \nShe breaks down and cries \nCry \nEverything he wants \nEverything he thinks he wants just drove away \nCrushed inside his room \nShe can never ever know he feels this way \nAll the things that she said, I'm so stupid, she's right \nNo, I'm right, she's a bitch, no she's not, no she isn't \n(I'm still here waiting for you) \nAll the things that she said, I'm so stupid, I want her, \nI want to destroy her \nHe breaks down and cries \nCry \nI'm still here waiting for you \nI'm always searching for you \nFor all the rest of my life \nYou will be somewhere else \nThat shudder, fear and spark \nThat night beside the river \nI'll always be in your arms \nNo matter who you're holding on to \nCry \nI will never cry again\n\n", "album": {"title": "Schizophrenology_(2006)&&7181", "genre": "Experimental Rock", "year": 2006}}, {"title": "Welcome To The City", "href": "Welcome_To_The_City&&7373", "artist": {"unique_name": "The_Majestic_Twelve"}, "lyrics": "So hungry, but you smile your mouth shut\nYou're all alone\n(You're gonna b-b-b-b-b-b-b-b-breakdown)\nI love your teeth, your empty face\nYou're the perfect drone\n(You're gonna b-b-b-b-b-b-b-b-breakdown)\n...98 degrees...\nYou shouldn't think when you're alone\nIt might make you sick\n(You're gonna b-b-b-b-b-b-b-b-breakdown)\nCompletely sick\nAnd suffocating violently\nSuffocating violently\n(You're gonna b-b-b-b-b-b-b-b-breakdown)\nEverybody dance\nDriving her Mercedes through the heart of the city\nShe thinks she's everything, there's nothing at all\nThe blood she doesn't bleed explodes in every borough\nShe sucks off Charlie Sheen inside the bathroom stall\nWelcome to the city\nSo full of chemicals and nothing to do\nWelcome to the city\nIt's gonna b-b-b-b-b-b-break you\nWelcome to the city\nSmile past the wannabes and pray that they drown\nWelcome to the city\nSo sad your life is gonna b-b-b-break you down\n\n", "album": {"title": "Schizophrenology_(2006)&&7181", "genre": "Experimental Rock", "year": 2006}}, {"title": "American Rage", "href": "American_Rage&&8306", "artist": {"unique_name": "The_Majestic_Twelve"}, "lyrics": "I've listened to all of your nonsense \nI've tried to make sense of it \nIt's left me broke and bleeding \nSlow burn, American Rage \nI take the hours they give me \nMy wife sleeps all alone \nMy son, he barely knows me \nI am American Rage \nMy father sweat oil in a flat field \nMy mother taught children in school \nWe fought, and saved, and prayed \nWe bleed American Rage \nI work every second I'm breathing \nI'm on the clock every second I'm alive \nBut still I'm slowly sinking \nI am American Rage \nI'll be right behind you in your dreams, dear - \nI'll be right behind you in your nightmare\n\n", "album": {"title": "Schizophrenology_(2006)&&7181", "genre": "Experimental Rock", "year": 2006}}]