[{"title": "Ordinary Girl", "href": "Ordinary_Girl&&5260", "artist": {"unique_name": "Tommy_James"}, "lyrics": "And she sits with a cup of coffee, lights another cigarette,\nStares out the kitchen window, and wonders if that's all she gets.\nShe thinks about back in high school, turns on the radio,\nBut the old songs just remind her what she was a long time ago.\nOoh, she's lookin' for a rainbow, all she knows.\nOoh, lookin' for a magic rainbow day in the snow.\nHey, girl, don't be so hard on yourself,\nYou're only like everyone else and we all go through those changes.\nHey, girl, heaven still waits in your eyes\nEven though time passes by as you're going through this world an everyday, ordinary girl.\n\nAnd she looks at the ring on her finger, thinks about her wedding day,\nThat just gets her dreaming about the boy that got away.\nAnd a kiss from a distant summer still lights up her eyes\nAnd it brings back all the feelings like a thousand fireflies; ooh-ooh-ooh.\nOh, she's lookin' for a rainbow, all she knows.\nOoh, lookin' for a magic rainbow day in the snow.\nGirl, don't be so hard on yourself,\nYou're only like everyone else and we all go through those changes.\nHey, girl, heaven still waits in your eyes\nEven though time passes by as you're going through this world an everyday, ordinary girl.\n\n(Saxophone solo)\n\nEven though time passes by as you're going through this world an everyday, ordinary girl;\nA very special, ordinary girl.\n\n", "album": {"title": "Hold_The_Fire_(2006)&&3038", "genre": "", "year": 2006}}, {"title": "Angels and Strangers", "href": "Angels_And_Strangers&&6166", "artist": {"unique_name": "Tommy_James"}, "lyrics": "And I'm face to face with a vision, something I saw in a dream.\nAnd I reach out to touch; think I love you too much;\nThings just ain't what they seem.\nAnd all these feelings I'm feeling, that don't have a name\n'Cause angels and strangers, they all look the same\nDon't talk to strangers; don't believe what they say.\nDon't pray to angels, they'll lead you astray.\nOh, I'm in love and I can't shake it. (angels, angels)\nWell if this is love, then, I can't take it. (angels, angels)\nDon't need no revelation take my heart and leave me shakin'.\nVisions of love are filled with danger, angels, and strangers.\n\nOn the edge of temptation, goin' over the line.\nBreak my heart and my concentration, goin' out of my mind.\nYou know that I wanna love you. I wanna give you my heart.\nBut, angels and strangers, ooh, you can't tell them apart.\nDon't talk to strangers; don't believe what they say.\nDon't pray to angels, they'll lead you astray.\nOh, I'm in love and I can't shake it (I can't shake it) (angels, angels)\nWell if this is love, then, I can't take it (I can't take it) (angels, angels)\nDon't need no mystery lady (mystery lady) break my heart and make me crazy\nVisions of love are filled with danger, angels, and strangers.\n\nVisions of love, lovers unknown;\nAngels and strangers, leave me alone.\nOne's out to love you, one's out betrayed;\nAngels and strangers, just go away.\n\n", "album": {"title": "Hold_The_Fire_(2006)&&3038", "genre": "", "year": 2006}}, {"title": "Isn't That The Guy", "href": "Isn%27t_That_The_Guy&&9165", "artist": {"unique_name": "Tommy_James"}, "lyrics": "Isn't that the guy you were seein' last summer?\nBaby, don't deny it, I can tell he's your lover\n'Cause I caught you in a lie and I saw that little number\nWhen you thought I wasn't looking, you were eyein' each other.\nIsn't that the guy that you said you were leavin'?\nWhen you looked me in the eye and you had me believin'\nEverything you said, girl, I just didn't see it.\nNow you're playing with my head, baby, I don't need it.\nIsn't that the guy that you told me you were over with;\nThinking that you'd get by without me knowing it?\nDo you think I'm blind? And all the time you were fakin',\nIt's blowing my mind, and I just can't take it no more.\n(You say) You say, (You say) You say, (You say) You say, (You say) You say,\n(You say) You say, (You say) You say, (You say) You say, (You say) No way!\n\nTryin' to be cool with this goin' on in front of me;\nTryin' not to be the fool I don't wanna be.\nWas he on your mind every time you were lovin' me?\nDon't prentend you don't know he was here to keep you company.\nIsn't that the guy you were seein' last summer, baby?\nBaby, don't deny it, I can tell he's your lover\n'Cause I caught you in a lie and I saw that little number\nWhen you thought I wasn't looking, you were eyein' each other. Oh, yeah.\n(You say) You say, (You say) You say, (You say) You say, (You say) You say,\n(You say) You say, (You say) You say, (You say) You say, (You say) No way!\n\nGo on and say it (say it). You made me play it.\nRight in my face, it was (face it was) a cold-hearted embrace.\nAll I can do is (do is) stand there and take it (take it).\nI bought every single lie you were sellin'.\nHow did he know if you didn't tell him?\n\n(Light up the night)\n(I saw the light)\n(Oh)\n(You know that ain't right)\n(Light up the night) Yeah!\n(You know that ain't right) You know that ain't right.\n(Oh) I didn't see it comin'.\n(I saw the light) I saw the light.\n(Light up the night) Ooh!\n(I saw the light) I saw the light.\n(Oh) I know that he's the one.\n(You know that ain't right) You know that ain't right, baby.\n(Light up the night) Ooh!\n(I saw the light) I saw the light.\n(Oh) Yeah!\n(You know that ain't right) You know that ain't right, baby.\n\n", "album": {"title": "Hold_The_Fire_(2006)&&3038", "genre": "", "year": 2006}}, {"title": "Megamation Man", "href": "Megamation_Man&&3790", "artist": {"unique_name": "Tommy_James"}, "lyrics": "(No more border in the new world order.)\n(No more border in the new world order.)\n(No more border in the new world order.)\n(No more border in the new world order.)\n(No more border in the new world order.)\n\nIn the twenty-first century, we'll all be together.\nIn the one world fantasy, we'll all live forever\nAnd we'll save ourselves; we just keep getting better.\nMegamation man, gonna hear the call,\nWe're gonna have it all.\nTell the boys and girls we got a brand new world,\nGot a brand new plan: megamation man.\n\nIn the twenty-first century, we got a brand new religion.\nWe'll end the misery of the human condition.\nNo more mystery 'cause the beast has risen.\nMegamation man, gonna hear the call,\nWe're gonna have it all.\nTell the boys and girls we got a brand new world,\nGot a brand new plan: megamation man.\n\nIn the twenty-first century, the motives are higher;\nAnd peace and harmony kiss from the ball of fire.\nJust what we need is a brand new messiah: a megamation man.\nOh, gonna hear the call, we're gonna have it all.\nTell the boys and girls we got a brand new world,\nGot a brand new plan: megamation man.\n\n(No more border in the new world order.)\n(No more border in the new world order.)\n(No more border in the new world order.)\n(No more border in the new world order.)\n(No more border in the new world order.)\n(No more border in the new world order.)\n\n", "album": {"title": "Hold_The_Fire_(2006)&&3038", "genre": "", "year": 2006}}, {"title": "I Love Christmas", "href": "I_Love_Christmas&&2093", "artist": {"unique_name": "Tommy_James"}, "lyrics": "I love Christmas time, mistletoe, and cherry wine;\nSongs of Christmas cheer when Christmas time is here.\nLove to hear the whole world singing.\nAll the jingle bells are ringing.\nJoy to the world! I Love Christmas!\n\nWhen I was three, my momma took me to see Santa Claus.\nUp to the second floor of the department store and there he was.\nI asked him, \"Could ya' please bring a teddy bear?\"\nHe told me not to worry: he'd be there.\nBut does Santa keep his promises? Yes he does. Yes he does!\nI love Christmas time, mistletoe, and cherry wine;\nSongs of Christmas cheer when Christmas time is here.\nLove to hear the whole world singing.\nAll the jingle bells are ringing.\nJoy to the world! I Love Christmas!\n\nSo now I'm watching my own kids under the Christmas tree.\nI hear 'em playing and laughing, just like it was me.\nAnd I thank the good Lord everyday that we live here in the U.S.A.\nAnd from my heart all I can say is, \"Happy Birthday, Jesus!\"\nI love Christmas time, mistletoe, and cherry wine;\nSongs of Christmas cheer when Christmas time is here.\nLove to hear the whole world singing.\nAll the jingle bells are ringing.\nJoy to the world! I Love Christmas!\n\n", "album": {"title": "Hold_The_Fire_(2006)&&3038", "genre": "", "year": 2006}}, {"title": "Give It All", "href": "Give_It_All&&3454", "artist": {"unique_name": "Tommy_James"}, "lyrics": "And if you think you're goin' crazy\nRemember, I got there before you.\nThe little demons used to chase me;\nHad me thinkin' they were cool, fool!\nAw, give it all,\nDon't believe in TV and the mall.\nAw, give it all,\nDon't believe what you see anymore.\n\nDon't be scared to be rejected.\nDon't give in, they won't expect it.\nYou can do your dream, just give it all.\n\nAnd if you think the ground is shakin',\nIt's just the sound of baby-boom!\nAll the good stuff has been taken;\n'Ya think there's nothin' left for you, that ain't true.\nAw, give it all,\nDon't believe in TV and the mall.\nAw, give it all,\nDon't believe what you see anymore.\n\nDon't look up if they impress you.\nDon't look down, it may depress you.\nIt ain't that far if you fall, so give it all.\n\n(Guitar solo followed by an instrumental break and chorus adlibs)\n\nSo, grit your teeth and grind your axes,\nTrust in God, and pay your taxes.\nGo break down the wall, but give it all!\n\n", "album": {"title": "Hold_The_Fire_(2006)&&3038", "genre": "", "year": 2006}}, {"title": "Hold The Fire", "href": "Hold_The_Fire&&4139", "artist": {"unique_name": "Tommy_James"}, "lyrics": "You can't believe your eyes, the lines that show;\nThe mirror doesn't lie, you're growin' old.\nThe love, the love, the love you thought would last a lifetime is growin' cold.\nYou're the one who had to run and hold the fire (whoa).\nYou were hot and always got your one desire (whoa).\nNow you say your hands are shakin',\nNow you say your heart is breakin',\nNow you've got a funny feelin' nothin' lasts forever, hold the fire.\n(You're the one who had to run and hold the fire) C'mon, hold the fire\n(You were hot and always got your one desire) Gotta hold on\n(You're the one who had to run and hold the fire)\n\nYou said you'd never change, you were born to fly.\nBut, now you're feelin' strange and you don't know why.\nThe time, the time, the time you'd thought would last forever has left you dry.\nYou're the one who had to run and hold the fire (whoa).\nYou were hot and always got your one desire (whoa).\nPeace and love you once called freedom;\nYou ain't sure you're still believin',\nNow you've got a funny feelin' nothin' lasts forever, hold the fire.\n(You're the one who had to run and hold the fire) C'mon, hold the fire\n(You were hot and always got your one desire) Gotta hold on\n(You're the one who had to run and hold the fire) Hold the fire.\n\n(You're the one who had to run and hold the fire) C'mon, hold the fire\n(You were hot and always got your one desire) Hold on\n(You're the one who had to run and hold the fire) C'mon, hold the fire.\n(You were hot and always got your one desire)\n(You're the one who had to run and hold the fire) Hold the fire\n(You were hot and always got your one desire) Hold the fire\n(You're the one who had to run and hold the fire) Hold on, hold on\n(You were hot and always got your one desire) Hold the fire\n(You're the one who had to run and hold the fire) Just hold the fire\n(You were hot and always got your one desire)\n(You're the one who had to run and hold the fire) Oh\n(You were hot and always got your one desire)\n(You're the one who had to run and hold the fire)\n(You were hot and always got your one desire)\n\n", "album": {"title": "Hold_The_Fire_(2006)&&3038", "genre": "", "year": 2006}}, {"title": "It Keeps On Goin'", "href": "It_Keeps_On_Goin%27&&2235", "artist": {"unique_name": "Tommy_James"}, "lyrics": "It don't stop, it just keeps on goin' just like a rock but there ain't no slowin' it down.\nOn the street all the noise keeps growin'. It don't stop, it just keeps on goin'\n\nI look up in the sky. I see creation about a trillion miles away.\nYou an me sittin' here, a small conversation; what the hell we got to say?\nWell, if you want the truth, better change the station; just let the music play. 'Cause\nIt don't stop, it just keeps on goin' just like a rock but there ain't no slowin' it down.\nOn the street all the noise keeps growin'. It don't stop, it just keeps on goin'\n\nLookin' for a place to hide and drink my coffee; any little place that I can find.\nAnd if I come to you, will you speak softly, and be a friend of mine?\nIf you see a monkey on my back, will you take him off me before I'm out of time? 'Cause\nIt don't stop, it just keeps on goin' just like a rock but there ain't no slowin' it down.\nOn the street all the noise keeps growin'. It don't stop, it just keeps on goin'\n\nYou say you wanna be president and save the nation; you say you've got a plan.\nWell, God bless you, I hope you do. Congratulations! Just take it like a man.\nWell, as for me, I'll just be sittin' over here waitin' for the Lamb. 'Cause\nIt don't stop, it just keeps on goin' just like a rock but there ain't no slowin' it down.\nOn the street all the noise keeps growin'. It don't stop, it just keeps on goin'\n\n", "album": {"title": "Hold_The_Fire_(2006)&&3038", "genre": "", "year": 2006}}, {"title": "Amy", "href": "Amy&&7237", "artist": {"unique_name": "Tommy_James"}, "lyrics": "(Tonight, you're mine.)\n(Tonight, you're mine. Take your time.)\n(Tonight, you're mine. Take your time.)\nTake me so far away. I don't care any more.\nCan't hear a word you say. I just wanna love you some more.\nGirl, when you're next to me and you're holdin' me tight, you are the best for me.\nLove's right in my face. It's so close I can taste it. It's love and that makes it alright.\nI don't know where it's goin'. My weak side is showin'.\nBaby, I didn't mean to love you, Amy, baby, I do.\n\n(Tonight, you're mine. Take your time.)\n(Tonight, you're mine. Take your time.)\nStreamin' like fireflies, we light up the night\nFlyin' through paradise and aren't we a beautiful sight? Ooh.\nWhen you do love with me, I'm a movie star: street lights and fantasy.\nI love lookin' at you and watchin' a natural angel, cause that's who you are.\nI don't know where it's goin'. My feelings are flowin'. \nBaby, what else can I do? Amy, baby, I love you.\n\n(Tonight, you're mine. Take your time.)\n(Tonight, you're mine. Take your time.)\n(Tonight, you're mine. Take your time.)\n\n", "album": {"title": "Hold_The_Fire_(2006)&&3038", "genre": "", "year": 2006}}, {"title": "Lupe And Joe", "href": "Lupe_%26_Joe&&1364", "artist": {"unique_name": "Tommy_James"}, "lyrics": "Talkin' 'bout my baby, the little Latin Lupe Lu.\nShe's a high-flyin' lady; ain't no dance she couldn't do.\nShe's my little Latin baby; little Latin Lupe Lu.\n\nIf you wanna do it right, little Lupe show you how.\nIf you wanna get crazy, she's the best for miles around.\nRock me now, pretty baby; little Latin Lupe Lu.\n\nA-poppa, poppa, Lupe, Lupe. Ah, shake it Lupe Lu.\nYou can do it pretty baby. C'mon and do the Hootchie Koo.\nShe's my little Latin baby; little Latin Lupe Lu\n\nLook at Killer Joe go cuttin' in on me.\nPlayin' like he don't know she belongs to me.\nLook at how they walkin'; holdin' her so tight.\nSomeone better tell him he lookin' for a fight.\nGo on and tell him; go on and tell him she's supposed to be with me.\n(Killer Joe) (Killer Joe) (Killer Joe) (Killer Joe)\n(Killer Joe) (Killer Joe) (Killer Joe) (Killer Joe)\n\nI'm talkin' 'bout my baby, little Latin Lupe Lu.\nShe makin' me crazy. Ain't nothin' I can do.\nA little Latin baby; little Latin Lupe Lu\n\nA-poppa, poppa, Lupe, Lupe. Ah shake it, Lupe Lu.\nYou can do it to me baby. C'mon and do the Hootchie Koo.\nShe's my little Latin baby; little Latin Lupe Lu.\nHey! (poppa, poppa, Lupe, Lupe) poppa, poppa, Lupe, Lupe.\n(Shake it Lupe Lu) Yeah, shake it Lupe Lu.\nC'mon and do it to me baby. C'mon and do the Hootchie Koo.\nShe's my little Latin baby; little Latin Lupe Lu.\nLittle Latin Lupe Lu.\nLittle Latin Lupe Lu.\nLittle Latin Lupe.\n\n", "album": {"title": "Hold_The_Fire_(2006)&&3038", "genre": "", "year": 2006}}, {"title": "Love Words", "href": "Love_Words&&629", "artist": {"unique_name": "Tommy_James"}, "lyrics": "Say, say your love\nSay your love words\nSay your love\nSay your love words\n\nLove is a wave alone on an ocean\nSomeone you crave in perpetual motion\nNeeding nobody: that's always the message you send\nIt's being alone that troubles and grieves you\nThe one that you'd die for, she finally sees you\nOne chance only to never be lonely again\nWhat did playin' the role ever get you?\nTell her you love her (you love her) and she'll let you\n\nAll the love in the world's in your hands tonight\nEverything you are needing\nAll your love's in your words, if you say them right\nEverything you are feeling\n\nSay, say your love\nSay your love words\nSay your love\nSay your love words\n\nYou're tough and you're strong: that's just what she's learning\nBut she's got you wrong: you are desperately yearning\nFor someone to love you, maybe even a friend\nSo why do I see a broken connection?\nI'm talkin' to me and it's just my reflection\nOne chance only to never be lonely again\nWhat did playin' the role ever get you?\nTell her you love her (you love her), ooh, and she'll let you\n\nAll the love in the world's in your hands tonight\nEverything you are needing\nAll your love's in your words, if you say them right\nEverything you are feeling\nEverything you are feeling\n\nAll the love in the world's in your hands tonight\nEverything you are needing\nAll your love's in your words, if you say them right\nEverything you are feeling\nEverything you are feeling\n\nSay, say your love\nSay your love words\nSay your love, love words\nSay, say your love\nSay your love words\nSay your love, love words\n\n", "album": {"title": "Hold_The_Fire_(2006)&&3038", "genre": "", "year": 2006}}]